
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
        Объект.Дата = ТекущаяДата();  
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	// МАС - 31.10.2017 - Заполняем док по возврату --->> 
	Если Параметры.Свойство("ДокВозврат") И ЗначениеЗаполнено(Параметры.ДокВозврат) Тогда

		Если Параметры.Статус = "Подготовлен" Тогда
			
			Объект.СтатусСкладскогоУчета = Справочники.СтатусыСкладскогоУчета.ПодготовленКВозврату;
			Объект.Основание = Параметры.ДокВозврат;
			
			ТЗТовары = Параметры.ДокВозврат.Товары.Выгрузить();
			ТЗТовары.Свернуть("ДокументПоступления,ТипЗаказа");		
			
			Для каждого Ст Из ТЗТовары Цикл
			
				НСтр = Объект.СтатусыЗаказов.Добавить();			
				НСтр.Заказ = Документы.РеализацияТоваровУслуг.НайтиПоНомеру(Ст.ДокументПоступления.Номер);
				Если НЕ ЗначениеЗаполнено(НСтр.Заказ) Тогда	
					Продолжить;					
				КонецЕсли;
				НСтр.СтатусСкладскогоУчета = Справочники.СтатусыСкладскогоУчета.ПодготовленКВозврату;
				НСтр.ТипЗаказа = Ст.ТипЗаказа;
			
			КонецЦикла;			
			
		Иначе		
		КонецЕсли;			
	
	КонецЕсли;	
	// <<--- МАС 	
	
КонецПроцедуры
