
&НаКлиенте
Процедура Заполнить(Команда)
    //Получим данные выгруженые из почты
    Данные = Документы.УслугиПоЗаказам.ПолучитьДанныеИзРС(Объект.Контрагент); 
    Если Данные.Количество() > 0 Тогда
        //Получаем объект
        ДокументОбъект = ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.УслугиПоЗаказам")); 
        //Заполняем на сервере данными из выборки
        ДокументОбъект.ЗаполнитьНаСервере(Данные,Объект.Контрагент);
        //ЗначениеВДанныеФормы(ДокументОбъект,Объект);
        ЭтаФорма.Прочитать();
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьИОтправить(Команда)
        ДокументОбъект = ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.УслугиПоЗаказам"));
        ДокументОбъект.СформироватьИОтправить();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    //Если Объект.Проведен Тогда
    //    ЭтаФорма.ТолькоПросмотр = Истина;
    //    Элементы.УслугиКоманднаяПанель.ПодчиненныеЭлементы.УслугиСформироватьИОтправить.Доступность = Ложь;
    //Иначе
    //    ЭтаФорма.ТолькоПросмотр = НЕ Параметры.Ключ.Пустая();
    //КонецЕсли;
КонецПроцедуры
