
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Добавить("ТипОборудования");
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если НЕ Ссылка.Пустая() Тогда
		
		СменилиОборудование = (Ссылка.ТипОборудования <> ТипОборудования);
		
		Если ЕстьЗаписиВРС(Ссылка) И СменилиОборудование Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "По данной модели ведётся учёт! Смена типа оборудования невозможна!";
			Сообщение.Поле = "ТипОборудования";
			Сообщение.Сообщить(); 
			
			Отказ = Истина;
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

Функция ЕстьЗаписиВРС(МодельОборудования)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыОборудованияСрезПоследних.Период КАК Период,
		|	СтатусыОборудованияСрезПоследних.Регистратор КАК Регистратор,
		|	СтатусыОборудованияСрезПоследних.НомерСтроки КАК НомерСтроки,
		|	СтатусыОборудованияСрезПоследних.Активность КАК Активность,
		|	СтатусыОборудованияСрезПоследних.Оборудование КАК Оборудование,
		|	СтатусыОборудованияСрезПоследних.Оборудование.МодельОборудования КАК Модель,
		|	СтатусыОборудованияСрезПоследних.СтатусОборудования КАК СтатусОборудования,
		|	СтатусыОборудованияСрезПоследних.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.СтатусыОборудования.СрезПоследних(, Оборудование.МодельОборудования = &МодельОборудования) КАК СтатусыОборудованияСрезПоследних";
	
	Запрос.УстановитьПараметр("МодельОборудования", МодельОборудования);
	
	РезультатЗапроса = Запрос.Выполнить();	

	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции // ()
 