
Функция ПолучитьТаблицуДвижений(Запрос) Экспорт
	
	//Запрос = Новый Запрос;
	//Запрос.МенеджерВременныхТаблиц = МенеджерТаблицИсходныхДанных;
	Запрос.Текст = Запрос.Текст +
	"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|" +
	"ВЫБРАТЬ
	|	ВТ_ИсходныеДанные.Период КАК Период,
	|	ВТ_ИсходныеДанные.ВидОперации КАК ВидОперации,
	|	МАКСИМУМ(экВесаПроизводственныхОпераций.Период) КАК ПериодВеса
	|ПОМЕСТИТЬ ВТ_ПериодыВеса
	|ИЗ
	|	РегистрСведений.экВесаПроизводственныхОпераций КАК экВесаПроизводственныхОпераций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные
	|		ПО экВесаПроизводственныхОпераций.Период <= ВТ_ИсходныеДанные.Период
	|			И экВесаПроизводственныхОпераций.ВидПроизводственнойОперации = ВТ_ИсходныеДанные.ВидОперации
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ИсходныеДанные.Период,
	|	ВТ_ИсходныеДанные.ВидОперации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИсходныеДанные.Период КАК Период,
	|	ВТ_ИсходныеДанные.Заказ КАК Заказ,
	|	ВТ_ИсходныеДанные.Регион КАК Регион,
	|	экВидыПроизводственныхОпераций.СтатьяЗатрат КАК СтатьяЗатрат,
	|	ВТ_ИсходныеДанные.ВидОперации КАК ВидОперации,
	|	ВТ_ИсходныеДанные.ОбратныйПоток КАК ОбратныйПоток,
	|	ЕСТЬNULL(экВесаПроизводственныхОпераций.ВесПроизводственнойОперации, 1) КАК ВесПроизводственнойОперации
	|ИЗ
	|	ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПериодыВеса КАК ВТ_ПериодыВеса
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.экВесаПроизводственныхОпераций КАК экВесаПроизводственныхОпераций
	|			ПО ВТ_ПериодыВеса.ПериодВеса = экВесаПроизводственныхОпераций.Период
	|				И ВТ_ПериодыВеса.ВидОперации = экВесаПроизводственныхОпераций.ВидПроизводственнойОперации
	|		ПО ВТ_ИсходныеДанные.Период = ВТ_ПериодыВеса.Период
	|			И ВТ_ИсходныеДанные.ВидОперации = ВТ_ПериодыВеса.ВидОперации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.экВидыПроизводственныхОпераций КАК экВидыПроизводственныхОпераций
	|		ПО ВТ_ИсходныеДанные.ВидОперации = экВидыПроизводственныхОпераций.Ссылка";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции