
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекущиеТарифы.Параметры.УстановитьЗначениеПараметра("Тариф", Объект.Ссылка);
	//ТолькоПросмотр = Истина;
	
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	ТарификацияФинансовыхУслугСрезПоследних.ПроцентБанковскойКомиссии,
	            |	ТарификацияФинансовыхУслугСрезПоследних.ПроцентАгентскогоВознаграждения
	            |ИЗ
	            |	РегистрСведений.ТарификацияФинансовыхУслуг.СрезПоследних КАК ТарификацияФинансовыхУслугСрезПоследних
	            |ГДЕ
	            |	ТарификацияФинансовыхУслугСрезПоследних.Тариф = &Тариф";
	Зап.УстановитьПараметр("Тариф", Объект.Ссылка);
	
	Рез = Зап.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда
		ПроцентБанковскойКомиссии = Рез.ПроцентБанковскойКомиссии;
		ПроцентАгентскогоВознаграждения = Рез.ПроцентАгентскогоВознаграждения;
	КонецеСли;	
КонецПроцедуры
