&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.СписокДокументПроверен.Доступность = РольДоступна("ПодготовкаПланируемыхПлатежей");
	Элементы.СписокКонтекстноеМенюДокументПроверен.Доступность = Элементы.СписокДокументПроверен.Доступность;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецеСли;	
	
	//Элементы.СписокДокументПроверен.Пометка = ПроверкаДокументовСервер.ПолучитьСтатусПроверкиДокумента(Элементы.Список.ТекущаяСтрока);
	Элементы.СписокДокументПроверен.Пометка = Элементы.Список.ТекущиеДанные.ДокументПроверен;
	Элементы.СписокКонтекстноеМенюДокументПроверен.Пометка = Элементы.СписокДокументПроверен.Пометка;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументПроверен(Команда)
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецеСли;	
	
	Если ДокументПроверенНаСервере(Элементы.Список.ТекущаяСтрока, НЕ Элементы.СписокДокументПроверен.Пометка) Тогда
		Элементы.СписокДокументПроверен.Пометка = НЕ Элементы.СписокДокументПроверен.Пометка;
		Элементы.СписокКонтекстноеМенюДокументПроверен.Пометка = Элементы.СписокДокументПроверен.Пометка;		
	КонецеСли;	
		
КонецПроцедуры

&НаСервере
Функция ДокументПроверенНаСервере(Документ, Пометка)

	ПараметрыПроверки = Новый Структура;
	ПараметрыПроверки.Вставить("Период", ТекущаяДата());
	ПараметрыПроверки.Вставить("ДокументПроверен", Пометка);
	ПараметрыПроверки.Вставить("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	ПараметрыПроверки.Вставить("Документ", Документ);
	
	Попытка
		ПроверкаДокументовСервер.УстановитьСтатусПроверкиДокумента(ПараметрыПроверки);
	Исключение
		Возврат Ложь;
	КонецПопытки;	
	
	//+Степанов Задача № 3439
	//ПлатежиКомитентамСервер.УстановитьСтатусДокументовВводДанных(Документ.ПлатежиКИсполнению.Выгрузить(), Пометка); 		
	ПлатежиКомитентамСервер.УстановитьСтатусДокументовВводДанных(Документ.ПлатежиКИсполнению.Выгрузить(), Пометка,Документ);
	//-Степанов
	Возврат Истина;	
	
КонецФункции

&НаКлиенте
Процедура СписокОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	СписокПриАктивизацииСтроки(ВыбранноеЗначение);
	
КонецПроцедуры


&НаКлиенте
Процедура ТестКлиента(Команда)

	ПлатежиКомитентамСервер.РегламентПроверкаПодтвержденияОплатыПоПлатежнымДокументам();
	
КонецПроцедуры

