Процедура УстановитьСтатусУведомления(Заказ, Отметка = Ложь) Экспорт
	//Зап = Новый Запрос;
	//Зап.Текст = "ВЫБРАТЬ
	//            |	Заказ.Ссылка КАК Заказ
	//            |ИЗ
	//            |	Документ.Заказ КАК Заказ
	//            |ГДЕ
	//            |	Заказ.Номер = &Номер";
	//Зап.УстановитьПараметр("Номер", НомерЗаказа);
	//Выб = Зап.Выполнить().Выбрать();
	//Заказ = Неопределено;
	//Если Выб.Следующий() Тогда
	//	Заказ = Выб.Заказ;
	//КонецЕСли;
	
	ПериодЗаписи = ТекущаяДата();
	Если ЗначениеЗаполнено(Заказ) Тогда
		Наб = РегистрыСведений.УведомлениеООкончанииИнтервалаДоставки.СоздатьНаборЗаписей();
		Наб.Отбор.Заказ.Установить(Заказ);
		Наб.Отбор.Период.Установить(ПериодЗаписи);
		
		Нов = Наб.Добавить();
		Нов.Период = ПериодЗаписи;
		Нов.Заказ = Заказ;
		Нов.СтатусВыставлен = Отметка;
		
		Наб.Записать();
	КонецеСли;	
КонецПроцедуры	

Процедура УстановитьIDПодписчикаPushУведомлений(IDПодписчика) Экспорт
	Константы.IDПодписчикаPushУведомлений.Установить(Новый ХранилищеЗначения(IDПодписчика, Новый СжатиеДанных(9)));
КонецПроцедуры	

