Процедура ВыполнитьОбменВФоне() Экспорт
	ФоновыеЗадания.Выполнить("МодульОбмен.ВыполнитьОбменНаСервере");
КонецПроцедуры	

Процедура ВыполнитьОбменHTTPВФоне() Экспорт
	ФоновыеЗадания.Выполнить("МодульОбмен_http.ВыгрузитьДанныеСтатусов");
КонецПроцедуры	

Функция СобратьДанныеПоИнтервалам() Экспорт
	
	ГлубинаПросмотраВМинутах = Константы.ГлубинаПросмотраИнтервалаВМинутах.Получить();
	Если ГлубинаПросмотраВМинутах = 0 Тогда
		ГлубинаПросмотраВМинутах = 60;
	КонецЕСли;	
	
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	Заказы.Ссылка КАК Заказ,
	            |	Заказы.Телефон КАК Телефон,
	            |	Заказы.НомерКлиента КАК НомерЗаказаИМ,
	            |	Заказы.Номер КАК Номер,
	            |	Заказы.Клиент КАК Клиент,
	            |	Заказы.ВремяДоставкиПо КАК ВремяДоставкиПо,
	            |	ЕСТЬNULL(УведомлениеООкончанииИнтервалаДоставкиСрезПоследних.Период, ИСТИНА) КАК ДатаУведомления
	            |ИЗ
	            |	Документ.Заказ КАК Заказы
	            |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УведомлениеООкончанииИнтервалаДоставки.СрезПоследних КАК УведомлениеООкончанииИнтервалаДоставкиСрезПоследних
	            |		ПО (УведомлениеООкончанииИнтервалаДоставкиСрезПоследних.Заказ.Ссылка = Заказы.Ссылка)
	            |ГДЕ
	            |	(Заказы.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.РезультатыДоставки.ПустаяСсылка)
	            |			ИЛИ Заказы.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.РезультатыДоставки.КДоставке))
	            |	И Заказы.Дата МЕЖДУ &ДатаНач И &ДатаКон
	            |	И Заказы.ВремяДоставкиПо < &ВремяДоставкиПо
	            |	И Заказы.СнятьСДоставки = ЛОЖЬ";
	Зап.УстановитьПараметр("ДатаНач", НачалоДня(ТекущаяДата()));
	Зап.УстановитьПараметр("ДатаКон", КонецДня(ТекущаяДата()));
	Зап.УстановитьПараметр("ВремяДоставкиПо", Дата(1,1,1, Час(ТекущаяДата()), Минута(ТекущаяДата()), 0) + ГлубинаПросмотраВМинутах*60);
	
	Выб = Зап.Выполнить().Выбрать();
	
	Мас = Новый Массив;
	
	
	Пока Выб.Следующий() Цикл
		Если Выб.ДатаУведомления <> Истина Тогда
			Если ТекущаяДата() < Выб.ДатаУведомления + 1200 Тогда
				Продолжить;
			КонецеСли;	
		КонецеСли;	
		Струк = Новый Структура;
		Струк.Вставить("Номер", Строка(Выб.Номер));
		Струк.Вставить("Телефон", Строка(Выб.Телефон));
		
		Мас.Добавить(Струк);
		
		МеханизмУведомленийСервер.УстановитьСтатусУведомления(Выб.Заказ);
	КонецЦикла;	
	
	Возврат Мас;
КонецФункции	
////этот код давал очень веселую ошибку на Андроиде
//Функция ПроверкаВыполненияОбменаВФоне() Экспорт
//	Задания = ФоновыеЗадания.ПолучитьФоновыеЗадания();
//	Если Задания.Количество() <> 0 Тогда
//		Возврат Истина;
//	Иначе
//		Возврат Ложь;
//	КонецеСли;	
//КонецФункции	