// все объекты, связанные с РэдЭкспресс - добавляем в ситсему с префиксом "рэ"

#Область  СлужебныеПроцедуры

Функция ПолучитьПодключениеКСервисуRED() Экспорт 
	
	Подключение = Новый Структура;
	
	Если ПараметрыСеанса.рэЭтоТестовыйРежим Тогда
		
		Подключение.Вставить("WS_Путь","https://redexpressservice.ru/api/internal/syncserv-test/syncserv.asmx?WSDL");
		Подключение.Вставить("Прокси_Путь","https://redexpressservice.ru");
		Подключение.Вставить("Пользователь", "redexpress");
		Подключение.Вставить("Пароль", "RedExpress");
		
	Иначе 
		
		Подключение.Вставить("WS_Путь","https://redexpressservice.ru/api/internal/syncserv/syncserv.asmx?WSDL");
		Подключение.Вставить("Прокси_Путь","https://redexpressservice.ru");
		Подключение.Вставить("Пользователь", "redexpress");
		Подключение.Вставить("Пароль", "RedExpress");

		
	КонецЕсли;	

	Возврат Подключение;	
	
КонецФункции	

Процедура ЗаписатьЛог_рэЛогЗапросов(Объект, Метод, Операция, Заказ, Статус, ТекстЗапроса = "", ТекстОтвета = "") Экспорт
	
	Набор = РегистрыСведений.рэЛогЗапросов.СоздатьНаборЗаписей();
	
	Набор.Отбор.Объект.Установить(Объект);
	Набор.Отбор.Метод.Установить(Метод);
	Набор.Отбор.Заказ.Установить(Заказ);
	Если ЗначениеЗаполнено(Операция) Тогда
		Набор.Отбор.Операция.Установить(Операция);
    КонецЕсли;
	
	Набор.Отбор.Период.Установить(ТекущаяДата());
	
	Запись = Набор.Добавить();
	Период = ТекущаяДата();
	Запись.Период   = Период;
	Запись.Объект = Объект;
	Запись.Метод = Метод;
	Запись.Операция = Операция;
	Запись.Заказ = Заказ; 
	
	Запись.Статус = Статус;
	Запись.Запрос = ТекстЗапроса;
	Запись.Ответ = ТекстОтвета;
		
	Попытка	
		Набор.Записать();		
	Исключение
		Сообщить("Ошибка записи логов отправки запросов Red: " + ОписаниеОшибки());	
	КонецПопытки;
	
	Если Статус <> 200 И Статус <> "Success" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	рэОбъектыДляОбменаСрезПоследних.СчетчикВыгрузок КАК СчетчикВыгрузок
		               |ИЗ
		               |	РегистрСведений.рэОбъектыДляОбмена.СрезПоследних(
		               |			,
		               |			Заказ = &Заказ
		               |				И Метод = &Метод
		              // |				И Объект = &Объект
		               |				И Операция = &Операция) КАК рэОбъектыДляОбменаСрезПоследних";
		
		//Запрос.УстановитьПараметр("Объект", Объект);
		Запрос.УстановитьПараметр("Метод", Метод);
		Запрос.УстановитьПараметр("Операция", Операция);
		Запрос.УстановитьПараметр("Заказ", Заказ); 
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			Если Выборка.СчетчикВыгрузок >= 20 Тогда
				
				Мас = ОбработкаСобытийИУведомленийСервер.ВернутьМассивАдресатовПоСобытию(Перечисления.ВидыСобытийУведомленияАбонентов.Регламент_рэОтправкаДанныхДляОбмена_ОшибкаОтправки);
				
				Если Мас.Количество() = 0 Тогда
					Возврат;
				КонецЕсли;	
				
				ТемаПисьма = "Ошибка отправки данных в РЕД";
				ТекстПисьма = "Ошибка отправки данных в РЕД" + Символы.ПС  + Символы.ПС + 
				"Период:  " + Период + Символы.ПС + 
				"Объект:  " + Объект + Символы.ПС + 
				"Метод:  " + Метод + Символы.ПС + 
				"Операция:  " + Операция + Символы.ПС + 
				"Заказ:  " + Заказ + Символы.ПС + 
				"Статус: " + Статус + Символы.ПС + Символы.ПС +  
				"ТекстЗапроса: " + ТекстЗапроса + Символы.ПС + Символы.ПС + 
				"ТекстОтвета: " + ТекстОтвета;
				
				lem.ОтправитьСообщение(Мас, ТемаПисьма, ТекстПисьма);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьрэОбъектыДляОбмена(Период, Объект, Метод, Операция, Заказ, ДатаОтправки, ДанныеОтправлены, ПереданныйСтатус = Неопределено)
	
	Попытка
		
		МенеджерЗаписи = РегистрыСведений.рэОбъектыДляОбмена.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = Период;
		МенеджерЗаписи.Объект = Объект;
		МенеджерЗаписи.Метод = Метод;
		МенеджерЗаписи.Операция = Операция;
		МенеджерЗаписи.Заказ = Заказ; 
		МенеджерЗаписи.Прочитать(); 
		
		Если ДанныеОтправлены = Ложь Тогда
			
			МенеджерЗаписи.СчетчикВыгрузок = МенеджерЗаписи.СчетчикВыгрузок + 1; 
		
		КонецЕсли; 
		
		МенеджерЗаписи.ДатаОтправки = ДатаОтправки;
		МенеджерЗаписи.ДанныеОтправлены = ДанныеОтправлены;
		МенеджерЗаписи.ПереданныйСтатус = ПереданныйСтатус;
		МенеджерЗаписи.Записать();
		
		
	Исключение
		
	КонецПопытки;
	
КонецПроцедуры	

#КонецОбласти   

Функция REDРегламентВыгрузкиПоКурьерам() Экспорт
	
	Попытка
		
		ПутиПодключенения = рэИнтеграцияРэдЭкспресс.ПолучитьПодключениеКСервисуRED();
		
		WSОпр = Новый WSОпределения(ПутиПодключенения.WS_Путь, ПутиПодключенения.Пользователь, ПутиПодключенения.Пароль);	
		Прокси = Новый WSПрокси(WSОпр, "http://www.redexpress.ru/", "SyncService" , "SyncServiceSoap");

		Прокси.Пользователь = ПутиПодключенения.Пользователь;
		Прокси.Пароль = ПутиПодключенения.Пароль;
		
		КурьерТип = Прокси.ФабрикаXDTO.Тип("http://www.redexpress.ru/", "Courier");
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	рэОбъектыДляОбменаСрезПоследних.Период КАК Период,
		               |	рэОбъектыДляОбменаСрезПоследних.Объект КАК Объект,
		               |	рэОбъектыДляОбменаСрезПоследних.Метод КАК Метод,
		               |	рэОбъектыДляОбменаСрезПоследних.Операция КАК Операция,
		               |	рэОбъектыДляОбменаСрезПоследних.Заказ КАК Заказ
		               |ПОМЕСТИТЬ ВТ_рэОбъектыДляОбмена
		               |ИЗ
		               |	РегистрСведений.рэОбъектыДляОбмена.СрезПоследних КАК рэОбъектыДляОбменаСрезПоследних
		               |ГДЕ
		               |	рэОбъектыДляОбменаСрезПоследних.Метод = &Метод
		               |	И рэОбъектыДляОбменаСрезПоследних.ДанныеОтправлены = ЛОЖЬ
		               |	И рэОбъектыДляОбменаСрезПоследних.СчетчикВыгрузок < 20
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	новаВодители.Ссылка.Наименование КАК Наименование,
		               |	""В"" + новаВодители.Ссылка.Код КАК Код,
		               |	новаВодители.Ссылка КАК Ссылка,
		               |	МАКСИМУМ(ПривязкаМашинКРейсамСрезПоследних.Транспорт) КАК Транспорт,
		               |	ВТ_рэОбъектыДляОбмена.Период КАК Период,
		               |	ВТ_рэОбъектыДляОбмена.Объект КАК Объект,
		               |	ВТ_рэОбъектыДляОбмена.Метод КАК Метод,
		               |	ВТ_рэОбъектыДляОбмена.Операция КАК Операция,
		               |	ВТ_рэОбъектыДляОбмена.Заказ КАК Заказ
		               |ПОМЕСТИТЬ ВТ_Данные
		               |ИЗ
		               |	ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.новаВодители КАК новаВодители
		               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних(, ) КАК ПривязкаМашинКРейсамСрезПоследних
		               |			ПО новаВодители.Ссылка = ПривязкаМашинКРейсамСрезПоследних.Водитель
		               |		ПО ((ВЫРАЗИТЬ(ВТ_рэОбъектыДляОбмена.Заказ КАК Справочник.новаВодители)) = новаВодители.Ссылка)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	новаВодители.Ссылка.Наименование,
		               |	""В"" + новаВодители.Ссылка.Код,
		               |	новаВодители.Ссылка,
		               |	ВТ_рэОбъектыДляОбмена.Период,
		               |	ВТ_рэОбъектыДляОбмена.Объект,
		               |	ВТ_рэОбъектыДляОбмена.Метод,
		               |	ВТ_рэОбъектыДляОбмена.Операция,
		               |	ВТ_рэОбъектыДляОбмена.Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_Данные.Наименование КАК Наименование,
		               |	ВТ_Данные.Код КАК Код,
		               |	ВТ_Данные.Ссылка КАК Ссылка,
		               |	ЕСТЬNULL(ВТ_Данные.Транспорт.НомерГосударственнойРегистрации, ""-"") КАК CarNumber,
		               |	ЕСТЬNULL(ТелефонныеАппаратыТранспортаСрезПоследних.ТА.Телефон, ""-"") КАК Phone,
		               |	ВЫБОР
		               |		КОГДА ВТ_Данные.Ссылка.ТерминалДоставки = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.СПбСтриж)
		               |			ТОГДА 2
		               |		ИНАЧЕ 1
		               |	КОНЕЦ КАК TerminalId,
		               |	ВТ_Данные.Период КАК Период,
		               |	ВТ_Данные.Объект КАК Объект,
		               |	ВТ_Данные.Метод КАК Метод,
		               |	ВТ_Данные.Операция КАК Операция,
		               |	ВТ_Данные.Заказ КАК Заказ
		               |ИЗ
		               |	ВТ_Данные КАК ВТ_Данные
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТелефонныеАппаратыТранспорта.СрезПоследних(, ) КАК ТелефонныеАппаратыТранспортаСрезПоследних
		               |		ПО ВТ_Данные.Транспорт = ТелефонныеАппаратыТранспортаСрезПоследних.Транспорт";
		
		Запрос.УстановитьПараметр("Метод", ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateCourier")); 
		
		Рез = Запрос.Выполнить();
		Выборка = Рез.Выбрать();
		
		Если Рез.Пустой() Тогда
			
			Возврат Истина;
			
		Иначе 
			
			ТипVehicleType =  Прокси.ФабрикаXDTO.Тип("http://www.redexpress.ru/", "VehicleType");
			VehicleType = Прокси.ФабрикаXDTO.Создать(ТипVehicleType);
			
			Пока Выборка.Следующий() Цикл
				
				Попытка
					
					Курьер = Прокси.ФабрикаXDTO.Создать(КурьерТип);
					Курьер.Id = Выборка.Код;
					Курьер.Name = Выборка.Наименование;
					
					Курьер.Surname = "-";
					Курьер.Patronymic = "-";
					Курьер.IsActive = Истина;
					Курьер.CarNumber = Выборка.CarNumber;
					Курьер.Phone = Выборка.Phone;
					Курьер.Email = "-";
					Курьер.TerminalId = Выборка.TerminalId;
					Курьер.VehicleType = "Company";
					
					
					ЗаписьXML = Новый ЗаписьXML;
					ЗаписьXML.УстановитьСтроку();
					Прокси.ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, Курьер);
					ДанныеXML_Данные = ЗаписьXML.Закрыть();	
					
					Ответ = Прокси.UpdateCourier(Курьер);
					
					ЗаписьXML = Новый ЗаписьXML;
					ЗаписьXML.УстановитьСтроку();
					Прокси.ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, Ответ);
					ДанныеXML_Ответ = ЗаписьXML.Закрыть();	
					
					Если Ответ.Status = 200 Или Ответ.Status ="Success" Тогда
						
						ОбновитьрэОбъектыДляОбмена(Выборка.Период, Выборка.Объект, Выборка.Метод, Выборка.Операция, Выборка.Заказ, ТекущаяДата(), Истина);
						
					Иначе	
						
						ОбновитьрэОбъектыДляОбмена(Выборка.Период, Выборка.Объект, Выборка.Метод, Выборка.Операция, Выборка.Заказ, ТекущаяДата(), Ложь);
						
					КонецЕсли;	                               
					
					ЗаписатьЛог_рэЛогЗапросов(Выборка.Объект, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateCourier"), Выборка.Операция, Выборка.Заказ, Ответ.Status, ДанныеXML_Данные, ДанныеXML_Ответ);
					
				Исключение
					
					ЗаписатьЛог_рэЛогЗапросов(Выборка.Объект, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateCourier"), Выборка.Операция, Выборка.Заказ, "Ошибка отправки записи", , ОписаниеОшибки());
					
				КонецПопытки;

			КонецЦикла;
						
		КонецЕсли;
		
	Исключение	
		
		РезультатСтруктура = Новый Структура;
		ЗаписатьЛог_рэЛогЗапросов(,ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateCourier"), , , "Общая ошибка", , ОписаниеОшибки());
		
		Возврат Ложь;
		
	КонецПопытки;	
	
	Возврат Истина;
	
КонецФункции

Функция REDРегламентВыгрузкиПоКурьерам_РегистрацияДляОтправки(Рейс = Неопределено, Водитель = Неопределено) Экспорт
	
	Попытка
		
		Если Водитель = Неопределено Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	ПривязкаМашинКРейсамСрезПоследних.Водитель КАК Водитель
			               |ИЗ
			               |	РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних(, Рейс = &Рейс) КАК ПривязкаМашинКРейсамСрезПоследних";
			
			Запрос.УстановитьПараметр("Рейс", Рейс);
			
			Результат = Запрос.Выполнить();
			
			Если Результат.Пустой() Тогда
				Возврат Истина;
			КонецЕсли;
			
			Выборка = Результат.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				МенеджерЗаписи = РегистрыСведений.рэОбъектыДляОбмена.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Период = ТекущаяДата();
				МенеджерЗаписи.Метод = Перечисления.рэМетоды.UpdateCourier;
				МенеджерЗаписи.Объект = Рейс;
				МенеджерЗаписи.Заказ  = Выборка.Водитель;
				МенеджерЗаписи.Записать();
				
			КонецЦикла;
			
		Иначе
			
			МенеджерЗаписи = РегистрыСведений.рэОбъектыДляОбмена.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период = ТекущаяДата();
			МенеджерЗаписи.Метод = Перечисления.рэМетоды.UpdateCourier;
			МенеджерЗаписи.Объект = Рейс;
			МенеджерЗаписи.Заказ = Водитель;
			МенеджерЗаписи.Записать();		
			
		КонецЕсли;
		
	Исключение	
		
		Сообщить("Ошибка регистрации объекта для обмена в подсистеме Red: " + ОписаниеОшибки());
		Возврат Ложь;
		
	КонецПопытки;	
	
	Возврат Истина;
	

	
КонецФункции	

Функция REDОбновитАдресПолучателя() Экспорт
	
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	рэОбъектыДляОбменаСрезПоследних.Период КАК Период,
		|	рэОбъектыДляОбменаСрезПоследних.Заказ КАК Заказ,
		|	рэОбъектыДляОбменаСрезПоследних.Метод КАК Метод,
		|	рэОбъектыДляОбменаСрезПоследних.Операция КАК Операция
		|ПОМЕСТИТЬ ВТ_рэОбъектыДляОбмена
		|ИЗ
		|	РегистрСведений.рэОбъектыДляОбмена.СрезПоследних(, ) КАК рэОбъектыДляОбменаСрезПоследних
		|ГДЕ
		|	рэОбъектыДляОбменаСрезПоследних.Метод = &Метод
		|	И рэОбъектыДляОбменаСрезПоследних.ДанныеОтправлены = ЛОЖЬ
		|	И рэОбъектыДляОбменаСрезПоследних.СчетчикВыгрузок < 20
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_НужныеКонтрагенты
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Контрагенты.Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Родитель.ОсновнойМагазин = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Заказ,
		|	новаМестнаяДоставка.ТочкаПрибытия.Наименование КАК address,
		|	РеализацияТоваровУслуг.НомерВнешнегоЗаказа КАК invoiceId,
		|	ВТ_рэОбъектыДляОбмена.Метод КАК Метод,
		|	ВТ_рэОбъектыДляОбмена.Операция КАК Операция,
		|	ВТ_рэОбъектыДляОбмена.Период КАК Период
		|ИЗ
		|	БизнесПроцесс.новаМестнаяДоставка КАК новаМестнаяДоставка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		|			ПО РеализацияТоваровУслуг.Ссылка = ВТ_рэОбъектыДляОбмена.Заказ
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НужныеКонтрагенты КАК ВТ_НужныеКонтрагенты
		|			ПО РеализацияТоваровУслуг.ВладелецТовара = ВТ_НужныеКонтрагенты.Ссылка
		|		ПО новаМестнаяДоставка.Номер = РеализацияТоваровУслуг.Номер";
		
		Запрос.УстановитьПараметр("Ссылка", ПараметрыСеанса.рэКомпанияRED);
		Запрос.УстановитьПараметр("Метод", ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateRecipientAddress")); 
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			Возврат Истина;
		КонецЕсли;	
		
		
		Выборка = РезультатЗапроса.Выбрать(); 
		
		Если Выборка.Следующий() Тогда
			
			ПутиПодключенения = рэИнтеграцияРэдЭкспресс.ПолучитьПодключениеКСервисуRED();
			
			WSОпр = Новый WSОпределения(ПутиПодключенения.WS_Путь, ПутиПодключенения.Пользователь, ПутиПодключенения.Пароль);	
			Прокси = Новый WSПрокси(WSОпр, "http://www.redexpress.ru/", "SyncService" , "SyncServiceSoap");
			
			Прокси.Пользователь = ПутиПодключенения.Пользователь;
			Прокси.Пароль = ПутиПодключенения.Пароль;
			
			ДанныеXML_Данные = "invoiceId: """ + ОбработатьВнешнийНомерДляРед(СокрЛП(Выборка.invoiceId)) + """" + Символы.ПС + "address: """ + Выборка.address + """";
			
			Ответ = Прокси.UpdateRecipientAddress(ОбработатьВнешнийНомерДляРед(СокрЛП(Выборка.invoiceId)), Выборка.address);
			
			ЗаписьXML = Новый ЗаписьXML;
			ЗаписьXML.УстановитьСтроку();
			Прокси.ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, Ответ);
			ДанныеXML_Ответ = ЗаписьXML.Закрыть();	
			
			//ЗаписатьЛог_рэ_ЛогЗапросов(Ответ.Status, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateRecipientAddress"), Задание, Источник, ДанныеXML_Данные, ДанныеXML_Ответ);
			
			Если Ответ.Status = 200 Или Ответ.Status ="Success" Тогда
					
				ОбновитьрэОбъектыДляОбмена(Выборка.Период, , Выборка.Метод, Выборка.Операция, Выборка.Заказ, ТекущаяДата(), Истина);
				
			Иначе	
				
				ОбновитьрэОбъектыДляОбмена(Выборка.Период, , Выборка.Метод, Выборка.Операция, Выборка.Заказ, ТекущаяДата(), Ложь);
						
			КонецЕсли;	
					
			//ЗаписатьЛог_рэ_ЛогЗапросов(Ответ.Status, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateQuantityDeliveredGoods"), ВыборкаДокументов.ЗакрытиеЗаказов, ВыборкаДокументов.Реализация , ДанныеXML_Данные, ДанныеXML_Ответ);
			ЗаписатьЛог_рэЛогЗапросов(, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateRecipientAddress"), , Выборка.Заказ, Ответ.Status, ДанныеXML_Данные, ДанныеXML_Ответ)
	
			
		КонецЕсли;
		
	Исключение	
		
		//ЗаписатьЛог_рэ_ЛогЗапросов("Общая ошибка", ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateRecipientAddress"), ,Источник , , ОписаниеОшибки());
		ЗаписатьЛог_рэЛогЗапросов(,ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateRecipientAddress"), , , "Общая ошибка", , ОписаниеОшибки());
		Возврат Ложь;
		
	КонецПопытки;	
	
	Возврат Истина;
	
КонецФункции	

Функция REDОбновитАдресПолучателя__РегистрацияДляОтправки(Источник, Задание, НовыйАдрес) Экспорт   
	
	Если Не ЗначениеЗаполнено(ПараметрыСеанса.рэКомпанияRED) Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Заказ
		|ИЗ
		|	БизнесПроцесс.новаМестнаяДоставка КАК новаМестнаяДоставка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО новаМестнаяДоставка.Номер = РеализацияТоваровУслуг.Номер
		|ГДЕ
		|	новаМестнаяДоставка.Номер = &Номер
		|	И (РеализацияТоваровУслуг.ВладелецТовара = &ВладелецТовара
		|			ИЛИ РеализацияТоваровУслуг.ВладелецТовара.Родитель.ОсновнойМагазин = &ВладелецТовара)";
		
		Запрос.УстановитьПараметр("ВладелецТовара", ПараметрыСеанса.рэКомпанияRED);
		Запрос.УстановитьПараметр("Номер", Задание.Номер);
		
		Результат = Запрос.Выполнить();
		
		Если Результат.Пустой() Тогда
			Возврат Истина;
		КонецЕсли;
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			МенеджерЗаписи = РегистрыСведений.рэОбъектыДляОбмена.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период = ТекущаяДата();
			МенеджерЗаписи.Метод = Перечисления.рэМетоды.UpdateRecipientAddress;
			МенеджерЗаписи.Заказ  = Выборка.Заказ;
			МенеджерЗаписи.Записать();
			
		КонецЦикла;
		
	Исключение	
		
		Сообщить("Ошибка регистрации объекта для обмена в подсистеме Red: " + ОписаниеОшибки());
		Возврат Ложь;
		
	КонецПопытки;	
	
	Возврат Истина;
	
КонецФункции	

Функция REDПередачиДанныхПоДоставленнымТоварам()Экспорт 
	
	Попытка
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	рэОбъектыДляОбменаСрезПоследних.Период КАК Период,
		               |	ВЫРАЗИТЬ(рэОбъектыДляОбменаСрезПоследних.Объект КАК Документ.ЗакрытиеЗаказов).Ссылка КАК Объект,
		               |	рэОбъектыДляОбменаСрезПоследних.Метод КАК Метод,
		               |	рэОбъектыДляОбменаСрезПоследних.Операция КАК Операция,
		               |	рэОбъектыДляОбменаСрезПоследних.Заказ КАК Заказ,
		               |	рэОбъектыДляОбменаСрезПоследних.ДанныеОтправлены КАК ДанныеОтправлены,
		               |	рэОбъектыДляОбменаСрезПоследних.ДатаОтправки КАК ДатаОтправки
		               |ПОМЕСТИТЬ ВТ_рэОбъектыДляОбмена
		               |ИЗ
		               |	РегистрСведений.рэОбъектыДляОбмена.СрезПоследних(, ) КАК рэОбъектыДляОбменаСрезПоследних
		               |ГДЕ
		               |	рэОбъектыДляОбменаСрезПоследних.Метод = &Метод
		               |	И рэОбъектыДляОбменаСрезПоследних.ДанныеОтправлены = ЛОЖЬ
		               |	И рэОбъектыДляОбменаСрезПоследних.СчетчикВыгрузок < 20
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Объект,
		               |	Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Контрагенты.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ ВТ_НужныеКонтрагенты
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	Контрагенты.Ссылка = &Ссылка
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	Контрагенты.Ссылка
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	Контрагенты.Родитель.ОсновнойМагазин = &Ссылка
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЗакрытиеЗаказовЗаказы.Реализация.НомерВнешнегоЗаказа КАК invoiceId,
		               |	ЗакрытиеЗаказовТовары.Номенклатура.Артикул КАК ItemId,
		               |	ЗакрытиеЗаказовТовары.Количество - ЗакрытиеЗаказовТовары.КоличествоВозвращено - ЗакрытиеЗаказовТовары.Недовложение КАК Quantity,
		               |	ЗакрытиеЗаказовЗаказы.Реализация КАК Реализация,
		               |	ЗакрытиеЗаказовТовары.Номенклатура КАК Номенклатура,
		               |	ВТ_рэОбъектыДляОбмена.Период КАК Период,
		               |	ВТ_рэОбъектыДляОбмена.Метод КАК Метод,
		               |	ВТ_рэОбъектыДляОбмена.Операция КАК Операция,
		               |	ВТ_рэОбъектыДляОбмена.Заказ КАК Заказ,
		               |	ВТ_рэОбъектыДляОбмена.ДанныеОтправлены КАК ДанныеОтправлены,
		               |	ВТ_рэОбъектыДляОбмена.ДатаОтправки КАК ДатаОтправки,
		               |	ЗакрытиеЗаказовЗаказы.Ссылка КАК ЗакрытиеЗаказов
		               |ИЗ
		               |	ВТ_НужныеКонтрагенты КАК ВТ_НужныеКонтрагенты
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗакрытиеЗаказов.Заказы КАК ЗакрытиеЗаказовЗаказы
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗакрытиеЗаказов.Товары КАК ЗакрытиеЗаказовТовары
		               |			ПО ЗакрытиеЗаказовЗаказы.Ссылка = ЗакрытиеЗаказовТовары.Ссылка
		               |				И ЗакрытиеЗаказовЗаказы.Доставка = ЗакрытиеЗаказовТовары.Доставка
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |			ПО ЗакрытиеЗаказовЗаказы.Реализация = ВТ_рэОбъектыДляОбмена.Заказ
		               |				И ЗакрытиеЗаказовЗаказы.Ссылка = ВТ_рэОбъектыДляОбмена.Объект
		               |		ПО ВТ_НужныеКонтрагенты.Ссылка = ЗакрытиеЗаказовЗаказы.ВладелецТовара
		               |ГДЕ
		               |	ЗакрытиеЗаказовТовары.Количество - ЗакрытиеЗаказовТовары.КоличествоВозвращено - ЗакрытиеЗаказовТовары.Недовложение > 0
		               |	И ЗакрытиеЗаказовЗаказы.Закрыть = ИСТИНА
		               |ИТОГИ
		               |	МАКСИМУМ(invoiceId),
		               |	МАКСИМУМ(Период),
		               |	МАКСИМУМ(Метод),
		               |	МАКСИМУМ(Операция),
		               |	МАКСИМУМ(ДанныеОтправлены),
		               |	МАКСИМУМ(ДатаОтправки)
		               |ПО
		               |	ЗакрытиеЗаказов,
		               |	Реализация";
		
		Запрос.УстановитьПараметр("Ссылка", ПараметрыСеанса.рэКомпанияRED);
		Запрос.УстановитьПараметр("Метод",  ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateQuantityDeliveredGoods"));
		
		Результат = Запрос.Выполнить();
		
		Если Результат.Пустой() Тогда
			Возврат Истина;
		КонецЕсли;
		
		ПутиПодключенения = рэИнтеграцияРэдЭкспресс.ПолучитьПодключениеКСервисуRED();
		
		WSОпр = Новый WSОпределения(ПутиПодключенения.WS_Путь, ПутиПодключенения.Пользователь, ПутиПодключенения.Пароль);	
		Прокси = Новый WSПрокси(WSОпр, "http://www.redexpress.ru/", "SyncService" , "SyncServiceSoap");

		Прокси.Пользователь = ПутиПодключенения.Пользователь;
		Прокси.Пароль = ПутиПодключенения.Пароль;
		
		QuantityТип = Прокси.ФабрикаXDTO.Тип("http://www.redexpress.ru/", "ArrayOfQuantityGoods");
				
		QuantityGoodsТип = Прокси.ФабрикаXDTO.Тип("http://www.redexpress.ru/", "QuantityGoods");

		ВыборкаЗагрузкаСТСД = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаЗагрузкаСТСД.Следующий() Цикл 
			
			ВыборкаДокументов = ВыборкаЗагрузкаСТСД.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаДокументов.Следующий() Цикл
				
				Попытка
					
					QuantityОбъект = Прокси.ФабрикаXDTO.Создать(QuantityТип);
					
					ВыборкаТоваров = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					ЕстьДоставки = Ложь;
					
					Пока ВыборкаТоваров.Следующий() Цикл
						
						QuantityGoodОбъект = Прокси.ФабрикаXDTO.Создать(QuantityGoodsТип);
						QuantityGoodОбъект.ItemId   = ВыборкаТоваров.ItemId;
						QuantityGoodОбъект.Quantity = ВыборкаТоваров.Quantity;
						
						
						QuantityОбъект.QuantityGoods.Добавить(QuantityGoodОбъект);
						
					КонецЦикла;	
					
					
					ЗаписьXML = Новый ЗаписьXML;
					ЗаписьXML.УстановитьСтроку();
					Прокси.ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, QuantityОбъект);
					ДанныеXML_Данные = ЗаписьXML.Закрыть();	
					
					ДанныеXML_Данные = "invoiceId: """ + ОбработатьВнешнийНомерДляРед(ВыборкаДокументов.invoiceId) + """" + Символы.ПС + ДанныеXML_Данные;
					
					Ответ = Прокси.UpdateQuantityDeliveredGoods(ОбработатьВнешнийНомерДляРед(ВыборкаДокументов.invoiceId), QuantityОбъект);
					
					ЗаписьXML = Новый ЗаписьXML;
					ЗаписьXML.УстановитьСтроку();
					Прокси.ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, Ответ);
					ДанныеXML_Ответ = ЗаписьXML.Закрыть();
					
					Если Ответ.Status = 200 Или Ответ.Status ="Success" Тогда
					
						ОбновитьрэОбъектыДляОбмена(ВыборкаДокументов.Период, ВыборкаДокументов.ЗакрытиеЗаказов, ВыборкаДокументов.Метод, ВыборкаДокументов.Операция, ВыборкаДокументов.Реализация, ТекущаяДата(), Истина);
						
					Иначе 
						
						ОбновитьрэОбъектыДляОбмена(ВыборкаДокументов.Период, ВыборкаДокументов.ЗакрытиеЗаказов, ВыборкаДокументов.Метод, ВыборкаДокументов.Операция, ВыборкаДокументов.Реализация, ТекущаяДата(), Ложь);
						
					КонецЕсли;	
					
					//ЗаписатьЛог_рэ_ЛогЗапросов(Ответ.Status, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateQuantityDeliveredGoods"), ВыборкаДокументов.ЗакрытиеЗаказов, ВыборкаДокументов.Реализация , ДанныеXML_Данные, ДанныеXML_Ответ);
					ЗаписатьЛог_рэЛогЗапросов(ВыборкаДокументов.ЗакрытиеЗаказов, ВыборкаДокументов.Метод, ВыборкаДокументов.Операция, ВыборкаДокументов.Реализация, Ответ.Status, ДанныеXML_Данные, ДанныеXML_Ответ);
					
				Исключение
					
					//ЗаписатьЛог_рэ_ЛогЗапросов("Общая ошибка", ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateQuantityDeliveredGoods"), ВыборкаДокументов.ЗакрытиеЗаказов, ВыборкаДокументов.Реализация , , ОписаниеОшибки());
					ЗаписатьЛог_рэЛогЗапросов(ВыборкаДокументов.ЗакрытиеЗаказов, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateQuantityDeliveredGoods"), , ВыборкаДокументов.Реализация, "Общая ошибка",,ОписаниеОшибки());
					
					Возврат Ложь;
					
				КонецПопытки;
				
				
			КонецЦикла; 
		КонецЦикла; 

		
	Исключение	
		
		//ЗаписатьЛог_рэ_ЛогЗапросов("Общая ошибка", ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateQuantityDeliveredGoods"), , , , ОписаниеОшибки());
		ЗаписатьЛог_рэЛогЗапросов(,ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateQuantityDeliveredGoods"), , ,"Общая ошибка" , , ОписаниеОшибки());
		Возврат Ложь;
		
	КонецПопытки;		
	
	Возврат Истина; 
	
КонецФункции	

Функция REDОбновитьСтоимостьДоставкиУстановленнуюМагазином()
	
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	рэОбъектыДляОбменаСрезПоследних.Период КАК Период,
		               |	ВЫРАЗИТЬ(рэОбъектыДляОбменаСрезПоследних.Объект КАК Документ.ЗакрытиеЗаказов).Ссылка КАК Объект,
		               |	рэОбъектыДляОбменаСрезПоследних.Заказ КАК Заказ
		               |ПОМЕСТИТЬ ВТ_рэОбъектыДляОбмена
		               |ИЗ
		               |	РегистрСведений.рэОбъектыДляОбмена.СрезПоследних(, ) КАК рэОбъектыДляОбменаСрезПоследних
		               |ГДЕ
		               |	рэОбъектыДляОбменаСрезПоследних.Метод = &Метод
		               |	И рэОбъектыДляОбменаСрезПоследних.ДанныеОтправлены = ЛОЖЬ
		               |	И рэОбъектыДляОбменаСрезПоследних.СчетчикВыгрузок < 20
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Объект,
		               |	Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Контрагенты.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ ВТ_НужныеКонтрагенты
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	Контрагенты.Ссылка = &Ссылка
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	Контрагенты.Ссылка
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	Контрагенты.Родитель.ОсновнойМагазин = &Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЗакрытиеЗаказовЗаказы.Реализация.НомерВнешнегоЗаказа КАК invoiceId,
		               |	ЗакрытиеЗаказовЗаказы.Ссылка КАК ЗакрытиеЗаказов,
		               |	ЗакрытиеЗаказовЗаказы.Реализация КАК Реализация,
		               |	ЗакрытиеЗаказовЗаказы.СуммаДоставкиДоМКАД + ЗакрытиеЗаказовЗаказы.СуммаДоставкиЗаМКАД КАК cost,
		               |	0 КАК prepaid,
		               |	ВТ_рэОбъектыДляОбмена.Период КАК Период,
		               |	ВТ_рэОбъектыДляОбмена.Объект КАК Объект,
		               |	ВТ_рэОбъектыДляОбмена.Заказ КАК Заказ
		               |ИЗ
		               |	ВТ_НужныеКонтрагенты КАК ВТ_НужныеКонтрагенты
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗакрытиеЗаказов.Заказы КАК ЗакрытиеЗаказовЗаказы
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗакрытиеЗаказов.Товары КАК ЗакрытиеЗаказовТовары
		               |			ПО ЗакрытиеЗаказовЗаказы.Ссылка = ЗакрытиеЗаказовТовары.Ссылка
		               |				И ЗакрытиеЗаказовЗаказы.Доставка = ЗакрытиеЗаказовТовары.Доставка
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |			ПО ЗакрытиеЗаказовЗаказы.Ссылка = ВТ_рэОбъектыДляОбмена.Объект
		               |				И ЗакрытиеЗаказовЗаказы.Реализация = ВТ_рэОбъектыДляОбмена.Заказ
		               |		ПО ВТ_НужныеКонтрагенты.Ссылка = ЗакрытиеЗаказовЗаказы.ВладелецТовара
		               |ГДЕ
		               |	ЗакрытиеЗаказовЗаказы.Закрыть = ИСТИНА";
		
		Запрос.УстановитьПараметр("Ссылка", ПараметрыСеанса.рэКомпанияRED);
		Запрос.УстановитьПараметр("Метод", ПредопределенноеЗначение("Перечисление.рэМетоды.UpdatePriceShopService"));
		
		Результат = Запрос.Выполнить();
		
		Если Результат.Пустой() Тогда
			Возврат Истина;
		КонецЕсли;
		
		ПутиПодключенения = рэИнтеграцияРэдЭкспресс.ПолучитьПодключениеКСервисуRED();
		
		WSОпр = Новый WSОпределения(ПутиПодключенения.WS_Путь, ПутиПодключенения.Пользователь, ПутиПодключенения.Пароль);	
		Прокси = Новый WSПрокси(WSОпр, "http://www.redexpress.ru/", "SyncService" , "SyncServiceSoap");
		
		Прокси.Пользователь = ПутиПодключенения.Пользователь;
		Прокси.Пароль = ПутиПодключенения.Пароль;
		
		ВыборкаДокументов = Результат.Выбрать();
		
		Пока ВыборкаДокументов.Следующий() Цикл
			
			Попытка
				
				ДанныеXML_Данные = "invoiceId: """ + ОбработатьВнешнийНомерДляРед(ВыборкаДокументов.invoiceId) + """" + Символы.ПС +
									"cost: """ + ВыборкаДокументов.cost + """" + Символы.ПС + 
									"prepaid: """ + ВыборкаДокументов.prepaid + """";
				
				Ответ = Прокси.UpdatePriceShopService(ОбработатьВнешнийНомерДляРед(ВыборкаДокументов.invoiceId), ВыборкаДокументов.cost, ВыборкаДокументов.prepaid);
				
				ЗаписьXML = Новый ЗаписьXML;
				ЗаписьXML.УстановитьСтроку();
				Прокси.ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, Ответ);
				ДанныеXML_Ответ = ЗаписьXML.Закрыть();
				
				Если Ответ.Status = 200 Или Ответ.Status ="Success" Тогда
					
					ОбновитьрэОбъектыДляОбмена(ВыборкаДокументов.Период, ВыборкаДокументов.ЗакрытиеЗаказов, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdatePriceShopService"), Неопределено, ВыборкаДокументов.Реализация, ТекущаяДата(), Истина);
					
				Иначе 
					
					ОбновитьрэОбъектыДляОбмена(ВыборкаДокументов.Период, ВыборкаДокументов.ЗакрытиеЗаказов, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdatePriceShopService"), Неопределено, ВыборкаДокументов.Реализация, ТекущаяДата(), Ложь);
				
				КонецЕсли;
				
				//ЗаписатьЛог_рэ_ЛогЗапросов(Ответ.Status, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdatePriceShopService"), ВыборкаДокументов.ЗакрытиеЗаказов, ВыборкаДокументов.Реализация, ДанныеXML_Данные, ДанныеXML_Ответ);
				ЗаписатьЛог_рэЛогЗапросов(ВыборкаДокументов.ЗакрытиеЗаказов, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdatePriceShopService"), , ВыборкаДокументов.Реализация, Ответ.Status, ДанныеXML_Данные, ДанныеXML_Ответ);
			Исключение
				
				//ЗаписатьЛог_рэ_ЛогЗапросов("Общая ошибка", ПредопределенноеЗначение("Перечисление.рэМетоды.UpdatePriceShopService"), ВыборкаДокументов.ЗакрытиеЗаказов, ВыборкаДокументов.Реализация, , ОписаниеОшибки());
				ЗаписатьЛог_рэЛогЗапросов(ВыборкаДокументов.ЗакрытиеЗаказов, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdatePriceShopService"), , ВыборкаДокументов.Реализация, "Общая ошибка", , ОписаниеОшибки());
				Возврат Ложь;
				
			КонецПопытки;
			
			
		КонецЦикла; 
		
		
	Исключение	
		
		//ЗаписатьЛог_рэ_ЛогЗапросов("Общая ошибка", ПредопределенноеЗначение("Перечисление.рэМетоды.UpdatePriceShopService"), , , , ОписаниеОшибки());
		ЗаписатьЛог_рэЛогЗапросов(,ПредопределенноеЗначение("Перечисление.рэМетоды.UpdatePriceShopService"), , ,"Общая ошибка" , , ОписаниеОшибки());
		Возврат Ложь;
		
	КонецПопытки;	
	
	Возврат Истина;
	
КонецФункции	

Функция REDОбновитьИнформациюОПлатежахПоНакладной()
	
	Возврат Истина;
	
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	рэОбъектыДляОбменаСрезПоследних.Период КАК Период,
		               |	ВЫРАЗИТЬ(рэОбъектыДляОбменаСрезПоследних.Объект КАК Документ.ЗакрытиеЗаказов).Ссылка КАК Объект,
		               |	рэОбъектыДляОбменаСрезПоследних.Заказ КАК Заказ
		               |ПОМЕСТИТЬ ВТ_рэОбъектыДляОбмена
		               |ИЗ
		               |	РегистрСведений.рэОбъектыДляОбмена.СрезПоследних(, ) КАК рэОбъектыДляОбменаСрезПоследних
		               |ГДЕ
		               |	рэОбъектыДляОбменаСрезПоследних.Метод = &Метод
		               |	И рэОбъектыДляОбменаСрезПоследних.ДанныеОтправлены = ЛОЖЬ
		               |	И рэОбъектыДляОбменаСрезПоследних.СчетчикВыгрузок < 20
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Объект,
		               |	Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Контрагенты.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ ВТ_НужныеКонтрагенты
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	Контрагенты.Ссылка = &Ссылка
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	Контрагенты.Ссылка
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	Контрагенты.Родитель.ОсновнойМагазин = &Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	МАКСИМУМ(ЗакрытиеЗаказовЗаказы.Реализация.НомерВнешнегоЗаказа) КАК invoiceId,
		               |	ЗакрытиеЗаказовЗаказы.Ссылка КАК ЗакрытиеЗаказов,
		               |	СУММА((ЗакрытиеЗаказовТовары.Количество - ЗакрытиеЗаказовТовары.КоличествоВозвращено - ЗакрытиеЗаказовТовары.Недовложение) * ЗакрытиеЗаказовТовары.Цена) КАК СуммаТоваров,
		               |	МАКСИМУМ(ЗакрытиеЗаказовЗаказы.СуммаДоставкиДоМКАД + ЗакрытиеЗаказовЗаказы.СуммаДоставкиЗаМКАД) КАК СуммаДоставки,
		               |	ЗакрытиеЗаказовЗаказы.Реализация КАК Реализация,
		               |	ЗакрытиеЗаказовЗаказы.Ссылка.Дата КАК ДатаЗакрытия,
		               |	ВТ_рэОбъектыДляОбмена.Период КАК Период
		               |ИЗ
		               |	ВТ_НужныеКонтрагенты КАК ВТ_НужныеКонтрагенты
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗакрытиеЗаказов.Заказы КАК ЗакрытиеЗаказовЗаказы
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗакрытиеЗаказов.Товары КАК ЗакрытиеЗаказовТовары
		               |			ПО ЗакрытиеЗаказовЗаказы.Ссылка = ЗакрытиеЗаказовТовары.Ссылка
		               |				И ЗакрытиеЗаказовЗаказы.Доставка = ЗакрытиеЗаказовТовары.Доставка
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |			ПО ЗакрытиеЗаказовЗаказы.Ссылка = ВТ_рэОбъектыДляОбмена.Объект
		               |				И ЗакрытиеЗаказовЗаказы.Реализация = ВТ_рэОбъектыДляОбмена.Заказ
		               |		ПО ВТ_НужныеКонтрагенты.Ссылка = ЗакрытиеЗаказовЗаказы.ВладелецТовара
		               |ГДЕ
		               |	ЗакрытиеЗаказовЗаказы.Закрыть = ИСТИНА
		               |	И ЗакрытиеЗаказовЗаказы.ТипОплаты В(&ТипОплатыНаличныеТерминал)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЗакрытиеЗаказовЗаказы.Ссылка,
		               |	ЗакрытиеЗаказовЗаказы.Реализация,
		               |	ЗакрытиеЗаказовЗаказы.Ссылка.Дата,
		               |	ВТ_рэОбъектыДляОбмена.Период
		               |ИТОГИ
		               |	МАКСИМУМ(invoiceId),
		               |	МАКСИМУМ(ДатаЗакрытия),
		               |	МАКСИМУМ(Период)
		               |ПО
		               |	ЗакрытиеЗаказов,
		               |	Реализация";
		
		ТипОплатыНаличныеТерминал = Новый Массив;
		ТипОплатыНаличныеТерминал.Добавить(Справочники.ТипыОплат.Терминал);
		ТипОплатыНаличныеТерминал.Добавить(Справочники.ТипыОплат.Наличные);
		
		Запрос.УстановитьПараметр("Ссылка", ПараметрыСеанса.рэКомпанияRED);
		Запрос.УстановитьПараметр("ТипОплатыНаличныеТерминал", ТипОплатыНаличныеТерминал);
		Запрос.УстановитьПараметр("Метод", ПредопределенноеЗначение("Перечисление.рэМетоды.UpdatePayments"));
		
		Результат = Запрос.Выполнить();
		
		Если Результат.Пустой() Тогда
			Возврат Истина;
		КонецЕсли;
		
		ПутиПодключенения = рэИнтеграцияРэдЭкспресс.ПолучитьПодключениеКСервисуRED();
		
		WSОпр = Новый WSОпределения(ПутиПодключенения.WS_Путь, ПутиПодключенения.Пользователь, ПутиПодключенения.Пароль);	
		Прокси = Новый WSПрокси(WSОпр, "http://www.redexpress.ru/", "SyncService" , "SyncServiceSoap");
		
		Прокси.Пользователь = ПутиПодключенения.Пользователь;
		Прокси.Пароль = ПутиПодключенения.Пароль;
		
		ArrayOfPaymentТип = Прокси.ФабрикаXDTO.Тип("http://www.redexpress.ru/", "ArrayOfPayment");
		
		PaymentТип = Прокси.ФабрикаXDTO.Тип("http://www.redexpress.ru/", "Payment");
		
		ВыборкаЗакрытиеЗаказов = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаЗакрытиеЗаказов.Следующий() Цикл 
			
			ВыборкаДокументов = ВыборкаЗакрытиеЗаказов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаДокументов.Следующий() Цикл
				
				Попытка
					
					ArrayOfPaymentОбъект = Прокси.ФабрикаXDTO.Создать(ArrayOfPaymentТип);
					
					ВыборкаСумм = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Пока ВыборкаСумм.Следующий() Цикл
						
						PaymentОбъект = Прокси.ФабрикаXDTO.Создать(PaymentТип);
						PaymentОбъект.PaymentOrder = "-";
						PaymentОбъект.Amount   = ВыборкаСумм.СуммаТоваров + ВыборкаСумм.СуммаДоставки;
						PaymentОбъект.Date = ВыборкаДокументов.ДатаЗакрытия;
						
						ArrayOfPaymentОбъект.Payment.Добавить(PaymentОбъект);
						
					КонецЦикла;	
					
					
					ЗаписьXML = Новый ЗаписьXML;
					ЗаписьXML.УстановитьСтроку();
					Прокси.ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ArrayOfPaymentОбъект);
					ДанныеXML_Данные = ЗаписьXML.Закрыть();	
					
					ДанныеXML_Данные = "invoiceId: """ + ОбработатьВнешнийНомерДляРед(ВыборкаДокументов.invoiceId) + """" + Символы.ПС + ДанныеXML_Данные;
					
					Ответ = Прокси.UpdatePayments(ОбработатьВнешнийНомерДляРед(ВыборкаДокументов.invoiceId), ArrayOfPaymentОбъект);
					
					ЗаписьXML = Новый ЗаписьXML;
					ЗаписьXML.УстановитьСтроку();
					Прокси.ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, Ответ);
					ДанныеXML_Ответ = ЗаписьXML.Закрыть();	
					
					Если Ответ.Status = 200 Или Ответ.Status ="Success" Тогда
					
						ОбновитьрэОбъектыДляОбмена(ВыборкаДокументов.Период, ВыборкаДокументов.ЗакрытиеЗаказов, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdatePayments"), Неопределено, ВыборкаДокументов.Реализация, ТекущаяДата(), Истина);
						
					Иначе 
						
						ОбновитьрэОбъектыДляОбмена(ВыборкаДокументов.Период, ВыборкаДокументов.ЗакрытиеЗаказов, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdatePayments"), Неопределено, ВыборкаДокументов.Реализация, ТекущаяДата(), Ложь);
						
					КонецЕсли;	
						
					//ЗаписатьЛог_рэ_ЛогЗапросов(Ответ.Status, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdatePayments"), ВыборкаДокументов.ЗакрытиеЗаказов, ВыборкаДокументов.Реализация , ДанныеXML_Данные, ДанныеXML_Ответ);
					ЗаписатьЛог_рэЛогЗапросов(ВыборкаДокументов.ЗакрытиеЗаказов, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdatePayments"), , ВыборкаДокументов.Реализация, Ответ.Status, ДанныеXML_Данные, ДанныеXML_Ответ);
					
				Исключение
					
					//ЗаписатьЛог_рэ_ЛогЗапросов("Общая ошибка", ПредопределенноеЗначение("Перечисление.рэМетоды.UpdatePayments"), ВыборкаДокументов.ЗакрытиеЗаказов, ВыборкаДокументов.Реализация, , ОписаниеОшибки());
					ЗаписатьЛог_рэЛогЗапросов(ВыборкаДокументов.ЗакрытиеЗаказов, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdatePayments"), , ВыборкаДокументов.Реализация, "Общая ошибка", , ОписаниеОшибки());
					Возврат Ложь;
					
				КонецПопытки;
				
				
			КонецЦикла; 
			
		КонецЦикла;
		
		
	Исключение	
		
		//ЗаписатьЛог_рэ_ЛогЗапросов("Общая ошибка", ПредопределенноеЗначение("Перечисление.рэМетоды.UpdatePayments"), , , , ОписаниеОшибки());
		ЗаписатьЛог_рэЛогЗапросов(,ПредопределенноеЗначение("Перечисление.рэМетоды.UpdatePayments"), , , "Общая ошибка", , ОписаниеОшибки());
		Возврат Ложь;
		
	КонецПопытки;	
	
	Возврат Истина;
	
КонецФункции	

#Область  ПередачаДанныхОСтатусах

Функция REDПередачаДанныхОСтатусах_ПриходНаСклад()
		
	Попытка
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	рэОбъектыДляОбменаСрезПоследних.Период КАК Период,
		               |	рэОбъектыДляОбменаСрезПоследних.Объект КАК Объект,
		               |	рэОбъектыДляОбменаСрезПоследних.Заказ КАК Заказ,
		               |	рэОбъектыДляОбменаСрезПоследних.ДополнительнаяИнформация КАК ДополнительнаяИнформация
		               |ПОМЕСТИТЬ ВТ_рэОбъектыДляОбмена
		               |ИЗ
		               |	РегистрСведений.рэОбъектыДляОбмена.СрезПоследних(, ) КАК рэОбъектыДляОбменаСрезПоследних
		               |ГДЕ
		               |	рэОбъектыДляОбменаСрезПоследних.Метод = &Метод
		               |	И рэОбъектыДляОбменаСрезПоследних.ДанныеОтправлены = ЛОЖЬ
		               |	И рэОбъектыДляОбменаСрезПоследних.Операция = &Операция
		               |	И рэОбъектыДляОбменаСрезПоследних.СчетчикВыгрузок < 20
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Объект,
		               |	Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Контрагенты.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ ВТ_НужныеКонтрагенты
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	Контрагенты.Ссылка = &Ссылка
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	Контрагенты.Ссылка
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	Контрагенты.Родитель.ОсновнойМагазин = &Ссылка
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ШтрихкодыЗаказов.Заказ КАК Заказ,
		               |	МАКСИМУМ(ШтрихкодыЗаказов.НомерМеста) КАК НомерМеста
		               |ПОМЕСТИТЬ ВТ_НомераМест
		               |ИЗ
		               |	ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыЗаказов КАК ШтрихкодыЗаказов
		               |		ПО ВТ_рэОбъектыДляОбмена.Заказ = ШтрихкодыЗаказов.Заказ
		               |ГДЕ
		               |	ШтрихкодыЗаказов.НомерМеста <> 0
		               |	И ШтрихкодыЗаказов.ДокументТСД = ЗНАЧЕНИЕ(Документ.ЗагрузкаСТСД.ПустаяСсылка)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ШтрихкодыЗаказов.Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	МАКСИМУМ(МестонахождениеЗаказа.Период) КАК Период,
		               |	МестонахождениеЗаказа.Заказ КАК Заказ
		               |ПОМЕСТИТЬ ВТ_ПериодыСрезаМестонахождения
		               |ИЗ
		               |	ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеЗаказа КАК МестонахождениеЗаказа
		               |		ПО ВТ_рэОбъектыДляОбмена.Заказ = МестонахождениеЗаказа.Заказ
		               |			И ВТ_рэОбъектыДляОбмена.Период >= МестонахождениеЗаказа.Период
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	МестонахождениеЗаказа.Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	МестонахождениеЗаказа.Заказ КАК Заказ,
		               |	МестонахождениеЗаказа.Терминал КАК Терминал
		               |ПОМЕСТИТЬ ВТ_Местонахождение
		               |ИЗ
		               |	РегистрСведений.МестонахождениеЗаказа КАК МестонахождениеЗаказа
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПериодыСрезаМестонахождения КАК ВТ_ПериодыСрезаМестонахождения
		               |		ПО МестонахождениеЗаказа.Период = ВТ_ПериодыСрезаМестонахождения.Период
		               |			И МестонахождениеЗаказа.Заказ = ВТ_ПериодыСрезаМестонахождения.Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_рэОбъектыДляОбмена.Период КАК Период,
		               |	ВТ_рэОбъектыДляОбмена.Заказ КАК Реализация,
		               |	ЗагрузкаСТСДШтрихкоды.Ссылка КАК ЗагрузкаСТСД,
		               |	ВЫРАЗИТЬ(ЗагрузкаСТСДШтрихкоды.Заказ КАК Документ.РеализацияТоваровУслуг).НомерВнешнегоЗаказа КАК InvoiceId,
		               |	ВЫРАЗИТЬ(ЗагрузкаСТСДШтрихкоды.Заказ КАК Документ.РеализацияТоваровУслуг).ТерминалДоставки КАК ТерминалДоставки,
		               |	ЗагрузкаСТСДШтрихкоды.Ссылка.Дата КАК DateUpdate,
		               |	ЕСТЬNULL(ВТ_НомераМест.НомерМеста, 1) КАК PlaceId,
		               |	ВТ_рэОбъектыДляОбмена.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
		               |	ВЫБОР
		               |		КОГДА ВЫБОР
		               |				КОГДА ВТ_Местонахождение.Терминал ЕСТЬ NULL
		               |						ИЛИ ВТ_Местонахождение.Терминал = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.ПустаяСсылка)
		               |					ТОГДА ВЫРАЗИТЬ(ЗагрузкаСТСДШтрихкоды.Заказ КАК Документ.РеализацияТоваровУслуг).ТерминалДоставки
		               |				ИНАЧЕ ВТ_Местонахождение.Терминал
		               |			КОНЕЦ = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.МоскваСтриж)
		               |			ТОГДА 1
		               |		ИНАЧЕ 2
		               |	КОНЕЦ КАК TerminalIdCurrent,
		               |	""В"" + ПривязкаМашинКРейсамСрезПоследних.Водитель.Код КАК CourierId
		               |ИЗ
		               |	Документ.ЗагрузкаСТСД.Штрихкоды КАК ЗагрузкаСТСДШтрихкоды
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НомераМест КАК ВТ_НомераМест
		               |			ПО ВТ_рэОбъектыДляОбмена.Заказ = ВТ_НомераМест.Заказ
		               |		ПО ЗагрузкаСТСДШтрихкоды.Ссылка = ВТ_рэОбъектыДляОбмена.Объект
		               |			И ЗагрузкаСТСДШтрихкоды.Заказ = ВТ_рэОбъектыДляОбмена.Заказ
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НужныеКонтрагенты КАК ВТ_НужныеКонтрагенты
		               |		ПО (ВЫРАЗИТЬ(ЗагрузкаСТСДШтрихкоды.Заказ КАК Документ.РеализацияТоваровУслуг).ВладелецТовара = ВТ_НужныеКонтрагенты.Ссылка)
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Рейс.Заказы КАК РейсЗаказы
		               |		ПО ЗагрузкаСТСДШтрихкоды.Заказ = РейсЗаказы.Заказ
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Местонахождение КАК ВТ_Местонахождение
		               |		ПО ЗагрузкаСТСДШтрихкоды.Заказ = ВТ_Местонахождение.Заказ
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних КАК ПривязкаМашинКРейсамСрезПоследних
		               |		ПО (РейсЗаказы.Ссылка = ПривязкаМашинКРейсамСрезПоследних.Рейс)
		               |ИТОГИ
		               |	МАКСИМУМ(Период),
		               |	МАКСИМУМ(InvoiceId)
		               |ПО
		               |	ЗагрузкаСТСД";
		
		Запрос.УстановитьПараметр("Ссылка", ПараметрыСеанса.рэКомпанияRED);
		Запрос.УстановитьПараметр("Метод",  ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"));
		Запрос.УстановитьПараметр("Операция",  ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ПриходНаСклад"));

		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			Возврат Истина;
		КонецЕсли;	
		
		ПутиПодключенения = рэИнтеграцияРэдЭкспресс.ПолучитьПодключениеКСервисуRED();
		
		WSОпр = Новый WSОпределения(ПутиПодключенения.WS_Путь, ПутиПодключенения.Пользователь, ПутиПодключенения.Пароль);	
		Прокси = Новый WSПрокси(WSОпр, "http://www.redexpress.ru/", "SyncService" , "SyncServiceSoap");

		Прокси.Пользователь = ПутиПодключенения.Пользователь;
		Прокси.Пароль = ПутиПодключенения.Пароль;
		
		InvoiceStatusТип = Прокси.ФабрикаXDTO.Тип("http://www.redexpress.ru/", "InvoiceStatus");
				
		InvoicePlaceStatusТип = Прокси.ФабрикаXDTO.Тип("http://www.redexpress.ru/", "InvoicePlaceStatus");
		
		ArrayOfInvoicePlaceStatusТип = Прокси.ФабрикаXDTO.Тип("http://www.redexpress.ru/", "ArrayOfInvoicePlaceStatus");


		ВыборкаЗагрузкаСТСД = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаЗагрузкаСТСД.Следующий() Цикл 
			
			ВыборкаДокументов = ВыборкаЗагрузкаСТСД.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаДокументов.Следующий() Цикл
				
				Попытка
					
					InvoiceStatusбъект = Прокси.ФабрикаXDTO.Создать(InvoiceStatusТип);
					InvoiceStatusбъект.InvoiceId = ОбработатьВнешнийНомерДляРед(ВыборкаДокументов.InvoiceId);
					InvoiceStatusбъект.TerminalIdFrom = 0;
					InvoiceStatusбъект.TerminalIdTo = ?(ВыборкаДокументов.ТерминалДоставки = Справочники.РегиональныеТерминалы.МоскваСтриж, 1,2);
					InvoiceStatusбъект.TerminalIdCurrent = ВыборкаДокументов.TerminalIdCurrent;
					
					//InvoiceStatusбъект.DateUpdate = ВыборкаДокументов.DateUpdate;
					//ДатаПроведенияДока = Вычислить("'" + ВыборкаДокументов.ДополнительнаяИнформация + "'");
					ДатаПроведенияДока = ВыборкаДокументов.Период;
					InvoiceStatusбъект.DateUpdate = ДатаПроведенияДока;					
					
					//InvoiceStatusбъект.CourierId = ВыборкаДокументов.CourierId;
					
					ArrayOfInvoicePlaceStatusОбъект = Прокси.ФабрикаXDTO.Создать(ArrayOfInvoicePlaceStatusТип);

					
					InvoicePlaceStatusesОбъект = Прокси.ФабрикаXDTO.Создать(InvoicePlaceStatusТип);
					InvoicePlaceStatusesОбъект.PlaceId   = ВыборкаДокументов.PlaceId;
					InvoicePlaceStatusesОбъект.Status = "211";
					
					ArrayOfInvoicePlaceStatusОбъект.InvoicePlaceStatus.Добавить(InvoicePlaceStatusesОбъект);
			
					InvoiceStatusбъект.InvoicePlaceStatuses =  ArrayOfInvoicePlaceStatusОбъект;
					
					ЗаписьXML = Новый ЗаписьXML;
					ЗаписьXML.УстановитьСтроку();
					Прокси.ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, InvoiceStatusбъект);
					ДанныеXML_Данные = ЗаписьXML.Закрыть();	
					
					Ответ = Прокси.UpdateInvoiceStatus(InvoiceStatusбъект);
					
					ЗаписьXML = Новый ЗаписьXML;
					ЗаписьXML.УстановитьСтроку();
					Прокси.ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, Ответ);
					ДанныеXML_Ответ = ЗаписьXML.Закрыть();
					
					Если Ответ.Status = 200 Или Ответ.Status ="Success" Тогда
					
						ОбновитьрэОбъектыДляОбмена(ВыборкаДокументов.Период, ВыборкаДокументов.ЗагрузкаСТСД, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"),ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ПриходНаСклад"), ВыборкаДокументов.Реализация, ТекущаяДата(), Истина, Справочники.СтатусыЗаказов.ТоварНаСкладе);
						
					Иначе 
						
						ОбновитьрэОбъектыДляОбмена(ВыборкаДокументов.Период, ВыборкаДокументов.ЗагрузкаСТСД, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"),ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ПриходНаСклад"), ВыборкаДокументов.Реализация, ТекущаяДата(), Ложь, Справочники.СтатусыЗаказов.ТоварНаСкладе);
						
					КонецЕсли;	
					
					//ЗаписатьЛог_рэ_ЛогЗапросов(Ответ.Status, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"), ВыборкаДокументов.ЗагрузкаСТСД, ВыборкаДокументов.Реализация , ДанныеXML_Данные, ДанныеXML_Ответ);
					ЗаписатьЛог_рэЛогЗапросов(ВыборкаДокументов.ЗагрузкаСТСД, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"), ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ПриходНаСклад"), ВыборкаДокументов.Реализация, Ответ.Status, ДанныеXML_Данные, ДанныеXML_Ответ);
					
				Исключение
					
					//ЗаписатьЛог_рэ_ЛогЗапросов("Общая ошибка", ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"), ВыборкаДокументов.ЗагрузкаСТСД, ВыборкаДокументов.Реализация , , ОписаниеОшибки());
					ЗаписатьЛог_рэЛогЗапросов(ВыборкаДокументов.ЗагрузкаСТСД, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"), ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ПриходНаСклад"), ВыборкаДокументов.Реализация, "Общая ошибка", , ОписаниеОшибки());
					Возврат Ложь;
					
				КонецПопытки;
				
				
			КонецЦикла; 
		КонецЦикла; 

		
	Исключение	
		
		//ЗаписатьЛог_рэ_ЛогЗапросов("Общая ошибка", ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"), , , , ОписаниеОшибки());
		ЗаписатьЛог_рэЛогЗапросов(,ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"), ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ПриходНаСклад"), , "Общая ошибка", , ОписаниеОшибки());
		Возврат Ложь;
		
	КонецПопытки;		
	
	Возврат Истина; 

	
	
КонецФункции	

Функция REDПередачаДанныхОСтатусах_ОтсортированНаМаршрут_РегистрацияДляОтправки(Заказы, Заборы) Экспорт 
	
	Если Не ЗначениеЗаполнено(ПараметрыСеанса.рэКомпанияRED) Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	//Заказы - Массив ссылок на БизнесПроцесс.новаРейсМестнойДоставки
	//Заборы - ссылки на заборы
		
	Попытка
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Контрагенты.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ ВТ_НужныеКонтрагенты
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	Контрагенты.Ссылка = &Ссылка
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	Контрагенты.Ссылка
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	Контрагенты.Родитель.ОсновнойМагазин = &Ссылка
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ДокументРейс.Ссылка КАК Объект,
		               |	РеализацияТоваровУслуг.Ссылка КАК Заказ,
		               |	ДокументРейс.Дата КАК Дата
		               |ПОМЕСТИТЬ ВТ_Реализации
		               |ИЗ
		               |	РегистрСведений.новаЗаданияРейсов КАК новаЗаданияРейсов
		               |		ПОЛНОЕ СОЕДИНЕНИЕ БизнесПроцесс.новаРейсМестнойДоставки КАК новаРейсМестнойДоставки
		               |			ЛЕВОЕ СОЕДИНЕНИЕ Задача.новаЗадачаРейсаМестнойДоставки КАК ЗадачаРейса
		               |			ПО новаРейсМестнойДоставки.Ссылка = ЗадачаРейса.БизнесПроцесс
		               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Рейс КАК ДокументРейс
		               |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних КАК ПривязкаМашинКРейсамСрезПоследних
		               |				ПО ДокументРейс.Ссылка = ПривязкаМашинКРейсамСрезПоследних.Рейс
		               |			ПО новаРейсМестнойДоставки.Ссылка = ДокументРейс.РейсМестнойДоставки
		               |		ПО новаЗаданияРейсов.Рейс = новаРейсМестнойДоставки.Ссылка
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НужныеКонтрагенты КАК ВТ_НужныеКонтрагенты
		               |			ПО РеализацияТоваровУслуг.ВладелецТовара = ВТ_НужныеКонтрагенты.Ссылка
		               |		ПО новаЗаданияРейсов.Доставка.Номер = РеализацияТоваровУслуг.Номер
		               |ГДЕ
		               |	новаРейсМестнойДоставки.Ссылка В(&Заказы)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ДокументРейс.Ссылка,
		               |	РеализацияТоваровУслуг.Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	РейсЗаказы.Ссылка КАК Объект,
		               |	ЗаборТовара.Ссылка КАК Заказ,
		               |	РейсЗаказы.Ссылка.Дата КАК Дата
		               |ПОМЕСТИТЬ ВТ_Заборы
		               |ИЗ
		               |	Документ.ЗаборТовара КАК ЗаборТовара
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Рейс.Заказы КАК РейсЗаказы
		               |		ПО (РейсЗаказы.Заказ = ЗаборТовара.Ссылка)
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НужныеКонтрагенты КАК ВТ_НужныеКонтрагенты
		               |		ПО ЗаборТовара.Контрагент = ВТ_НужныеКонтрагенты.Ссылка
		               |ГДЕ
		               |	ЗаборТовара.Ссылка В(&Заборы)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РейсЗаказы.Ссылка,
		               |	ЗаборТовара.Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_Реализации.Объект КАК Объект,
		               |	ВТ_Реализации.Заказ КАК Заказ,
		               |	ВТ_Реализации.Дата КАК Дата
		               |ПОМЕСТИТЬ ВТ_Общее
		               |ИЗ
		               |	ВТ_Реализации КАК ВТ_Реализации
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ВТ_Заборы.Объект,
		               |	ВТ_Заборы.Заказ,
		               |	ВТ_Заборы.Дата
		               |ИЗ
		               |	ВТ_Заборы КАК ВТ_Заборы
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_Общее.Заказ КАК Заказ,
		               |	МАКСИМУМ(ВТ_Общее.Дата) КАК Дата
		               |ПОМЕСТИТЬ ВТ_Срез
		               |ИЗ
		               |	ВТ_Общее КАК ВТ_Общее
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВТ_Общее.Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_Общее.Объект КАК Объект,
		               |	ВТ_Общее.Заказ КАК Заказ
		               |ИЗ
		               |	ВТ_Общее КАК ВТ_Общее
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Срез КАК ВТ_Срез
		               |		ПО ВТ_Общее.Заказ = ВТ_Срез.Заказ
		               |			И ВТ_Общее.Дата = ВТ_Срез.Дата";
		
		Запрос.УстановитьПараметр("Ссылка", ПараметрыСеанса.рэКомпанияRED);
		Запрос.УстановитьПараметр("Заказы", Заказы);
		Запрос.УстановитьПараметр("Заборы", Заборы);

		
		Результат = Запрос.Выполнить();
		
		Если Результат.Пустой() Тогда
			Возврат Истина;
		КонецЕсли;
		
		

		Результат = Запрос.Выполнить();
		
		Если Результат.Пустой() Тогда
			Возврат Истина;
		КонецЕсли;
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			МенеджерЗаписи = РегистрыСведений.рэОбъектыДляОбмена.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период = ТекущаяДата();
			МенеджерЗаписи.Объект = Выборка.Объект;
			МенеджерЗаписи.Метод = Перечисления.рэМетоды.UpdateInvoiceStatus;
			МенеджерЗаписи.Операция = Перечисления.реОперацииПередачиСтатусов.ОтсортированНаМаршрут;
			МенеджерЗаписи.Заказ  = Выборка.Заказ;
			МенеджерЗаписи.ДополнительнаяИнформация = ЗагрузкаИзИнтернетМагазина.ДатаВСтроку(ТекущаяДата());
			МенеджерЗаписи.Записать();
			
		КонецЦикла;
		
	Исключение	
		
		Сообщить("Ошибка регистрации объекта для обмена в подсистеме Red: " + ОписаниеОшибки());
		Возврат Ложь;
		
	КонецПопытки;		
	
	Возврат Истина; 

	
	
КонецФункции	

Функция REDПередачаДанныхОСтатусах_ОтсортированНаМаршрут() Экспорт 
	
	//Заказы - Массив ссылок на БизнесПроцесс.новаРейсМестнойДоставки
	//Заборы - ссылки на заборы
		
	Попытка
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	рэОбъектыДляОбменаСрезПоследних.Период КАК Период,
		               |	рэОбъектыДляОбменаСрезПоследних.Объект КАК Объект,
		               |	рэОбъектыДляОбменаСрезПоследних.Заказ КАК Заказ,
		               |	рэОбъектыДляОбменаСрезПоследних.Период КАК Период1,
		               |	рэОбъектыДляОбменаСрезПоследних.ДополнительнаяИнформация КАК ДополнительнаяИнформация
		               |ПОМЕСТИТЬ ВТ_рэОбъектыДляОбмена
		               |ИЗ
		               |	РегистрСведений.рэОбъектыДляОбмена.СрезПоследних(, ) КАК рэОбъектыДляОбменаСрезПоследних
		               |ГДЕ
		               |	рэОбъектыДляОбменаСрезПоследних.ДанныеОтправлены = ЛОЖЬ
		               |	И рэОбъектыДляОбменаСрезПоследних.Метод = &Метод
		               |	И рэОбъектыДляОбменаСрезПоследних.Операция = &Операция
		               |	И рэОбъектыДляОбменаСрезПоследних.СчетчикВыгрузок < 20
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ШтрихкодыЗаказов.Заказ КАК Заказ,
		               |	МАКСИМУМ(ШтрихкодыЗаказов.НомерМеста) КАК НомерМеста
		               |ПОМЕСТИТЬ ВТ_НомераМест
		               |ИЗ
		               |	ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыЗаказов КАК ШтрихкодыЗаказов
		               |		ПО ВТ_рэОбъектыДляОбмена.Заказ = ШтрихкодыЗаказов.Заказ
		               |ГДЕ
		               |	ШтрихкодыЗаказов.НомерМеста <> 0
		               |	И ШтрихкодыЗаказов.ДокументТСД = ЗНАЧЕНИЕ(Документ.ЗагрузкаСТСД.ПустаяСсылка)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ШтрихкодыЗаказов.Заказ
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	МАКСИМУМ(МестонахождениеЗаказа.Период) КАК Период,
		               |	МестонахождениеЗаказа.Заказ КАК Заказ
		               |ПОМЕСТИТЬ ВТ_ПериодыСрезаМестонахождения
		               |ИЗ
		               |	ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеЗаказа КАК МестонахождениеЗаказа
		               |		ПО ВТ_рэОбъектыДляОбмена.Заказ = МестонахождениеЗаказа.Заказ
		               |			И ВТ_рэОбъектыДляОбмена.Период >= МестонахождениеЗаказа.Период
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	МестонахождениеЗаказа.Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	МестонахождениеЗаказа.Заказ КАК Заказ,
		               |	МестонахождениеЗаказа.Терминал КАК Терминал
		               |ПОМЕСТИТЬ ВТ_Местонахождение
		               |ИЗ
		               |	РегистрСведений.МестонахождениеЗаказа КАК МестонахождениеЗаказа
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПериодыСрезаМестонахождения КАК ВТ_ПериодыСрезаМестонахождения
		               |		ПО МестонахождениеЗаказа.Период = ВТ_ПериодыСрезаМестонахождения.Период
		               |			И МестонахождениеЗаказа.Заказ = ВТ_ПериодыСрезаМестонахождения.Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Контрагенты.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ ВТ_НужныеКонтрагенты
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	Контрагенты.Ссылка = &Ссылка
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	Контрагенты.Ссылка
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	Контрагенты.Родитель.ОсновнойМагазин = &Ссылка
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа КАК InvoiceId,
		               |	""В"" + ПривязкаМашинКРейсамСрезПоследних.Водитель.Код КАК CourierId,
		               |	ДокументРейс.Номер КАК RouteId,
		               |	ДокументРейс.Ссылка КАК Объект,
		               |	ВЫБОР
		               |		КОГДА ВЫБОР
		               |				КОГДА ВТ_Местонахождение.Терминал ЕСТЬ NULL
		               |						ИЛИ ВТ_Местонахождение.Терминал = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.ПустаяСсылка)
		               |					ТОГДА РеализацияТоваровУслуг.ТерминалДоставки
		               |				ИНАЧЕ ВТ_Местонахождение.Терминал
		               |			КОНЕЦ = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.МоскваСтриж)
		               |			ТОГДА 1
		               |		ИНАЧЕ 2
		               |	КОНЕЦ КАК TerminalIdCurrent,
		               |	РеализацияТоваровУслуг.Ссылка КАК Заказ,
		               |	ДокументРейс.Дата КАК DateUpdate,
		               |	ВТ_рэОбъектыДляОбмена.Период КАК Период,
		               |	ВТ_НомераМест.НомерМеста КАК НомерМеста,
		               |	ЕСТЬNULL(ВТ_НомераМест.НомерМеста, 1) КАК PlaceId,
		               |	ВТ_рэОбъектыДляОбмена.ДополнительнаяИнформация КАК ДополнительнаяИнформация
		               |ПОМЕСТИТЬ ВТ_Реализации
		               |ИЗ
		               |	РегистрСведений.новаЗаданияРейсов КАК новаЗаданияРейсов
		               |		ПОЛНОЕ СОЕДИНЕНИЕ БизнесПроцесс.новаРейсМестнойДоставки КАК новаРейсМестнойДоставки
		               |			ЛЕВОЕ СОЕДИНЕНИЕ Задача.новаЗадачаРейсаМестнойДоставки КАК ЗадачаРейса
		               |			ПО новаРейсМестнойДоставки.Ссылка = ЗадачаРейса.БизнесПроцесс
		               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Рейс КАК ДокументРейс
		               |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних КАК ПривязкаМашинКРейсамСрезПоследних
		               |				ПО ДокументРейс.Ссылка = ПривязкаМашинКРейсамСрезПоследних.Рейс
		               |			ПО новаРейсМестнойДоставки.Ссылка = ДокументРейс.РейсМестнойДоставки
		               |		ПО новаЗаданияРейсов.Рейс = новаРейсМестнойДоставки.Ссылка
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НужныеКонтрагенты КАК ВТ_НужныеКонтрагенты
		               |			ПО РеализацияТоваровУслуг.ВладелецТовара = ВТ_НужныеКонтрагенты.Ссылка
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |				ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НомераМест КАК ВТ_НомераМест
		               |				ПО ВТ_рэОбъектыДляОбмена.Заказ = ВТ_НомераМест.Заказ
		               |			ПО РеализацияТоваровУслуг.Ссылка = ВТ_рэОбъектыДляОбмена.Заказ
		               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Местонахождение КАК ВТ_Местонахождение
		               |			ПО РеализацияТоваровУслуг.Ссылка = ВТ_Местонахождение.Заказ
		               |		ПО новаЗаданияРейсов.Доставка.Номер = РеализацияТоваровУслуг.Номер
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа,
		               |	ДокументРейс.Номер,
		               |	ДокументРейс.Ссылка,
		               |	РеализацияТоваровУслуг.Ссылка,
		               |	ДокументРейс.Дата,
		               |	""В"" + ПривязкаМашинКРейсамСрезПоследних.Водитель.Код,
		               |	ВТ_рэОбъектыДляОбмена.Период,
		               |	ВТ_НомераМест.НомерМеста,
		               |	ВТ_рэОбъектыДляОбмена.ДополнительнаяИнформация,
		               |	ВЫБОР
		               |		КОГДА ВЫБОР
		               |				КОГДА ВТ_Местонахождение.Терминал ЕСТЬ NULL
		               |						ИЛИ ВТ_Местонахождение.Терминал = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.ПустаяСсылка)
		               |					ТОГДА РеализацияТоваровУслуг.ТерминалДоставки
		               |				ИНАЧЕ ВТ_Местонахождение.Терминал
		               |			КОНЕЦ = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.МоскваСтриж)
		               |			ТОГДА 1
		               |		ИНАЧЕ 2
		               |	КОНЕЦ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЗаборТовара.НомерВнешнегоЗаказа КАК InvoiceId,
		               |	""В"" + ЗаборТовара.Водитель.Код КАК CourierId,
		               |	РейсЗаказы.Ссылка.Номер КАК RouteId,
		               |	РейсЗаказы.Ссылка.Дата КАК DateUpdate,
		               |	ВЫБОР
		               |		КОГДА ЗаборТовара.ТерминалПриемки = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.МоскваСтриж)
		               |			ТОГДА 1
		               |		ИНАЧЕ 2
		               |	КОНЕЦ КАК TerminalIdCurrent,
		               |	РейсЗаказы.Ссылка КАК Объект,
		               |	ЗаборТовара.Ссылка КАК Заказ,
		               |	ВТ_рэОбъектыДляОбмена.Период КАК Период,
		               |	1 КАК PlaceId,
		               |	ВТ_рэОбъектыДляОбмена.ДополнительнаяИнформация КАК ДополнительнаяИнформация
		               |ПОМЕСТИТЬ ВТ_Заборы
		               |ИЗ
		               |	ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаборТовара КАК ЗаборТовара
		               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Рейс.Заказы КАК РейсЗаказы
		               |			ПО (РейсЗаказы.Заказ = ЗаборТовара.Ссылка)
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НужныеКонтрагенты КАК ВТ_НужныеКонтрагенты
		               |			ПО ЗаборТовара.Контрагент = ВТ_НужныеКонтрагенты.Ссылка
		               |		ПО ВТ_рэОбъектыДляОбмена.Заказ = ЗаборТовара.Ссылка
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РейсЗаказы.Ссылка,
		               |	ЗаборТовара.Ссылка,
		               |	ЗаборТовара.НомерВнешнегоЗаказа,
		               |	""В"" + ЗаборТовара.Водитель.Код,
		               |	РейсЗаказы.Ссылка.Номер,
		               |	РейсЗаказы.Ссылка.Дата,
		               |	ВЫБОР
		               |		КОГДА ЗаборТовара.ТерминалПриемки = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.МоскваСтриж)
		               |			ТОГДА 1
		               |		ИНАЧЕ 2
		               |	КОНЕЦ,
		               |	ВТ_рэОбъектыДляОбмена.Период,
		               |	ВТ_рэОбъектыДляОбмена.ДополнительнаяИнформация
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_Реализации.InvoiceId КАК InvoiceId,
		               |	ВТ_Реализации.CourierId КАК CourierId,
		               |	ВТ_Реализации.RouteId КАК RouteId,
		               |	ВТ_Реализации.Объект КАК Объект,
		               |	ВТ_Реализации.TerminalIdCurrent КАК TerminalIdCurrent,
		               |	ВТ_Реализации.Заказ КАК Заказ,
		               |	ВТ_Реализации.DateUpdate КАК DateUpdate,
		               |	ВТ_Реализации.Период КАК Период,
		               |	ВТ_Реализации.PlaceId КАК PlaceId,
		               |	ВТ_Реализации.ДополнительнаяИнформация КАК ДополнительнаяИнформация
		               |ИЗ
		               |	ВТ_Реализации КАК ВТ_Реализации
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ВТ_Заборы.InvoiceId,
		               |	ВТ_Заборы.CourierId,
		               |	ВТ_Заборы.RouteId,
		               |	ВТ_Заборы.Объект,
		               |	ВТ_Заборы.TerminalIdCurrent,
		               |	ВТ_Заборы.Заказ,
		               |	ВТ_Заборы.DateUpdate,
		               |	ВТ_Заборы.Период,
		               |	ВТ_Заборы.PlaceId,
		               |	ВТ_Заборы.ДополнительнаяИнформация
		               |ИЗ
		               |	ВТ_Заборы КАК ВТ_Заборы";
		
		Запрос.УстановитьПараметр("Ссылка", ПараметрыСеанса.рэКомпанияRED);
		Запрос.УстановитьПараметр("Метод", Перечисления.рэМетоды.UpdateInvoiceStatus);
		Запрос.УстановитьПараметр("Операция", Перечисления.реОперацииПередачиСтатусов.ОтсортированНаМаршрут);
		

		
		Результат = Запрос.Выполнить();
		
		Если Результат.Пустой() Тогда
			Возврат Истина;
		КонецЕсли;
		
		
		ПутиПодключенения = рэИнтеграцияРэдЭкспресс.ПолучитьПодключениеКСервисуRED();
		
		WSОпр = Новый WSОпределения(ПутиПодключенения.WS_Путь, ПутиПодключенения.Пользователь, ПутиПодключенения.Пароль);	
		Прокси = Новый WSПрокси(WSОпр, "http://www.redexpress.ru/", "SyncService" , "SyncServiceSoap");

		Прокси.Пользователь = ПутиПодключенения.Пользователь;
		Прокси.Пароль = ПутиПодключенения.Пароль;
		
		InvoiceStatusТип = Прокси.ФабрикаXDTO.Тип("http://www.redexpress.ru/", "InvoiceStatus");
				
		InvoicePlaceStatusТип = Прокси.ФабрикаXDTO.Тип("http://www.redexpress.ru/", "InvoicePlaceStatus");
		
		ArrayOfInvoicePlaceStatusТип = Прокси.ФабрикаXDTO.Тип("http://www.redexpress.ru/", "ArrayOfInvoicePlaceStatus");


		ВыборкаДокументов = Запрос.Выполнить().Выбрать();
		
			
		Пока ВыборкаДокументов.Следующий() Цикл
			
			Попытка
				
				InvoiceStatusбъект = Прокси.ФабрикаXDTO.Создать(InvoiceStatusТип);
				InvoiceStatusбъект.InvoiceId = ОбработатьВнешнийНомерДляРед(ВыборкаДокументов.InvoiceId);
				InvoiceStatusбъект.TerminalIdFrom = 0;
				//InvoiceStatusбъект.TerminalIdTo = ?(ВыборкаДокументов.ТерминалДоставки = Справочники.РегиональныеТерминалы.МоскваСтриж, 1,2);
				InvoiceStatusбъект.TerminalIdCurrent = ВыборкаДокументов.TerminalIdCurrent;
				
				//InvoiceStatusбъект.DateUpdate = ВыборкаДокументов.DateUpdate;
				//ДатаПроведенияДока = Вычислить("'" + ВыборкаДокументов.ДополнительнаяИнформация + "'");
				InvoiceStatusбъект.DateUpdate = ВыборкаДокументов.Период;
				
				InvoiceStatusбъект.CourierId = ВыборкаДокументов.CourierId;
				InvoiceStatusбъект.RouteId = ВыборкаДокументов.RouteId;
				
				
				ArrayOfInvoicePlaceStatusОбъект = Прокси.ФабрикаXDTO.Создать(ArrayOfInvoicePlaceStatusТип);
				
				
				InvoicePlaceStatusesОбъект = Прокси.ФабрикаXDTO.Создать(InvoicePlaceStatusТип);
				InvoicePlaceStatusesОбъект.PlaceId   = ВыборкаДокументов.PlaceId;
				InvoicePlaceStatusesОбъект.Status = "1001";
				
				ArrayOfInvoicePlaceStatusОбъект.InvoicePlaceStatus.Добавить(InvoicePlaceStatusesОбъект);
				
				InvoiceStatusбъект.InvoicePlaceStatuses =  ArrayOfInvoicePlaceStatusОбъект;
				
				ЗаписьXML = Новый ЗаписьXML;
				ЗаписьXML.УстановитьСтроку();
				Прокси.ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, InvoiceStatusбъект);
				ДанныеXML_Данные = ЗаписьXML.Закрыть();	
				
				Ответ = Прокси.UpdateInvoiceStatus(InvoiceStatusбъект);
				
				ЗаписьXML = Новый ЗаписьXML;
				ЗаписьXML.УстановитьСтроку();
				Прокси.ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, Ответ);
				ДанныеXML_Ответ = ЗаписьXML.Закрыть();
				
				Если Ответ.Status = 200 Или Ответ.Status ="Success" Тогда 
				
					ОбновитьрэОбъектыДляОбмена(ВыборкаДокументов.Период, ВыборкаДокументов.Объект, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"),ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ОтсортированНаМаршрут"), ВыборкаДокументов.Заказ, ТекущаяДата(), Истина, Справочники.СтатусыЗаказов.ЗаказМаршрутизирован);
					
				Иначе 
					
					ОбновитьрэОбъектыДляОбмена(ВыборкаДокументов.Период, ВыборкаДокументов.Объект, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"),ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ОтсортированНаМаршрут"), ВыборкаДокументов.Заказ, ТекущаяДата(), Ложь, Справочники.СтатусыЗаказов.ЗаказМаршрутизирован);
					
				КонецЕсли;	
				
				//ЗаписатьЛог_рэ_ЛогЗапросов(Ответ.Status, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"), ВыборкаДокументов.Объект, ВыборкаДокументов.Заказ , ДанныеXML_Данные, ДанныеXML_Ответ);
				ЗаписатьЛог_рэЛогЗапросов(ВыборкаДокументов.Объект, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"),ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ОтсортированНаМаршрут") , ВыборкаДокументов.Заказ, Ответ.Status, ДанныеXML_Данные, ДанныеXML_Ответ);
				
			Исключение
				
				//ЗаписатьЛог_рэ_ЛогЗапросов(, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"), ВыборкаДокументов.Объект , ВыборкаДокументов.Заказ, , ОписаниеОшибки());
				ЗаписатьЛог_рэЛогЗапросов(ВыборкаДокументов.Объект, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"), ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ОтсортированНаМаршрут"), ВыборкаДокументов.Заказ, "Общая ошибка", , ОписаниеОшибки());
				
				Возврат Ложь;
				
			КонецПопытки;
			
			
		КонецЦикла; 
		
	Исключение	
		
		//ЗаписатьЛог_рэ_ЛогЗапросов("Общая ошибка", ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"), , , , ОписаниеОшибки());
		ЗаписатьЛог_рэЛогЗапросов(,ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"),ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ОтсортированНаМаршрут") , , "Общая ошибка", , ОписаниеОшибки());
		Возврат Ложь;
		
	КонецПопытки;		
	
	Возврат Истина; 

	
	
КонецФункции	

Функция REDПередачаДанныхОСтатусах_ЗаказОтгруженКурьеру() Экспорт
		
	Попытка
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	рэОбъектыДляОбменаСрезПоследних.Период КАК Период,
		               |	рэОбъектыДляОбменаСрезПоследних.Объект КАК Объект,
		               |	рэОбъектыДляОбменаСрезПоследних.Заказ КАК Заказ,
		               |	рэОбъектыДляОбменаСрезПоследних.ДополнительнаяИнформация КАК ДополнительнаяИнформация
		               |ПОМЕСТИТЬ ВТ_рэОбъектыДляОбмена
		               |ИЗ
		               |	РегистрСведений.рэОбъектыДляОбмена.СрезПоследних(, ) КАК рэОбъектыДляОбменаСрезПоследних
		               |ГДЕ
		               |	рэОбъектыДляОбменаСрезПоследних.Метод = &Метод
		               |	И рэОбъектыДляОбменаСрезПоследних.ДанныеОтправлены = ЛОЖЬ
		               |	И рэОбъектыДляОбменаСрезПоследних.Операция = &Операция
   		               |	И рэОбъектыДляОбменаСрезПоследних.СчетчикВыгрузок < 20
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Объект,
		               |	Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	МАКСИМУМ(МестонахождениеЗаказа.Период) КАК Период,
		               |	МестонахождениеЗаказа.Заказ КАК Заказ
		               |ПОМЕСТИТЬ ВТ_ПериодыСрезаМестонахождения
		               |ИЗ
		               |	ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеЗаказа КАК МестонахождениеЗаказа
		               |		ПО ВТ_рэОбъектыДляОбмена.Заказ = МестонахождениеЗаказа.Заказ
		               |			И ВТ_рэОбъектыДляОбмена.Период >= МестонахождениеЗаказа.Период
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	МестонахождениеЗаказа.Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	МестонахождениеЗаказа.Заказ КАК Заказ,
		               |	МестонахождениеЗаказа.Терминал КАК Терминал
		               |ПОМЕСТИТЬ ВТ_Местонахождение
		               |ИЗ
		               |	РегистрСведений.МестонахождениеЗаказа КАК МестонахождениеЗаказа
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПериодыСрезаМестонахождения КАК ВТ_ПериодыСрезаМестонахождения
		               |		ПО МестонахождениеЗаказа.Период = ВТ_ПериодыСрезаМестонахождения.Период
		               |			И МестонахождениеЗаказа.Заказ = ВТ_ПериодыСрезаМестонахождения.Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ШтрихкодыЗаказов.Заказ КАК Заказ,
		               |	МАКСИМУМ(ШтрихкодыЗаказов.НомерМеста) КАК НомерМеста
		               |ПОМЕСТИТЬ ВТ_НомераМест
		               |ИЗ
		               |	ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыЗаказов КАК ШтрихкодыЗаказов
		               |		ПО ВТ_рэОбъектыДляОбмена.Заказ = ШтрихкодыЗаказов.Заказ
		               |ГДЕ
		               |	ШтрихкодыЗаказов.НомерМеста <> 0
		               |	И ШтрихкодыЗаказов.ДокументТСД = ЗНАЧЕНИЕ(Документ.ЗагрузкаСТСД.ПустаяСсылка)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ШтрихкодыЗаказов.Заказ
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Контрагенты.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ ВТ_НужныеКонтрагенты
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	Контрагенты.Ссылка = &Ссылка
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	Контрагенты.Ссылка
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	Контрагенты.Родитель.ОсновнойМагазин = &Ссылка
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_рэОбъектыДляОбмена.Период КАК Период,
		               |	ВТ_рэОбъектыДляОбмена.Заказ КАК Заказ,
		               |	ПогрузкаВАвтоЗаказы.Ссылка КАК Объект,
		               |	ПогрузкаВАвтоЗаказы.Заказ.НомерВнешнегоЗаказа КАК InvoiceId,
		               |	""В"" + ПривязкаМашинКРейсамСрезПоследних.Водитель.Код КАК CourierId,
		               |	ПогрузкаВАвтоЗаказы.Ссылка.Рейс.Номер КАК RouteId,
		               |	ПогрузкаВАвтоЗаказы.Ссылка.Рейс.Дата КАК DateWork,
		               |	ВЫБОР
		               |		КОГДА ВЫБОР
		               |				КОГДА ВТ_Местонахождение.Терминал ЕСТЬ NULL
		               |						ИЛИ ВТ_Местонахождение.Терминал = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.ПустаяСсылка)
		               |					ТОГДА ВЫРАЗИТЬ(ПогрузкаВАвтоЗаказы.Заказ КАК Документ.РеализацияТоваровУслуг).ТерминалДоставки
		               |				ИНАЧЕ ВТ_Местонахождение.Терминал
		               |			КОНЕЦ = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.МоскваСтриж)
		               |			ТОГДА 1
		               |		ИНАЧЕ 2
		               |	КОНЕЦ КАК TerminalIdCurrent,
		               |	ЕСТЬNULL(ВТ_НомераМест.НомерМеста, 1) КАК PlaceId,
		               |	ВТ_рэОбъектыДляОбмена.ДополнительнаяИнформация КАК ДополнительнаяИнформация
		               |ИЗ
		               |	Документ.ПогрузкаВАвто.Заказы КАК ПогрузкаВАвтоЗаказы
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |		ПО ПогрузкаВАвтоЗаказы.Ссылка = ВТ_рэОбъектыДляОбмена.Объект
		               |			И ПогрузкаВАвтоЗаказы.Заказ = ВТ_рэОбъектыДляОбмена.Заказ
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НужныеКонтрагенты КАК ВТ_НужныеКонтрагенты
		               |		ПО (ВЫРАЗИТЬ(ПогрузкаВАвтоЗаказы.Заказ КАК Документ.РеализацияТоваровУслуг).ВладелецТовара = ВТ_НужныеКонтрагенты.Ссылка)
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних КАК ПривязкаМашинКРейсамСрезПоследних
		               |		ПО ПогрузкаВАвтоЗаказы.Ссылка.Рейс = ПривязкаМашинКРейсамСрезПоследних.Рейс
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НомераМест КАК ВТ_НомераМест
		               |		ПО ПогрузкаВАвтоЗаказы.Заказ = ВТ_НомераМест.Заказ
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Местонахождение КАК ВТ_Местонахождение
		               |		ПО ПогрузкаВАвтоЗаказы.Заказ = ВТ_Местонахождение.Заказ
		               |ИТОГИ
		               |	МАКСИМУМ(Период),
		               |	МАКСИМУМ(InvoiceId)
		               |ПО
		               |	Объект";
		
		Запрос.УстановитьПараметр("Ссылка", ПараметрыСеанса.рэКомпанияRED);
		Запрос.УстановитьПараметр("Метод",  ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"));
		Запрос.УстановитьПараметр("Операция",  ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ЗаказОтгруженКурьеру"));

		Результат = Запрос.Выполнить();
		
		Если Результат.Пустой() Тогда
			Возврат Истина;
		КонецЕсли;
		
		ПутиПодключенения = рэИнтеграцияРэдЭкспресс.ПолучитьПодключениеКСервисуRED();
		
		WSОпр = Новый WSОпределения(ПутиПодключенения.WS_Путь, ПутиПодключенения.Пользователь, ПутиПодключенения.Пароль);	
		Прокси = Новый WSПрокси(WSОпр, "http://www.redexpress.ru/", "SyncService" , "SyncServiceSoap");

		Прокси.Пользователь = ПутиПодключенения.Пользователь;
		Прокси.Пароль = ПутиПодключенения.Пароль;
		
		InvoiceStatusТип = Прокси.ФабрикаXDTO.Тип("http://www.redexpress.ru/", "InvoiceStatus");
				
		InvoicePlaceStatusТип = Прокси.ФабрикаXDTO.Тип("http://www.redexpress.ru/", "InvoicePlaceStatus");
		
		ArrayOfInvoicePlaceStatusТип = Прокси.ФабрикаXDTO.Тип("http://www.redexpress.ru/", "ArrayOfInvoicePlaceStatus");


		ВыборкаЗагрузкаСТСД = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаЗагрузкаСТСД.Следующий() Цикл 
			
			ВыборкаДокументов = ВыборкаЗагрузкаСТСД.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаДокументов.Следующий() Цикл
				
				Попытка
					
					InvoiceStatusбъект = Прокси.ФабрикаXDTO.Создать(InvoiceStatusТип);
					InvoiceStatusбъект.InvoiceId = ОбработатьВнешнийНомерДляРед(ВыборкаДокументов.InvoiceId);
					InvoiceStatusбъект.CourierId = ВыборкаДокументов.CourierId;
					InvoiceStatusбъект.RouteId = ВыборкаДокументов.RouteId;
					InvoiceStatusбъект.TerminalIdCurrent = ВыборкаДокументов.TerminalIdCurrent;
					//InvoiceStatusбъект.DateWork = ВыборкаДокументов.DateWork;

					//ДатаПроведенияДока = Вычислить("'" + ВыборкаДокументов.ДополнительнаяИнформация + "'");
					InvoiceStatusбъект.DateUpdate = ВыборкаДокументов.Период;
					
					ArrayOfInvoicePlaceStatusОбъект = Прокси.ФабрикаXDTO.Создать(ArrayOfInvoicePlaceStatusТип);

					
					InvoicePlaceStatusesОбъект = Прокси.ФабрикаXDTO.Создать(InvoicePlaceStatusТип);
					InvoicePlaceStatusesОбъект.PlaceId   = ВыборкаДокументов.PlaceId;
					InvoicePlaceStatusesОбъект.Status = "221";
					
					ArrayOfInvoicePlaceStatusОбъект.InvoicePlaceStatus.Добавить(InvoicePlaceStatusesОбъект);
			
					InvoiceStatusбъект.InvoicePlaceStatuses =  ArrayOfInvoicePlaceStatusОбъект;
					
					ЗаписьXML = Новый ЗаписьXML;
					ЗаписьXML.УстановитьСтроку();
					Прокси.ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, InvoiceStatusбъект);
					ДанныеXML_Данные = ЗаписьXML.Закрыть();	
					
					Ответ = Прокси.UpdateInvoiceStatus(InvoiceStatusбъект);
					
					ЗаписьXML = Новый ЗаписьXML;
					ЗаписьXML.УстановитьСтроку();
					Прокси.ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, Ответ);
					ДанныеXML_Ответ = ЗаписьXML.Закрыть();
					
					Если Ответ.Status = 200 Или Ответ.Status ="Success" Тогда
					
						ОбновитьрэОбъектыДляОбмена(ВыборкаДокументов.Период, ВыборкаДокументов.Объект, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"),ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ЗаказОтгруженКурьеру"), ВыборкаДокументов.Заказ, ТекущаяДата(), Истина, Справочники.СтатусыЗаказов.НаПутиККлиенту);
						
					Иначе 
						
						ОбновитьрэОбъектыДляОбмена(ВыборкаДокументов.Период, ВыборкаДокументов.Объект, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"),ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ЗаказОтгруженКурьеру"), ВыборкаДокументов.Заказ, ТекущаяДата(), Ложь, Справочники.СтатусыЗаказов.НаПутиККлиенту);
						
					КонецЕсли;	
					
					//ЗаписатьЛог_рэ_ЛогЗапросов(Ответ.Status, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"), ВыборкаДокументов.Объект, ВыборкаДокументов.Заказ , ДанныеXML_Данные, ДанныеXML_Ответ);
					ЗаписатьЛог_рэЛогЗапросов(ВыборкаДокументов.Объект,  ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"), ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ЗаказОтгруженКурьеру"), ВыборкаДокументов.Заказ, Ответ.Status, ДанныеXML_Данные, ДанныеXML_Ответ);
					
				Исключение
					
					//ЗаписатьЛог_рэ_ЛогЗапросов("Общая ошибка", ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"), ВыборкаДокументов.Объект, ВыборкаДокументов.Заказ , , ОписаниеОшибки());
					ЗаписатьЛог_рэЛогЗапросов(ВыборкаДокументов.Объект,  ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"), ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ЗаказОтгруженКурьеру"), ВыборкаДокументов.Заказ, "Общая ошибка", , ОписаниеОшибки());

					
				КонецПопытки;
				
				
			КонецЦикла; 
		КонецЦикла; 

		
	Исключение	
		
		//ЗаписатьЛог_рэ_ЛогЗапросов("Общая ошибка", ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"), , , , ОписаниеОшибки());
		ЗаписатьЛог_рэЛогЗапросов(,ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"), ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ЗаказОтгруженКурьеру"), , "Общая ошибка", , ОписаниеОшибки());
		Возврат Ложь;
		
	КонецПопытки;		
	
	Возврат Истина; 
	
КонецФункции	

Функция REDПередачаДанныхОСтатусах_ЗаказОтменен() Экспорт
	
	Попытка
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	рэОбъектыДляОбменаСрезПоследних.Период КАК Период,
		               |	рэОбъектыДляОбменаСрезПоследних.Объект КАК Объект,
		               |	рэОбъектыДляОбменаСрезПоследних.Метод КАК Метод,
		               |	рэОбъектыДляОбменаСрезПоследних.Операция КАК Операция,
		               |	рэОбъектыДляОбменаСрезПоследних.Заказ КАК Заказ,
		               |	рэОбъектыДляОбменаСрезПоследних.ДополнительнаяИнформация КАК ДополнительнаяИнформация
		               |ПОМЕСТИТЬ ВТ_рэОбъектыДляОбмена
		               |ИЗ
		               |	РегистрСведений.рэОбъектыДляОбмена.СрезПоследних(, ) КАК рэОбъектыДляОбменаСрезПоследних
		               |ГДЕ
		               |	рэОбъектыДляОбменаСрезПоследних.Метод = &Метод
		               |	И рэОбъектыДляОбменаСрезПоследних.Операция = &Операция
		               |	И рэОбъектыДляОбменаСрезПоследних.ДанныеОтправлены = ЛОЖЬ
		               |	И рэОбъектыДляОбменаСрезПоследних.СчетчикВыгрузок < 20
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	МАКСИМУМ(МестонахождениеЗаказа.Период) КАК Период,
		               |	МестонахождениеЗаказа.Заказ КАК Заказ
		               |ПОМЕСТИТЬ ВТ_ПериодыСрезаМестонахождения
		               |ИЗ
		               |	ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеЗаказа КАК МестонахождениеЗаказа
		               |		ПО ВТ_рэОбъектыДляОбмена.Заказ = МестонахождениеЗаказа.Заказ
		               |			И ВТ_рэОбъектыДляОбмена.Период >= МестонахождениеЗаказа.Период
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	МестонахождениеЗаказа.Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	МестонахождениеЗаказа.Заказ КАК Заказ,
		               |	МестонахождениеЗаказа.Терминал КАК Терминал
		               |ПОМЕСТИТЬ ВТ_Местонахождение
		               |ИЗ
		               |	РегистрСведений.МестонахождениеЗаказа КАК МестонахождениеЗаказа
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПериодыСрезаМестонахождения КАК ВТ_ПериодыСрезаМестонахождения
		               |		ПО МестонахождениеЗаказа.Период = ВТ_ПериодыСрезаМестонахождения.Период
		               |			И МестонахождениеЗаказа.Заказ = ВТ_ПериодыСрезаМестонахождения.Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ШтрихкодыЗаказов.Заказ КАК Заказ,
		               |	МАКСИМУМ(ШтрихкодыЗаказов.НомерМеста) КАК НомерМеста
		               |ПОМЕСТИТЬ ВТ_НомераМест
		               |ИЗ
		               |	ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыЗаказов КАК ШтрихкодыЗаказов
		               |		ПО ВТ_рэОбъектыДляОбмена.Заказ = ШтрихкодыЗаказов.Заказ
		               |ГДЕ
		               |	ШтрихкодыЗаказов.НомерМеста <> 0
		               |	И ШтрихкодыЗаказов.ДокументТСД = ЗНАЧЕНИЕ(Документ.ЗагрузкаСТСД.ПустаяСсылка)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ШтрихкодыЗаказов.Заказ
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Контрагенты.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ ВТ_НужныеКонтрагенты
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	Контрагенты.Ссылка = &Ссылка
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	Контрагенты.Ссылка
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	Контрагенты.Родитель.ОсновнойМагазин = &Ссылка
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа КАК InvoiceId,
		               |	""В"" + ПривязкаМашинКРейсамСрезПоследних.Водитель.Код КАК CourierId,
		               |	ДокументРейс.Номер КАК RouteId,
		               |	ВЫБОР
		               |		КОГДА ВЫБОР
		               |				КОГДА ВТ_Местонахождение.Терминал ЕСТЬ NULL
		               |						ИЛИ ВТ_Местонахождение.Терминал = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.ПустаяСсылка)
		               |					ТОГДА РеализацияТоваровУслуг.ТерминалДоставки
		               |				ИНАЧЕ ВТ_Местонахождение.Терминал
		               |			КОНЕЦ = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.МоскваСтриж)
		               |			ТОГДА 1
		               |		ИНАЧЕ 2
		               |	КОНЕЦ КАК TerminalIdCurrent,
		               |	РеализацияТоваровУслуг.Ссылка КАК Заказ,
		               |	ДокументРейс.Дата КАК DateUpdate,
		               |	ВТ_рэОбъектыДляОбмена.Период КАК Период,
		               |	ВТ_рэОбъектыДляОбмена.Объект КАК Объект,
		               |	ЕСТЬNULL(ВТ_НомераМест.НомерМеста, 1) КАК PlaceId,
		               |	ВТ_рэОбъектыДляОбмена.ДополнительнаяИнформация КАК ДополнительнаяИнформация
		               |ПОМЕСТИТЬ ВТ_Реализации
		               |ИЗ
		               |	РегистрСведений.новаЗаданияРейсов КАК новаЗаданияРейсов
		               |		ПОЛНОЕ СОЕДИНЕНИЕ БизнесПроцесс.новаРейсМестнойДоставки КАК новаРейсМестнойДоставки
		               |			ЛЕВОЕ СОЕДИНЕНИЕ Задача.новаЗадачаРейсаМестнойДоставки КАК ЗадачаРейса
		               |			ПО новаРейсМестнойДоставки.Ссылка = ЗадачаРейса.БизнесПроцесс
		               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Рейс КАК ДокументРейс
		               |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних КАК ПривязкаМашинКРейсамСрезПоследних
		               |				ПО ДокументРейс.Ссылка = ПривязкаМашинКРейсамСрезПоследних.Рейс
		               |			ПО новаРейсМестнойДоставки.Ссылка = ДокументРейс.РейсМестнойДоставки
		               |		ПО новаЗаданияРейсов.Рейс = новаРейсМестнойДоставки.Ссылка
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НужныеКонтрагенты КАК ВТ_НужныеКонтрагенты
		               |			ПО РеализацияТоваровУслуг.ВладелецТовара = ВТ_НужныеКонтрагенты.Ссылка
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |			ПО (ВЫРАЗИТЬ(ВТ_рэОбъектыДляОбмена.Заказ КАК Документ.РеализацияТоваровУслуг).Ссылка = РеализацияТоваровУслуг.Ссылка)
		               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НомераМест КАК ВТ_НомераМест
		               |			ПО РеализацияТоваровУслуг.Ссылка = ВТ_НомераМест.Заказ
		               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеЗаказа.СрезПоследних(
		               |					,
		               |					Заказ В
		               |						(ВЫБРАТЬ
		               |							ВТ_рэОбъектыДляОбмена.Заказ КАК Заказ
		               |						ИЗ
		               |							ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена)) КАК МестонахождениеЗаказаСрезПоследних
		               |			ПО РеализацияТоваровУслуг.Ссылка = МестонахождениеЗаказаСрезПоследних.Заказ
		               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Местонахождение КАК ВТ_Местонахождение
		               |			ПО РеализацияТоваровУслуг.Ссылка = ВТ_Местонахождение.Заказ
		               |		ПО новаЗаданияРейсов.Доставка.Номер = РеализацияТоваровУслуг.Номер
		               |ГДЕ
		               |	РеализацияТоваровУслуг.СтатусИнтернетМагазина = 4
		               |	И ВТ_рэОбъектыДляОбмена.Объект ССЫЛКА Документ.Рейс
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа,
		               |	ДокументРейс.Номер,
		               |	РеализацияТоваровУслуг.Ссылка,
		               |	ДокументРейс.Дата,
		               |	""В"" + ПривязкаМашинКРейсамСрезПоследних.Водитель.Код,
		               |	ВТ_рэОбъектыДляОбмена.Период,
		               |	ВТ_рэОбъектыДляОбмена.Объект,
		               |	ЕСТЬNULL(ВТ_НомераМест.НомерМеста, 1),
		               |	ВТ_рэОбъектыДляОбмена.ДополнительнаяИнформация,
		               |	ВЫБОР
		               |		КОГДА ВЫБОР
		               |				КОГДА ВТ_Местонахождение.Терминал ЕСТЬ NULL
		               |						ИЛИ ВТ_Местонахождение.Терминал = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.ПустаяСсылка)
		               |					ТОГДА РеализацияТоваровУслуг.ТерминалДоставки
		               |				ИНАЧЕ ВТ_Местонахождение.Терминал
		               |			КОНЕЦ = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.МоскваСтриж)
		               |			ТОГДА 1
		               |		ИНАЧЕ 2
		               |	КОНЕЦ
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа,
		               |	""В"" + ПривязкаМашинКРейсамСрезПоследних.Водитель.Код,
		               |	ДокументРейс.Номер,
		               |	ВЫБОР
		               |		КОГДА РеализацияТоваровУслуг.ТерминалДоставки = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.МоскваСтриж)
		               |			ТОГДА 1
		               |		ИНАЧЕ 2
		               |	КОНЕЦ,
		               |	РеализацияТоваровУслуг.Ссылка,
		               |	ДокументРейс.Дата,
		               |	ВТ_рэОбъектыДляОбмена.Период,
		               |	ВТ_рэОбъектыДляОбмена.Объект,
		               |	ЕСТЬNULL(ВТ_НомераМест.НомерМеста, 1),
		               |	NULL
		               |ИЗ
		               |	РегистрСведений.новаЗаданияРейсов КАК новаЗаданияРейсов
		               |		ПОЛНОЕ СОЕДИНЕНИЕ БизнесПроцесс.новаРейсМестнойДоставки КАК новаРейсМестнойДоставки
		               |			ЛЕВОЕ СОЕДИНЕНИЕ Задача.новаЗадачаРейсаМестнойДоставки КАК ЗадачаРейса
		               |			ПО новаРейсМестнойДоставки.Ссылка = ЗадачаРейса.БизнесПроцесс
		               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Рейс КАК ДокументРейс
		               |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних КАК ПривязкаМашинКРейсамСрезПоследних
		               |				ПО ДокументРейс.Ссылка = ПривязкаМашинКРейсамСрезПоследних.Рейс
		               |			ПО новаРейсМестнойДоставки.Ссылка = ДокументРейс.РейсМестнойДоставки
		               |		ПО новаЗаданияРейсов.Рейс = новаРейсМестнойДоставки.Ссылка
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НужныеКонтрагенты КАК ВТ_НужныеКонтрагенты
		               |			ПО РеализацияТоваровУслуг.ВладелецТовара = ВТ_НужныеКонтрагенты.Ссылка
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗакрытиеЗаказов.Заказы КАК ЗакрытиеЗаказовЗаказы
		               |				ПО (ВЫРАЗИТЬ(ВТ_рэОбъектыДляОбмена.Заказ КАК Документ.РеализацияТоваровУслуг).Ссылка = ЗакрытиеЗаказовЗаказы.Реализация)
		               |					И (ВЫРАЗИТЬ(ВТ_рэОбъектыДляОбмена.Объект КАК Документ.ЗакрытиеЗаказов).Ссылка = ЗакрытиеЗаказовЗаказы.Ссылка)
		               |			ПО (ВТ_рэОбъектыДляОбмена.Заказ = РеализацияТоваровУслуг.Ссылка)
		               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НомераМест КАК ВТ_НомераМест
		               |			ПО РеализацияТоваровУслуг.Ссылка = ВТ_НомераМест.Заказ
		               |		ПО новаЗаданияРейсов.Доставка.Номер = РеализацияТоваровУслуг.Номер
		               |ГДЕ
		               |	ЗакрытиеЗаказовЗаказы.Отклонить
		               |	И ЗакрытиеЗаказовЗаказы.ПричинаНевыполнения = &ПричинаНевыполнения
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа,
		               |	ДокументРейс.Номер,
		               |	РеализацияТоваровУслуг.Ссылка,
		               |	ДокументРейс.Дата,
		               |	""В"" + ПривязкаМашинКРейсамСрезПоследних.Водитель.Код,
		               |	ВЫБОР
		               |		КОГДА РеализацияТоваровУслуг.ТерминалДоставки = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.МоскваСтриж)
		               |			ТОГДА 1
		               |		ИНАЧЕ 2
		               |	КОНЕЦ,
		               |	ВТ_рэОбъектыДляОбмена.Период,
		               |	ВТ_рэОбъектыДляОбмена.Объект,
		               |	ЕСТЬNULL(ВТ_НомераМест.НомерМеста, 1)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЗаборТовара.НомерВнешнегоЗаказа КАК InvoiceId,
		               |	""В"" + ЗаборТовара.Водитель.Код КАК CourierId,
		               |	РейсЗаказы.Ссылка.Номер КАК RouteId,
		               |	РейсЗаказы.Ссылка.Дата КАК DateUpdate,
		               |	ВЫБОР
		               |		КОГДА ЗаборТовара.ТерминалПриемки = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.МоскваСтриж)
		               |			ТОГДА 1
		               |		ИНАЧЕ 2
		               |	КОНЕЦ КАК TerminalIdCurrent,
		               |	ВТ_рэОбъектыДляОбмена.Объект КАК Объект,
		               |	ЗаборТовара.Ссылка КАК Заказ,
		               |	ВТ_рэОбъектыДляОбмена.Период КАК Период,
		               |	1 КАК PlaceId,
		               |	ВТ_рэОбъектыДляОбмена.ДополнительнаяИнформация КАК ДополнительнаяИнформация
		               |ПОМЕСТИТЬ ВТ_Заборы
		               |ИЗ
		               |	Документ.ЗаборТовара КАК ЗаборТовара
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Рейс.Заказы КАК РейсЗаказы
		               |		ПО (РейсЗаказы.Заказ = ЗаборТовара.Ссылка)
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НужныеКонтрагенты КАК ВТ_НужныеКонтрагенты
		               |		ПО ЗаборТовара.Контрагент = ВТ_НужныеКонтрагенты.Ссылка
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |		ПО (ВЫРАЗИТЬ(ВТ_рэОбъектыДляОбмена.Заказ КАК Документ.ЗаборТовара).Ссылка = ЗаборТовара.Ссылка)
		               |ГДЕ
		               |	ЗаборТовара.СтатусИнтернетМагазина = 4
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЗаборТовара.Ссылка,
		               |	ЗаборТовара.НомерВнешнегоЗаказа,
		               |	""В"" + ЗаборТовара.Водитель.Код,
		               |	РейсЗаказы.Ссылка.Номер,
		               |	РейсЗаказы.Ссылка.Дата,
		               |	ВЫБОР
		               |		КОГДА ЗаборТовара.ТерминалПриемки = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.МоскваСтриж)
		               |			ТОГДА 1
		               |		ИНАЧЕ 2
		               |	КОНЕЦ,
		               |	ВТ_рэОбъектыДляОбмена.Период,
		               |	ВТ_рэОбъектыДляОбмена.ДополнительнаяИнформация,
		               |	ВТ_рэОбъектыДляОбмена.Объект
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа КАК InvoiceId,
		               |	""В"" + ПривязкаМашинКРейсамСрезПоследних.Водитель.Код КАК CourierId,
		               |	ДокументРейс.Номер КАК RouteId,
		               |	ВЫБОР
		               |		КОГДА ВЫБОР
		               |				КОГДА ВТ_Местонахождение.Терминал ЕСТЬ NULL
		               |						ИЛИ ВТ_Местонахождение.Терминал = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.ПустаяСсылка)
		               |					ТОГДА РеализацияТоваровУслуг.ТерминалДоставки
		               |				ИНАЧЕ ВТ_Местонахождение.Терминал
		               |			КОНЕЦ = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.МоскваСтриж)
		               |			ТОГДА 1
		               |		ИНАЧЕ 2
		               |	КОНЕЦ КАК TerminalIdCurrent,
		               |	РеализацияТоваровУслуг.Ссылка КАК Заказ,
		               |	ДанныеЗаказаВодителя.Ссылка.Дата КАК DateUpdate,
		               |	ВТ_рэОбъектыДляОбмена.Период КАК Период,
		               |	ВТ_рэОбъектыДляОбмена.Объект КАК Объект,
		               |	ЕСТЬNULL(ВТ_НомераМест.НомерМеста, 1) КАК PlaceId,
		               |	ВТ_рэОбъектыДляОбмена.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
		               |	ДокументРейс.Ссылка КАК Рейс
		               |ПОМЕСТИТЬ ВТ_ДанныеЗаказаВодителя
		               |ИЗ
		               |	РегистрСведений.новаЗаданияРейсов КАК новаЗаданияРейсов
		               |		ПОЛНОЕ СОЕДИНЕНИЕ БизнесПроцесс.новаРейсМестнойДоставки КАК новаРейсМестнойДоставки
		               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Рейс КАК ДокументРейс
		               |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних КАК ПривязкаМашинКРейсамСрезПоследних
		               |				ПО ДокументРейс.Ссылка = ПривязкаМашинКРейсамСрезПоследних.Рейс
		               |			ПО новаРейсМестнойДоставки.Ссылка = ДокументРейс.РейсМестнойДоставки
		               |		ПО новаЗаданияРейсов.Рейс = новаРейсМестнойДоставки.Ссылка
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НужныеКонтрагенты КАК ВТ_НужныеКонтрагенты
		               |			ПО РеализацияТоваровУслуг.ВладелецТовара = ВТ_НужныеКонтрагенты.Ссылка
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ДанныеЗаказаВодителя КАК ДанныеЗаказаВодителя
		               |				ПО (ВЫРАЗИТЬ(ВТ_рэОбъектыДляОбмена.Заказ КАК Документ.РеализацияТоваровУслуг).Ссылка = ДанныеЗаказаВодителя.Реализация)
		               |					И (ВЫРАЗИТЬ(ВТ_рэОбъектыДляОбмена.Объект КАК Документ.ДанныеЗаказаВодителя).Ссылка = ДанныеЗаказаВодителя.Ссылка)
		               |			ПО (ВТ_рэОбъектыДляОбмена.Заказ = РеализацияТоваровУслуг.Ссылка)
		               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НомераМест КАК ВТ_НомераМест
		               |			ПО РеализацияТоваровУслуг.Ссылка = ВТ_НомераМест.Заказ
		               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Местонахождение КАК ВТ_Местонахождение
		               |			ПО РеализацияТоваровУслуг.Ссылка = ВТ_Местонахождение.Заказ
		               |		ПО новаЗаданияРейсов.Доставка.Номер = РеализацияТоваровУслуг.Номер
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа,
		               |	ДокументРейс.Номер,
		               |	РеализацияТоваровУслуг.Ссылка,
		               |	""В"" + ПривязкаМашинКРейсамСрезПоследних.Водитель.Код,
		               |	ВТ_рэОбъектыДляОбмена.Период,
		               |	ВТ_рэОбъектыДляОбмена.Объект,
		               |	ДанныеЗаказаВодителя.Ссылка.Дата,
		               |	ЕСТЬNULL(ВТ_НомераМест.НомерМеста, 1),
		               |	ВТ_рэОбъектыДляОбмена.ДополнительнаяИнформация,
		               |	ВЫБОР
		               |		КОГДА ВЫБОР
		               |				КОГДА ВТ_Местонахождение.Терминал ЕСТЬ NULL
		               |						ИЛИ ВТ_Местонахождение.Терминал = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.ПустаяСсылка)
		               |					ТОГДА РеализацияТоваровУслуг.ТерминалДоставки
		               |				ИНАЧЕ ВТ_Местонахождение.Терминал
		               |			КОНЕЦ = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.МоскваСтриж)
		               |			ТОГДА 1
		               |		ИНАЧЕ 2
		               |	КОНЕЦ,
		               |	ДокументРейс.Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ДанныеЗаказаВодителя.Заказ КАК Заказ,
		               |	МАКСИМУМ(ВТ_ДанныеЗаказаВодителя.Рейс.Дата) КАК РейсДата
		               |ПОМЕСТИТЬ ВТ_ПоследнийРейс
		               |ИЗ
		               |	ВТ_ДанныеЗаказаВодителя КАК ВТ_ДанныеЗаказаВодителя
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВТ_ДанныеЗаказаВодителя.Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_Реализации.InvoiceId КАК InvoiceId,
		               |	ВТ_Реализации.CourierId КАК CourierId,
		               |	ВТ_Реализации.RouteId КАК RouteId,
		               |	ВТ_Реализации.Объект КАК Объект,
		               |	ВТ_Реализации.TerminalIdCurrent КАК TerminalIdCurrent,
		               |	ВТ_Реализации.Заказ КАК Заказ,
		               |	ВТ_Реализации.DateUpdate КАК DateUpdate,
		               |	ВТ_Реализации.Период КАК Период,
		               |	ВТ_Реализации.PlaceId КАК PlaceId,
		               |	ВТ_Реализации.ДополнительнаяИнформация КАК ДополнительнаяИнформация
		               |ИЗ
		               |	ВТ_Реализации КАК ВТ_Реализации
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ВТ_Заборы.InvoiceId,
		               |	ВТ_Заборы.CourierId,
		               |	ВТ_Заборы.RouteId,
		               |	ВТ_Заборы.Объект,
		               |	ВТ_Заборы.TerminalIdCurrent,
		               |	ВТ_Заборы.Заказ,
		               |	ВТ_Заборы.DateUpdate,
		               |	ВТ_Заборы.Период,
		               |	ВТ_Заборы.PlaceId,
		               |	ВТ_Заборы.ДополнительнаяИнформация
		               |ИЗ
		               |	ВТ_Заборы КАК ВТ_Заборы
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ВТ_ДанныеЗаказаВодителя.InvoiceId,
		               |	ВТ_ДанныеЗаказаВодителя.CourierId,
		               |	ВТ_ДанныеЗаказаВодителя.RouteId,
		               |	ВТ_ДанныеЗаказаВодителя.Объект,
		               |	ВТ_ДанныеЗаказаВодителя.TerminalIdCurrent,
		               |	ВТ_ДанныеЗаказаВодителя.Заказ,
		               |	ВТ_ДанныеЗаказаВодителя.DateUpdate,
		               |	ВТ_ДанныеЗаказаВодителя.Период,
		               |	ВТ_ДанныеЗаказаВодителя.PlaceId,
		               |	ВТ_ДанныеЗаказаВодителя.ДополнительнаяИнформация
		               |ИЗ
		               |	ВТ_ДанныеЗаказаВодителя КАК ВТ_ДанныеЗаказаВодителя
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПоследнийРейс КАК ВТ_ПоследнийРейс
		               |		ПО ВТ_ДанныеЗаказаВодителя.Заказ = ВТ_ПоследнийРейс.Заказ
		               |			И ВТ_ДанныеЗаказаВодителя.Рейс.Дата = ВТ_ПоследнийРейс.РейсДата";
		
		Запрос.УстановитьПараметр("Ссылка", ПараметрыСеанса.рэКомпанияRED);
		Запрос.УстановитьПараметр("Метод", ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"));
		Запрос.УстановитьПараметр("Операция", ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.Отменен"));
		Запрос.УстановитьПараметр("ПричинаНевыполнения", Справочники.ПричиныНеВыполненияДоставки.ОтказКлиентаБезЗаезда);

		Результат = Запрос.Выполнить();
		
		Если Результат.Пустой() Тогда
			Возврат Истина;
		КонецЕсли;
		
		ПутиПодключенения = рэИнтеграцияРэдЭкспресс.ПолучитьПодключениеКСервисуRED();
		
		WSОпр = Новый WSОпределения(ПутиПодключенения.WS_Путь, ПутиПодключенения.Пользователь, ПутиПодключенения.Пароль);	
		Прокси = Новый WSПрокси(WSОпр, "http://www.redexpress.ru/", "SyncService" , "SyncServiceSoap");

		Прокси.Пользователь = ПутиПодключенения.Пользователь;
		Прокси.Пароль = ПутиПодключенения.Пароль;
		
		InvoiceStatusТип = Прокси.ФабрикаXDTO.Тип("http://www.redexpress.ru/", "InvoiceStatus");
				
		InvoicePlaceStatusТип = Прокси.ФабрикаXDTO.Тип("http://www.redexpress.ru/", "InvoicePlaceStatus");
		
		ArrayOfInvoicePlaceStatusТип = Прокси.ФабрикаXDTO.Тип("http://www.redexpress.ru/", "ArrayOfInvoicePlaceStatus");
		
		ВыборкаДокументов = Результат.Выбрать();
		
		Пока ВыборкаДокументов.Следующий() Цикл
			
			Попытка
				
				InvoiceStatusбъект = Прокси.ФабрикаXDTO.Создать(InvoiceStatusТип);
				InvoiceStatusбъект.InvoiceId = ОбработатьВнешнийНомерДляРед(ВыборкаДокументов.InvoiceId);
				
				//InvoiceStatusбъект.DateUpdate = ТекущаяДата();
				ДатаПроведенияДока = ВыборкаДокументов.Период;
				InvoiceStatusбъект.DateUpdate = ДатаПроведенияДока;
				
				InvoiceStatusбъект.Comment = "-";
				InvoiceStatusбъект.CourierId = ВыборкаДокументов.CourierId;
				InvoiceStatusбъект.RouteId = ВыборкаДокументов.RouteId;
				InvoiceStatusбъект.TerminalIdCurrent = ВыборкаДокументов.TerminalIdCurrent;
				
				
				ArrayOfInvoicePlaceStatusОбъект = Прокси.ФабрикаXDTO.Создать(ArrayOfInvoicePlaceStatusТип);
				
				
				InvoicePlaceStatusesОбъект = Прокси.ФабрикаXDTO.Создать(InvoicePlaceStatusТип);
				InvoicePlaceStatusesОбъект.PlaceId   = ВыборкаДокументов.PlaceId;
				InvoicePlaceStatusesОбъект.Status = "401";
				
				ArrayOfInvoicePlaceStatusОбъект.InvoicePlaceStatus.Добавить(InvoicePlaceStatusesОбъект);
				
				InvoiceStatusбъект.InvoicePlaceStatuses =  ArrayOfInvoicePlaceStatusОбъект;
				
				ЗаписьXML = Новый ЗаписьXML;
				ЗаписьXML.УстановитьСтроку();
				Прокси.ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, InvoiceStatusбъект);
				ДанныеXML_Данные = ЗаписьXML.Закрыть();	
				
				Ответ = Прокси.UpdateInvoiceStatus(InvoiceStatusбъект);
				
				ЗаписьXML = Новый ЗаписьXML;
				ЗаписьXML.УстановитьСтроку();
				Прокси.ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, Ответ);
				ДанныеXML_Ответ = ЗаписьXML.Закрыть();
				
				Если Ответ.Status = 200 Или Ответ.Status ="Success" Тогда
					
					ОбновитьрэОбъектыДляОбмена(ВыборкаДокументов.Период, ВыборкаДокументов.Объект, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"),ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.Отменен"), ВыборкаДокументов.Заказ, ТекущаяДата(), Истина, Справочники.СтатусыЗаказов.ЗаказНеВозилиНаДоставку);
					
				Иначе 
					
					ОбновитьрэОбъектыДляОбмена(ВыборкаДокументов.Период, ВыборкаДокументов.Объект, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"),ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.Отменен"), ВыборкаДокументов.Заказ, ТекущаяДата(), Ложь, Справочники.СтатусыЗаказов.ЗаказНеВозилиНаДоставку);
					
				КонецЕсли;	
				
				//ЗаписатьЛог_рэ_ЛогЗапросов(Ответ.Status, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"), ВыборкаДокументов.Объект, ВыборкаДокументов.Заказ , ДанныеXML_Данные, ДанныеXML_Ответ);
                ЗаписатьЛог_рэЛогЗапросов(ВыборкаДокументов.Объект,  ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"),ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.Отменен"), ВыборкаДокументов.Заказ, Ответ.Status, ДанныеXML_Данные, ДанныеXML_Ответ);
				
			Исключение
				
				//ЗаписатьЛог_рэ_ЛогЗапросов("Общая ошибка", ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"), ВыборкаДокументов.Объект, ВыборкаДокументов.Заказ , , ОписаниеОшибки());
                ЗаписатьЛог_рэЛогЗапросов(ВыборкаДокументов.Объект,  ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"),ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.Отменен"), ВыборкаДокументов.Заказ, "Общая ошибка", , ОписаниеОшибки());				
				Возврат Ложь;
				
			КонецПопытки;
			
			
		КонецЦикла; 
		
		
	Исключение	
		
		//ЗаписатьЛог_рэ_ЛогЗапросов("Общая ошибка", ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"), , , , ОписаниеОшибки());
		ЗаписатьЛог_рэЛогЗапросов(,ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"),ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.Отменен") , , "Общая ошибка", , ОписаниеОшибки());
		Возврат Ложь;
		
	КонецПопытки;		
	
	Возврат Истина; 

КонецФункции	

Функция REDПередачаДанныхОСтатусах_ЗаказОтменен_РегистрацияДляОтправки(selfDelivery_Ч, СтатусЗаказа,  стрНомерЗаказа) Экспорт
	
	Если Не ЗначениеЗаполнено(ПараметрыСеанса.рэКомпанияRED) Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	Если СтатусЗаказа <> 4 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если selfDelivery_Ч <> 1 И selfDelivery_Ч <> 2 И selfDelivery_Ч <> 4 Тогда
		Возврат Истина;
	КонецЕсли;	

				
	Попытка
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Контрагенты.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ ВТ_НужныеКонтрагенты
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	Контрагенты.Ссылка = &Ссылка
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	Контрагенты.Ссылка
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	Контрагенты.Родитель.ОсновнойМагазин = &Ссылка
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ДокументРейс.Ссылка КАК Объект,
		               |	РеализацияТоваровУслуг.Ссылка КАК Заказ
		               |ПОМЕСТИТЬ ВТ_Реализации
		               |ИЗ
		               |	РегистрСведений.новаЗаданияРейсов КАК новаЗаданияРейсов
		               |		ПОЛНОЕ СОЕДИНЕНИЕ БизнесПроцесс.новаРейсМестнойДоставки КАК новаРейсМестнойДоставки
		               |			ЛЕВОЕ СОЕДИНЕНИЕ Задача.новаЗадачаРейсаМестнойДоставки КАК ЗадачаРейса
		               |			ПО новаРейсМестнойДоставки.Ссылка = ЗадачаРейса.БизнесПроцесс
		               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Рейс КАК ДокументРейс
		               |			ПО новаРейсМестнойДоставки.Ссылка = ДокументРейс.РейсМестнойДоставки
		               |		ПО новаЗаданияРейсов.Рейс = новаРейсМестнойДоставки.Ссылка
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НужныеКонтрагенты КАК ВТ_НужныеКонтрагенты
		               |			ПО РеализацияТоваровУслуг.ВладелецТовара = ВТ_НужныеКонтрагенты.Ссылка
		               |		ПО новаЗаданияРейсов.Доставка.Номер = РеализацияТоваровУслуг.Номер
		               |ГДЕ
		               |	РеализацияТоваровУслуг.Номер = &Номер
		               |	И &ВидДокумента = 1
		               |	И РеализацияТоваровУслуг.СтатусИнтернетМагазина = 2
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ДокументРейс.Ссылка,
		               |	РеализацияТоваровУслуг.Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	РейсЗаказы.Ссылка КАК Объект,
		               |	ЗаборТовара.Ссылка КАК Заказ
		               |ПОМЕСТИТЬ ВТ_Заборы
		               |ИЗ
		               |	Документ.ЗаборТовара КАК ЗаборТовара
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Рейс.Заказы КАК РейсЗаказы
		               |		ПО (РейсЗаказы.Заказ = ЗаборТовара.Ссылка)
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НужныеКонтрагенты КАК ВТ_НужныеКонтрагенты
		               |		ПО ЗаборТовара.Контрагент = ВТ_НужныеКонтрагенты.Ссылка
		               |ГДЕ
		               |	ЗаборТовара.Номер = &Номер
		               |	И &ВидДокумента = 2
		               |	И ЗаборТовара.СтатусИнтернетМагазина = 2
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РейсЗаказы.Ссылка,
		               |	ЗаборТовара.Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_Реализации.Объект КАК Объект,
		               |	ВТ_Реализации.Заказ КАК Заказ
		               |ИЗ
		               |	ВТ_Реализации КАК ВТ_Реализации
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ВТ_Заборы.Объект,
		               |	ВТ_Заборы.Заказ
		               |ИЗ
		               |	ВТ_Заборы КАК ВТ_Заборы";
		
		Запрос.УстановитьПараметр("Ссылка", ПараметрыСеанса.рэКомпанияRED);
		Запрос.УстановитьПараметр("Номер", стрНомерЗаказа);
		Запрос.УстановитьПараметр("ВидДокумента", selfDelivery_Ч);


		Результат = Запрос.Выполнить();
		
		Если Результат.Пустой() Тогда
			Возврат Истина;
		КонецЕсли;
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			МенеджерЗаписи = РегистрыСведений.рэОбъектыДляОбмена.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период = ТекущаяДата();
			МенеджерЗаписи.Объект = Выборка.Объект;
			МенеджерЗаписи.Метод = Перечисления.рэМетоды.UpdateInvoiceStatus;
			МенеджерЗаписи.Операция = Перечисления.реОперацииПередачиСтатусов.Отменен;
			МенеджерЗаписи.Заказ  = Выборка.Заказ;
			МенеджерЗаписи.ДополнительнаяИнформация = ЗагрузкаИзИнтернетМагазина.ДатаВСтроку(ТекущаяДата());
			МенеджерЗаписи.Записать();
			
		КонецЦикла;
		
	Исключение	
		
		Сообщить("Ошибка регистрации объекта для обмена в подсистеме Red: " + ОписаниеОшибки());
		Возврат Ложь;
		
	КонецПопытки;		
	
	Возврат Истина; 
	
КонецФункции	

Функция REDПередачаДанныхОСтатусах_ОтказВоВремяДоставки() Экспорт
	
	Попытка
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	рэОбъектыДляОбменаСрезПоследних.Период КАК Период,
		               |	рэОбъектыДляОбменаСрезПоследних.Объект КАК Объект,
		               |	рэОбъектыДляОбменаСрезПоследних.Метод КАК Метод,
		               |	рэОбъектыДляОбменаСрезПоследних.Операция КАК Операция,
		               |	рэОбъектыДляОбменаСрезПоследних.Заказ КАК Заказ,
		               |	рэОбъектыДляОбменаСрезПоследних.ДополнительнаяИнформация КАК ДополнительнаяИнформация
		               |ПОМЕСТИТЬ ВТ_рэОбъектыДляОбмена
		               |ИЗ
		               |	РегистрСведений.рэОбъектыДляОбмена.СрезПоследних(, ) КАК рэОбъектыДляОбменаСрезПоследних
		               |ГДЕ
		               |	рэОбъектыДляОбменаСрезПоследних.Метод = &Метод
		               |	И рэОбъектыДляОбменаСрезПоследних.Операция = &Операция
		               |	И рэОбъектыДляОбменаСрезПоследних.ДанныеОтправлены = ЛОЖЬ
		               |	И рэОбъектыДляОбменаСрезПоследних.СчетчикВыгрузок < 20
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	МАКСИМУМ(МестонахождениеЗаказа.Период) КАК Период,
		               |	МестонахождениеЗаказа.Заказ КАК Заказ
		               |ПОМЕСТИТЬ ВТ_ПериодыСрезаМестонахождения
		               |ИЗ
		               |	ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеЗаказа КАК МестонахождениеЗаказа
		               |		ПО ВТ_рэОбъектыДляОбмена.Заказ = МестонахождениеЗаказа.Заказ
		               |			И ВТ_рэОбъектыДляОбмена.Период >= МестонахождениеЗаказа.Период
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	МестонахождениеЗаказа.Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	МестонахождениеЗаказа.Заказ КАК Заказ,
		               |	МестонахождениеЗаказа.Терминал КАК Терминал
		               |ПОМЕСТИТЬ ВТ_Местонахождение
		               |ИЗ
		               |	РегистрСведений.МестонахождениеЗаказа КАК МестонахождениеЗаказа
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПериодыСрезаМестонахождения КАК ВТ_ПериодыСрезаМестонахождения
		               |		ПО МестонахождениеЗаказа.Период = ВТ_ПериодыСрезаМестонахождения.Период
		               |			И МестонахождениеЗаказа.Заказ = ВТ_ПериодыСрезаМестонахождения.Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ШтрихкодыЗаказов.Заказ КАК Заказ,
		               |	МАКСИМУМ(ШтрихкодыЗаказов.НомерМеста) КАК НомерМеста
		               |ПОМЕСТИТЬ ВТ_НомераМест
		               |ИЗ
		               |	ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыЗаказов КАК ШтрихкодыЗаказов
		               |		ПО ВТ_рэОбъектыДляОбмена.Заказ = ШтрихкодыЗаказов.Заказ
		               |ГДЕ
		               |	ШтрихкодыЗаказов.НомерМеста <> 0
		               |	И ШтрихкодыЗаказов.ДокументТСД = ЗНАЧЕНИЕ(Документ.ЗагрузкаСТСД.ПустаяСсылка)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ШтрихкодыЗаказов.Заказ
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Контрагенты.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ ВТ_НужныеКонтрагенты
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	Контрагенты.Ссылка = &Ссылка
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	Контрагенты.Ссылка
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	Контрагенты.Родитель.ОсновнойМагазин = &Ссылка
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа КАК InvoiceId,
		               |	""В"" + ПривязкаМашинКРейсамСрезПоследних.Водитель.Код КАК CourierId,
		               |	ДокументРейс.Номер КАК RouteId,
		               |	ВЫБОР
		               |		КОГДА ВЫБОР
		               |				КОГДА ВТ_Местонахождение.Терминал ЕСТЬ NULL
		               |						ИЛИ ВТ_Местонахождение.Терминал = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.ПустаяСсылка)
		               |					ТОГДА РеализацияТоваровУслуг.ТерминалДоставки
		               |				ИНАЧЕ ВТ_Местонахождение.Терминал
		               |			КОНЕЦ = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.МоскваСтриж)
		               |			ТОГДА 1
		               |		ИНАЧЕ 2
		               |	КОНЕЦ КАК TerminalIdCurrent,
		               |	РеализацияТоваровУслуг.Ссылка КАК Заказ,
		               |	ЗакрытиеЗаказовЗаказы.Ссылка.Дата КАК DateUpdate,
		               |	ВТ_рэОбъектыДляОбмена.Период КАК Период,
		               |	ВТ_рэОбъектыДляОбмена.Объект КАК Объект,
		               |	ЕСТЬNULL(ВТ_НомераМест.НомерМеста, 1) КАК PlaceId,
		               |	ВТ_рэОбъектыДляОбмена.ДополнительнаяИнформация КАК ДополнительнаяИнформация
		               |ПОМЕСТИТЬ ВТ_Реализации
		               |ИЗ
		               |	РегистрСведений.новаЗаданияРейсов КАК новаЗаданияРейсов
		               |		ПОЛНОЕ СОЕДИНЕНИЕ БизнесПроцесс.новаРейсМестнойДоставки КАК новаРейсМестнойДоставки
		               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Рейс КАК ДокументРейс
		               |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних КАК ПривязкаМашинКРейсамСрезПоследних
		               |				ПО ДокументРейс.Ссылка = ПривязкаМашинКРейсамСрезПоследних.Рейс
		               |			ПО новаРейсМестнойДоставки.Ссылка = ДокументРейс.РейсМестнойДоставки
		               |		ПО новаЗаданияРейсов.Рейс = новаРейсМестнойДоставки.Ссылка
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НужныеКонтрагенты КАК ВТ_НужныеКонтрагенты
		               |			ПО РеализацияТоваровУслуг.ВладелецТовара = ВТ_НужныеКонтрагенты.Ссылка
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗакрытиеЗаказов.Заказы КАК ЗакрытиеЗаказовЗаказы
		               |				ПО (ВЫРАЗИТЬ(ВТ_рэОбъектыДляОбмена.Заказ КАК Документ.РеализацияТоваровУслуг).Ссылка = ЗакрытиеЗаказовЗаказы.Реализация)
		               |					И (ВЫРАЗИТЬ(ВТ_рэОбъектыДляОбмена.Объект КАК Документ.ЗакрытиеЗаказов).Ссылка = ЗакрытиеЗаказовЗаказы.Ссылка)
		               |			ПО (ВТ_рэОбъектыДляОбмена.Заказ = РеализацияТоваровУслуг.Ссылка)
		               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НомераМест КАК ВТ_НомераМест
		               |			ПО РеализацияТоваровУслуг.Ссылка = ВТ_НомераМест.Заказ
		               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеЗаказа.СрезПоследних(
		               |					,
		               |					Заказ В
		               |						(ВЫБРАТЬ
		               |							ВТ_рэОбъектыДляОбмена.Заказ КАК Заказ
		               |						ИЗ
		               |							ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена)) КАК МестонахождениеЗаказаСрезПоследних
		               |			ПО РеализацияТоваровУслуг.Ссылка = МестонахождениеЗаказаСрезПоследних.Заказ
		               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Местонахождение КАК ВТ_Местонахождение
		               |			ПО РеализацияТоваровУслуг.Ссылка = ВТ_Местонахождение.Заказ
		               |		ПО новаЗаданияРейсов.Доставка.Номер = РеализацияТоваровУслуг.Номер
		               |ГДЕ
		               |	ЗакрытиеЗаказовЗаказы.ПричинаНевыполнения = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ОтказКлиентаСЗаездом)
		               |	И ЗакрытиеЗаказовЗаказы.Закрыть = ИСТИНА
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа,
		               |	ДокументРейс.Номер,
		               |	РеализацияТоваровУслуг.Ссылка,
		               |	""В"" + ПривязкаМашинКРейсамСрезПоследних.Водитель.Код,
		               |	ВТ_рэОбъектыДляОбмена.Период,
		               |	ВТ_рэОбъектыДляОбмена.Объект,
		               |	ЗакрытиеЗаказовЗаказы.Ссылка.Дата,
		               |	ЕСТЬNULL(ВТ_НомераМест.НомерМеста, 1),
		               |	ВТ_рэОбъектыДляОбмена.ДополнительнаяИнформация,
		               |	ВЫБОР
		               |		КОГДА ВЫБОР
		               |				КОГДА ВТ_Местонахождение.Терминал ЕСТЬ NULL
		               |						ИЛИ ВТ_Местонахождение.Терминал = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.ПустаяСсылка)
		               |					ТОГДА РеализацияТоваровУслуг.ТерминалДоставки
		               |				ИНАЧЕ ВТ_Местонахождение.Терминал
		               |			КОНЕЦ = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.МоскваСтриж)
		               |			ТОГДА 1
		               |		ИНАЧЕ 2
		               |	КОНЕЦ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_Реализации.InvoiceId КАК InvoiceId,
		               |	ВТ_Реализации.CourierId КАК CourierId,
		               |	ВТ_Реализации.RouteId КАК RouteId,
		               |	ВТ_Реализации.Объект КАК Объект,
		               |	ВТ_Реализации.TerminalIdCurrent КАК TerminalIdCurrent,
		               |	ВТ_Реализации.Заказ КАК Заказ,
		               |	ВТ_Реализации.DateUpdate КАК DateUpdate,
		               |	ВТ_Реализации.Период КАК Период,
		               |	ВТ_Реализации.PlaceId КАК PlaceId
		               |ИЗ
		               |	ВТ_Реализации КАК ВТ_Реализации";
		
		Запрос.УстановитьПараметр("Ссылка", ПараметрыСеанса.рэКомпанияRED);
		Запрос.УстановитьПараметр("Метод", ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"));
		Запрос.УстановитьПараметр("Операция", ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ОтказВоВремяДоставки"));

		Результат = Запрос.Выполнить();
		
		Если Результат.Пустой() Тогда
			Возврат Истина;
		КонецЕсли;
		
		ПутиПодключенения = рэИнтеграцияРэдЭкспресс.ПолучитьПодключениеКСервисуRED();
		
		WSОпр = Новый WSОпределения(ПутиПодключенения.WS_Путь, ПутиПодключенения.Пользователь, ПутиПодключенения.Пароль);	
		Прокси = Новый WSПрокси(WSОпр, "http://www.redexpress.ru/", "SyncService" , "SyncServiceSoap");

		Прокси.Пользователь = ПутиПодключенения.Пользователь;
		Прокси.Пароль = ПутиПодключенения.Пароль;
		
		InvoiceStatusТип = Прокси.ФабрикаXDTO.Тип("http://www.redexpress.ru/", "InvoiceStatus");
				
		InvoicePlaceStatusТип = Прокси.ФабрикаXDTO.Тип("http://www.redexpress.ru/", "InvoicePlaceStatus");
		
		ArrayOfInvoicePlaceStatusТип = Прокси.ФабрикаXDTO.Тип("http://www.redexpress.ru/", "ArrayOfInvoicePlaceStatus");
		
		ВыборкаДокументов = Результат.Выбрать();
		
		Пока ВыборкаДокументов.Следующий() Цикл
			
			Попытка
				
				InvoiceStatusбъект = Прокси.ФабрикаXDTO.Создать(InvoiceStatusТип);
				InvoiceStatusбъект.InvoiceId = ОбработатьВнешнийНомерДляРед(ВыборкаДокументов.InvoiceId);
				
				//InvoiceStatusбъект.DateUpdate = ТекущаяДата();
				//ДатаПроведенияДока = Вычислить("'" + ВыборкаДокументов.ДополнительнаяИнформация + "'");
				InvoiceStatusбъект.DateUpdate = ВыборкаДокументов.Период;
				
				InvoiceStatusбъект.Comment = "-";
				//InvoiceStatusбъект.CourierId = ВыборкаДокументов.CourierId;
				//InvoiceStatusбъект.RouteId = ВыборкаДокументов.RouteId;
				InvoiceStatusбъект.TerminalIdCurrent = ВыборкаДокументов.TerminalIdCurrent;
				
				ArrayOfInvoicePlaceStatusОбъект = Прокси.ФабрикаXDTO.Создать(ArrayOfInvoicePlaceStatusТип);
				
				InvoicePlaceStatusesОбъект = Прокси.ФабрикаXDTO.Создать(InvoicePlaceStatusТип);
				InvoicePlaceStatusesОбъект.PlaceId   = ВыборкаДокументов.PlaceId;
				InvoicePlaceStatusesОбъект.Status = "303";
				
				ArrayOfInvoicePlaceStatusОбъект.InvoicePlaceStatus.Добавить(InvoicePlaceStatusesОбъект);
				
				InvoiceStatusбъект.InvoicePlaceStatuses =  ArrayOfInvoicePlaceStatusОбъект;
				
				ЗаписьXML = Новый ЗаписьXML;
				ЗаписьXML.УстановитьСтроку();
				Прокси.ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, InvoiceStatusбъект);
				ДанныеXML_Данные = ЗаписьXML.Закрыть();	
				
				Ответ = Прокси.UpdateInvoiceStatus(InvoiceStatusбъект);
				
				ЗаписьXML = Новый ЗаписьXML;
				ЗаписьXML.УстановитьСтроку();
				Прокси.ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, Ответ);
				ДанныеXML_Ответ = ЗаписьXML.Закрыть();
				
				Если Ответ.Status = 200 Или Ответ.Status ="Success" Тогда
					
					ОбновитьрэОбъектыДляОбмена(ВыборкаДокументов.Период, ВыборкаДокументов.Объект, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"),ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ОтказВоВремяДоставки"), ВыборкаДокументов.Заказ, ТекущаяДата(), Истина, Справочники.СтатусыЗаказов.ОтказСЗаездом);
					
				Иначе 
					
					ОбновитьрэОбъектыДляОбмена(ВыборкаДокументов.Период, ВыборкаДокументов.Объект, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"),ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ОтказВоВремяДоставки"), ВыборкаДокументов.Заказ, ТекущаяДата(), Ложь, Справочники.СтатусыЗаказов.ОтказСЗаездом);
					
				КонецЕсли;	
				
				ЗаписатьЛог_рэЛогЗапросов(ВыборкаДокументов.Объект,  ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"),ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ОтказВоВремяДоставки"), ВыборкаДокументов.Заказ, Ответ.Status, ДанныеXML_Данные, ДанныеXML_Ответ);
				
			Исключение
				
				ЗаписатьЛог_рэЛогЗапросов(ВыборкаДокументов.Объект,  ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"),ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ОтказВоВремяДоставки"), ВыборкаДокументов.Заказ, "Общая ошибка", , ОписаниеОшибки());				
				Возврат Ложь;
				
			КонецПопытки;
			
			
		КонецЦикла; 
		
		
	Исключение	
		
		//ЗаписатьЛог_рэ_ЛогЗапросов("Общая ошибка", ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"), , , , ОписаниеОшибки());
		ЗаписатьЛог_рэЛогЗапросов(,ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"),ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ОтказВоВремяДоставки") , , "Общая ошибка", , ОписаниеОшибки());
		Возврат Ложь;
		
	КонецПопытки;		
	
	Возврат Истина; 

КонецФункции	

Функция REDПередачаДанныхОСтатусах_Перенос() Экспорт
	
	Попытка
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	рэОбъектыДляОбменаСрезПоследних.Период КАК Период,
		               |	рэОбъектыДляОбменаСрезПоследних.Объект КАК Объект,
		               |	рэОбъектыДляОбменаСрезПоследних.Заказ КАК Заказ,
		               |	рэОбъектыДляОбменаСрезПоследних.Метод КАК Метод,
		               |	рэОбъектыДляОбменаСрезПоследних.Операция КАК Операция
		               |ПОМЕСТИТЬ ВТ_рэОбъектыДляОбмена
		               |ИЗ
		               |	РегистрСведений.рэОбъектыДляОбмена.СрезПоследних(
		               |			,
		               |			Метод = &Метод
		               |				И Операция = &Операция) КАК рэОбъектыДляОбменаСрезПоследних
		               |ГДЕ
		               |	рэОбъектыДляОбменаСрезПоследних.ДанныеОтправлены = ЛОЖЬ
		               |	И рэОбъектыДляОбменаСрезПоследних.СчетчикВыгрузок < 20
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	МАКСИМУМ(МестонахождениеЗаказа.Период) КАК Период,
		               |	МестонахождениеЗаказа.Заказ КАК Заказ
		               |ПОМЕСТИТЬ ВТ_ПериодыСрезаМестонахождения
		               |ИЗ
		               |	ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеЗаказа КАК МестонахождениеЗаказа
		               |		ПО ВТ_рэОбъектыДляОбмена.Заказ = МестонахождениеЗаказа.Заказ
		               |			И ВТ_рэОбъектыДляОбмена.Период >= МестонахождениеЗаказа.Период
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	МестонахождениеЗаказа.Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	МестонахождениеЗаказа.Заказ КАК Заказ,
		               |	МестонахождениеЗаказа.Терминал КАК Терминал
		               |ПОМЕСТИТЬ ВТ_Местонахождение
		               |ИЗ
		               |	РегистрСведений.МестонахождениеЗаказа КАК МестонахождениеЗаказа
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПериодыСрезаМестонахождения КАК ВТ_ПериодыСрезаМестонахождения
		               |		ПО МестонахождениеЗаказа.Период = ВТ_ПериодыСрезаМестонахождения.Период
		               |			И МестонахождениеЗаказа.Заказ = ВТ_ПериодыСрезаМестонахождения.Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Контрагенты.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ ВТ_НужныеКонтрагенты
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	Контрагенты.Ссылка = &Ссылка
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	Контрагенты.Ссылка
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	Контрагенты.Родитель.ОсновнойМагазин = &Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_рэОбъектыДляОбмена.Период КАК Период,
		               |	ВТ_рэОбъектыДляОбмена.Объект КАК Объект,
		               |	ВТ_рэОбъектыДляОбмена.Заказ КАК Заказ,
		               |	ВТ_рэОбъектыДляОбмена.Метод КАК Метод,
		               |	ВТ_рэОбъектыДляОбмена.Операция КАК Операция,
		               |	рэОбъектыДляОбмена.ДополнительнаяИнформация КАК ДополнительнаяИнформация
		               |ПОМЕСТИТЬ ВТ_рэОбъектыДляОбмена_Ресурсы
		               |ИЗ
		               |	ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.рэОбъектыДляОбмена КАК рэОбъектыДляОбмена
		               |		ПО ВТ_рэОбъектыДляОбмена.Период = рэОбъектыДляОбмена.Период
		               |			И ВТ_рэОбъектыДляОбмена.Объект = рэОбъектыДляОбмена.Объект
		               |			И ВТ_рэОбъектыДляОбмена.Заказ = рэОбъектыДляОбмена.Заказ
		               |			И ВТ_рэОбъектыДляОбмена.Метод = рэОбъектыДляОбмена.Метод
		               |			И ВТ_рэОбъектыДляОбмена.Операция = рэОбъектыДляОбмена.Операция
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ШтрихкодыЗаказов.Заказ КАК Заказ,
		               |	МАКСИМУМ(ШтрихкодыЗаказов.НомерМеста) КАК НомерМеста
		               |ПОМЕСТИТЬ ВТ_НомераМест
		               |ИЗ
		               |	ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыЗаказов КАК ШтрихкодыЗаказов
		               |		ПО ВТ_рэОбъектыДляОбмена.Заказ = ШтрихкодыЗаказов.Заказ
		               |ГДЕ
		               |	ШтрихкодыЗаказов.НомерМеста <> 0
		               |	И ШтрихкодыЗаказов.ДокументТСД = ЗНАЧЕНИЕ(Документ.ЗагрузкаСТСД.ПустаяСсылка)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ШтрихкодыЗаказов.Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	новаОтчетВодителяЗадания.ДатаПереноса КАК DateDeliveryTransfer,
		               |	новаМестнаяДоставка.ДатаСоздания КАК TimeDeliveryTransfer,
		               |	новаМестнаяДоставка.ВремяОтправленияС КАК Start,
		               |	новаМестнаяДоставка.ВремяОтправленияПо КАК End,
		               |	РеализацияТоваровУслуг.Контрагент.Наименование КАК RecipientSurname,
		               |	РеализацияТоваровУслуг.Телефон КАК RecipientPhone,
		               |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа КАК InvoiceId,
		               |	ВТ_НомераМест.НомерМеста КАК PlaceId,
		               |	ВТ_рэОбъектыДляОбмена_Ресурсы.Объект КАК Объект,
		               |	ВТ_рэОбъектыДляОбмена_Ресурсы.Заказ КАК Заказ,
		               |	ВЫБОР
		               |		КОГДА ВЫБОР
		               |				КОГДА ВТ_Местонахождение.Терминал ЕСТЬ NULL
		               |						ИЛИ ВТ_Местонахождение.Терминал = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.ПустаяСсылка)
		               |					ТОГДА РеализацияТоваровУслуг.ТерминалДоставки
		               |				ИНАЧЕ ВТ_Местонахождение.Терминал
		               |			КОНЕЦ = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.МоскваСтриж)
		               |			ТОГДА 1
		               |		ИНАЧЕ 2
		               |	КОНЕЦ КАК TerminalIdCurrent,
		               |	ВТ_рэОбъектыДляОбмена_Ресурсы.Период КАК Период
		               |ИЗ
		               |	БизнесПроцесс.новаМестнаяДоставка КАК новаМестнаяДоставка
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.новаОтчетВодителя.Задания КАК новаОтчетВодителяЗадания
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_рэОбъектыДляОбмена_Ресурсы КАК ВТ_рэОбъектыДляОбмена_Ресурсы
		               |			ПО новаОтчетВодителяЗадания.Ссылка = ВТ_рэОбъектыДляОбмена_Ресурсы.Объект
		               |				И новаОтчетВодителяЗадания.Задание.Номер = ВТ_рэОбъектыДляОбмена_Ресурсы.Заказ.Номер
		               |		ПО новаМестнаяДоставка.Ссылка = новаОтчетВодителяЗадания.Задание
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НужныеКонтрагенты КАК ВТ_НужныеКонтрагенты
		               |			ПО РеализацияТоваровУслуг.Контрагент = ВТ_НужныеКонтрагенты.Ссылка
		               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НомераМест КАК ВТ_НомераМест
		               |			ПО РеализацияТоваровУслуг.Ссылка = ВТ_НомераМест.Заказ
		               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеЗаказа.СрезПоследних(
		               |					,
		               |					Заказ В
		               |						(ВЫБРАТЬ
		               |							ВТ_рэОбъектыДляОбмена.Заказ КАК Заказ
		               |						ИЗ
		               |							ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена)) КАК МестонахождениеЗаказаСрезПоследних
		               |			ПО РеализацияТоваровУслуг.Ссылка = МестонахождениеЗаказаСрезПоследних.Заказ
		               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Местонахождение КАК ВТ_Местонахождение
		               |			ПО РеализацияТоваровУслуг.Ссылка = ВТ_Местонахождение.Заказ
		               |		ПО новаМестнаяДоставка.Номер = РеализацияТоваровУслуг.Номер
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ДанныеЗаказаВодителя.ДатаПереноса,
		               |	новаМестнаяДоставка.ДатаСоздания,
		               |	новаМестнаяДоставка.ВремяОтправленияС,
		               |	новаМестнаяДоставка.ВремяОтправленияПо,
		               |	РеализацияТоваровУслуг.Контрагент.Наименование,
		               |	РеализацияТоваровУслуг.Телефон,
		               |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа,
		               |	ВТ_НомераМест.НомерМеста,
		               |	ВТ_рэОбъектыДляОбмена_Ресурсы.Объект,
		               |	ВТ_рэОбъектыДляОбмена_Ресурсы.Заказ,
		               |	ВЫБОР
		               |		КОГДА ВЫБОР
		               |				КОГДА ВТ_Местонахождение.Терминал ЕСТЬ NULL
		               |						ИЛИ ВТ_Местонахождение.Терминал = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.ПустаяСсылка)
		               |					ТОГДА РеализацияТоваровУслуг.ТерминалДоставки
		               |				ИНАЧЕ ВТ_Местонахождение.Терминал
		               |			КОНЕЦ = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.МоскваСтриж)
		               |			ТОГДА 1
		               |		ИНАЧЕ 2
		               |	КОНЕЦ,
		               |	ВТ_рэОбъектыДляОбмена_Ресурсы.Период
		               |ИЗ
		               |	БизнесПроцесс.новаМестнаяДоставка КАК новаМестнаяДоставка
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НужныеКонтрагенты КАК ВТ_НужныеКонтрагенты
		               |			ПО РеализацияТоваровУслуг.Контрагент = ВТ_НужныеКонтрагенты.Ссылка
		               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НомераМест КАК ВТ_НомераМест
		               |			ПО РеализацияТоваровУслуг.Ссылка = ВТ_НомераМест.Заказ
		               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеЗаказа.СрезПоследних(
		               |					,
		               |					Заказ В
		               |						(ВЫБРАТЬ
		               |							ВТ_рэОбъектыДляОбмена.Заказ КАК Заказ
		               |						ИЗ
		               |							ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена)) КАК МестонахождениеЗаказаСрезПоследних
		               |			ПО РеализацияТоваровУслуг.Ссылка = МестонахождениеЗаказаСрезПоследних.Заказ
		               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Местонахождение КАК ВТ_Местонахождение
		               |			ПО РеализацияТоваровУслуг.Ссылка = ВТ_Местонахождение.Заказ
		               |		ПО новаМестнаяДоставка.Номер = РеализацияТоваровУслуг.Номер
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ДанныеЗаказаВодителя КАК ДанныеЗаказаВодителя
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_рэОбъектыДляОбмена_Ресурсы КАК ВТ_рэОбъектыДляОбмена_Ресурсы
		               |			ПО ДанныеЗаказаВодителя.Ссылка = ВТ_рэОбъектыДляОбмена_Ресурсы.Объект
		               |				И ДанныеЗаказаВодителя.Реализация = ВТ_рэОбъектыДляОбмена_Ресурсы.Заказ
		               |		ПО новаМестнаяДоставка.Номер = ДанныеЗаказаВодителя.Реализация.Номер";
		
		Запрос.УстановитьПараметр("Ссылка", ПараметрыСеанса.рэКомпанияRED);
		Запрос.УстановитьПараметр("Метод", ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"));
		Запрос.УстановитьПараметр("Операция", ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.Перенос"));

		Результат = Запрос.Выполнить();
		
		Если Результат.Пустой() Тогда
			Возврат Истина;
		КонецЕсли;
		
		ПутиПодключенения = рэИнтеграцияРэдЭкспресс.ПолучитьПодключениеКСервисуRED();
		
		WSОпр = Новый WSОпределения(ПутиПодключенения.WS_Путь, ПутиПодключенения.Пользователь, ПутиПодключенения.Пароль);	
		Прокси = Новый WSПрокси(WSОпр, "http://www.redexpress.ru/", "SyncService" , "SyncServiceSoap");

		Прокси.Пользователь = ПутиПодключенения.Пользователь;
		Прокси.Пароль = ПутиПодключенения.Пароль;
		
		InvoiceStatusТип = Прокси.ФабрикаXDTO.Тип("http://www.redexpress.ru/", "InvoiceStatus");
				
		InvoicePlaceStatusТип = Прокси.ФабрикаXDTO.Тип("http://www.redexpress.ru/", "InvoicePlaceStatus");
		
		ArrayOfInvoicePlaceStatusТип = Прокси.ФабрикаXDTO.Тип("http://www.redexpress.ru/", "ArrayOfInvoicePlaceStatus");
		
		TimeIntervalТип = Прокси.ФабрикаXDTO.Тип("http://www.redexpress.ru/", "TimeInterval");
		
		ВыборкаДокументов = Результат.Выбрать();
		
		Пока ВыборкаДокументов.Следующий() Цикл
			
			Попытка
				
				InvoiceStatusбъект = Прокси.ФабрикаXDTO.Создать(InvoiceStatusТип);
				InvoiceStatusбъект.InvoiceId = ОбработатьВнешнийНомерДляРед(ВыборкаДокументов.InvoiceId);
				InvoiceStatusбъект.DateDelivery = ТекущаяДата();
				InvoiceStatusбъект.DateDeliveryTransfer = ВыборкаДокументов.DateDeliveryTransfer;
				//InvoiceStatusбъект.TimeDeliveryTransfer = ВыборкаДокументов.TimeDeliveryTransfer ;
				
				//ДатаПроведенияДока = Вычислить("'" + ВыборкаДокументов.ДополнительнаяИнформация + "'");
				InvoiceStatusбъект.DateUpdate = ВыборкаДокументов.Период;
				
				InvoiceStatusбъект.RecipientSurname = ВыборкаДокументов.RecipientSurname;
				InvoiceStatusбъект.RecipientPhone = ВыборкаДокументов.RecipientPhone;
				
				InvoiceStatusбъект.TerminalIdCurrent = ВыборкаДокументов.TerminalIdCurrent;
				
				TimeIntervalОбъект =  Прокси.ФабрикаXDTO.Создать(TimeIntervalТип);
	    	    TimeIntervalОбъект.Start = ВыборкаДокументов.Start;
    	    	TimeIntervalОбъект.End = ВыборкаДокументов.End;
				
				InvoiceStatusбъект.TimeDeliveryTransfer = TimeIntervalОбъект;
				
				ArrayOfInvoicePlaceStatusОбъект = Прокси.ФабрикаXDTO.Создать(ArrayOfInvoicePlaceStatusТип);
				
				InvoicePlaceStatusesОбъект = Прокси.ФабрикаXDTO.Создать(InvoicePlaceStatusТип);
				InvoicePlaceStatusesОбъект.PlaceId   = ВыборкаДокументов.PlaceId;
				InvoicePlaceStatusesОбъект.Status = "232";
				
				ArrayOfInvoicePlaceStatusОбъект.InvoicePlaceStatus.Добавить(InvoicePlaceStatusesОбъект);
				
				InvoiceStatusбъект.InvoicePlaceStatuses =  ArrayOfInvoicePlaceStatusОбъект;
				
				ЗаписьXML = Новый ЗаписьXML;
				ЗаписьXML.УстановитьСтроку();
				Прокси.ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, InvoiceStatusбъект);
				ДанныеXML_Данные = ЗаписьXML.Закрыть();	
				
				Ответ = Прокси.UpdateInvoiceStatus(InvoiceStatusбъект);
				
				ЗаписьXML = Новый ЗаписьXML;
				ЗаписьXML.УстановитьСтроку();
				Прокси.ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, Ответ);
				ДанныеXML_Ответ = ЗаписьXML.Закрыть();
				
				Если Ответ.Status = 200 Или Ответ.Status ="Success" Тогда
					
					ОбновитьрэОбъектыДляОбмена(ВыборкаДокументов.Период, ВыборкаДокументов.Объект, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"),ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.Перенос"), ВыборкаДокументов.Заказ, ТекущаяДата(), Истина, Справочники.СтатусыЗаказов.Перенос);
					
				Иначе 
					
					ОбновитьрэОбъектыДляОбмена(ВыборкаДокументов.Период, ВыборкаДокументов.Объект, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"),ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.Перенос"), ВыборкаДокументов.Заказ, ТекущаяДата(), Ложь, Справочники.СтатусыЗаказов.Перенос);
					
				КонецЕсли;	
				
				ЗаписатьЛог_рэЛогЗапросов(ВыборкаДокументов.Объект,  ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"),ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.Перенос"), ВыборкаДокументов.Заказ, Ответ.Status, ДанныеXML_Данные, ДанныеXML_Ответ);
				
			Исключение
				
				ЗаписатьЛог_рэЛогЗапросов(ВыборкаДокументов.Объект,  ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"),ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.Перенос"), ВыборкаДокументов.Заказ, "Общая ошибка", , ОписаниеОшибки());				
				Возврат Ложь;
				
			КонецПопытки;
			
			
		КонецЦикла; 
		
		
	Исключение	
		
		//ЗаписатьЛог_рэ_ЛогЗапросов("Общая ошибка", ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"), , , , ОписаниеОшибки());
		ЗаписатьЛог_рэЛогЗапросов(,ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"),ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.Перенос") , , "Общая ошибка", , ОписаниеОшибки());
		Возврат Ложь;
		
	КонецПопытки;		
	
	Возврат Истина; 

КонецФункции

Функция REDПередачаДанныхОСтатусах_ЧастичнаяДоставка() Экспорт
	
	Попытка
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	рэОбъектыДляОбменаСрезПоследних.Период КАК Период,
		               |	рэОбъектыДляОбменаСрезПоследних.Объект КАК Объект,
		               |	рэОбъектыДляОбменаСрезПоследних.Метод КАК Метод,
		               |	рэОбъектыДляОбменаСрезПоследних.Операция КАК Операция,
		               |	рэОбъектыДляОбменаСрезПоследних.Заказ КАК Заказ,
		               |	рэОбъектыДляОбменаСрезПоследних.ДополнительнаяИнформация КАК ДополнительнаяИнформация
		               |ПОМЕСТИТЬ ВТ_рэОбъектыДляОбмена
		               |ИЗ
		               |	РегистрСведений.рэОбъектыДляОбмена.СрезПоследних(, ) КАК рэОбъектыДляОбменаСрезПоследних
		               |ГДЕ
		               |	рэОбъектыДляОбменаСрезПоследних.Метод = &Метод
		               |	И рэОбъектыДляОбменаСрезПоследних.Операция = &Операция
		               |	И рэОбъектыДляОбменаСрезПоследних.ДанныеОтправлены = ЛОЖЬ
   		               |	И рэОбъектыДляОбменаСрезПоследних.СчетчикВыгрузок < 20
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	МАКСИМУМ(МестонахождениеЗаказа.Период) КАК Период,
		               |	МестонахождениеЗаказа.Заказ КАК Заказ
		               |ПОМЕСТИТЬ ВТ_ПериодыСрезаМестонахождения
		               |ИЗ
		               |	ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеЗаказа КАК МестонахождениеЗаказа
		               |		ПО ВТ_рэОбъектыДляОбмена.Заказ = МестонахождениеЗаказа.Заказ
		               |			И ВТ_рэОбъектыДляОбмена.Период >= МестонахождениеЗаказа.Период
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	МестонахождениеЗаказа.Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	МестонахождениеЗаказа.Заказ КАК Заказ,
		               |	МестонахождениеЗаказа.Терминал КАК Терминал
		               |ПОМЕСТИТЬ ВТ_Местонахождение
		               |ИЗ
		               |	РегистрСведений.МестонахождениеЗаказа КАК МестонахождениеЗаказа
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПериодыСрезаМестонахождения КАК ВТ_ПериодыСрезаМестонахождения
		               |		ПО МестонахождениеЗаказа.Период = ВТ_ПериодыСрезаМестонахождения.Период
		               |			И МестонахождениеЗаказа.Заказ = ВТ_ПериодыСрезаМестонахождения.Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ШтрихкодыЗаказов.Заказ КАК Заказ,
		               |	МАКСИМУМ(ШтрихкодыЗаказов.НомерМеста) КАК НомерМеста
		               |ПОМЕСТИТЬ ВТ_НомераМест
		               |ИЗ
		               |	ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыЗаказов КАК ШтрихкодыЗаказов
		               |		ПО ВТ_рэОбъектыДляОбмена.Заказ = ШтрихкодыЗаказов.Заказ
		               |ГДЕ
		               |	ШтрихкодыЗаказов.НомерМеста <> 0
		               |	И ШтрихкодыЗаказов.ДокументТСД = ЗНАЧЕНИЕ(Документ.ЗагрузкаСТСД.ПустаяСсылка)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ШтрихкодыЗаказов.Заказ
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Контрагенты.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ ВТ_НужныеКонтрагенты
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	Контрагенты.Ссылка = &Ссылка
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	Контрагенты.Ссылка
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	Контрагенты.Родитель.ОсновнойМагазин = &Ссылка
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЗакрытиеЗаказовТовары.Ссылка КАК Ссылка,
		               |	ЗакрытиеЗаказовТовары.Реализация КАК Реализация
		               |ПОМЕСТИТЬ ВТ_ЗакрытиеЗаказовТовары
		               |ИЗ
		               |	ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗакрытиеЗаказов.Товары КАК ЗакрытиеЗаказовТовары
		               |		ПО (ВЫРАЗИТЬ(ВТ_рэОбъектыДляОбмена.Заказ КАК Документ.РеализацияТоваровУслуг).Ссылка = ЗакрытиеЗаказовТовары.Реализация)
		               |			И (ВЫРАЗИТЬ(ВТ_рэОбъектыДляОбмена.Объект КАК Документ.ЗакрытиеЗаказов).Ссылка = ЗакрытиеЗаказовТовары.Ссылка)
		               |ГДЕ
		               |	ЗакрытиеЗаказовТовары.КоличествоВозвращено <> 0
		               |	И ЗакрытиеЗаказовТовары.Недовложение = 0
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЗакрытиеЗаказовТовары.Ссылка,
		               |	ЗакрытиеЗаказовТовары.Реализация
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа КАК InvoiceId,
		               |	""В"" + ПривязкаМашинКРейсамСрезПоследних.Водитель.Код КАК CourierId,
		               |	ДокументРейс.Номер КАК RouteId,
		               |	ВЫБОР
		               |		КОГДА ВЫБОР
		               |				КОГДА ВТ_Местонахождение.Терминал ЕСТЬ NULL
		               |						ИЛИ ВТ_Местонахождение.Терминал = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.ПустаяСсылка)
		               |					ТОГДА РеализацияТоваровУслуг.ТерминалДоставки
		               |				ИНАЧЕ ВТ_Местонахождение.Терминал
		               |			КОНЕЦ = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.МоскваСтриж)
		               |			ТОГДА 1
		               |		ИНАЧЕ 2
		               |	КОНЕЦ КАК TerminalIdCurrent,
		               |	РеализацияТоваровУслуг.Ссылка КАК Заказ,
		               |	ЗакрытиеЗаказовЗаказы.Ссылка.Дата КАК DateUpdate,
		               |	ВТ_рэОбъектыДляОбмена.Период КАК Период,
		               |	ВТ_рэОбъектыДляОбмена.Объект КАК Объект,
		               |	ЕСТЬNULL(ВТ_НомераМест.НомерМеста, 1) КАК PlaceId,
		               |	ВТ_рэОбъектыДляОбмена.ДополнительнаяИнформация КАК ДополнительнаяИнформация
		               |ПОМЕСТИТЬ ВТ_Реализации
		               |ИЗ
		               |	РегистрСведений.новаЗаданияРейсов КАК новаЗаданияРейсов
		               |		ПОЛНОЕ СОЕДИНЕНИЕ БизнесПроцесс.новаРейсМестнойДоставки КАК новаРейсМестнойДоставки
		               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Рейс КАК ДокументРейс
		               |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних КАК ПривязкаМашинКРейсамСрезПоследних
		               |				ПО ДокументРейс.Ссылка = ПривязкаМашинКРейсамСрезПоследних.Рейс
		               |			ПО новаРейсМестнойДоставки.Ссылка = ДокументРейс.РейсМестнойДоставки
		               |		ПО новаЗаданияРейсов.Рейс = новаРейсМестнойДоставки.Ссылка
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НужныеКонтрагенты КАК ВТ_НужныеКонтрагенты
		               |			ПО РеализацияТоваровУслуг.ВладелецТовара = ВТ_НужныеКонтрагенты.Ссылка
		               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗакрытиеЗаказов.Заказы КАК ЗакрытиеЗаказовЗаказы
		               |					ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗакрытиеЗаказовТовары КАК ВТ_ЗакрытиеЗаказовТовары
		               |					ПО ЗакрытиеЗаказовЗаказы.Ссылка = ВТ_ЗакрытиеЗаказовТовары.Ссылка
		               |						И ЗакрытиеЗаказовЗаказы.Реализация = ВТ_ЗакрытиеЗаказовТовары.Реализация
		               |				ПО (ВЫРАЗИТЬ(ВТ_рэОбъектыДляОбмена.Заказ КАК Документ.РеализацияТоваровУслуг).Ссылка = ЗакрытиеЗаказовЗаказы.Реализация)
		               |					И (ВЫРАЗИТЬ(ВТ_рэОбъектыДляОбмена.Объект КАК Документ.ЗакрытиеЗаказов).Ссылка = ЗакрытиеЗаказовЗаказы.Ссылка)
		               |			ПО (ВТ_рэОбъектыДляОбмена.Заказ = РеализацияТоваровУслуг.Ссылка)
		               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НомераМест КАК ВТ_НомераМест
		               |			ПО РеализацияТоваровУслуг.Ссылка = ВТ_НомераМест.Заказ
		               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Местонахождение КАК ВТ_Местонахождение
		               |			ПО РеализацияТоваровУслуг.Ссылка = ВТ_Местонахождение.Заказ
		               |		ПО новаЗаданияРейсов.Доставка.Номер = РеализацияТоваровУслуг.Номер
		               |ГДЕ
		               |	ЗакрытиеЗаказовЗаказы.Закрыть = ИСТИНА
		               |	И (ЗакрытиеЗаказовЗаказы.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.Выполнена)
		               |			ИЛИ ЗакрытиеЗаказовЗаказы.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.ВыполненаЧастично))
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа,
		               |	ДокументРейс.Номер,
		               |	РеализацияТоваровУслуг.Ссылка,
		               |	""В"" + ПривязкаМашинКРейсамСрезПоследних.Водитель.Код,
		               |	ВТ_рэОбъектыДляОбмена.Период,
		               |	ВТ_рэОбъектыДляОбмена.Объект,
		               |	ЗакрытиеЗаказовЗаказы.Ссылка.Дата,
		               |	ЕСТЬNULL(ВТ_НомераМест.НомерМеста, 1),
		               |	ВТ_рэОбъектыДляОбмена.ДополнительнаяИнформация,
		               |	ВЫБОР
		               |		КОГДА ВЫБОР
		               |				КОГДА ВТ_Местонахождение.Терминал ЕСТЬ NULL
		               |						ИЛИ ВТ_Местонахождение.Терминал = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.ПустаяСсылка)
		               |					ТОГДА РеализацияТоваровУслуг.ТерминалДоставки
		               |				ИНАЧЕ ВТ_Местонахождение.Терминал
		               |			КОНЕЦ = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.МоскваСтриж)
		               |			ТОГДА 1
		               |		ИНАЧЕ 2
		               |	КОНЕЦ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_Реализации.InvoiceId КАК InvoiceId,
		               |	ВТ_Реализации.CourierId КАК CourierId,
		               |	ВТ_Реализации.RouteId КАК RouteId,
		               |	ВТ_Реализации.Объект КАК Объект,
		               |	ВТ_Реализации.TerminalIdCurrent КАК TerminalIdCurrent,
		               |	ВТ_Реализации.Заказ КАК Заказ,
		               |	ВТ_Реализации.DateUpdate КАК DateUpdate,
		               |	ВТ_Реализации.Период КАК Период,
		               |	ВТ_Реализации.PlaceId КАК PlaceId,
		               |	ВТ_Реализации.ДополнительнаяИнформация КАК ДополнительнаяИнформация
		               |ИЗ
		               |	ВТ_Реализации КАК ВТ_Реализации";
		
		Запрос.УстановитьПараметр("Ссылка", ПараметрыСеанса.рэКомпанияRED);
		Запрос.УстановитьПараметр("Метод", ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"));
		Запрос.УстановитьПараметр("Операция", ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ЧастичнаяДоставка"));

		Результат = Запрос.Выполнить();
		
		Если Результат.Пустой() Тогда
			Возврат Истина;
		КонецЕсли;
		
		ПутиПодключенения = рэИнтеграцияРэдЭкспресс.ПолучитьПодключениеКСервисуRED();
		
		WSОпр = Новый WSОпределения(ПутиПодключенения.WS_Путь, ПутиПодключенения.Пользователь, ПутиПодключенения.Пароль);	
		Прокси = Новый WSПрокси(WSОпр, "http://www.redexpress.ru/", "SyncService" , "SyncServiceSoap");

		Прокси.Пользователь = ПутиПодключенения.Пользователь;
		Прокси.Пароль = ПутиПодключенения.Пароль;
		
		InvoiceStatusТип = Прокси.ФабрикаXDTO.Тип("http://www.redexpress.ru/", "InvoiceStatus");
				
		InvoicePlaceStatusТип = Прокси.ФабрикаXDTO.Тип("http://www.redexpress.ru/", "InvoicePlaceStatus");
		
		ArrayOfInvoicePlaceStatusТип = Прокси.ФабрикаXDTO.Тип("http://www.redexpress.ru/", "ArrayOfInvoicePlaceStatus");
		
		ВыборкаДокументов = Результат.Выбрать();
		
		Пока ВыборкаДокументов.Следующий() Цикл
			
			Попытка
				
				InvoiceStatusбъект = Прокси.ФабрикаXDTO.Создать(InvoiceStatusТип);
				InvoiceStatusбъект.InvoiceId = ОбработатьВнешнийНомерДляРед(ВыборкаДокументов.InvoiceId);
				
				//InvoiceStatusбъект.DateUpdate = ТекущаяДата();
				//ДатаПроведенияДока = Вычислить("'" + ВыборкаДокументов.ДополнительнаяИнформация + "'");
				InvoiceStatusбъект.DateUpdate = ВыборкаДокументов.Период;
				
				InvoiceStatusбъект.Comment = "-";
				//InvoiceStatusбъект.CourierId = ВыборкаДокументов.CourierId;
				//InvoiceStatusбъект.RouteId = ВыборкаДокументов.RouteId;
				InvoiceStatusбъект.TerminalIdCurrent = ВыборкаДокументов.TerminalIdCurrent;
				
				ArrayOfInvoicePlaceStatusОбъект = Прокси.ФабрикаXDTO.Создать(ArrayOfInvoicePlaceStatusТип);
				
				InvoicePlaceStatusesОбъект = Прокси.ФабрикаXDTO.Создать(InvoicePlaceStatusТип);
				InvoicePlaceStatusesОбъект.PlaceId   = ВыборкаДокументов.PlaceId;
				InvoicePlaceStatusesОбъект.Status = "302";
				
				ArrayOfInvoicePlaceStatusОбъект.InvoicePlaceStatus.Добавить(InvoicePlaceStatusesОбъект);
				
				InvoiceStatusбъект.InvoicePlaceStatuses =  ArrayOfInvoicePlaceStatusОбъект;
				
				ЗаписьXML = Новый ЗаписьXML;
				ЗаписьXML.УстановитьСтроку();
				Прокси.ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, InvoiceStatusбъект);
				ДанныеXML_Данные = ЗаписьXML.Закрыть();	
				
				Ответ = Прокси.UpdateInvoiceStatus(InvoiceStatusбъект);
				
				ЗаписьXML = Новый ЗаписьXML;
				ЗаписьXML.УстановитьСтроку();
				Прокси.ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, Ответ);
				ДанныеXML_Ответ = ЗаписьXML.Закрыть();
				
				Если Ответ.Status = 200 Или Ответ.Status ="Success" Тогда
					
					ОбновитьрэОбъектыДляОбмена(ВыборкаДокументов.Период, ВыборкаДокументов.Объект, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"),ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ЧастичнаяДоставка"), ВыборкаДокументов.Заказ, ТекущаяДата(), Истина, Справочники.СтатусыЗаказов.ВыполненЧастично);
					
				Иначе 
					
					ОбновитьрэОбъектыДляОбмена(ВыборкаДокументов.Период, ВыборкаДокументов.Объект, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"),ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ЧастичнаяДоставка"), ВыборкаДокументов.Заказ, ТекущаяДата(), Ложь, Справочники.СтатусыЗаказов.ВыполненЧастично);
					
				КонецЕсли;	
				
				ЗаписатьЛог_рэЛогЗапросов(ВыборкаДокументов.Объект,  ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"),ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ЧастичнаяДоставка"), ВыборкаДокументов.Заказ, Ответ.Status, ДанныеXML_Данные, ДанныеXML_Ответ);
				
			Исключение
				
				ЗаписатьЛог_рэЛогЗапросов(ВыборкаДокументов.Объект,  ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"),ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ЧастичнаяДоставка"), ВыборкаДокументов.Заказ, "Общая ошибка", , ОписаниеОшибки());				
				Возврат Ложь;
				
			КонецПопытки;
			
			
		КонецЦикла; 
		
		
	Исключение	
		
		//ЗаписатьЛог_рэ_ЛогЗапросов("Общая ошибка", ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"), , , , ОписаниеОшибки());
		ЗаписатьЛог_рэЛогЗапросов(,ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"),ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ЧастичнаяДоставка") , , "Общая ошибка", , ОписаниеОшибки());
		Возврат Ложь;
		
	КонецПопытки;		
	
	Возврат Истина; 

КонецФункции	

Функция REDПередачаДанныхОСтатусах_ЧастичнаяДоставкаСНедовложением() Экспорт
	
	Попытка
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	рэОбъектыДляОбменаСрезПоследних.Период КАК Период,
		               |	рэОбъектыДляОбменаСрезПоследних.Объект КАК Объект,
		               |	рэОбъектыДляОбменаСрезПоследних.Метод КАК Метод,
		               |	рэОбъектыДляОбменаСрезПоследних.Операция КАК Операция,
		               |	рэОбъектыДляОбменаСрезПоследних.Заказ КАК Заказ,
		               |	рэОбъектыДляОбменаСрезПоследних.ДополнительнаяИнформация КАК ДополнительнаяИнформация
		               |ПОМЕСТИТЬ ВТ_рэОбъектыДляОбмена
		               |ИЗ
		               |	РегистрСведений.рэОбъектыДляОбмена.СрезПоследних(, ) КАК рэОбъектыДляОбменаСрезПоследних
		               |ГДЕ
		               |	рэОбъектыДляОбменаСрезПоследних.Метод = &Метод
		               |	И рэОбъектыДляОбменаСрезПоследних.Операция = &Операция
		               |	И рэОбъектыДляОбменаСрезПоследних.ДанныеОтправлены = ЛОЖЬ
   		               |	И рэОбъектыДляОбменаСрезПоследних.СчетчикВыгрузок < 20
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	МАКСИМУМ(МестонахождениеЗаказа.Период) КАК Период,
		               |	МестонахождениеЗаказа.Заказ КАК Заказ
		               |ПОМЕСТИТЬ ВТ_ПериодыСрезаМестонахождения
		               |ИЗ
		               |	ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеЗаказа КАК МестонахождениеЗаказа
		               |		ПО ВТ_рэОбъектыДляОбмена.Заказ = МестонахождениеЗаказа.Заказ
		               |			И ВТ_рэОбъектыДляОбмена.Период >= МестонахождениеЗаказа.Период
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	МестонахождениеЗаказа.Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	МестонахождениеЗаказа.Заказ КАК Заказ,
		               |	МестонахождениеЗаказа.Терминал КАК Терминал
		               |ПОМЕСТИТЬ ВТ_Местонахождение
		               |ИЗ
		               |	РегистрСведений.МестонахождениеЗаказа КАК МестонахождениеЗаказа
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПериодыСрезаМестонахождения КАК ВТ_ПериодыСрезаМестонахождения
		               |		ПО МестонахождениеЗаказа.Период = ВТ_ПериодыСрезаМестонахождения.Период
		               |			И МестонахождениеЗаказа.Заказ = ВТ_ПериодыСрезаМестонахождения.Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ШтрихкодыЗаказов.Заказ КАК Заказ,
		               |	МАКСИМУМ(ШтрихкодыЗаказов.НомерМеста) КАК НомерМеста
		               |ПОМЕСТИТЬ ВТ_НомераМест
		               |ИЗ
		               |	ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыЗаказов КАК ШтрихкодыЗаказов
		               |		ПО ВТ_рэОбъектыДляОбмена.Заказ = ШтрихкодыЗаказов.Заказ
		               |ГДЕ
		               |	ШтрихкодыЗаказов.НомерМеста <> 0
		               |	И ШтрихкодыЗаказов.ДокументТСД = ЗНАЧЕНИЕ(Документ.ЗагрузкаСТСД.ПустаяСсылка)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ШтрихкодыЗаказов.Заказ
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Контрагенты.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ ВТ_НужныеКонтрагенты
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	Контрагенты.Ссылка = &Ссылка
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	Контрагенты.Ссылка
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	Контрагенты.Родитель.ОсновнойМагазин = &Ссылка
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЗакрытиеЗаказовТовары.Ссылка КАК Ссылка,
		               |	ЗакрытиеЗаказовТовары.Реализация КАК Реализация
		               |ПОМЕСТИТЬ ВТ_ЗакрытиеЗаказовТовары
		               |ИЗ
		               |	ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗакрытиеЗаказов.Товары КАК ЗакрытиеЗаказовТовары
		               |		ПО (ВЫРАЗИТЬ(ВТ_рэОбъектыДляОбмена.Заказ КАК Документ.РеализацияТоваровУслуг).Ссылка = ЗакрытиеЗаказовТовары.Реализация)
		               |			И (ВЫРАЗИТЬ(ВТ_рэОбъектыДляОбмена.Объект КАК Документ.ЗакрытиеЗаказов).Ссылка = ЗакрытиеЗаказовТовары.Ссылка)
		               |ГДЕ
		               |	ЗакрытиеЗаказовТовары.КоличествоВозвращено = 0
		               |	И ЗакрытиеЗаказовТовары.Недовложение <> 0
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЗакрытиеЗаказовТовары.Ссылка,
		               |	ЗакрытиеЗаказовТовары.Реализация
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа КАК InvoiceId,
		               |	""В"" + ПривязкаМашинКРейсамСрезПоследних.Водитель.Код КАК CourierId,
		               |	ДокументРейс.Номер КАК RouteId,
		               |	ВЫБОР
		               |		КОГДА ВЫБОР
		               |				КОГДА ВТ_Местонахождение.Терминал ЕСТЬ NULL
		               |						ИЛИ ВТ_Местонахождение.Терминал = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.ПустаяСсылка)
		               |					ТОГДА РеализацияТоваровУслуг.ТерминалДоставки
		               |				ИНАЧЕ ВТ_Местонахождение.Терминал
		               |			КОНЕЦ = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.МоскваСтриж)
		               |			ТОГДА 1
		               |		ИНАЧЕ 2
		               |	КОНЕЦ КАК TerminalIdCurrent,
		               |	РеализацияТоваровУслуг.Ссылка КАК Заказ,
		               |	ЗакрытиеЗаказовЗаказы.Ссылка.Дата КАК DateUpdate,
		               |	ВТ_рэОбъектыДляОбмена.Период КАК Период,
		               |	ВТ_рэОбъектыДляОбмена.Объект КАК Объект,
		               |	ЕСТЬNULL(ВТ_НомераМест.НомерМеста, 1) КАК PlaceId,
		               |	ВТ_рэОбъектыДляОбмена.ДополнительнаяИнформация КАК ДополнительнаяИнформация
		               |ПОМЕСТИТЬ ВТ_Реализации
		               |ИЗ
		               |	РегистрСведений.новаЗаданияРейсов КАК новаЗаданияРейсов
		               |		ПОЛНОЕ СОЕДИНЕНИЕ БизнесПроцесс.новаРейсМестнойДоставки КАК новаРейсМестнойДоставки
		               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Рейс КАК ДокументРейс
		               |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних КАК ПривязкаМашинКРейсамСрезПоследних
		               |				ПО ДокументРейс.Ссылка = ПривязкаМашинКРейсамСрезПоследних.Рейс
		               |			ПО новаРейсМестнойДоставки.Ссылка = ДокументРейс.РейсМестнойДоставки
		               |		ПО новаЗаданияРейсов.Рейс = новаРейсМестнойДоставки.Ссылка
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НужныеКонтрагенты КАК ВТ_НужныеКонтрагенты
		               |			ПО РеализацияТоваровУслуг.ВладелецТовара = ВТ_НужныеКонтрагенты.Ссылка
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗакрытиеЗаказов.Заказы КАК ЗакрытиеЗаказовЗаказы
		               |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗакрытиеЗаказовТовары КАК ВТ_ЗакрытиеЗаказовТовары
		               |					ПО ЗакрытиеЗаказовЗаказы.Ссылка = ВТ_ЗакрытиеЗаказовТовары.Ссылка
		               |						И ЗакрытиеЗаказовЗаказы.Реализация = ВТ_ЗакрытиеЗаказовТовары.Реализация
		               |				ПО (ВЫРАЗИТЬ(ВТ_рэОбъектыДляОбмена.Заказ КАК Документ.РеализацияТоваровУслуг).Ссылка = ЗакрытиеЗаказовЗаказы.Реализация)
		               |					И (ВЫРАЗИТЬ(ВТ_рэОбъектыДляОбмена.Объект КАК Документ.ЗакрытиеЗаказов).Ссылка = ЗакрытиеЗаказовЗаказы.Ссылка)
		               |			ПО (ВТ_рэОбъектыДляОбмена.Заказ = РеализацияТоваровУслуг.Ссылка)
		               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НомераМест КАК ВТ_НомераМест
		               |			ПО РеализацияТоваровУслуг.Ссылка = ВТ_НомераМест.Заказ
		               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Местонахождение КАК ВТ_Местонахождение
		               |			ПО РеализацияТоваровУслуг.Ссылка = ВТ_Местонахождение.Заказ
		               |		ПО новаЗаданияРейсов.Доставка.Номер = РеализацияТоваровУслуг.Номер
		               |ГДЕ
		               |	ЗакрытиеЗаказовЗаказы.Закрыть = ИСТИНА
		               |	И (ЗакрытиеЗаказовЗаказы.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.Выполнена)
		               |			ИЛИ ЗакрытиеЗаказовЗаказы.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.ВыполненаЧастично))
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа,
		               |	ДокументРейс.Номер,
		               |	РеализацияТоваровУслуг.Ссылка,
		               |	""В"" + ПривязкаМашинКРейсамСрезПоследних.Водитель.Код,
		               |	ВТ_рэОбъектыДляОбмена.Период,
		               |	ВТ_рэОбъектыДляОбмена.Объект,
		               |	ЗакрытиеЗаказовЗаказы.Ссылка.Дата,
		               |	ЕСТЬNULL(ВТ_НомераМест.НомерМеста, 1),
		               |	ВТ_рэОбъектыДляОбмена.ДополнительнаяИнформация,
		               |	ВЫБОР
		               |		КОГДА ВЫБОР
		               |				КОГДА ВТ_Местонахождение.Терминал ЕСТЬ NULL
		               |						ИЛИ ВТ_Местонахождение.Терминал = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.ПустаяСсылка)
		               |					ТОГДА РеализацияТоваровУслуг.ТерминалДоставки
		               |				ИНАЧЕ ВТ_Местонахождение.Терминал
		               |			КОНЕЦ = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.МоскваСтриж)
		               |			ТОГДА 1
		               |		ИНАЧЕ 2
		               |	КОНЕЦ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_Реализации.InvoiceId КАК InvoiceId,
		               |	ВТ_Реализации.CourierId КАК CourierId,
		               |	ВТ_Реализации.RouteId КАК RouteId,
		               |	ВТ_Реализации.Объект КАК Объект,
		               |	ВТ_Реализации.TerminalIdCurrent КАК TerminalIdCurrent,
		               |	ВТ_Реализации.Заказ КАК Заказ,
		               |	ВТ_Реализации.DateUpdate КАК DateUpdate,
		               |	ВТ_Реализации.Период КАК Период,
		               |	ВТ_Реализации.PlaceId КАК PlaceId,
		               |	ВТ_Реализации.ДополнительнаяИнформация КАК ДополнительнаяИнформация
		               |ИЗ
		               |	ВТ_Реализации КАК ВТ_Реализации";
		
		Запрос.УстановитьПараметр("Ссылка", ПараметрыСеанса.рэКомпанияRED);
		Запрос.УстановитьПараметр("Метод", ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"));
		Запрос.УстановитьПараметр("Операция", ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ЧастичнаяДоставкаСНедовложением"));

		Результат = Запрос.Выполнить();
		
		Если Результат.Пустой() Тогда
			Возврат Истина;
		КонецЕсли;
		
		ПутиПодключенения = рэИнтеграцияРэдЭкспресс.ПолучитьПодключениеКСервисуRED();
		
		WSОпр = Новый WSОпределения(ПутиПодключенения.WS_Путь, ПутиПодключенения.Пользователь, ПутиПодключенения.Пароль);	
		Прокси = Новый WSПрокси(WSОпр, "http://www.redexpress.ru/", "SyncService" , "SyncServiceSoap");

		Прокси.Пользователь = ПутиПодключенения.Пользователь;
		Прокси.Пароль = ПутиПодключенения.Пароль;
		
		InvoiceStatusТип = Прокси.ФабрикаXDTO.Тип("http://www.redexpress.ru/", "InvoiceStatus");
				
		InvoicePlaceStatusТип = Прокси.ФабрикаXDTO.Тип("http://www.redexpress.ru/", "InvoicePlaceStatus");
		
		ArrayOfInvoicePlaceStatusТип = Прокси.ФабрикаXDTO.Тип("http://www.redexpress.ru/", "ArrayOfInvoicePlaceStatus");
		
		ВыборкаДокументов = Результат.Выбрать();
		
		Пока ВыборкаДокументов.Следующий() Цикл
			
			Попытка
				
				InvoiceStatusбъект = Прокси.ФабрикаXDTO.Создать(InvoiceStatusТип);
				InvoiceStatusбъект.InvoiceId = ОбработатьВнешнийНомерДляРед(ВыборкаДокументов.InvoiceId);
				
				//InvoiceStatusбъект.DateUpdate = ТекущаяДата();
				//ДатаПроведенияДока = Вычислить("'" + ВыборкаДокументов.ДополнительнаяИнформация + "'");
				InvoiceStatusбъект.DateUpdate = ВыборкаДокументов.Период;
				
				InvoiceStatusбъект.Comment = "-";
				//InvoiceStatusбъект.CourierId = ВыборкаДокументов.CourierId;
				//InvoiceStatusбъект.RouteId = ВыборкаДокументов.RouteId;
				InvoiceStatusбъект.TerminalIdCurrent = ВыборкаДокументов.TerminalIdCurrent;
				
				ArrayOfInvoicePlaceStatusОбъект = Прокси.ФабрикаXDTO.Создать(ArrayOfInvoicePlaceStatusТип);
				
				InvoicePlaceStatusesОбъект = Прокси.ФабрикаXDTO.Создать(InvoicePlaceStatusТип);
				InvoicePlaceStatusesОбъект.PlaceId   = ВыборкаДокументов.PlaceId;
				InvoicePlaceStatusesОбъект.Status = "1002";
				
				ArrayOfInvoicePlaceStatusОбъект.InvoicePlaceStatus.Добавить(InvoicePlaceStatusesОбъект);
				
				InvoiceStatusбъект.InvoicePlaceStatuses =  ArrayOfInvoicePlaceStatusОбъект;
				
				ЗаписьXML = Новый ЗаписьXML;
				ЗаписьXML.УстановитьСтроку();
				Прокси.ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, InvoiceStatusбъект);
				ДанныеXML_Данные = ЗаписьXML.Закрыть();	
				
				Ответ = Прокси.UpdateInvoiceStatus(InvoiceStatusбъект);
				
				ЗаписьXML = Новый ЗаписьXML;
				ЗаписьXML.УстановитьСтроку();
				Прокси.ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, Ответ);
				ДанныеXML_Ответ = ЗаписьXML.Закрыть();
				
				Если Ответ.Status = 200 Или Ответ.Status ="Success" Тогда
					
					ОбновитьрэОбъектыДляОбмена(ВыборкаДокументов.Период, ВыборкаДокументов.Объект, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"),ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ЧастичнаяДоставкаСНедовложением"), ВыборкаДокументов.Заказ, ТекущаяДата(), Истина, Справочники.СтатусыЗаказов.ВыполненЧастичноСНедовложением);
					
				Иначе 
					
					ОбновитьрэОбъектыДляОбмена(ВыборкаДокументов.Период, ВыборкаДокументов.Объект, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"),ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ЧастичнаяДоставкаСНедовложением"), ВыборкаДокументов.Заказ, ТекущаяДата(), Ложь, Справочники.СтатусыЗаказов.ВыполненЧастичноСНедовложением);
					
				КонецЕсли;	
				
				ЗаписатьЛог_рэЛогЗапросов(ВыборкаДокументов.Объект,  ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"),ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ЧастичнаяДоставкаСНедовложением"), ВыборкаДокументов.Заказ, Ответ.Status, ДанныеXML_Данные, ДанныеXML_Ответ);
				
			Исключение
				
				ЗаписатьЛог_рэЛогЗапросов(ВыборкаДокументов.Объект,  ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"),ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ЧастичнаяДоставкаСНедовложением"), ВыборкаДокументов.Заказ, "Общая ошибка", , ОписаниеОшибки());				
				Возврат Ложь;
				
			КонецПопытки;
			
			
		КонецЦикла; 
		
		
	Исключение	
		
		//ЗаписатьЛог_рэ_ЛогЗапросов("Общая ошибка", ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"), , , , ОписаниеОшибки());
		ЗаписатьЛог_рэЛогЗапросов(,ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"),ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ЧастичнаяДоставкаСНедовложением") , , "Общая ошибка", , ОписаниеОшибки());
		Возврат Ложь;
		
	КонецПопытки;		
	
	Возврат Истина; 

КонецФункции	

Функция REDПередачаДанныхОСтатусах_Выполнен() Экспорт
	
	Попытка
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	рэОбъектыДляОбменаСрезПоследних.Период КАК Период,
		               |	рэОбъектыДляОбменаСрезПоследних.Объект КАК Объект,
		               |	рэОбъектыДляОбменаСрезПоследних.Метод КАК Метод,
		               |	рэОбъектыДляОбменаСрезПоследних.Операция КАК Операция,
		               |	рэОбъектыДляОбменаСрезПоследних.Заказ КАК Заказ,
		               |	рэОбъектыДляОбменаСрезПоследних.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
		               |	рэОбъектыДляОбменаСрезПоследних.Заказ.ВладелецТовара КАК ЗаказВладелецТовара
		               |ПОМЕСТИТЬ ВТ_рэОбъектыДляОбмена
		               |ИЗ
		               |	РегистрСведений.рэОбъектыДляОбмена.СрезПоследних(, ) КАК рэОбъектыДляОбменаСрезПоследних
		               |ГДЕ
		               |	рэОбъектыДляОбменаСрезПоследних.Метод = &Метод
		               |	И рэОбъектыДляОбменаСрезПоследних.Операция = &Операция
		               |	И рэОбъектыДляОбменаСрезПоследних.ДанныеОтправлены = ЛОЖЬ
		               |	И рэОбъектыДляОбменаСрезПоследних.СчетчикВыгрузок < 20
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	МАКСИМУМ(МестонахождениеЗаказа.Период) КАК Период,
		               |	МестонахождениеЗаказа.Заказ КАК Заказ
		               |ПОМЕСТИТЬ ВТ_ПериодыСрезаМестонахождения
		               |ИЗ
		               |	ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеЗаказа КАК МестонахождениеЗаказа
		               |		ПО ВТ_рэОбъектыДляОбмена.Заказ = МестонахождениеЗаказа.Заказ
		               |			И ВТ_рэОбъектыДляОбмена.Период >= МестонахождениеЗаказа.Период
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	МестонахождениеЗаказа.Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	МестонахождениеЗаказа.Заказ КАК Заказ,
		               |	МестонахождениеЗаказа.Терминал КАК Терминал
		               |ПОМЕСТИТЬ ВТ_Местонахождение
		               |ИЗ
		               |	РегистрСведений.МестонахождениеЗаказа КАК МестонахождениеЗаказа
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПериодыСрезаМестонахождения КАК ВТ_ПериодыСрезаМестонахождения
		               |		ПО МестонахождениеЗаказа.Период = ВТ_ПериодыСрезаМестонахождения.Период
		               |			И МестонахождениеЗаказа.Заказ = ВТ_ПериодыСрезаМестонахождения.Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ШтрихкодыЗаказов.Заказ КАК Заказ,
		               |	МАКСИМУМ(ШтрихкодыЗаказов.НомерМеста) КАК НомерМеста
		               |ПОМЕСТИТЬ ВТ_НомераМест
		               |ИЗ
		               |	ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыЗаказов КАК ШтрихкодыЗаказов
		               |		ПО ВТ_рэОбъектыДляОбмена.Заказ = ШтрихкодыЗаказов.Заказ
		               |ГДЕ
		               |	ШтрихкодыЗаказов.НомерМеста <> 0
		               |	И ШтрихкодыЗаказов.ДокументТСД = ЗНАЧЕНИЕ(Документ.ЗагрузкаСТСД.ПустаяСсылка)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ШтрихкодыЗаказов.Заказ
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Контрагенты.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ ВТ_НужныеКонтрагенты
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	Контрагенты.Ссылка = &Ссылка
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	Контрагенты.Ссылка
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	Контрагенты.Родитель.ОсновнойМагазин = &Ссылка
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_рэОбъектыДляОбмена.Объект КАК Ссылка,
		               |	ВТ_рэОбъектыДляОбмена.Заказ КАК Реализация
		               |ПОМЕСТИТЬ ВТ_ЗакрытиеЗаказовТовары
		               |ИЗ
		               |	ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗакрытиеЗаказов.Товары КАК ЗакрытиеЗаказовТовары
		               |		ПО (ВЫРАЗИТЬ(ВТ_рэОбъектыДляОбмена.Заказ КАК Документ.РеализацияТоваровУслуг).Ссылка = ЗакрытиеЗаказовТовары.Реализация)
		               |			И (ВЫРАЗИТЬ(ВТ_рэОбъектыДляОбмена.Объект КАК Документ.ЗакрытиеЗаказов).Ссылка = ЗакрытиеЗаказовТовары.Ссылка)
		               |ГДЕ
		               |	ЗакрытиеЗаказовТовары.КоличествоВозвращено = 0
		               |	И ЗакрытиеЗаказовТовары.Недовложение = 0
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВТ_рэОбъектыДляОбмена.Объект,
		               |	ВТ_рэОбъектыДляОбмена.Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа КАК InvoiceId,
		               |	""В"" + ПривязкаМашинКРейсамСрезПоследних.Водитель.Код КАК CourierId,
		               |	ДокументРейс.Номер КАК RouteId,
		               |	ВЫБОР
		               |		КОГДА ВЫБОР
		               |				КОГДА ВТ_Местонахождение.Терминал ЕСТЬ NULL
		               |						ИЛИ ВТ_Местонахождение.Терминал = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.ПустаяСсылка)
		               |					ТОГДА РеализацияТоваровУслуг.ТерминалДоставки
		               |				ИНАЧЕ ВТ_Местонахождение.Терминал
		               |			КОНЕЦ = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.МоскваСтриж)
		               |			ТОГДА 1
		               |		ИНАЧЕ 2
		               |	КОНЕЦ КАК TerminalIdCurrent,
		               |	РеализацияТоваровУслуг.Ссылка КАК Заказ,
		               |	ЗакрытиеЗаказовЗаказы.Ссылка.Дата КАК DateUpdate,
		               |	ВТ_рэОбъектыДляОбмена.Период КАК Период,
		               |	ВТ_рэОбъектыДляОбмена.Объект КАК Объект,
		               |	ЕСТЬNULL(ВТ_НомераМест.НомерМеста, 1) КАК PlaceId,
		               |	ВТ_рэОбъектыДляОбмена.ДополнительнаяИнформация КАК ДополнительнаяИнформация
		               |ПОМЕСТИТЬ ВТ_Реализации
		               |ИЗ
		               |	РегистрСведений.новаЗаданияРейсов КАК новаЗаданияРейсов
		               |		ПОЛНОЕ СОЕДИНЕНИЕ БизнесПроцесс.новаРейсМестнойДоставки КАК новаРейсМестнойДоставки
		               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Рейс КАК ДокументРейс
		               |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних КАК ПривязкаМашинКРейсамСрезПоследних
		               |				ПО ДокументРейс.Ссылка = ПривязкаМашинКРейсамСрезПоследних.Рейс
		               |			ПО новаРейсМестнойДоставки.Ссылка = ДокументРейс.РейсМестнойДоставки
		               |		ПО новаЗаданияРейсов.Рейс = новаРейсМестнойДоставки.Ссылка
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НужныеКонтрагенты КАК ВТ_НужныеКонтрагенты
		               |			ПО РеализацияТоваровУслуг.ВладелецТовара = ВТ_НужныеКонтрагенты.Ссылка
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗакрытиеЗаказов.Заказы КАК ЗакрытиеЗаказовЗаказы
		               |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗакрытиеЗаказовТовары КАК ВТ_ЗакрытиеЗаказовТовары
		               |					ПО ЗакрытиеЗаказовЗаказы.Ссылка = ВТ_ЗакрытиеЗаказовТовары.Ссылка
		               |						И ЗакрытиеЗаказовЗаказы.Реализация = ВТ_ЗакрытиеЗаказовТовары.Реализация
		               |				ПО (ВЫРАЗИТЬ(ВТ_рэОбъектыДляОбмена.Заказ КАК Документ.РеализацияТоваровУслуг).Ссылка = ЗакрытиеЗаказовЗаказы.Реализация)
		               |					И (ВЫРАЗИТЬ(ВТ_рэОбъектыДляОбмена.Объект КАК Документ.ЗакрытиеЗаказов).Ссылка = ЗакрытиеЗаказовЗаказы.Ссылка)
		               |			ПО (ВТ_рэОбъектыДляОбмена.Заказ = РеализацияТоваровУслуг.Ссылка)
		               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НомераМест КАК ВТ_НомераМест
		               |			ПО РеализацияТоваровУслуг.Ссылка = ВТ_НомераМест.Заказ
		               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Местонахождение КАК ВТ_Местонахождение
		               |			ПО РеализацияТоваровУслуг.Ссылка = ВТ_Местонахождение.Заказ
		               |		ПО новаЗаданияРейсов.Доставка.Номер = РеализацияТоваровУслуг.Номер
		               |ГДЕ
		               |	ЗакрытиеЗаказовЗаказы.Закрыть = ИСТИНА
		               |	И ЗакрытиеЗаказовЗаказы.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.Выполнена)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа,
		               |	ДокументРейс.Номер,
		               |	РеализацияТоваровУслуг.Ссылка,
		               |	""В"" + ПривязкаМашинКРейсамСрезПоследних.Водитель.Код,
		               |	ВТ_рэОбъектыДляОбмена.Период,
		               |	ВТ_рэОбъектыДляОбмена.Объект,
		               |	ЗакрытиеЗаказовЗаказы.Ссылка.Дата,
		               |	ЕСТЬNULL(ВТ_НомераМест.НомерМеста, 1),
		               |	ВТ_рэОбъектыДляОбмена.ДополнительнаяИнформация,
		               |	ВЫБОР
		               |		КОГДА ВЫБОР
		               |				КОГДА ВТ_Местонахождение.Терминал ЕСТЬ NULL
		               |						ИЛИ ВТ_Местонахождение.Терминал = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.ПустаяСсылка)
		               |					ТОГДА РеализацияТоваровУслуг.ТерминалДоставки
		               |				ИНАЧЕ ВТ_Местонахождение.Терминал
		               |			КОНЕЦ = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.МоскваСтриж)
		               |			ТОГДА 1
		               |		ИНАЧЕ 2
		               |	КОНЕЦ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа КАК InvoiceId,
		               |	""В"" + ПривязкаМашинКРейсамСрезПоследних.Водитель.Код КАК CourierId,
		               |	ДокументРейс.Номер КАК RouteId,
		               |	ВЫБОР
		               |		КОГДА ВЫБОР
		               |				КОГДА ВТ_Местонахождение.Терминал ЕСТЬ NULL
		               |						ИЛИ ВТ_Местонахождение.Терминал = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.ПустаяСсылка)
		               |					ТОГДА РеализацияТоваровУслуг.ТерминалДоставки
		               |				ИНАЧЕ ВТ_Местонахождение.Терминал
		               |			КОНЕЦ = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.МоскваСтриж)
		               |			ТОГДА 1
		               |		ИНАЧЕ 2
		               |	КОНЕЦ КАК TerminalIdCurrent,
		               |	РеализацияТоваровУслуг.Ссылка КАК Заказ,
		               |	ДанныеЗаказаВодителя.Ссылка.Дата КАК DateUpdate,
		               |	ВТ_рэОбъектыДляОбмена.Период КАК Период,
		               |	ВТ_рэОбъектыДляОбмена.Объект КАК Объект,
		               |	ЕСТЬNULL(ВТ_НомераМест.НомерМеста, 1) КАК PlaceId,
		               |	ВТ_рэОбъектыДляОбмена.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
		               |	ДокументРейс.Ссылка КАК Рейс
		               |ПОМЕСТИТЬ ВТ_ДанныеЗаказаВодителя_Заказы
		               |ИЗ
		               |	РегистрСведений.новаЗаданияРейсов КАК новаЗаданияРейсов
		               |		ПОЛНОЕ СОЕДИНЕНИЕ БизнесПроцесс.новаРейсМестнойДоставки КАК новаРейсМестнойДоставки
		               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Рейс КАК ДокументРейс
		               |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних КАК ПривязкаМашинКРейсамСрезПоследних
		               |				ПО ДокументРейс.Ссылка = ПривязкаМашинКРейсамСрезПоследних.Рейс
		               |			ПО новаРейсМестнойДоставки.Ссылка = ДокументРейс.РейсМестнойДоставки
		               |		ПО новаЗаданияРейсов.Рейс = новаРейсМестнойДоставки.Ссылка
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НужныеКонтрагенты КАК ВТ_НужныеКонтрагенты
		               |			ПО РеализацияТоваровУслуг.ВладелецТовара = ВТ_НужныеКонтрагенты.Ссылка
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ДанныеЗаказаВодителя КАК ДанныеЗаказаВодителя
		               |				ПО (ВЫРАЗИТЬ(ВТ_рэОбъектыДляОбмена.Заказ КАК Документ.РеализацияТоваровУслуг).Ссылка = ДанныеЗаказаВодителя.Реализация)
		               |					И (ВЫРАЗИТЬ(ВТ_рэОбъектыДляОбмена.Объект КАК Документ.ДанныеЗаказаВодителя).Ссылка = ДанныеЗаказаВодителя.Ссылка)
		               |			ПО (ВТ_рэОбъектыДляОбмена.Заказ = РеализацияТоваровУслуг.Ссылка)
		               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НомераМест КАК ВТ_НомераМест
		               |			ПО РеализацияТоваровУслуг.Ссылка = ВТ_НомераМест.Заказ
		               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Местонахождение КАК ВТ_Местонахождение
		               |			ПО РеализацияТоваровУслуг.Ссылка = ВТ_Местонахождение.Заказ
		               |		ПО новаЗаданияРейсов.Доставка.Номер = РеализацияТоваровУслуг.Номер
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа,
		               |	ДокументРейс.Номер,
		               |	РеализацияТоваровУслуг.Ссылка,
		               |	""В"" + ПривязкаМашинКРейсамСрезПоследних.Водитель.Код,
		               |	ВТ_рэОбъектыДляОбмена.Период,
		               |	ВТ_рэОбъектыДляОбмена.Объект,
		               |	ДанныеЗаказаВодителя.Ссылка.Дата,
		               |	ЕСТЬNULL(ВТ_НомераМест.НомерМеста, 1),
		               |	ВТ_рэОбъектыДляОбмена.ДополнительнаяИнформация,
		               |	ВЫБОР
		               |		КОГДА ВЫБОР
		               |				КОГДА ВТ_Местонахождение.Терминал ЕСТЬ NULL
		               |						ИЛИ ВТ_Местонахождение.Терминал = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.ПустаяСсылка)
		               |					ТОГДА РеализацияТоваровУслуг.ТерминалДоставки
		               |				ИНАЧЕ ВТ_Местонахождение.Терминал
		               |			КОНЕЦ = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.МоскваСтриж)
		               |			ТОГДА 1
		               |		ИНАЧЕ 2
		               |	КОНЕЦ,
		               |	ДокументРейс.Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЗаборТовара.НомерВнешнегоЗаказа КАК InvoiceId,
		               |	""В"" + ЗаборТовара.Водитель.Код КАК CourierId,
		               |	РейсЗаказы.Ссылка.Номер КАК RouteId,
		               |	РейсЗаказы.Ссылка.Дата КАК DateUpdate,
		               |	ВЫБОР
		               |		КОГДА ЗаборТовара.ТерминалПриемки = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.МоскваСтриж)
		               |			ТОГДА 1
		               |		ИНАЧЕ 2
		               |	КОНЕЦ КАК TerminalIdCurrent,
		               |	ВТ_рэОбъектыДляОбмена.Объект КАК Объект,
		               |	ЗаборТовара.Ссылка КАК Заказ,
		               |	ВТ_рэОбъектыДляОбмена.Период КАК Период,
		               |	1 КАК PlaceId,
		               |	ВТ_рэОбъектыДляОбмена.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
		               |	РейсЗаказы.Ссылка КАК Рейс
		               |ПОМЕСТИТЬ ВТ_Заборы
		               |ИЗ
		               |	Документ.ЗаборТовара КАК ЗаборТовара
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Рейс.Заказы КАК РейсЗаказы
		               |		ПО (РейсЗаказы.Заказ = ЗаборТовара.Ссылка)
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НужныеКонтрагенты КАК ВТ_НужныеКонтрагенты
		               |		ПО ЗаборТовара.Контрагент = ВТ_НужныеКонтрагенты.Ссылка
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |		ПО (ВЫРАЗИТЬ(ВТ_рэОбъектыДляОбмена.Заказ КАК Документ.ЗаборТовара).Ссылка = ЗаборТовара.Ссылка)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЗаборТовара.Ссылка,
		               |	ЗаборТовара.НомерВнешнегоЗаказа,
		               |	""В"" + ЗаборТовара.Водитель.Код,
		               |	РейсЗаказы.Ссылка.Номер,
		               |	РейсЗаказы.Ссылка.Дата,
		               |	ВЫБОР
		               |		КОГДА ЗаборТовара.ТерминалПриемки = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.МоскваСтриж)
		               |			ТОГДА 1
		               |		ИНАЧЕ 2
		               |	КОНЕЦ,
		               |	ВТ_рэОбъектыДляОбмена.Период,
		               |	ВТ_рэОбъектыДляОбмена.ДополнительнаяИнформация,
		               |	ВТ_рэОбъектыДляОбмена.Объект,
		               |	РейсЗаказы.Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_Заборы.InvoiceId КАК InvoiceId,
		               |	ВТ_Заборы.CourierId КАК CourierId,
		               |	ВТ_Заборы.RouteId КАК RouteId,
		               |	ВТ_Заборы.DateUpdate КАК DateUpdate,
		               |	ВТ_Заборы.TerminalIdCurrent КАК TerminalIdCurrent,
		               |	ВТ_Заборы.Объект КАК Объект,
		               |	ВТ_Заборы.Заказ КАК Заказ,
		               |	ВТ_Заборы.Период КАК Период,
		               |	ВТ_Заборы.PlaceId КАК PlaceId,
		               |	ВТ_Заборы.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
		               |	ВТ_Заборы.Рейс КАК Рейс
		               |ПОМЕСТИТЬ ВТ_Общее_ОперативныеСтатусы
		               |ИЗ
		               |	ВТ_Заборы КАК ВТ_Заборы
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ВТ_ДанныеЗаказаВодителя_Заказы.InvoiceId,
		               |	ВТ_ДанныеЗаказаВодителя_Заказы.CourierId,
		               |	ВТ_ДанныеЗаказаВодителя_Заказы.RouteId,
		               |	ВТ_ДанныеЗаказаВодителя_Заказы.DateUpdate,
		               |	ВТ_ДанныеЗаказаВодителя_Заказы.TerminalIdCurrent,
		               |	ВТ_ДанныеЗаказаВодителя_Заказы.Объект,
		               |	ВТ_ДанныеЗаказаВодителя_Заказы.Заказ,
		               |	ВТ_ДанныеЗаказаВодителя_Заказы.Период,
		               |	ВТ_ДанныеЗаказаВодителя_Заказы.PlaceId,
		               |	ВТ_ДанныеЗаказаВодителя_Заказы.ДополнительнаяИнформация,
		               |	ВТ_ДанныеЗаказаВодителя_Заказы.Рейс
		               |ИЗ
		               |	ВТ_ДанныеЗаказаВодителя_Заказы КАК ВТ_ДанныеЗаказаВодителя_Заказы
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_Общее_ОперативныеСтатусы.Заказ КАК Заказ,
		               |	МАКСИМУМ(ВТ_Общее_ОперативныеСтатусы.Рейс.Дата) КАК РейсДата
		               |ПОМЕСТИТЬ ВТ_ПоследнийРейс
		               |ИЗ
		               |	ВТ_Общее_ОперативныеСтатусы КАК ВТ_Общее_ОперативныеСтатусы
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВТ_Общее_ОперативныеСтатусы.Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_Реализации.InvoiceId КАК InvoiceId,
		               |	ВТ_Реализации.CourierId КАК CourierId,
		               |	ВТ_Реализации.RouteId КАК RouteId,
		               |	ВТ_Реализации.Объект КАК Объект,
		               |	ВТ_Реализации.TerminalIdCurrent КАК TerminalIdCurrent,
		               |	ВТ_Реализации.Заказ КАК Заказ,
		               |	ВТ_Реализации.DateUpdate КАК DateUpdate,
		               |	ВТ_Реализации.Период КАК Период,
		               |	ВТ_Реализации.PlaceId КАК PlaceId,
		               |	ВТ_Реализации.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
		               |	NULL КАК Рейс
		               |ИЗ
		               |	ВТ_Реализации КАК ВТ_Реализации
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ВТ_Общее_ОперативныеСтатусы.InvoiceId,
		               |	ВТ_Общее_ОперативныеСтатусы.CourierId,
		               |	ВТ_Общее_ОперативныеСтатусы.RouteId,
		               |	ВТ_Общее_ОперативныеСтатусы.Объект,
		               |	ВТ_Общее_ОперативныеСтатусы.TerminalIdCurrent,
		               |	ВТ_Общее_ОперативныеСтатусы.Заказ,
		               |	ВТ_Общее_ОперативныеСтатусы.DateUpdate,
		               |	ВТ_Общее_ОперативныеСтатусы.Период,
		               |	ВТ_Общее_ОперативныеСтатусы.PlaceId,
		               |	ВТ_Общее_ОперативныеСтатусы.ДополнительнаяИнформация,
		               |	ВТ_Общее_ОперативныеСтатусы.Рейс
		               |ИЗ
		               |	ВТ_Общее_ОперативныеСтатусы КАК ВТ_Общее_ОперативныеСтатусы
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПоследнийРейс КАК ВТ_ПоследнийРейс
		               |		ПО ВТ_Общее_ОперативныеСтатусы.Заказ = ВТ_ПоследнийРейс.Заказ
		               |			И ВТ_Общее_ОперативныеСтатусы.Рейс.Дата = ВТ_ПоследнийРейс.РейсДата";
		
		Запрос.УстановитьПараметр("Ссылка", ПараметрыСеанса.рэКомпанияRED);
		Запрос.УстановитьПараметр("Метод", ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"));
		Запрос.УстановитьПараметр("Операция", ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.Выполнен"));

		Результат = Запрос.Выполнить();
		
		Если Результат.Пустой() Тогда
			Возврат Истина;
		КонецЕсли;
		
		ПутиПодключенения = рэИнтеграцияРэдЭкспресс.ПолучитьПодключениеКСервисуRED();
		
		WSОпр = Новый WSОпределения(ПутиПодключенения.WS_Путь, ПутиПодключенения.Пользователь, ПутиПодключенения.Пароль);	
		Прокси = Новый WSПрокси(WSОпр, "http://www.redexpress.ru/", "SyncService" , "SyncServiceSoap");

		Прокси.Пользователь = ПутиПодключенения.Пользователь;
		Прокси.Пароль = ПутиПодключенения.Пароль;
		
		InvoiceStatusТип = Прокси.ФабрикаXDTO.Тип("http://www.redexpress.ru/", "InvoiceStatus");
				
		InvoicePlaceStatusТип = Прокси.ФабрикаXDTO.Тип("http://www.redexpress.ru/", "InvoicePlaceStatus");
		
		ArrayOfInvoicePlaceStatusТип = Прокси.ФабрикаXDTO.Тип("http://www.redexpress.ru/", "ArrayOfInvoicePlaceStatus");
		
		ВыборкаДокументов = Результат.Выбрать();
		
		Пока ВыборкаДокументов.Следующий() Цикл
			
			Попытка
				
				InvoiceStatusбъект = Прокси.ФабрикаXDTO.Создать(InvoiceStatusТип);
				InvoiceStatusбъект.InvoiceId = ОбработатьВнешнийНомерДляРед(ВыборкаДокументов.InvoiceId);
				
				//InvoiceStatusбъект.DateUpdate = ТекущаяДата();
				//ДатаПроведенияДока = Вычислить("'" + ВыборкаДокументов.ДополнительнаяИнформация + "'");
				InvoiceStatusбъект.DateUpdate = ВыборкаДокументов.Период;
				
				InvoiceStatusбъект.Comment = "-";
				//InvoiceStatusбъект.CourierId = ВыборкаДокументов.CourierId;
				//InvoiceStatusбъект.RouteId = ВыборкаДокументов.RouteId;
				InvoiceStatusбъект.TerminalIdCurrent = ВыборкаДокументов.TerminalIdCurrent;
				
				ArrayOfInvoicePlaceStatusОбъект = Прокси.ФабрикаXDTO.Создать(ArrayOfInvoicePlaceStatusТип);
				
				InvoicePlaceStatusesОбъект = Прокси.ФабрикаXDTO.Создать(InvoicePlaceStatusТип);
				InvoicePlaceStatusesОбъект.PlaceId   = ВыборкаДокументов.PlaceId;
				InvoicePlaceStatusesОбъект.Status = "301";
				
				ArrayOfInvoicePlaceStatusОбъект.InvoicePlaceStatus.Добавить(InvoicePlaceStatusesОбъект);
				
				InvoiceStatusбъект.InvoicePlaceStatuses =  ArrayOfInvoicePlaceStatusОбъект;
				
				ЗаписьXML = Новый ЗаписьXML;
				ЗаписьXML.УстановитьСтроку();
				Прокси.ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, InvoiceStatusбъект);
				ДанныеXML_Данные = ЗаписьXML.Закрыть();	
				
				Ответ = Прокси.UpdateInvoiceStatus(InvoiceStatusбъект);
				
				ЗаписьXML = Новый ЗаписьXML;
				ЗаписьXML.УстановитьСтроку();
				Прокси.ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, Ответ);
				ДанныеXML_Ответ = ЗаписьXML.Закрыть();
				
				Если Ответ.Status = 200 Или Ответ.Status ="Success" Тогда
					
					ОбновитьрэОбъектыДляОбмена(ВыборкаДокументов.Период, ВыборкаДокументов.Объект, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"),ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.Выполнен"), ВыборкаДокументов.Заказ, ТекущаяДата(), Истина, Справочники.СтатусыЗаказов.Выполнен);
					
				Иначе 
					
					ОбновитьрэОбъектыДляОбмена(ВыборкаДокументов.Период, ВыборкаДокументов.Объект, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"),ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.Выполнен"), ВыборкаДокументов.Заказ, ТекущаяДата(), Ложь, Справочники.СтатусыЗаказов.Выполнен);
					
				КонецЕсли;	
				
				ЗаписатьЛог_рэЛогЗапросов(ВыборкаДокументов.Объект,  ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"),ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.Выполнен"), ВыборкаДокументов.Заказ, Ответ.Status, ДанныеXML_Данные, ДанныеXML_Ответ);
				
			Исключение
				
				ЗаписатьЛог_рэЛогЗапросов(ВыборкаДокументов.Объект,  ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"),ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.Выполнен"), ВыборкаДокументов.Заказ, "Общая ошибка", , ОписаниеОшибки());				
				Возврат Ложь;
				
			КонецПопытки;
			
			
		КонецЦикла; 
		
		
	Исключение	
		
		//ЗаписатьЛог_рэ_ЛогЗапросов("Общая ошибка", ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"), , , , ОписаниеОшибки());
		ЗаписатьЛог_рэЛогЗапросов(,ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"),ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.Выполнен") , , "Общая ошибка", , ОписаниеОшибки());
		Возврат Ложь;
		
	КонецПопытки;		
	
	Возврат Истина; 

КонецФункции	

Функция REDПередачаДанныхОСтатусах_ЗаказНаМагистрали()  Экспорт
		
	Попытка
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	рэОбъектыДляОбменаСрезПоследних.Период КАК Период,
		               |	рэОбъектыДляОбменаСрезПоследних.Объект КАК Объект,
		               |	рэОбъектыДляОбменаСрезПоследних.Заказ КАК Заказ,
		               |	рэОбъектыДляОбменаСрезПоследних.ДополнительнаяИнформация КАК ДополнительнаяИнформация
		               |ПОМЕСТИТЬ ВТ_рэОбъектыДляОбмена
		               |ИЗ
		               |	РегистрСведений.рэОбъектыДляОбмена.СрезПоследних(, ) КАК рэОбъектыДляОбменаСрезПоследних
		               |ГДЕ
		               |	рэОбъектыДляОбменаСрезПоследних.Метод = &Метод
		               |	И рэОбъектыДляОбменаСрезПоследних.ДанныеОтправлены = ЛОЖЬ
		               |	И рэОбъектыДляОбменаСрезПоследних.Операция = &Операция
		               |	И рэОбъектыДляОбменаСрезПоследних.СчетчикВыгрузок < 20
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Объект,
		               |	Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	МАКСИМУМ(МестонахождениеЗаказа.Период) КАК Период,
		               |	МестонахождениеЗаказа.Заказ КАК Заказ
		               |ПОМЕСТИТЬ ВТ_ПериодыСрезаМестонахождения
		               |ИЗ
		               |	ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеЗаказа КАК МестонахождениеЗаказа
		               |		ПО ВТ_рэОбъектыДляОбмена.Заказ = МестонахождениеЗаказа.Заказ
		               |			И ВТ_рэОбъектыДляОбмена.Период >= МестонахождениеЗаказа.Период
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	МестонахождениеЗаказа.Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	МестонахождениеЗаказа.Заказ КАК Заказ,
		               |	МестонахождениеЗаказа.Терминал КАК Терминал
		               |ПОМЕСТИТЬ ВТ_Местонахождение
		               |ИЗ
		               |	РегистрСведений.МестонахождениеЗаказа КАК МестонахождениеЗаказа
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПериодыСрезаМестонахождения КАК ВТ_ПериодыСрезаМестонахождения
		               |		ПО МестонахождениеЗаказа.Период = ВТ_ПериодыСрезаМестонахождения.Период
		               |			И МестонахождениеЗаказа.Заказ = ВТ_ПериодыСрезаМестонахождения.Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Контрагенты.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ ВТ_НужныеКонтрагенты
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	Контрагенты.Ссылка = &Ссылка
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	Контрагенты.Ссылка
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	Контрагенты.Родитель.ОсновнойМагазин = &Ссылка
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ШтрихкодыЗаказов.Заказ КАК Заказ,
		               |	МАКСИМУМ(ШтрихкодыЗаказов.НомерМеста) КАК НомерМеста
		               |ПОМЕСТИТЬ ВТ_НомераМест
		               |ИЗ
		               |	ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыЗаказов КАК ШтрихкодыЗаказов
		               |		ПО ВТ_рэОбъектыДляОбмена.Заказ = ШтрихкодыЗаказов.Заказ
		               |ГДЕ
		               |	ШтрихкодыЗаказов.НомерМеста <> 0
		               |	И ШтрихкодыЗаказов.ДокументТСД = ЗНАЧЕНИЕ(Документ.ЗагрузкаСТСД.ПустаяСсылка)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ШтрихкодыЗаказов.Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_рэОбъектыДляОбмена.Период КАК Период,
		               |	ВТ_рэОбъектыДляОбмена.Заказ КАК Реализация,
		               |	ВнутреннееПеремещениеЗаказовЗаказы.Ссылка КАК ЗагрузкаСТСД,
		               |	ВЫРАЗИТЬ(ВнутреннееПеремещениеЗаказовЗаказы.Заказ КАК Документ.РеализацияТоваровУслуг).НомерВнешнегоЗаказа КАК InvoiceId,
		               |	ВнутреннееПеремещениеЗаказовЗаказы.Ссылка.Дата КАК DateUpdate,
		               |	""В"" + ПривязкаМашинКРейсамСрезПоследних.Водитель.Код КАК CourierId,
		               |	ЕСТЬNULL(ВТ_НомераМест.НомерМеста, 1) КАК PlaceId,
		               |	ВТ_рэОбъектыДляОбмена.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
		               |	ВнутреннееПеремещениеЗаказовЗаказы.Ссылка.ТерминалОтправки КАК ТерминалОтправки,
		               |	ВнутреннееПеремещениеЗаказовЗаказы.Ссылка.ТерминалПолучения КАК ТерминалПолучения,
		               |	ВЫБОР
		               |		КОГДА ВЫБОР
		               |				КОГДА ВТ_Местонахождение.Терминал ЕСТЬ NULL
		               |						ИЛИ ВТ_Местонахождение.Терминал = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.ПустаяСсылка)
		               |					ТОГДА ВнутреннееПеремещениеЗаказовЗаказы.Заказ.ТерминалДоставки
		               |				ИНАЧЕ ВТ_Местонахождение.Терминал
		               |			КОНЕЦ = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.МоскваСтриж)
		               |			ТОГДА 1
		               |		ИНАЧЕ 2
		               |	КОНЕЦ КАК TerminalIdCurrent
		               |ИЗ
		               |	Документ.ВнутреннееПеремещениеЗаказов.Заказы КАК ВнутреннееПеремещениеЗаказовЗаказы
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НомераМест КАК ВТ_НомераМест
		               |			ПО ВТ_рэОбъектыДляОбмена.Заказ = ВТ_НомераМест.Заказ
		               |		ПО ВнутреннееПеремещениеЗаказовЗаказы.Ссылка = ВТ_рэОбъектыДляОбмена.Объект
		               |			И ВнутреннееПеремещениеЗаказовЗаказы.Заказ = ВТ_рэОбъектыДляОбмена.Заказ
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НужныеКонтрагенты КАК ВТ_НужныеКонтрагенты
		               |		ПО (ВЫРАЗИТЬ(ВнутреннееПеремещениеЗаказовЗаказы.Заказ КАК Документ.РеализацияТоваровУслуг).ВладелецТовара = ВТ_НужныеКонтрагенты.Ссылка)
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Рейс.Заказы КАК РейсЗаказы
		               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних КАК ПривязкаМашинКРейсамСрезПоследних
		               |			ПО РейсЗаказы.Ссылка = ПривязкаМашинКРейсамСрезПоследних.Рейс
		               |		ПО ВнутреннееПеремещениеЗаказовЗаказы.Заказ = РейсЗаказы.Заказ
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Местонахождение КАК ВТ_Местонахождение
		               |		ПО ВнутреннееПеремещениеЗаказовЗаказы.Заказ = ВТ_Местонахождение.Заказ
		               |ИТОГИ
		               |	МАКСИМУМ(Период),
		               |	МАКСИМУМ(InvoiceId)
		               |ПО
		               |	ЗагрузкаСТСД";
		
		Запрос.УстановитьПараметр("Ссылка", ПараметрыСеанса.рэКомпанияRED);
		Запрос.УстановитьПараметр("Метод",  ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"));
		Запрос.УстановитьПараметр("Операция",  ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ЗаказНаМагистрали"));

		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			Возврат Истина;
		КонецЕсли;	
		
		ПутиПодключенения = рэИнтеграцияРэдЭкспресс.ПолучитьПодключениеКСервисуRED();
		
		WSОпр = Новый WSОпределения(ПутиПодключенения.WS_Путь, ПутиПодключенения.Пользователь, ПутиПодключенения.Пароль);	
		Прокси = Новый WSПрокси(WSОпр, "http://www.redexpress.ru/", "SyncService" , "SyncServiceSoap");

		Прокси.Пользователь = ПутиПодключенения.Пользователь;
		Прокси.Пароль = ПутиПодключенения.Пароль;
		
		InvoiceStatusТип = Прокси.ФабрикаXDTO.Тип("http://www.redexpress.ru/", "InvoiceStatus");
				
		InvoicePlaceStatusТип = Прокси.ФабрикаXDTO.Тип("http://www.redexpress.ru/", "InvoicePlaceStatus");
		
		ArrayOfInvoicePlaceStatusТип = Прокси.ФабрикаXDTO.Тип("http://www.redexpress.ru/", "ArrayOfInvoicePlaceStatus");


		ВыборкаЗагрузкаСТСД = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаЗагрузкаСТСД.Следующий() Цикл 
			
			ВыборкаДокументов = ВыборкаЗагрузкаСТСД.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаДокументов.Следующий() Цикл
				
				Попытка
					
					InvoiceStatusбъект = Прокси.ФабрикаXDTO.Создать(InvoiceStatusТип);
					InvoiceStatusбъект.InvoiceId = ОбработатьВнешнийНомерДляРед(ВыборкаДокументов.InvoiceId);
					InvoiceStatusбъект.TerminalIdFrom = ?(ВыборкаДокументов.ТерминалОтправки = Справочники.РегиональныеТерминалы.МоскваСтриж, 1,2);
					InvoiceStatusбъект.TerminalIdTo = ?(ВыборкаДокументов.ТерминалПолучения = Справочники.РегиональныеТерминалы.МоскваСтриж, 1,2);
					InvoiceStatusбъект.TerminalIdCurrent = ВыборкаДокументов.TerminalIdCurrent;
					
					//InvoiceStatusбъект.DateUpdate = ВыборкаДокументов.DateUpdate;
					//ДатаПроведенияДока = Вычислить("'" + ВыборкаДокументов.ДополнительнаяИнформация + "'");
					InvoiceStatusбъект.DateUpdate = ВыборкаДокументов.Период;					
					
					InvoiceStatusбъект.CourierId = ВыборкаДокументов.CourierId;
					
					ArrayOfInvoicePlaceStatusОбъект = Прокси.ФабрикаXDTO.Создать(ArrayOfInvoicePlaceStatusТип);

					
					InvoicePlaceStatusesОбъект = Прокси.ФабрикаXDTO.Создать(InvoicePlaceStatusТип);
					InvoicePlaceStatusesОбъект.PlaceId   = ВыборкаДокументов.PlaceId;
					InvoicePlaceStatusesОбъект.Status = "219";
					
					ArrayOfInvoicePlaceStatusОбъект.InvoicePlaceStatus.Добавить(InvoicePlaceStatusesОбъект);
			
					InvoiceStatusбъект.InvoicePlaceStatuses =  ArrayOfInvoicePlaceStatusОбъект;
					
					ЗаписьXML = Новый ЗаписьXML;
					ЗаписьXML.УстановитьСтроку();
					Прокси.ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, InvoiceStatusбъект);
					ДанныеXML_Данные = ЗаписьXML.Закрыть();	
					
					Ответ = Прокси.UpdateInvoiceStatus(InvoiceStatusбъект);
					
					ЗаписьXML = Новый ЗаписьXML;
					ЗаписьXML.УстановитьСтроку();
					Прокси.ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, Ответ);
					ДанныеXML_Ответ = ЗаписьXML.Закрыть();
					
					Если Ответ.Status = 200 Или Ответ.Status ="Success" Тогда
					
						ОбновитьрэОбъектыДляОбмена(ВыборкаДокументов.Период, ВыборкаДокументов.ЗагрузкаСТСД, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"),ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ЗаказНаМагистрали"), ВыборкаДокументов.Реализация, ТекущаяДата(), Истина, Справочники.СтатусыЗаказов.ЗаказНаМагистрали);
						
					Иначе 
						
						ОбновитьрэОбъектыДляОбмена(ВыборкаДокументов.Период, ВыборкаДокументов.ЗагрузкаСТСД, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"),ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ЗаказНаМагистрали"), ВыборкаДокументов.Реализация, ТекущаяДата(), Ложь, Справочники.СтатусыЗаказов.ЗаказНаМагистрали);
						
					КонецЕсли;	
					
					//ЗаписатьЛог_рэ_ЛогЗапросов(Ответ.Status, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"), ВыборкаДокументов.ЗагрузкаСТСД, ВыборкаДокументов.Реализация , ДанныеXML_Данные, ДанныеXML_Ответ);
					ЗаписатьЛог_рэЛогЗапросов(ВыборкаДокументов.ЗагрузкаСТСД, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"), ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ЗаказНаМагистрали"), ВыборкаДокументов.Реализация, Ответ.Status, ДанныеXML_Данные, ДанныеXML_Ответ);
					
				Исключение
					
					//ЗаписатьЛог_рэ_ЛогЗапросов("Общая ошибка", ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"), ВыборкаДокументов.ЗагрузкаСТСД, ВыборкаДокументов.Реализация , , ОписаниеОшибки());
					ЗаписатьЛог_рэЛогЗапросов(ВыборкаДокументов.ЗагрузкаСТСД, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"), ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ЗаказНаМагистрали"), ВыборкаДокументов.Реализация, "Общая ошибка", , ОписаниеОшибки());
					Возврат Ложь;
					
				КонецПопытки;
				
				
			КонецЦикла; 
		КонецЦикла; 

		
	Исключение	
		
		//ЗаписатьЛог_рэ_ЛогЗапросов("Общая ошибка", ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"), , , , ОписаниеОшибки());
		ЗаписатьЛог_рэЛогЗапросов(,ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"), ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ЗаказНаМагистрали"), , "Общая ошибка", , ОписаниеОшибки());
		Возврат Ложь;
		
	КонецПопытки;		
	
	Возврат Истина; 

	
	
КонецФункции	

Функция REDПередачаДанныхОСтатусах_ЗаказПоступилВТерминалДоставки_РегистрацияДляОтправки(ТаблицаДанных) Экспорт
	
	Если Не ЗначениеЗаполнено(ПараметрыСеанса.рэКомпанияRED) Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	Попытка
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Контрагенты.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ ВТ_НужныеКонтрагенты
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	Контрагенты.Ссылка = &Ссылка
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	Контрагенты.Ссылка
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	Контрагенты.Родитель.ОсновнойМагазин = &Ссылка
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаДанных.ДокументРегистратор КАК ДокументРегистратор,
		               |	ТаблицаДанных.Реализация КАК Реализация
		               |ПОМЕСТИТЬ ВТ_ТаблицаДанных
		               |ИЗ
		               |	&ТаблицаДанных КАК ТаблицаДанных
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Реализация,
		               |	ДокументРегистратор
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	РеализацияТоваровУслуг.Ссылка КАК Заказ,
		               |	ВТ_ТаблицаДанных.ДокументРегистратор КАК Объект
		               |ИЗ
		               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НужныеКонтрагенты КАК ВТ_НужныеКонтрагенты
		               |		ПО РеализацияТоваровУслуг.ВладелецТовара = ВТ_НужныеКонтрагенты.Ссылка
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаДанных КАК ВТ_ТаблицаДанных
		               |		ПО РеализацияТоваровУслуг.Ссылка = ВТ_ТаблицаДанных.Реализация
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РеализацияТоваровУслуг.Ссылка,
		               |	ВТ_ТаблицаДанных.ДокументРегистратор";
		
		Запрос.УстановитьПараметр("Ссылка", ПараметрыСеанса.рэКомпанияRED);
		Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаДанных);

		Результат = Запрос.Выполнить();
		
		Если Результат.Пустой() Тогда
			Возврат Истина;
		КонецЕсли;
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			МенеджерЗаписи = РегистрыСведений.рэОбъектыДляОбмена.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период = ТекущаяДата();
			МенеджерЗаписи.Объект = Выборка.Объект;
			МенеджерЗаписи.Метод = Перечисления.рэМетоды.UpdateInvoiceStatus;
			МенеджерЗаписи.Операция = Перечисления.реОперацииПередачиСтатусов.ЗаказПоступилВТерминалДоставки;
			МенеджерЗаписи.Заказ  = Выборка.Заказ;
			МенеджерЗаписи.ДополнительнаяИнформация = ЗагрузкаИзИнтернетМагазина.ДатаВСтроку(ТекущаяДата());
			МенеджерЗаписи.Записать();
			
		КонецЦикла;
		
	Исключение	
		
		Сообщить("Ошибка регистрации объекта для обмена в подсистеме Red: " + ОписаниеОшибки());
		Возврат Ложь;
		
	КонецПопытки;		
	
	Возврат Истина; 
	
КонецФункции	

Функция REDПередачаДанныхОСтатусах_ЗаказПоступилВТерминалДоставки()   Экспорт 
		
	Попытка
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	рэОбъектыДляОбменаСрезПоследних.Период КАК Период,
		               |	рэОбъектыДляОбменаСрезПоследних.Объект КАК Объект,
		               |	рэОбъектыДляОбменаСрезПоследних.Заказ КАК Заказ,
		               |	рэОбъектыДляОбменаСрезПоследних.ДополнительнаяИнформация КАК ДополнительнаяИнформация
		               |ПОМЕСТИТЬ ВТ_рэОбъектыДляОбмена
		               |ИЗ
		               |	РегистрСведений.рэОбъектыДляОбмена.СрезПоследних(, ) КАК рэОбъектыДляОбменаСрезПоследних
		               |ГДЕ
		               |	рэОбъектыДляОбменаСрезПоследних.Метод = &Метод
		               |	И рэОбъектыДляОбменаСрезПоследних.ДанныеОтправлены = ЛОЖЬ
		               |	И рэОбъектыДляОбменаСрезПоследних.Операция = &Операция
		               |	И рэОбъектыДляОбменаСрезПоследних.СчетчикВыгрузок < 20
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Объект,
		               |	Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	МАКСИМУМ(МестонахождениеЗаказа.Период) КАК Период,
		               |	МестонахождениеЗаказа.Заказ КАК Заказ
		               |ПОМЕСТИТЬ ВТ_ПериодыСрезаМестонахождения
		               |ИЗ
		               |	ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеЗаказа КАК МестонахождениеЗаказа
		               |		ПО ВТ_рэОбъектыДляОбмена.Заказ = МестонахождениеЗаказа.Заказ
		               |			И ВТ_рэОбъектыДляОбмена.Период >= МестонахождениеЗаказа.Период
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	МестонахождениеЗаказа.Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	МестонахождениеЗаказа.Заказ КАК Заказ,
		               |	МестонахождениеЗаказа.Терминал КАК Терминал
		               |ПОМЕСТИТЬ ВТ_Местонахождение
		               |ИЗ
		               |	РегистрСведений.МестонахождениеЗаказа КАК МестонахождениеЗаказа
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПериодыСрезаМестонахождения КАК ВТ_ПериодыСрезаМестонахождения
		               |		ПО МестонахождениеЗаказа.Период = ВТ_ПериодыСрезаМестонахождения.Период
		               |			И МестонахождениеЗаказа.Заказ = ВТ_ПериодыСрезаМестонахождения.Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Контрагенты.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ ВТ_НужныеКонтрагенты
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	Контрагенты.Ссылка = &Ссылка
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	Контрагенты.Ссылка
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	Контрагенты.Родитель.ОсновнойМагазин = &Ссылка
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ШтрихкодыЗаказов.Заказ КАК Заказ,
		               |	МАКСИМУМ(ШтрихкодыЗаказов.НомерМеста) КАК НомерМеста
		               |ПОМЕСТИТЬ ВТ_НомераМест
		               |ИЗ
		               |	ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыЗаказов КАК ШтрихкодыЗаказов
		               |		ПО ВТ_рэОбъектыДляОбмена.Заказ = ШтрихкодыЗаказов.Заказ
		               |ГДЕ
		               |	ШтрихкодыЗаказов.НомерМеста <> 0
		               |	И ШтрихкодыЗаказов.ДокументТСД = ЗНАЧЕНИЕ(Документ.ЗагрузкаСТСД.ПустаяСсылка)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ШтрихкодыЗаказов.Заказ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_рэОбъектыДляОбмена.Период КАК Период,
		               |	ВТ_рэОбъектыДляОбмена.Заказ КАК Реализация,
		               |	ЗагрузкаСТСДШтрихкоды.Ссылка КАК ЗагрузкаСТСД,
		               |	ВЫРАЗИТЬ(ЗагрузкаСТСДШтрихкоды.Заказ КАК Документ.РеализацияТоваровУслуг).НомерВнешнегоЗаказа КАК InvoiceId,
		               |	ЗагрузкаСТСДШтрихкоды.Ссылка.Дата КАК DateUpdate,
		               |	""В"" + ПривязкаМашинКРейсамСрезПоследних.Водитель.Код КАК CourierId,
		               |	ЕСТЬNULL(ВТ_НомераМест.НомерМеста, 1) КАК PlaceId,
		               |	ВТ_рэОбъектыДляОбмена.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
		               |	ЗагрузкаСТСДШтрихкоды.Ссылка.ТерминалПриема КАК ТерминалДоставки,
		               |	ВЫБОР
		               |		КОГДА ВЫБОР
		               |				КОГДА ВТ_Местонахождение.Терминал ЕСТЬ NULL
		               |						ИЛИ ВТ_Местонахождение.Терминал = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.ПустаяСсылка)
		               |					ТОГДА ЗагрузкаСТСДШтрихкоды.Заказ.ТерминалДоставки
		               |				ИНАЧЕ ВТ_Местонахождение.Терминал
		               |			КОНЕЦ = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.МоскваСтриж)
		               |			ТОГДА 1
		               |		ИНАЧЕ 2
		               |	КОНЕЦ КАК TerminalIdCurrent
		               |ИЗ
		               |	Документ.ЗагрузкаСТСД.Штрихкоды КАК ЗагрузкаСТСДШтрихкоды
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_рэОбъектыДляОбмена КАК ВТ_рэОбъектыДляОбмена
		               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НомераМест КАК ВТ_НомераМест
		               |			ПО ВТ_рэОбъектыДляОбмена.Заказ = ВТ_НомераМест.Заказ
		               |		ПО ЗагрузкаСТСДШтрихкоды.Ссылка = ВТ_рэОбъектыДляОбмена.Объект
		               |			И ЗагрузкаСТСДШтрихкоды.Заказ = ВТ_рэОбъектыДляОбмена.Заказ
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НужныеКонтрагенты КАК ВТ_НужныеКонтрагенты
		               |		ПО (ВЫРАЗИТЬ(ЗагрузкаСТСДШтрихкоды.Заказ КАК Документ.РеализацияТоваровУслуг).ВладелецТовара = ВТ_НужныеКонтрагенты.Ссылка)
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Рейс.Заказы КАК РейсЗаказы
		               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних КАК ПривязкаМашинКРейсамСрезПоследних
		               |			ПО РейсЗаказы.Ссылка = ПривязкаМашинКРейсамСрезПоследних.Рейс
		               |		ПО ЗагрузкаСТСДШтрихкоды.Заказ = РейсЗаказы.Заказ
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Местонахождение КАК ВТ_Местонахождение
		               |		ПО ЗагрузкаСТСДШтрихкоды.Заказ = ВТ_Местонахождение.Заказ
		               |ИТОГИ
		               |	МАКСИМУМ(Период),
		               |	МАКСИМУМ(InvoiceId)
		               |ПО
		               |	ЗагрузкаСТСД";
		
		Запрос.УстановитьПараметр("Ссылка", ПараметрыСеанса.рэКомпанияRED);
		Запрос.УстановитьПараметр("Метод",  ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"));
		Запрос.УстановитьПараметр("Операция",  ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ЗаказПоступилВТерминалДоставки"));

		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			Возврат Истина;
		КонецЕсли;	
		
		ПутиПодключенения = рэИнтеграцияРэдЭкспресс.ПолучитьПодключениеКСервисуRED();
		
		WSОпр = Новый WSОпределения(ПутиПодключенения.WS_Путь, ПутиПодключенения.Пользователь, ПутиПодключенения.Пароль);	
		Прокси = Новый WSПрокси(WSОпр, "http://www.redexpress.ru/", "SyncService" , "SyncServiceSoap");

		Прокси.Пользователь = ПутиПодключенения.Пользователь;
		Прокси.Пароль = ПутиПодключенения.Пароль;
		
		InvoiceStatusТип = Прокси.ФабрикаXDTO.Тип("http://www.redexpress.ru/", "InvoiceStatus");
				
		InvoicePlaceStatusТип = Прокси.ФабрикаXDTO.Тип("http://www.redexpress.ru/", "InvoicePlaceStatus");
		
		ArrayOfInvoicePlaceStatusТип = Прокси.ФабрикаXDTO.Тип("http://www.redexpress.ru/", "ArrayOfInvoicePlaceStatus");


		ВыборкаЗагрузкаСТСД = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаЗагрузкаСТСД.Следующий() Цикл 
			
			ВыборкаДокументов = ВыборкаЗагрузкаСТСД.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаДокументов.Следующий() Цикл
				
				Попытка
					
					InvoiceStatusбъект = Прокси.ФабрикаXDTO.Создать(InvoiceStatusТип);
					InvoiceStatusбъект.InvoiceId = ОбработатьВнешнийНомерДляРед(ВыборкаДокументов.InvoiceId);
					InvoiceStatusбъект.TerminalIdFrom = ?(ВыборкаДокументов.ТерминалДоставки = Справочники.РегиональныеТерминалы.МоскваСтриж, 1,2);
					InvoiceStatusбъект.TerminalIdTo = ?(ВыборкаДокументов.ТерминалДоставки = Справочники.РегиональныеТерминалы.МоскваСтриж, 1,2);
					InvoiceStatusбъект.TerminalIdCurrent = ВыборкаДокументов.TerminalIdCurrent;
					
					//InvoiceStatusбъект.DateUpdate = ВыборкаДокументов.DateUpdate;
					//ДатаПроведенияДока = Вычислить("'" + ВыборкаДокументов.ДополнительнаяИнформация + "'");
					InvoiceStatusбъект.DateUpdate = ВыборкаДокументов.Период;					
					
					InvoiceStatusбъект.CourierId = ВыборкаДокументов.CourierId;
					
					ArrayOfInvoicePlaceStatusОбъект = Прокси.ФабрикаXDTO.Создать(ArrayOfInvoicePlaceStatusТип);

					
					InvoicePlaceStatusesОбъект = Прокси.ФабрикаXDTO.Создать(InvoicePlaceStatusТип);
					InvoicePlaceStatusesОбъект.PlaceId   = ВыборкаДокументов.PlaceId;
					InvoicePlaceStatusesОбъект.Status = "220";
					
					ArrayOfInvoicePlaceStatusОбъект.InvoicePlaceStatus.Добавить(InvoicePlaceStatusesОбъект);
			
					InvoiceStatusбъект.InvoicePlaceStatuses =  ArrayOfInvoicePlaceStatusОбъект;
					
					ЗаписьXML = Новый ЗаписьXML;
					ЗаписьXML.УстановитьСтроку();
					Прокси.ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, InvoiceStatusбъект);
					ДанныеXML_Данные = ЗаписьXML.Закрыть();	
					
					Ответ = Прокси.UpdateInvoiceStatus(InvoiceStatusбъект);
					
					ЗаписьXML = Новый ЗаписьXML;
					ЗаписьXML.УстановитьСтроку();
					Прокси.ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, Ответ);
					ДанныеXML_Ответ = ЗаписьXML.Закрыть();
					
					Если Ответ.Status = 200 Или Ответ.Status ="Success" Тогда
					
						ОбновитьрэОбъектыДляОбмена(ВыборкаДокументов.Период, ВыборкаДокументов.ЗагрузкаСТСД, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"),ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ЗаказПоступилВТерминалДоставки"), ВыборкаДокументов.Реализация, ТекущаяДата(), Истина, Справочники.СтатусыЗаказов.ЗаказПоступилВТерминалДоставки);
						
					Иначе 
						
						ОбновитьрэОбъектыДляОбмена(ВыборкаДокументов.Период, ВыборкаДокументов.ЗагрузкаСТСД, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"),ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ЗаказПоступилВТерминалДоставки"), ВыборкаДокументов.Реализация, ТекущаяДата(), Ложь, Справочники.СтатусыЗаказов.ЗаказПоступилВТерминалДоставки);
						
					КонецЕсли;	
					
					//ЗаписатьЛог_рэ_ЛогЗапросов(Ответ.Status, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"), ВыборкаДокументов.ЗагрузкаСТСД, ВыборкаДокументов.Реализация , ДанныеXML_Данные, ДанныеXML_Ответ);
					ЗаписатьЛог_рэЛогЗапросов(ВыборкаДокументов.ЗагрузкаСТСД, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"), ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ЗаказПоступилВТерминалДоставки"), ВыборкаДокументов.Реализация, Ответ.Status, ДанныеXML_Данные, ДанныеXML_Ответ);
					
				Исключение
					
					//ЗаписатьЛог_рэ_ЛогЗапросов("Общая ошибка", ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"), ВыборкаДокументов.ЗагрузкаСТСД, ВыборкаДокументов.Реализация , , ОписаниеОшибки());
					ЗаписатьЛог_рэЛогЗапросов(ВыборкаДокументов.ЗагрузкаСТСД, ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"), ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ЗаказПоступилВТерминалДоставки"), ВыборкаДокументов.Реализация, "Общая ошибка", , ОписаниеОшибки());
					Возврат Ложь;
					
				КонецПопытки;
				
				
			КонецЦикла; 
		КонецЦикла; 

		
	Исключение	
		
		//ЗаписатьЛог_рэ_ЛогЗапросов("Общая ошибка", ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"), , , , ОписаниеОшибки());
		ЗаписатьЛог_рэЛогЗапросов(,ПредопределенноеЗначение("Перечисление.рэМетоды.UpdateInvoiceStatus"), ПредопределенноеЗначение("Перечисление.реОперацииПередачиСтатусов.ЗаказПоступилВТерминалДоставки"), , "Общая ошибка", , ОписаниеОшибки());
		Возврат Ложь;
		
	КонецПопытки;		
	
	Возврат Истина; 

	
	
КонецФункции	
#КонецОбласти   

Функция ОбработатьВнешнийНомерДляРед(ВнешнийНомер)
	
	Позиция = СтрНайти(ВнешнийНомер, "--");
	
	Если Позиция = 0 Тогда
		
		Возврат ВнешнийНомер;
		
	Иначе 	
		
		ВнешнийНомерПослеОбработки = Прав(ВнешнийНомер, СтрДлина(ВнешнийНомер) - Позиция - 1); 
		Возврат ВнешнийНомерПослеОбработки;
		
	КонецЕсли;	
	
КонецФункции	

Процедура REDОбработкаПроведения(Документ, Отказ, РежимПроведения) Экспорт
	
	Если Отказ Тогда 
		
		Возврат;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыСеанса.рэКомпанияRED) Тогда
		
		Возврат;
		
	КонецЕсли;	
	
	Если ТипЗнч(Документ) = Тип("ДокументОбъект.ЗакрытиеЗаказов") Тогда
		
		Попытка
			
			Если ПараметрыСеанса.рэКомпанияRED = Справочники.Контрагенты.ПустаяСсылка() Тогда
				
				Возврат;
				
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	Контрагенты.Ссылка КАК Ссылка
			               |ПОМЕСТИТЬ ВТ_НужныеКонтрагенты
			               |ИЗ
			               |	Справочник.Контрагенты КАК Контрагенты
			               |ГДЕ
			               |	Контрагенты.Ссылка = &ВладелецТовара
			               |
			               |ОБЪЕДИНИТЬ ВСЕ
			               |
			               |ВЫБРАТЬ
			               |	Контрагенты.Ссылка
			               |ИЗ
			               |	Справочник.Контрагенты КАК Контрагенты
			               |ГДЕ
			               |	Контрагенты.Родитель.ОсновнойМагазин = &ВладелецТовара
			               |
			               |ИНДЕКСИРОВАТЬ ПО
			               |	Ссылка
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ЗакрытиеЗаказовЗаказы.Ссылка КАК Ссылка,
			               |	ЗакрытиеЗаказовЗаказы.Реализация КАК Реализация,
			               |	ЗакрытиеЗаказовЗаказы.ТипОплаты КАК ТипОплаты,
			               |	МАКСИМУМ(ВЫБОР
			               |			КОГДА ЕСТЬNULL(ЗакрытиеЗаказовТовары.Количество, 0) - ЕСТЬNULL(ЗакрытиеЗаказовТовары.КоличествоВозвращено, 0) - ЕСТЬNULL(ЗакрытиеЗаказовТовары.Недовложение, 0) > 0
			               |				ТОГДА ИСТИНА
			               |			ИНАЧЕ ЛОЖЬ
			               |		КОНЕЦ) КАК UpdateQuantityDeliveredGoods,
			               |	ЛОЖЬ КАК Отменен,
			               |	МАКСИМУМ(ВЫБОР
			               |			КОГДА ЗакрытиеЗаказовЗаказы.ПричинаНевыполнения = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ОтказКлиентаСЗаездом)
			               |				ТОГДА ИСТИНА
			               |			ИНАЧЕ ЛОЖЬ
			               |		КОНЕЦ) КАК ОтказСЗаездом,
			               |	МАКСИМУМ(ВЫБОР
			               |			КОГДА (ЗакрытиеЗаказовЗаказы.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.Выполнена)
			               |					ИЛИ ЗакрытиеЗаказовЗаказы.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.ВыполненаЧастично))
			               |					И ЗакрытиеЗаказовТовары.КоличествоВозвращено <> 0
			               |					И ЗакрытиеЗаказовТовары.Недовложение = 0
			               |				ТОГДА ИСТИНА
			               |			ИНАЧЕ ЛОЖЬ
			               |		КОНЕЦ) КАК ЧастичнаяДоставка,
			               |	МАКСИМУМ(ВЫБОР
			               |			КОГДА (ЗакрытиеЗаказовЗаказы.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.Выполнена)
			               |					ИЛИ ЗакрытиеЗаказовЗаказы.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.ВыполненаЧастично))
			               |					И ЗакрытиеЗаказовТовары.КоличествоВозвращено = 0
			               |					И ЗакрытиеЗаказовТовары.Недовложение <> 0
			               |				ТОГДА ИСТИНА
			               |			ИНАЧЕ ЛОЖЬ
			               |		КОНЕЦ) КАК ЧастичнаяДоставкаСНедовложением,
			               |	МАКСИМУМ(ВЫБОР
			               |			КОГДА ЗакрытиеЗаказовЗаказы.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.Выполнена)
			               |				ТОГДА ИСТИНА
			               |			ИНАЧЕ ЛОЖЬ
			               |		КОНЕЦ) КАК Выполнен
			               |ИЗ
			               |	Документ.ЗакрытиеЗаказов.Заказы КАК ЗакрытиеЗаказовЗаказы
			               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗакрытиеЗаказов.Товары КАК ЗакрытиеЗаказовТовары
			               |		ПО ЗакрытиеЗаказовЗаказы.Ссылка = ЗакрытиеЗаказовТовары.Ссылка
			               |			И ЗакрытиеЗаказовЗаказы.Доставка = ЗакрытиеЗаказовТовары.Доставка
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НужныеКонтрагенты КАК ВТ_НужныеКонтрагенты
			               |		ПО ЗакрытиеЗаказовЗаказы.ВладелецТовара = ВТ_НужныеКонтрагенты.Ссылка
			               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.рэЛогЗапросов.СрезПоследних КАК рэЛогЗапросовСрезПоследних
			               |		ПО ЗакрытиеЗаказовЗаказы.Ссылка = рэЛогЗапросовСрезПоследних.Объект
			               |			И (рэЛогЗапросовСрезПоследних.Метод = ЗНАЧЕНИЕ(Перечисление.рэМетоды.UpdateInvoiceStatus))
			               |			И (рэЛогЗапросовСрезПоследних.Операция = ЗНАЧЕНИЕ(Перечисление.реОперацииПередачиСтатусов.Выполнен))
			               |ГДЕ
			               |	(ЗакрытиеЗаказовЗаказы.ВладелецТовара = &ВладелецТовара
			               |			ИЛИ ЗакрытиеЗаказовЗаказы.ВладелецТовара.Родитель.ОсновнойМагазин = &ВладелецТовара)
			               |	И ЗакрытиеЗаказовЗаказы.Ссылка = &Ссылка
			               |	И ЗакрытиеЗаказовЗаказы.Закрыть = ИСТИНА
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ЗакрытиеЗаказовЗаказы.Ссылка,
			               |	ЗакрытиеЗаказовЗаказы.Реализация,
			               |	ЗакрытиеЗаказовЗаказы.ТипОплаты
			               |
			               |ОБЪЕДИНИТЬ ВСЕ
			               |
			               |ВЫБРАТЬ
			               |	ЗакрытиеЗаказовЗаказы.Ссылка,
			               |	ЗакрытиеЗаказовЗаказы.Реализация,
			               |	ЗакрытиеЗаказовЗаказы.ТипОплаты,
			               |	МАКСИМУМ(ВЫБОР
			               |			КОГДА ЗакрытиеЗаказовЗаказы.Закрыть = ИСТИНА
			               |					И (ЕСТЬNULL(ЗакрытиеЗаказовТовары.КоличествоВозвращено, 0) <> 0
			               |						ИЛИ ЕСТЬNULL(ЗакрытиеЗаказовТовары.Недовложение, 0) <> 0)
			               |				ТОГДА ИСТИНА
			               |			ИНАЧЕ ЛОЖЬ
			               |		КОНЕЦ),
			               |	ИСТИНА,
			               |	ЛОЖЬ,
			               |	ЛОЖЬ,
			               |	ЛОЖЬ,
			               |	ЛОЖЬ
			               |ИЗ
			               |	Документ.ЗакрытиеЗаказов.Заказы КАК ЗакрытиеЗаказовЗаказы
			               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗакрытиеЗаказов.Товары КАК ЗакрытиеЗаказовТовары
			               |		ПО ЗакрытиеЗаказовЗаказы.Ссылка = ЗакрытиеЗаказовТовары.Ссылка
			               |			И ЗакрытиеЗаказовЗаказы.Доставка = ЗакрытиеЗаказовТовары.Доставка
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НужныеКонтрагенты КАК ВТ_НужныеКонтрагенты
			               |		ПО ЗакрытиеЗаказовЗаказы.ВладелецТовара = ВТ_НужныеКонтрагенты.Ссылка
			               |ГДЕ
			               |	(ЗакрытиеЗаказовЗаказы.ВладелецТовара = &ВладелецТовара
			               |			ИЛИ ЗакрытиеЗаказовЗаказы.ВладелецТовара.Родитель.ОсновнойМагазин = &ВладелецТовара)
			               |	И ЗакрытиеЗаказовЗаказы.Ссылка = &Ссылка
			               |	И ЗакрытиеЗаказовЗаказы.Отклонить
			               |	И ЗакрытиеЗаказовЗаказы.ПричинаНевыполнения = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ОтказКлиентаБезЗаезда)
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ЗакрытиеЗаказовЗаказы.Реализация,
			               |	ЗакрытиеЗаказовЗаказы.ТипОплаты,
			               |	ЗакрытиеЗаказовЗаказы.Ссылка";
			
			Запрос.УстановитьПараметр("ВладелецТовара",  ПараметрыСеанса.рэКомпанияRED);
			Запрос.УстановитьПараметр("Ссылка",  Документ.Ссылка);
			
			
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл 
				
				//Если Выборка.ТипОплаты = Справочники.ТипыОплат.Терминал Или 
				//		Выборка.ТипОплаты = Справочники.ТипыОплат.Наличные Тогда
				//		
				//	МенеджерЗаписи = РегистрыСведений.рэОбъектыДляОбмена.СоздатьМенеджерЗаписи();
				//	МенеджерЗаписи.Период = ТекущаяДата();
				//	МенеджерЗаписи.Объект = Выборка.Ссылка;
				//	МенеджерЗаписи.Метод = Перечисления.рэМетоды.UpdatePayments;
				//	МенеджерЗаписи.Заказ  = Выборка.Реализация; 
				//	МенеджерЗаписи.Записать();
				//	
				//КонецЕсли;
				
				Если Выборка.Отменен Тогда
					
					МенеджерЗаписи = РегистрыСведений.рэОбъектыДляОбмена.СоздатьМенеджерЗаписи();
					МенеджерЗаписи.Период = ТекущаяДата();
					МенеджерЗаписи.Объект = Выборка.Ссылка;
					МенеджерЗаписи.Метод = Перечисления.рэМетоды.UpdateInvoiceStatus;
					МенеджерЗаписи.Операция = Перечисления.реОперацииПередачиСтатусов.Отменен;
					МенеджерЗаписи.Заказ  = Выборка.Реализация;
					МенеджерЗаписи.Записать();
					
				Иначе
					
					Если ТипЗнч(Выборка.Реализация) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
						
						МенеджерЗаписи = РегистрыСведений.рэОбъектыДляОбмена.СоздатьМенеджерЗаписи();
						МенеджерЗаписи.Период = ТекущаяДата();
						МенеджерЗаписи.Объект = Выборка.Ссылка;
						МенеджерЗаписи.Метод = Перечисления.рэМетоды.UpdatePriceShopService;
						МенеджерЗаписи.Заказ  = Выборка.Реализация;
						МенеджерЗаписи.Записать();
						
						Если Выборка.UpdateQuantityDeliveredGoods Тогда
							
							МенеджерЗаписи = РегистрыСведений.рэОбъектыДляОбмена.СоздатьМенеджерЗаписи();
							МенеджерЗаписи.Период = ТекущаяДата();
							МенеджерЗаписи.Объект = Выборка.Ссылка;
							МенеджерЗаписи.Метод = Перечисления.рэМетоды.UpdateQuantityDeliveredGoods;
							МенеджерЗаписи.Заказ  = Выборка.Реализация;
							МенеджерЗаписи.Записать();
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
				Если Выборка.ОтказСЗаездом Тогда
					
					МенеджерЗаписи = РегистрыСведений.рэОбъектыДляОбмена.СоздатьМенеджерЗаписи();
					МенеджерЗаписи.Период = ТекущаяДата();
					МенеджерЗаписи.Объект = Выборка.Ссылка;
					МенеджерЗаписи.Метод = Перечисления.рэМетоды.UpdateInvoiceStatus;
					МенеджерЗаписи.Операция = Перечисления.реОперацииПередачиСтатусов.ОтказВоВремяДоставки;
					МенеджерЗаписи.Заказ  = Выборка.Реализация;
					МенеджерЗаписи.ДополнительнаяИнформация = ЗагрузкаИзИнтернетМагазина.ДатаВСтроку(ТекущаяДата());
					МенеджерЗаписи.Записать();
					
				КонецЕсли;
				

				
				Если Выборка.ЧастичнаяДоставка Тогда
					
					МенеджерЗаписи = РегистрыСведений.рэОбъектыДляОбмена.СоздатьМенеджерЗаписи();
					МенеджерЗаписи.Период = ТекущаяДата();
					МенеджерЗаписи.Объект = Выборка.Ссылка;
					МенеджерЗаписи.Метод = Перечисления.рэМетоды.UpdateInvoiceStatus;
					МенеджерЗаписи.Операция = Перечисления.реОперацииПередачиСтатусов.ЧастичнаяДоставка;
					МенеджерЗаписи.Заказ  = Выборка.Реализация;
					МенеджерЗаписи.ДополнительнаяИнформация = ЗагрузкаИзИнтернетМагазина.ДатаВСтроку(ТекущаяДата());
					МенеджерЗаписи.Записать();
					
				КонецЕсли;

				Если Выборка.ЧастичнаяДоставкаСНедовложением Тогда
					
					МенеджерЗаписи = РегистрыСведений.рэОбъектыДляОбмена.СоздатьМенеджерЗаписи();
					МенеджерЗаписи.Период = ТекущаяДата();
					МенеджерЗаписи.Объект = Выборка.Ссылка;
					МенеджерЗаписи.Метод = Перечисления.рэМетоды.UpdateInvoiceStatus;
					МенеджерЗаписи.Операция = Перечисления.реОперацииПередачиСтатусов.ЧастичнаяДоставкаСНедовложением;
					МенеджерЗаписи.Заказ  = Выборка.Реализация;
					МенеджерЗаписи.ДополнительнаяИнформация = ЗагрузкаИзИнтернетМагазина.ДатаВСтроку(ТекущаяДата());
					МенеджерЗаписи.Записать();
					
				КонецЕсли;
				
				Если Выборка.Выполнен Тогда
					
					МенеджерЗаписи = РегистрыСведений.рэОбъектыДляОбмена.СоздатьМенеджерЗаписи();
					МенеджерЗаписи.Период = ТекущаяДата();
					МенеджерЗаписи.Объект = Выборка.Ссылка;
					МенеджерЗаписи.Метод = Перечисления.рэМетоды.UpdateInvoiceStatus;
					МенеджерЗаписи.Операция = Перечисления.реОперацииПередачиСтатусов.Выполнен;
					МенеджерЗаписи.Заказ  = Выборка.Реализация;
					МенеджерЗаписи.ДополнительнаяИнформация = ЗагрузкаИзИнтернетМагазина.ДатаВСтроку(ТекущаяДата());
					МенеджерЗаписи.Записать();
					
				КонецЕсли;
				
			КонецЦикла;
			
		Исключение
			
			Отказ = Истина;
			Сообщить("Ошибка регистрации объекта для обмена в подсистеме Red: " + ОписаниеОшибки());
			
		КонецПопытки;
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументОбъект.ЗагрузкаСТСД") И 
					Документ.ТипЗагрузкиТСД = ПредопределенноеЗначение("Перечисление.ТипыЗагрузкиТСД.ПриходWiFiVeeRoute") Тогда
					
					
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ 
		               |	ЗагрузкаСТСДШтрихкоды.Ссылка КАК Ссылка,
		               |	РеализацияТоваровУслуг.Ссылка КАК Реализация
		               |ИЗ
		               |	Документ.ЗагрузкаСТСД.Штрихкоды КАК ЗагрузкаСТСДШтрихкоды
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		               |		ПО ЗагрузкаСТСДШтрихкоды.Заказ = РеализацияТоваровУслуг.Ссылка
		               |ГДЕ
		               |	ЗагрузкаСТСДШтрихкоды.Ссылка = &Ссылка
		               |	И РеализацияТоваровУслуг.ВладелецТовара = &ВладелецТовара
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЗагрузкаСТСДШтрихкоды.Ссылка,
		               |	РеализацияТоваровУслуг.Ссылка
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ЗагрузкаСТСДШтрихкоды.Ссылка,
		               |	РеализацияТоваровУслуг.Ссылка
		               |ИЗ
		               |	Документ.ЗагрузкаСТСД.Штрихкоды КАК ЗагрузкаСТСДШтрихкоды
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		               |		ПО ЗагрузкаСТСДШтрихкоды.Заказ = РеализацияТоваровУслуг.Ссылка
		               |ГДЕ
		               |	ЗагрузкаСТСДШтрихкоды.Ссылка = &Ссылка
		               |	И РеализацияТоваровУслуг.ВладелецТовара.Родитель.ОсновнойМагазин = &ВладелецТовара
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЗагрузкаСТСДШтрихкоды.Ссылка,
		               |	РеализацияТоваровУслуг.Ссылка";
			
		Запрос.УстановитьПараметр("ВладелецТовара",  ПараметрыСеанса.рэКомпанияRED);
		Запрос.УстановитьПараметр("Ссылка",  Документ.Ссылка);
			
		СтрокаЗаказ = Запрос.Выполнить().Выбрать();	
		
		Пока СтрокаЗаказ.Следующий() Цикл 
						
			Попытка
				
				МенеджерЗаписи = РегистрыСведений.рэОбъектыДляОбмена.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Период = ТекущаяДата();
				МенеджерЗаписи.Объект = Документ.Ссылка;
				МенеджерЗаписи.Метод = Перечисления.рэМетоды.UpdateInvoiceStatus;
				МенеджерЗаписи.Операция = Перечисления.реОперацииПередачиСтатусов.ПриходНаСклад;
				МенеджерЗаписи.ДополнительнаяИнформация = ЗагрузкаИзИнтернетМагазина.ДатаВСтроку(ТекущаяДата());
				МенеджерЗаписи.Заказ  = СтрокаЗаказ.Реализация;
				МенеджерЗаписи.Записать();
				
			Исключение
				
				Отказ = Истина;
				Сообщить("Ошибка регистрации объекта для обмена в подсистеме Red: " + ОписаниеОшибки());
				
			КонецПопытки;
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументОбъект.ПогрузкаВАвто") Тогда
					
					
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ 
					   |	ЗагрузкаСТСДШтрихкоды.Ссылка КАК Ссылка,
		               |	РеализацияТоваровУслуг.Ссылка КАК Реализация
		               |ИЗ
		               |	Документ.ПогрузкаВАвто.Заказы КАК ЗагрузкаСТСДШтрихкоды
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		               |		ПО ЗагрузкаСТСДШтрихкоды.Заказ = РеализацияТоваровУслуг.Ссылка
		               |ГДЕ
		               |	ЗагрузкаСТСДШтрихкоды.Ссылка = &Ссылка
		               |	И РеализацияТоваровУслуг.ВладелецТовара = &ВладелецТовара
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЗагрузкаСТСДШтрихкоды.Ссылка,
		               |	РеализацияТоваровУслуг.Ссылка
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ 
		               |	ЗагрузкаСТСДШтрихкоды.Ссылка,
		               |	РеализацияТоваровУслуг.Ссылка
		               |ИЗ
		               |	Документ.ПогрузкаВАвто.Заказы КАК ЗагрузкаСТСДШтрихкоды
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		               |		ПО ЗагрузкаСТСДШтрихкоды.Заказ = РеализацияТоваровУслуг.Ссылка
		               |ГДЕ
		               |	ЗагрузкаСТСДШтрихкоды.Ссылка = &Ссылка
		               |	И РеализацияТоваровУслуг.ВладелецТовара.Родитель.ОсновнойМагазин = &ВладелецТовара
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЗагрузкаСТСДШтрихкоды.Ссылка,
		               |	РеализацияТоваровУслуг.Ссылка";
			
		Запрос.УстановитьПараметр("ВладелецТовара",  ПараметрыСеанса.рэКомпанияRED);
		Запрос.УстановитьПараметр("Ссылка",  Документ.Ссылка);
			
		СтрокаЗаказ = Запрос.Выполнить().Выбрать();	
		
		Пока СтрокаЗаказ.Следующий() Цикл 
						
			Попытка
				
				МенеджерЗаписи = РегистрыСведений.рэОбъектыДляОбмена.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Период = ТекущаяДата();
				МенеджерЗаписи.Объект = Документ.Ссылка;
				МенеджерЗаписи.Метод = Перечисления.рэМетоды.UpdateInvoiceStatus;
				МенеджерЗаписи.Операция = Перечисления.реОперацииПередачиСтатусов.ЗаказОтгруженКурьеру;
				МенеджерЗаписи.Заказ  = СтрокаЗаказ.Реализация;
				МенеджерЗаписи.ДополнительнаяИнформация = ЗагрузкаИзИнтернетМагазина.ДатаВСтроку(ТекущаяДата());
				МенеджерЗаписи.Записать();
				
			Исключение
				
				Отказ = Истина;
				Сообщить("Ошибка регистрации объекта для обмена в подсистеме Red: " + ОписаниеОшибки());
				
			КонецПопытки;
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументОбъект.новаОтчетВодителя") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	новаОтчетВодителяЗадания.Ссылка КАК Ссылка,
		               |	РеализацияТоваровУслуг.Ссылка КАК Реализация
		               |ИЗ
		               |	Документ.новаОтчетВодителя.Задания КАК новаОтчетВодителяЗадания
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		               |		ПО новаОтчетВодителяЗадания.Задание.Номер = РеализацияТоваровУслуг.Номер
		               |ГДЕ
		               |	новаОтчетВодителяЗадания.Ссылка = &Ссылка
		               |	И РеализацияТоваровУслуг.ВладелецТовара = &ВладелецТовара
		               |	И новаОтчетВодителяЗадания.Перенесено = ИСТИНА
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	новаОтчетВодителяЗадания.Ссылка,
		               |	РеализацияТоваровУслуг.Ссылка
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	новаОтчетВодителяЗадания.Ссылка,
		               |	РеализацияТоваровУслуг.Ссылка
		               |ИЗ
		               |	Документ.новаОтчетВодителя.Задания КАК новаОтчетВодителяЗадания
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		               |		ПО новаОтчетВодителяЗадания.Задание.Номер = РеализацияТоваровУслуг.Номер
		               |ГДЕ
		               |	новаОтчетВодителяЗадания.Ссылка = &Ссылка
		               |	И РеализацияТоваровУслуг.ВладелецТовара.Родитель.ОсновнойМагазин = &ВладелецТовара
		               |	И новаОтчетВодителяЗадания.Перенесено = ИСТИНА
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	новаОтчетВодителяЗадания.Ссылка,
		               |	РеализацияТоваровУслуг.Ссылка";
		
		
		Запрос.УстановитьПараметр("ВладелецТовара",  ПараметрыСеанса.рэКомпанияRED);
		Запрос.УстановитьПараметр("Ссылка",  Документ.Ссылка);

	
		СтрокаЗаказ = Запрос.Выполнить().Выбрать();	
		
		Пока СтрокаЗаказ.Следующий() Цикл 
						
			Попытка
				
				МенеджерЗаписи = РегистрыСведений.рэОбъектыДляОбмена.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Период = ТекущаяДата();
				МенеджерЗаписи.Объект = Документ.Ссылка;
				МенеджерЗаписи.Метод = Перечисления.рэМетоды.UpdateInvoiceStatus;
				МенеджерЗаписи.Операция = Перечисления.реОперацииПередачиСтатусов.Перенос;
				МенеджерЗаписи.Заказ  = СтрокаЗаказ.Реализация;
				МенеджерЗаписи.ДополнительнаяИнформация = ЗагрузкаИзИнтернетМагазина.ДатаВСтроку(ТекущаяДата());
				МенеджерЗаписи.Записать();
				
			Исключение
				
				Отказ = Истина;
				Сообщить("Ошибка регистрации объекта для обмена в подсистеме Red: " + ОписаниеОшибки());
				
			КонецПопытки;
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументОбъект.ГрупповаяУстановкаСтатусовЗаказов") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Контрагенты.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ ВТ_НужныеКонтрагенты
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	Контрагенты.Ссылка = &ВладелецТовара
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	Контрагенты.Ссылка
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	Контрагенты.Родитель.ОсновнойМагазин = &ВладелецТовара
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ГрупповаяУстановкаСтатусовЗаказовСтатусыЗаказов.Заказ КАК Реализация,
		               |	ВЫРАЗИТЬ(ГрупповаяУстановкаСтатусовЗаказовСтатусыЗаказов.Ссылка.Основание КАК Документ.ВнутреннееПеремещениеЗаказов) КАК Объект
		               |ИЗ
		               |	Документ.ГрупповаяУстановкаСтатусовЗаказов.СтатусыЗаказов КАК ГрупповаяУстановкаСтатусовЗаказовСтатусыЗаказов
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НужныеКонтрагенты КАК ВТ_НужныеКонтрагенты
		               |		ПО ГрупповаяУстановкаСтатусовЗаказовСтатусыЗаказов.Заказ.ВладелецТовара = ВТ_НужныеКонтрагенты.Ссылка
		               |ГДЕ
		               |	ГрупповаяУстановкаСтатусовЗаказовСтатусыЗаказов.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыЗаказов.ЗаказНаМагистрали)
		               |	И ГрупповаяУстановкаСтатусовЗаказовСтатусыЗаказов.Ссылка = &Ссылка
		               |	И ГрупповаяУстановкаСтатусовЗаказовСтатусыЗаказов.Ссылка.Основание ССЫЛКА Документ.ВнутреннееПеремещениеЗаказов";
		
		
		Запрос.УстановитьПараметр("ВладелецТовара",  ПараметрыСеанса.рэКомпанияRED);
		Запрос.УстановитьПараметр("Ссылка",  Документ.Ссылка);

	
		СтрокаЗаказ = Запрос.Выполнить().Выбрать();	
		
		Пока СтрокаЗаказ.Следующий() Цикл 
						
			Попытка
				
				МенеджерЗаписи = РегистрыСведений.рэОбъектыДляОбмена.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Период = ТекущаяДата();
				МенеджерЗаписи.Объект = СтрокаЗаказ.Объект;
				МенеджерЗаписи.Метод = Перечисления.рэМетоды.UpdateInvoiceStatus;
				МенеджерЗаписи.Операция = Перечисления.реОперацииПередачиСтатусов.ЗаказНаМагистрали;
				МенеджерЗаписи.Заказ  = СтрокаЗаказ.Реализация;
				МенеджерЗаписи.ДополнительнаяИнформация = ЗагрузкаИзИнтернетМагазина.ДатаВСтроку(ТекущаяДата());
				МенеджерЗаписи.Записать();
				
			Исключение
				
				Отказ = Истина;
				Сообщить("Ошибка регистрации объекта для обмена в подсистеме Red: " + ОписаниеОшибки());
				
			КонецПопытки;
			
		КонецЦикла;
	
		
	КонецЕсли;	
	
КонецПроцедуры	

Процедура рэОбработкаЗаписиПриЗаписи(Источник, Отказ) Экспорт
	
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.новаВодители") Тогда 
	
		REDРегламентВыгрузкиПоКурьерам_РегистрацияДляОтправки(Неопределено, Источник.Ссылка);	
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура рэОтправкаДанныхДляОбмена() Экспорт
	
	Если Не ЗначениеЗаполнено(ПараметрыСеанса.рэКомпанияRED) Тогда
		
		Возврат;
		
	КонецЕсли;	
	
	Отказ = REDРегламентВыгрузкиПоКурьерам();
	Отказ = REDОбновитАдресПолучателя(); 
	
	Отказ = REDПередачиДанныхПоДоставленнымТоварам();
	Отказ = REDОбновитьИнформациюОПлатежахПоНакладной();
	Отказ = REDОбновитьСтоимостьДоставкиУстановленнуюМагазином();
	
	Отказ = REDПередачаДанныхОСтатусах_ПриходНаСклад();
	Отказ = REDПередачаДанныхОСтатусах_ОтсортированНаМаршрут();
	Отказ = REDПередачаДанныхОСтатусах_ЗаказОтгруженКурьеру();
	Отказ = REDПередачаДанныхОСтатусах_ЗаказОтменен();
	Отказ = REDПередачаДанныхОСтатусах_ОтказВоВремяДоставки();
	Отказ = REDПередачаДанныхОСтатусах_Перенос();
	Отказ = REDПередачаДанныхОСтатусах_ЧастичнаяДоставка();
	Отказ = REDПередачаДанныхОСтатусах_ЧастичнаяДоставкаСНедовложением();
	Отказ = REDПередачаДанныхОСтатусах_Выполнен();
	Отказ = REDПередачаДанныхОСтатусах_ЗаказНаМагистрали();
	Отказ = REDПередачаДанныхОСтатусах_ЗаказПоступилВТерминалДоставки();
			
КонецПроцедуры

Процедура ВыгрузкаВодителейвРЭД() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПривязкаМашинКРейсамСрезПоследних.Водитель КАК Водитель,
	               |	ПривязкаМашинКРейсамСрезПоследних.Рейс КАК Рейс
	               |ИЗ
	               |	РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних(
	               |			,
	               |			Рейс.ДатаРейса >= &Период
	               |				И Рейс.ДатаРейса <= КОНЕЦПЕРИОДА(&Период, ДЕНЬ)) КАК ПривязкаМашинКРейсамСрезПоследних
	               |ГДЕ
	               |	ПривязкаМашинКРейсамСрезПоследних.Водитель <> ЗНАЧЕНИЕ(Справочник.новаВодители.пустаяссылка)";
	
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		REDРегламентВыгрузкиПоКурьерам_РегистрацияДляОтправки(Выборка.Рейс, Выборка.Водитель);		
	
	КонецЦикла; 
	
	REDРегламентВыгрузкиПоКурьерам();	
	
КонецПроцедуры

Функция ЭтоРЭД(Контрагент) Экспорт 
	
	РЭД =  Константы.рэКомпанияRED.Получить();
	
	Если Контрагент = РЭД Или Контрагент.Родитель.ОсновнойМагазин = РЭД Тогда
		
		Возврат Истина;
		
	Иначе 
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции	



