#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТребуемыйКод = Параметры.ТребуемыйКод;
	ПричинаОтказаПереноса = Параметры.ПричинаОтказаПереноса;
	Заказ = Параметры.Заказ;
	РезультатДоставки = Параметры.РезультатДоставки;
	Рейс = Параметры.Рейс;	
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура БезКода(Команда)
	СтруктураПараметровЗакрытия = ПолучитьОбщуюСтруктуруПараметровЗакрытия();
	СтруктураПараметровЗакрытия.Вставить("РезультатВыполненияВводаКИК", "БезКода");
	СтруктураПараметровЗакрытия.Вставить("СтатусУстановленБезКИК", Истина);
	Закрыть(СтруктураПараметровЗакрытия);
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	СтруктураПараметровЗакрытия = ПолучитьОбщуюСтруктуруПараметровЗакрытия();
	СтруктураПараметровЗакрытия.Вставить("РезультатВыполненияВводаКИК", "КодНеВведен");
	Закрыть(СтруктураПараметровЗакрытия);
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	// Вставить содержимое обработчика.
	Если ТребуемыйКод <> ВведенныйКод Тогда
		Элементы.ДекорацияРезультат.Заголовок = "КОД НЕ ВЕРЕН!";
	Иначе
		Элементы.ДекорацияРезультат.Заголовок = "ВЕРНЫЙ КОД!";
		СтруктураПараметровЗакрытия = ПолучитьОбщуюСтруктуруПараметровЗакрытия();
		СтруктураПараметровЗакрытия.Вставить("РезультатВыполненияВводаКИК", "ВерныйКод");
		СтруктураПараметровЗакрытия.Вставить("ВведенныйКИК", ВведенныйКод);
		Закрыть(СтруктураПараметровЗакрытия);
	КонецеСли;	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получить общую структуру параметров закрытия.
// 
// Возвращаемое значение:
//  Структура - Получить общую структуру параметров закрытия:
// * Заказ - СправочникСсылка.Заказы - 
// * РезультатДоставки - СправочникСсылка.РезультатыДоставки - 
// * ПричинаОтказаПереноса - СправочникСсылка.ПричиныОтказаПереноса - 
// * Рейс - СправочникСсылка.Рейсы - 
&НаКлиенте
Функция ПолучитьОбщуюСтруктуруПараметровЗакрытия()
	ПараметрыЗакрытияФормы = Новый Структура();
	ПараметрыЗакрытияФормы.Вставить("Заказ", Заказ);
	ПараметрыЗакрытияФормы.Вставить("РезультатДоставки", РезультатДоставки);
	ПараметрыЗакрытияФормы.Вставить("ПричинаОтказаПереноса", ПричинаОтказаПереноса);
	ПараметрыЗакрытияФормы.Вставить("Рейс", Рейс);	
	
	Возврат ПараметрыЗакрытияФормы;
КонецФункции	
#КонецОбласти


