
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр мгТарифыФОТ
	Движения.мгТарифыНадбавки.Записывать = Истина;
	Движения.мгТарифыНадбавки.Очистить();
	Для Каждого ТекСтрокаТарифыНачислений Из ТарифыНачислений Цикл
		Движение = Движения.мгТарифыНадбавки.Добавить();
		Движение.Период = Дата;
		Движение.Начисление = ТекСтрокаТарифыНачислений.Начисления;
		Движение.Тариф = ТекСтрокаТарифыНачислений.Тариф;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
