Функция Сформировать(Таб, НачПериода, КонПериода, Контрагент) Экспорт
	Таб.Очистить();
	Зап = Новый Запрос;
				
	Зап.Текст = "ВЫБРАТЬ
	            |	МАКСИМУМ(ДанныеЗаказаВодителя.Дата) КАК ДатаДоставки,
	            |	ДанныеЗаказаВодителя.Реализация
	            |ПОМЕСТИТЬ ВТВремяДоставки
	            |ИЗ
	            |	Документ.ДанныеЗаказаВодителя КАК ДанныеЗаказаВодителя
	            |ГДЕ
	            |	ДанныеЗаказаВодителя.Реализация.ВладелецТовара = &ИнтернетМагазин
	            |
	            |СГРУППИРОВАТЬ ПО
	            |	ДанныеЗаказаВодителя.Реализация
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	СостоянияЗаказов.Доставка.ВремяПрибытияС КАК ВремяПрибытияС,
	            |	СостоянияЗаказов.Доставка.ВремяПрибытияПо КАК ВремяПрибытияПо,
	            |	ВТВремяДоставки.ДатаДоставки КАК ДатаДоставкиПоФакту,
	            |	ВЫБОР
	            |		КОГДА СостоянияЗаказов.ПричинаНеВыполнения В (ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.НетНаСкладе), ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ОтказКлиентаБезЗаезда), ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ОтказКлиентаСЗаездом))
	            |			ТОГДА СостоянияЗаказов.ПричинаОтказа
	            |		ИНАЧЕ """"
	            |	КОНЕЦ КАК ПричинаОтмены,
	            |	ВЫБОР
	            |		КОГДА СостоянияЗаказов.ПричинаНеВыполнения В (ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ПереносДоставки), ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ПереносСЗаездом))
	            |			ТОГДА СостоянияЗаказов.ПричинаОтказа
	            |		ИНАЧЕ """"
	            |	КОНЕЦ КАК ПричинаПереноса,
	            |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа КАК НомерЗаказа,
	            |	ВЫБОР
	            |		КОГДА СостоянияЗаказов.РезультатДоставки <> ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.Выполнена)
	            |				И СостоянияЗаказов.РезультатДоставки <> ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.ВыполненаЧастично)
	            |			ТОГДА ВЫБОР
	            |					КОГДА СостоянияЗаказов.ПричинаНеВыполнения В (ЗНАЧЕНИЕ(Справочник.ПричиныНевыполненияДоставки.ПереносСЗаездом), ЗНАЧЕНИЕ(Справочник.ПричиныНевыполненияДоставки.ПереносДоставки))
	            |						ТОГДА ""Перенос""
	            |					ИНАЧЕ ""Отмена""
	            |				КОНЕЦ
	            |		ИНАЧЕ ""Доставлен""
	            |	КОНЕЦ КАК СтатусЗаказа,
	            |	РеализацияТоваровУслуг.Дата КАК ДатаДоставки,
	            |	ВЫБОР
	            |		КОГДА СостоянияЗаказов.РезультатДоставки <> ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.Выполнена)
	            |				И СостоянияЗаказов.РезультатДоставки <> ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.ВыполненаЧастично)
	            |			ТОГДА ВЫБОР
	            |					КОГДА СостоянияЗаказов.ПричинаНеВыполнения В (ЗНАЧЕНИЕ(Справочник.ПричиныНевыполненияДоставки.ПереносСЗаездом), ЗНАЧЕНИЕ(Справочник.ПричиныНевыполненияДоставки.ОтказКлиентаСЗаездом))
	            |						ТОГДА ИСТИНА
	            |					ИНАЧЕ ЛОЖЬ
	            |				КОНЕЦ
	            |		ИНАЧЕ ИСТИНА
	            |	КОНЕЦ КАК Ездили
	            |ИЗ
	            |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	            |		ЛЕВОЕ СОЕДИНЕНИЕ ВТВремяДоставки КАК ВТВремяДоставки
	            |		ПО (ВТВремяДоставки.Реализация.Ссылка = РеализацияТоваровУслуг.Ссылка)
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказов КАК СостоянияЗаказов
	            |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.новаОтчетВодителя КАК новаОтчетВодителя
	            |			ПО СостоянияЗаказов.Регистратор = новаОтчетВодителя.Ссылка
	            |		ПО РеализацияТоваровУслуг.Номер = СостоянияЗаказов.Доставка.Номер
	            |ГДЕ
	            |	новаОтчетВодителя.Рейс.ДатаНачала МЕЖДУ &НачПериода И &КонПериода
	            |	И РеализацияТоваровУслуг.ВладелецТовара = &ИнтернетМагазин
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |УНИЧТОЖИТЬ ВТВремяДоставки";
				
				
				
				
	Зап.УстановитьПараметр("НачПериода", НачалоДня(НачПериода));			
	Зап.УстановитьПараметр("КонПериода", КонецДня(КонПериода));			
	Зап.УстановитьПараметр("ИнтернетМагазин", Контрагент);			
	
	Рез = Зап.Выполнить().Выгрузить();
	
	
	Мак = ПолучитьМакет("Макет");
	ОблШ = Мак.ПолучитьОбласть("Шапка");
	ОблСтр = Мак.ПолучитьОбласть("Строка");
	Таб.Вывести(ОблШ);
	
	
	
	
	Для Каждого Тек Из Рез Цикл
		ЗаполнитьЗначенияСвойств(ОблСтр.параметры, Тек);
		
		ЧН = Час(Тек.ВремяПрибытияС);
		ЧК = Час(Тек.ВремяПрибытияПо);
		
		ЧС = Окр(ЧК-ЧН/2);
		
		МН = Минута(Тек.ВремяПрибытияС);
		МК = Минута(Тек.ВремяПрибытияПо);
		
		ОблСтр.Параметры.ПериодДоставки = "с " + Формат(ЧН, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=") + ":" + Формат(МН, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=") + " по " + Формат(ЧК, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=") + ":" + Формат(МК, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=");
		
		Если ЗначениеЗаполнено(Тек.ДатаДоставкиПоФакту) Тогда
			ЧН = Час(Тек.ДатаДоставкиПоФакту);
			МН = Минута(Тек.ДатаДоставкиПоФакту);
			Если Тек.СтатусЗаказа = "Отмена" Тогда
				Если Тек.Ездили Тогда
					ОблСтр.Параметры.ВремяПриезда = Формат(ЧН, "ЧЦ=2; ЧВН=; ЧГ=") + ":" + Формат(МН, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=");
				Иначе
					ОблСтр.Параметры.ВремяПриезда = "не ездили";
				КонецеСли;	
			Иначе
				ОблСтр.Параметры.ВремяПриезда = Формат(ЧН, "ЧЦ=2; ЧВН=; ЧГ=") + ":" + Формат(МН, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=");
			КонецеСли;
		Иначе
			ОблСтр.Параметры.ВремяПриезда = Формат(ЧС, "ЧЦ=2; ЧВН=; ЧГ=") + ":23";
		КонецеСли;
		Таб.Вывести(ОблСтр);
	КонецЦикла;
	
	
	Таб.ПолеСлева = 3;
	Таб.ПолеСнизу = 3;
	Таб.ПолеСверху = 3;
	Таб.ПолеСправа = 3;
	Таб.Автомасштаб = Истина;
	Таб.ТолькоПросмотр = 1;
	Таб.ИмяПараметровПечати = "Энтер_2";
	Возврат Таб;
КонецФункции