&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	ДатаОтч = ДобавитьМесяц(ТекущаяДата(), -1); 
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	ТабДок = СформироватьСервер();
КонецПроцедуры

&НаСервере
Функция СформироватьСервер()
	От = Отчеты.ОтчетПоКачествуДоставок_Лореаль.Создать();
    Возврат От.СформироватьОтчет(ДатаОтч,Контрагент);
   //ОбъектНаСервере = РеквизитФормыВЗначение("Отчет");
   //Возврат ОбъектНаСервере.СформироватьОтчет(ДатаОтч, Контрагент);
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_618");
КонецПроцедуры


