
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Час(ТекущаяДата()) >= 17 Тогда
		ДатаНачала = НачалоДня(ТекущаяДата()+ 12*60*60) - 9 * 24 * 3600;      //
	Иначе
		ДатаНачала = НачалоДня(ТекущаяДата()) - 9 * 24 * 3600;
	КонецЕсли;
	Объект.ДатаНачала = ДатаНачала;
	Объект.ДатаОкончания = ДатаНачала + 18 * 3600 * 24;
	ТерминалДоставки = ?(ЗначениеЗаполнено(ПараметрыСеанса.ТерминалДоставки),ПараметрыСеанса.ТерминалДоставки,Справочники.РегиональныеТерминалы.МоскваСтриж);
	Объект.ТерминалДоставки = ТерминалДоставки;
	СтрокаТерминалаМск = Объект.РегиональныеТерминалы.Добавить();
	СтрокаТерминалаМск.РегиональныйТерминал = Справочники.РегиональныеТерминалы.МоскваСтриж;
	СтрокаТерминалаМск.Выгружать = ТерминалДоставки <> Справочники.РегиональныеТерминалы.СПбСтриж;
	СтрокаТерминалаСпб = Объект.РегиональныеТерминалы.Добавить();
	СтрокаТерминалаСпб.РегиональныйТерминал = Справочники.РегиональныеТерминалы.СПбСтриж;
	СтрокаТерминалаСпб.Выгружать = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	СобытиеКонтроляВремени = ПредопределенноеЗначение("Справочник.СобытияКонтроляВремени.ВыгрузкаШКВСерверСканирования");
	ПустойРейс = ПредопределенноеЗначение("Документ.Рейс.ПустаяСсылка");
	Если УчетКонтроляВремениСервер.ПроверитьСостояниеСобытия(СобытиеКонтроляВремени,ПустойРейс,Объект.ТерминалДоставки) Тогда
		МассивТерминалов = Новый Массив;
		Для Каждого СтрокаТЧ Из Объект.РегиональныеТерминалы Цикл
			Если СтрокаТЧ.Выгружать Тогда
				МассивТерминалов.Добавить(СтрокаТЧ.РегиональныйТерминал);
			КонецЕсли;	
		КонецЦикла;	
		УчетКонтроляВремениСервер.ЗаписатьРСКонтрольВремени(СобытиеКонтроляВремени,,Ложь,,,Объект.ТерминалДоставки);
		Попытка
			СтруктураОтвета = РаботаССервисомСканированияСервер.ВыгрузитьШКНаСерверСканирования(Объект.ДатаНачала,Объект.ДатаОкончания,МассивТерминалов,Объект.УдалятьДублиШК);
			Если СтруктураОтвета.result = "OK" Тогда
				ТекстПредупреждения = "Выгрузка ШК закончена";
			Иначе
				ТекстПредупреждения = "Не удалось выгрузить ШК! " + СтруктураОтвета.errorDescr;
			КонецЕсли;	
			УчетКонтроляВремениСервер.ЗаписатьРСКонтрольВремени(СобытиеКонтроляВремени,,Истина,,,Объект.ТерминалДоставки);
			ПоказатьПредупреждение(,ТекстПредупреждения);
		Исключение
			УчетКонтроляВремениСервер.ЗаписатьРСКонтрольВремени(СобытиеКонтроляВремени,,Истина,,,Объект.ТерминалДоставки);
			ПоказатьПредупреждение(,"Произошла ошибка при выгрузке ШК! " + ОписаниеОшибки());
			Возврат;
		КонецПопытки;		
	Иначе
		ПоказатьПредупреждение(,"Выгрузка ШК уже выполняется!");
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура РегиональныеТерминалыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура РегиональныеТерминалыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

