
Процедура ОбработкаПроведения(Отказ, Режим)
	Если Не ЗначениеЗаполнено(ДатаНазначения) Тогда
		Сообщить("Не указана дата назначения!", СтатусСообщения.Важное);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Для Каждого стрСотрудник Из Сотрудники Цикл
		Если Не ЗначениеЗаполнено(стрСотрудник.Сотрудник) Тогда
			Сообщить("Строка " + Строка(стрСотрудник.НомерСтроки) + ": не заполнен сотрудник!", СтатусСообщения.Важное);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Движение = Движения.новаСхемыНачисленияЗарплатыСотрудников.Добавить();
		Движение.Период = ДатаНазначения;
		ЗаполнитьЗначенияСвойств(Движение, стрСотрудник);
	КонецЦикла;
КонецПроцедуры
