Функция ОписаниеТиповСтрока() Экспорт
	Возврат Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(10));
КонецФункции	

Функция ТипШтрихкода(Штр, ИмяП = Неопределено) Экспорт
	Если ТипЗнч(Штр) = Тип("ПеречислениеСсылка.ТипыЗагрузкиТСД") Тогда
		ОбъектМетаданных = Штр.Метаданные();
		
		ИндексЗначения = Перечисления[ОбъектМетаданных.Имя].Индекс(Штр);
		
		ИмяП = ОбъектМетаданных.ЗначенияПеречисления[ИндексЗначения].Имя;		
		Возврат "ТипыЗагрузкиТСД";
	ИначеЕсли ТипЗнч(Штр) = Тип("СправочникСсылка.Контрагенты") Тогда
		ИмяП = СокрЛП(Штр.Наименование);		
		Возврат "Контрагенты";		
	ИначеЕсли ТипЗнч(Штр) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Возврат "Реализация";
	ИначеЕсли ТипЗнч(Штр) = Тип("Число") Тогда
		Возврат "Число";
		
	КонецеСли;	
КонецФункции	

Функция ПустойТранспорт() Экспорт
	Возврат Справочники.новаТранспорт.НайтиПоКоду("000152").Ссылка;
КонецФункции	