#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр СтатусыЗаказов
	Движения.СтатусыЗаказов.Записывать = Истина;
	Для Каждого ТекЗаказ Из Заказы Цикл
		Движение = Движения.СтатусыЗаказов.Добавить();
		Движение.Период = Дата;
		Движение.Заказ = ТекЗаказ.Заказ;
		Движение.Рейс = Рейс;
		Движение.РезультатДоставки = ТекЗаказ.СтатусДоставки;
		Движение.ПричинаОтказаПереноса = ТекЗаказ.ПричинаОтказаПереноса;
		Движение.ДатаПереносаДоставки = ТекЗаказ.ДатаПереносаДоставки;
		Движение.СтатусУстановленВЦУ = СтатусУстановленВЦУ;
	КонецЦикла	

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ	
КонецПроцедуры
#КонецОбласти	 