&НаКлиенте
Функция ПолучитьИмяПровайдера() Экспорт
	
#Если МобильноеПриложениеКлиент Тогда
	Данные = ГеопозиционированиеСервер.ПолучитьИмяПровайдера();
	Провайдер = Неопределено;
	Если Данные.Выбор = ПредопределенноеЗначение("Перечисление.ИспользоватьПровайдерГеопозиционирования.СамыйЭкономичныйПровайдер") Тогда
		Провайдер = СредстваГеопозиционирования.ПолучитьСамогоЭнергоЭкономичногоПровайдера();
	ИначеЕсли Данные.Выбор = ПредопределенноеЗначение("Перечисление.ИспользоватьПровайдерГеопозиционирования.СамыйТочныйПровайдер") Тогда
		Провайдер = СредстваГеопозиционирования.ПолучитьСамогоТочногоПровайдера();
		Если Провайдер = Неопределено Тогда
			//берем первого попавшегося провайдера
			МасПровайдеров = СредстваГеопозиционирования.ПолучитьПровайдеров();
			Для Каждого ТекПровайдер Из МасПровайдеров Цикл
				Провайдер = ТекПровайдер;
				Прервать;
			КонецЦикла;
		КонецЕсли;	
	Иначе
		Если Не ЗначениеЗаполнено(Данные.Имя) Тогда
	        Ответ = Вопрос(НСтр("ru = ""Не выбран провайдер геопозиционирования. Установить его сейчас?"";"), РежимДиалогаВопрос.ДаНет, 0);
	        Если Ответ = КодВозвратаДиалога.Да Тогда
				П = Новый Структура("Геопозиционирование", Истина); 
	            ОткрытьФормуМодально("ОбщаяФорма.ФормаКонстант",П);
				Возврат ПолучитьИмяПровайдера();
	        Иначе
	            Возврат "";
	        КонецЕсли;
		КонецЕсли;
		Провайдер = СредстваГеопозиционирования.ПолучитьПровайдера(Данные.Имя);
		Если Провайдер = Неопределено Тогда
	        Ответ = Вопрос(НСтр("ru = ""Не доступен провайдер геопозиционирования. Изменить установки?"";"), РежимДиалогаВопрос.ДаНет, 0);
	        Если Ответ = КодВозвратаДиалога.Да Тогда
				П = Новый Структура("Геопозиционирование", Истина); 
	            ОткрытьФормуМодально("ОбщаяФорма.ФормаКонстант",П);
				Возврат ПолучитьИмяПровайдера();
	        Иначе
	            Возврат "";
	        КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если Провайдер <> Неопределено Тогда
		Возврат Провайдер.Имя;
	КонецЕсли;
#КонецЕсли
	Возврат "";

КонецФункции

&НаКлиенте
Функция ОбновитьМестоположение(ИмяПровайдера) Экспорт
    
#Если МобильноеПриложениеКлиент Тогда
	//ИмяПровайдера = ПолучитьИмяПровайдера();
	//Если Не ЗначениеЗаполнено(ИмяПровайдера) Тогда
	//    Возврат Ложь;
	//КонецЕсли;     
	
	СписокПровайдеров = СредстваГеопозиционирования.ПолучитьПровайдеров(Истина);
	
	Если СписокПровайдеров.Количество() = 0 Или СписокПровайдеров.Количество() = 1  Тогда
		Предупреждение("Нет провайдеров геопозиционирования!", 60);
		Возврат Ложь;
	Иначе
		//ИмяПровайдера = СписокПровайдеров[1].Имя;
	КонецеСли;	
	
	МестоПолучено = Ложь;
	Для Сч = 1 По СписокПровайдеров.Количество() - 1 Цикл
		ИмяПровайдера = СписокПровайдеров[Сч].Имя;
		Если Не СредстваГеопозиционирования.ОбновитьМестоположение(ИмяПровайдера, 10) Тогда // Если провайдер доступен, то 60 секунд достаточно для определения местоположения
			//Ответ = Вопрос(НСтр("ru = ""Не удалось получить данные от провайдера геопозиционирования. Изменить установки?"";"), РежимДиалогаВопрос.ДаНет, 0);
			//Если Ответ = КодВозвратаДиалога.Да Тогда
			//	П = Новый Структура("Геопозиционирование", Истина); 
			//    ОткрытьФормуМодально("ОбщаяФорма.ФормаКонстант",П);
			//	Возврат ОбновитьМестоположение(ИмяПровайдера);
			//Иначе
			//    Возврат Ложь;
			//КонецЕсли;
		Иначе	
			МестоПолучено = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если МестоПолучено Тогда
		Возврат истина;
	Иначе	
		Предупреждение("Не могу определить местоположение!", 60);
		Возврат Ложь;
	КонецЕсли;
#КонецЕсли

	Возврат Ложь;
    
КонецФункции
