
//Асеев 05.10.2020 (Задача № 4289)>>>
Процедура ЗаписатьИнформированиеЭкипажейОбИзмененияхВЗаказах(Знач СтруктураПараметров) Экспорт
	
	//Асеев 23.03.2021 (Задача № 4503)>>>
	Если Не СтруктураПараметров.Свойство("Транспорт") Тогда
		//Асеев 23.03.2021 (Задача № 4503)<<<
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Рейс", СтруктураПараметров.Рейс);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПривязкаМашинКРейсамСрезПоследних.Транспорт КАК Транспорт
		|ИЗ
		|	РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних(, Рейс = &Рейс) КАК ПривязкаМашинКРейсамСрезПоследних";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			СтруктураПараметров.Вставить("Транспорт", Выборка.Транспорт);
		КонецЕсли;
	КонецЕсли;
	
	ЗаписьРегистра = РегистрыСведений.ИнформированиеЭкипажейОбИзмененияхВЗаказах.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(ЗаписьРегистра, СтруктураПараметров);
	ЗаписьРегистра.Записать();
	
КонецПроцедуры
//Асеев 05.10.2020 (Задача № 4289)<<<

