Функция Сформировать(Таб, НачДата, КонДата, МассивКонтр) Экспорт
	Таб.Очистить();
	Зап = Новый Запрос;
	Зап.Текст = ТекстЗапросаЗаказы();				
				
	Зап.УстановитьПараметр("НачДата", НачалоДня(НачДата));			
	Зап.УстановитьПараметр("КонДата", КонецДня(КонДата));			
	Зап.УстановитьПараметр("МасКонтр", МассивКонтр);			
	
	Рез = Зап.Выполнить().Выгрузить();
	
	Мак = ПолучитьМакет("Макет");
	
	ОблШ = Мак.ПолучитьОбласть("Шапка");
	ОблС = Мак.ПолучитьОбласть("Строка");
	
	Таб.Вывести(ОблШ);
	
	НПП = 1;
	
	Для Каждого Тек Из Рез Цикл
		Ном2 = СтрПолучитьСтроку(СтрЗаменить(Тек.ВнешнийНомерЗаказа, "*", Символы.ПС), 2);
		ЗаполнитьЗначенияСвойств(ОблС.Параметры, Тек);
		
		Если Не ЗначениеЗаполнено(Тек.КоличествоДополнительныхВызовов) Тогда
			УслугиСД = Тек.СтоимостьДоставки;
			СтоимостьДопВыездов = 0;
		Иначе
			УслугиСД = Тек.СтоимостьДоставки/(Тек.КоличествоДополнительныхВызовов + 1);
			СтоимостьДопВыездов = Тек.КоличествоДополнительныхВызовов*УслугиСД;
		КонецеСли;	
		
		ОблС.Параметры.ВнешнийНомерЗаказа = Ном2;
		ОблС.Параметры.НПП = НПП;
		ОблС.Параметры.СтоимостьДоставки = УслугиСД;
		ОблС.Параметры.СтоимостьДопВыездов = СтоимостьДопВыездов;
		НПП = НПП + 1;
		Таб.Вывести(ОблС);
	КонецЦикла;	
	
	Зап = Новый Запрос;
	Зап.Текст = ТекстЗапросаЗаборовВозвратов();				
			
	Зап.УстановитьПараметр("НачДата", НачалоДня(НачДата));			
	Зап.УстановитьПараметр("КонДата", КонецДня(КонДата));			
	Зап.УстановитьПараметр("МасКонтр", МассивКонтр);
	Рез = Зап.Выполнить().Выгрузить();	
	
	ОблР = Мак.ПолучитьОбласть("Разделитель");
	
	ОблШ = Мак.ПолучитьОбласть("ШапкаЗаборы");
	ОблС = Мак.ПолучитьОбласть("СтрокаЗаборы");
	
	Таб.Вывести(ОблР);
	Таб.Вывести(ОблШ);
	
	НПП = 1;
	
	Для Каждого Тек Из Рез Цикл
		ЗаполнитьЗначенияСвойств(ОблС.Параметры, Тек);
		ОблС.Параметры.НПП = НПП;
		НПП = НПП + 1;
		Таб.Вывести(ОблС);
	КонецЦикла;	
	
	
	Возврат Таб;
КонецФункции	


Функция ТекстЗапросаЗаказы()
	Возврат "ВЫБРАТЬ
	        |	ЗакрытыеЗаказыОбороты.Реализация.Ссылка КАК Заказ,
	        |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ новаОтчетВодителяЗадания.Ссылка.Ссылка) КАК КоличествоВыездов
	        |ПОМЕСТИТЬ ВТКоличествоВыездов
	        |ИЗ
	        |	РегистрНакопления.ЗакрытыеЗаказы.Обороты(&НачДата, &КонДата, , ИнтернетМагазин В (&МасКонтр)) КАК ЗакрытыеЗаказыОбороты
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.новаОтчетВодителя.Задания КАК новаОтчетВодителяЗадания
	        |		ПО ЗакрытыеЗаказыОбороты.Реализация.Номер = новаОтчетВодителяЗадания.Задание.Номер
	        |ГДЕ
	        |	новаОтчетВодителяЗадания.ПричинаНевыполнения.Ссылка В (ЗНАЧЕНИЕ(Справочник.ПричиныНевыполненияДоставки.ПереносСЗаездом))
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ЗакрытыеЗаказыОбороты.Реализация.Ссылка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ЗакрытыеЗаказыОбороты.Реализация.НомерВнешнегоЗаказа КАК ВнешнийНомерЗаказа,
	        |	ЗакрытыеЗаказыОбороты.МассаОборот * 1000 КАК Вес,
	        |	ЗакрытыеЗаказыОбороты.ОплаченоКлиентовНалОборот - ЗакрытыеЗаказыОбороты.ПредоплатаПоКредитуОборот КАК ПолученоОтПокупателя,
	        |	ЗакрытыеЗаказыОбороты.УслугиСДОборот КАК СтоимостьДоставки,
	        |	ЗакрытыеЗаказыОбороты.КассовоеОбслуживаниеОборот КАК КассовоеОбслуживание,
	        |	ЕСТЬNULL(РасчетУслугСДОбороты.СуммаОборот, 0) КАК Подъем,
	        |	ЗакрытыеЗаказыОбороты.Реализация.НомерВнешнегоЗаказа КАК Баркод,
	        |	ЗакрытыеЗаказыОбороты.Реализация.Ссылка КАК Заказ,
	        |	ЕСТЬNULL(ВТКоличествоВыездов.КоличествоВыездов, 0) КАК КоличествоДополнительныхВызовов,
	        |	ВЫБОР
	        |		КОГДА ЗакрытыеЗаказыОбороты.ТипОплаты.Код = 1
	        |			ТОГДА ЗакрытыеЗаказыОбороты.СуммаОценочнаяОборот + ЗакрытыеЗаказыОбороты.СуммаДоставкиЗаМКАДОборот + ЗакрытыеЗаказыОбороты.СуммаДоставкиДоМКАДОборот
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК СуммаЗаказаНал,
	        |	ЗакрытыеЗаказыОбороты.СуммаВозвратаОборот КАК СуммаВозврата,
	        |	ЗакрытыеЗаказыОбороты.Реализация.Номер КАК Номер
	        |ИЗ
	        |	РегистрНакопления.ЗакрытыеЗаказы.Обороты(
	        |			&НачДата,
	        |			&КонДата,
	        |			,
	        |			ИнтернетМагазин.Ссылка В (&МасКонтр)
	        |				И СтатусИнтернетМагазина = ЗНАЧЕНИЕ(Справочник.статусзаказаинтернетмагазина.заказзакрыт)) КАК ЗакрытыеЗаказыОбороты
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетУслугСД.Обороты(&НачДата, &КонДата, , ПоказательУслуг.Ссылка = ЗНАЧЕНИЕ(Справочник.показателиРасчетаУслугСД.Подъем)) КАК РасчетУслугСДОбороты
	        |		ПО ЗакрытыеЗаказыОбороты.Реализация.Ссылка = РасчетУслугСДОбороты.Реализация.Ссылка
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоличествоВыездов КАК ВТКоличествоВыездов
	        |		ПО ЗакрытыеЗаказыОбороты.Реализация.Ссылка = ВТКоличествоВыездов.Заказ.Ссылка
	        |ГДЕ
	        |	ЗакрытыеЗаказыОбороты.ТипЗаказа В (ЗНАЧЕНИЕ(Перечисление.Типызаказов.Доставка), ЗНАЧЕНИЕ(Перечисление.Типызаказов.самовывоз))
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |УНИЧТОЖИТЬ ВТКоличествоВыездов";
КонецФункции	

Функция ТекстЗапросаЗаборов()
	Возврат "ВЫБРАТЬ
	        |	ЗакрытыеЗаказыОбороты.Реализация.НомерВнешнегоЗаказа КАК ВнешнийНомерЗаказа,
	        |	ЗакрытыеЗаказыОбороты.УслугиСДОборот КАК СтоимостьДоставки,
	        |	ЗакрытыеЗаказыОбороты.Реализация.НомерВнешнегоЗаказа КАК Баркод,
	        |	ЗакрытыеЗаказыОбороты.Реализация.Ссылка КАК Заказ,
	        |	ЗакрытыеЗаказыОбороты.Реализация.Дата КАК ДатаЗабора,
	        |	ЗакрытыеЗаказыОбороты.Реализация.АдресДоставки КАК АдресЗабора
	        |ИЗ
	        |	РегистрНакопления.ЗакрытыеЗаказы.Обороты(
	        |			&НачДата,
	        |			&КонДата,
	        |			,
	        |			ИнтернетМагазин.Ссылка В (&МасКонтр)
	        |				И СтатусИнтернетМагазина = ЗНАЧЕНИЕ(Справочник.статусзаказаинтернетмагазина.заказзакрыт)) КАК ЗакрытыеЗаказыОбороты
	        |ГДЕ
	        |	ЗакрытыеЗаказыОбороты.ТипЗаказа В (ЗНАЧЕНИЕ(Перечисление.Типызаказов.Забор))";
КонецФункции	



Функция ТекстЗапросаЗаборовВозвратов()
	Возврат "ВЫБРАТЬ
	        |	ЗакрытыеЗаказыОбороты.Реализация.НомерВнешнегоЗаказа КАК ВнешнийНомерЗаказа,
	        |	ЗакрытыеЗаказыОбороты.УслугиСДОборот КАК СтоимостьДоставки,
	        |	ЗакрытыеЗаказыОбороты.Реализация.НомерВнешнегоЗаказа КАК Баркод,
	        |	ЗакрытыеЗаказыОбороты.Реализация.Дата КАК ДатаЗабора,
	        |	""Забор"" КАК ТипОтправки
	        |ИЗ
	        |	РегистрНакопления.ЗакрытыеЗаказы.Обороты(
	        |			&НачДата,
	        |			&КонДата,
	        |			,
	        |			ИнтернетМагазин.Ссылка В (&МасКонтр)
	        |				И СтатусИнтернетМагазина = ЗНАЧЕНИЕ(Справочник.статусзаказаинтернетмагазина.заказзакрыт)) КАК ЗакрытыеЗаказыОбороты
	        |ГДЕ
	        |	ЗакрытыеЗаказыОбороты.ТипЗаказа В (ЗНАЧЕНИЕ(Перечисление.Типызаказов.Забор))
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	"""",
	        |	"""",
	        |	"""",
	        |	ВозвратТоваровПоставщику.Дата,
	        |	""Возврат""
	        |ИЗ
	        |	Документ.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику
	        |ГДЕ
	        |	ВозвратТоваровПоставщику.Проведен = ИСТИНА
	        |	И ВозвратТоваровПоставщику.Дата МЕЖДУ &НачДата И &КонДата
	        |	И ВозвратТоваровПоставщику.Контрагент В(&МасКонтр)";
КонецФункции	


Функция ВыгрузитьXML(Кат, НачДата, КонДата, МассивКонтр) Экспорт
	Зап = Новый Запрос;
	Зап.Текст = ТекстЗапросаЗаказы();				
				
	Зап.УстановитьПараметр("НачДата", НачалоДня(НачДата));			
	Зап.УстановитьПараметр("КонДата", КонецДня(КонДата));			
	Зап.УстановитьПараметр("МасКонтр", МассивКонтр);			
	
	Выб = Зап.Выполнить().Выбрать();
	
	
	Г = Новый УникальныйИдентификатор;
	
	ПутьКФайлу = Кат + "\" + "_subagent-report_" + Строка(Г) + ".xml";
	
	В = Новый ЗаписьXML;
    В.ОткрытьФайл(ПутьКФайлу); 
    В.ЗаписатьОбъявлениеXML(); 
    В.ЗаписатьНачалоЭлемента("unloading_from_subagent"); 
	В.ЗаписатьНачалоЭлемента("unload_type");
	В.ЗаписатьТекст("subagent_week_report"); 
	В.ЗаписатьКонецЭлемента();
	
	
	В.ЗаписатьНачалоЭлемента("ctPartner");
	
	В.ЗаписатьНачалоЭлемента("id");
	В.ЗаписатьТекст("56"); 
	В.ЗаписатьКонецЭлемента();
	
	В.ЗаписатьНачалоЭлемента("jurFace");
	В.ЗаписатьСекциюCDATA("ЗАО «СТРИЖ-Логистик»"); 
	В.ЗаписатьКонецЭлемента();
	
	В.ЗаписатьКонецЭлемента();
	
	
	В.ЗаписатьНачалоЭлемента("ctReportInfo");
	
	В.ЗаписатьНачалоЭлемента("date_crate");
	В.ЗаписатьТекст(Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy"));
	В.ЗаписатьКонецЭлемента();
	
	В.ЗаписатьНачалоЭлемента("period");
	В.ЗаписатьТекст(Формат(НачДата, "ДФ=dd.MM.yyyy") + "-" + Формат(КонДата, "ДФ=dd.MM.yyyy"));
	В.ЗаписатьКонецЭлемента();
	
	
	В.ЗаписатьКонецЭлемента();
	
	
	В.ЗаписатьНачалоЭлемента("Orders");
	
	Пока Выб.Следующий() Цикл
		В.ЗаписатьНачалоЭлемента("Order");
		В.ЗаписатьНачалоЭлемента("subagentOrderId");
		В.ЗаписатьТекст(СокрЛП(Выб.Номер));
		В.ЗаписатьКонецЭлемента();
		
		В.ЗаписатьНачалоЭлемента("ctOrderIdentity");
		
		В.ЗаписатьНачалоЭлемента("orderId");
		//В.ЗаписатьТекст(Выб.Номер);
		В.ЗаписатьКонецЭлемента();
		
		В.ЗаписатьНачалоЭлемента("barcode");
		В.ЗаписатьТекст(Выб.ВнешнийНомерЗаказа);
		В.ЗаписатьКонецЭлемента();
		
		Ном2 = СтрПолучитьСтроку(СтрЗаменить(Выб.ВнешнийНомерЗаказа, "*", Символы.ПС), 2);
		
		В.ЗаписатьНачалоЭлемента("webshopNumber");
		В.ЗаписатьТекст(Ном2);
		В.ЗаписатьКонецЭлемента();
		
		В.ЗаписатьКонецЭлемента();
		
		
		
		
		В.ЗаписатьНачалоЭлемента("ctOrderWeightVolume");
		
		В.ЗаписатьНачалоЭлемента("weight");
		В.ЗаписатьТекст(Формат(Выб.Вес, "ЧН=0; ЧГ="));
		В.ЗаписатьКонецЭлемента();
		
		В.ЗаписатьНачалоЭлемента("length");
		В.ЗаписатьТекст("0");
		В.ЗаписатьКонецЭлемента();
		
		В.ЗаписатьНачалоЭлемента("width");
		В.ЗаписатьТекст("0");
		В.ЗаписатьКонецЭлемента();
		
		В.ЗаписатьНачалоЭлемента("height");
		В.ЗаписатьТекст("0");
		В.ЗаписатьКонецЭлемента();
		
		В.ЗаписатьКонецЭлемента();

		
		
		Если Не ЗначениеЗаполнено(Выб.КоличествоДополнительныхВызовов) Тогда
			УслугиСД = Выб.СтоимостьДоставки;
			СтоимостьДопВыездов = 0;
		Иначе
			УслугиСД = Выб.СтоимостьДоставки/(Выб.КоличествоДополнительныхВызовов + 1);
			СтоимостьДопВыездов = Выб.КоличествоДополнительныхВызовов*УслугиСД;
		КонецеСли;	
		
		
		В.ЗаписатьНачалоЭлемента("ctOrderPaidParams");
		
		В.ЗаписатьНачалоЭлемента("client_cost");
		В.ЗаписатьТекст(Формат(Выб.СуммаЗаказаНал, "ЧДЦ=; ЧН=0; ЧГ="));
		В.ЗаписатьКонецЭлемента();

		В.ЗаписатьНачалоЭлемента("client_paid");
		В.ЗаписатьТекст(Формат(Выб.ПолученоОтПокупателя, "ЧДЦ=; ЧН=0; ЧГ="));
		В.ЗаписатьКонецЭлемента();
		
		В.ЗаписатьКонецЭлемента();
		
		В.ЗаписатьНачалоЭлемента("ctOrderPartnerServiceCostParams");
		
		В.ЗаписатьНачалоЭлемента("deliveryCost");
		В.ЗаписатьТекст(Формат(УслугиСД, "ЧДЦ=; ЧН=0; ЧГ="));
		В.ЗаписатьКонецЭлемента();
		
		В.ЗаписатьНачалоЭлемента("receptPaidCost");
		В.ЗаписатьТекст(Формат(Выб.КассовоеОбслуживание, "ЧДЦ=; ЧН=0; ЧГ="));
		В.ЗаписатьКонецЭлемента();
		
		В.ЗаписатьНачалоЭлемента("returnCost");
		В.ЗаписатьТекст(Формат(Выб.СуммаВозврата, "ЧДЦ=; ЧН=0; ЧГ="));
		В.ЗаписатьКонецЭлемента();
		
		В.ЗаписатьНачалоЭлемента("liftCost");
		В.ЗаписатьТекст(Формат(Выб.Подъем, "ЧДЦ=; ЧН=0; ЧГ="));
		В.ЗаписатьКонецЭлемента();
		
		В.ЗаписатьНачалоЭлемента("additionalExitCost");
		В.ЗаписатьАтрибут("count", Формат(Выб.КоличествоДополнительныхВызовов, "ЧДЦ=; ЧН=0; ЧГ="));
		В.ЗаписатьТекст(Формат(СтоимостьДопВыездов, "ЧДЦ=; ЧН=0; ЧГ="));
		В.ЗаписатьКонецЭлемента();
		
		В.ЗаписатьНачалоЭлемента("correctCost");
		В.ЗаписатьТекст("0");
		В.ЗаписатьКонецЭлемента();
		
		
		В.ЗаписатьКонецЭлемента();
		
		
		В.ЗаписатьКонецЭлемента();
	КонецЦикла;	
	
	В.ЗаписатьКонецЭлемента();
	
	// заборы 
	Зап.Текст = ТекстЗапросаЗаборов();
	Зап.УстановитьПараметр("НачДата", НачалоДня(НачДата));			
	Зап.УстановитьПараметр("КонДата", КонецДня(КонДата));			
	Зап.УстановитьПараметр("МасКонтр", МассивКонтр);			
	
	Выб = Зап.Выполнить().Выбрать();
	В.ЗаписатьНачалоЭлемента("shipments");
	Пока Выб.Следующий() Цикл
		В.ЗаписатьНачалоЭлемента("shipment");
		
		В.ЗаписатьНачалоЭлемента("shipmentId");
		В.ЗаписатьКонецЭлемента();
		
		В.ЗаписатьНачалоЭлемента("shipmentDirection");
		В.ЗаписатьКонецЭлемента();
		
		В.ЗаписатьНачалоЭлемента("intakeDate");
		В.ЗаписатьТекст(Формат(Выб.ДатаЗабора, "ДФ=yyyy-MM-dd"));
		В.ЗаписатьКонецЭлемента();

		В.ЗаписатьНачалоЭлемента("intakeServiceCost");
		В.ЗаписатьТекст(Формат(Выб.СтоимостьДоставки, "ЧДЦ=; ЧГ="));
		В.ЗаписатьКонецЭлемента();
		
		В.ЗаписатьНачалоЭлемента("intakeAddress");
		В.ЗаписатьТекст(СокрЛП(Выб.АдресЗабора));
		В.ЗаписатьКонецЭлемента();
		
		В.ЗаписатьКонецЭлемента();
	КонецЦикла;	
	
	В.ЗаписатьКонецЭлемента();
	
	В.ЗаписатьКонецЭлемента();
	В.Закрыть();
	
	Ф = Новый ДвоичныеДанные(ПутьКФайлу);
	
	Возврат ПутьКФайлу;	
КонецФункции	


