
&НаСервере
Процедура ЗарегистрироватьКОбменуНаСервере()
	// Вставить содержимое обработчика.
	Узел = ПараметрыСеанса.скан_УзелУТ;
	ПланыОбмена.ЗарегистрироватьИзменения(Узел, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьКОбмену(Команда)
	ЗарегистрироватьКОбменуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДерегистрацияДокументаНаСервере()
	Узел = ПараметрыСеанса.скан_УзелУТ;
	ПланыОбмена.УдалитьРегистрациюИзменений(Узел, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ДерегистрацияДокумента(Команда)
	ДерегистрацияДокументаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТолькоПросмотр = Истина;
КонецПроцедуры
