
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИнициализироватьКарту();
	ПодключитьОбработчикОжидания("ЗагрузитьПолигон", 10, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПолигон()
	
	Если ЗначениеЗаполнено(Объект.Координаты) Тогда
		ВыполнитьСкрипт("myPolygon = loadPolygon("""+ Объект.Координаты+""");");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Элементы.ПолеHTML.Документ.parentWindow.getCoordinatesPolygon();	
	
	Объект.Координаты = Элементы.ПолеHTML.document.getElementById("coords").value;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьКарту()
		
	ПолеHTML = ПолучитьТекстМакетаСервер();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстМакетаСервер()
	                 
	кодJS = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет").ПолучитьТекст();
	
	Возврат кодJS;	

КонецФункции // ПолучитьТекстМакетаСервер()

&НаКлиенте
Процедура СоздатьПолигон(Команда)
	ВыполнитьСкрипт("startDrawing();");
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПолигон(Команда)
	Если ЗначениеЗаполнено(Объект.Координаты) Тогда
		ВыполнитьСкрипт("startEditing();");
	Иначе 
		ВыполнитьСкрипт("startDrawing();");
	КонецЕсли;
	
КонецПроцедуры

 &НаКлиенте
//Выполняем Скрипт на странице
Процедура ВыполнитьСкрипт(ТекстСкрипт)
		
	ДИВ = Элементы.ПолеHTML.Документ.getElementById("TEST");
	ДИВ.setAttribute("onclick", ТекстСкрипт);
	ДИВ.click();
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = Ложь;
	//Диалог = Новый ДиалогВыбораЦвета;
	//
	//Если Диалог.Выбрать() Тогда
	//	Объект.Цвет = Диалог.Цвет;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	ВыполнитьСкрипт("stopEditing();");
КонецПроцедуры
