
&НаКлиенте
Функция ПечатьТекста(ТекстДляПечати, СодержимоеШК, ОжиданиеРезультатаПечати = Истина) Экспорт
	#Если МобильноеПриложениеКлиент Тогда
		Зап = Новый ЗапускПриложенияМобильногоУстройства();
		Зап.Приложение = "zj.com.cn.bluetooth.sdk";
		//Зап.ИмяКласса = "zj.com.cn.bluetooth.sdk.PrintMsg";
		Зап.ИмяКласса = "zj.com.cn.bluetooth.sdk.PrintMQR";
		
		ДанныеМП = Новый ДополнительныеДанныеЗапускаПриложенияМобильногоУстройства;
		ДанныеМП.Добавить("fname", ТекстДляПечати);
		ДанныеМП.Добавить("width", 200);
		ДанныеМП.Добавить("height", 200);
		ДанныеМП.Добавить("qr", СодержимоеШК);
		Зап.ДополнительныеДанные = ДанныеМП;
		
		РезультатПечатиПр = Зап.Запустить(ОжиданиеРезультатаПечати);
		
		РезультатПечати = Ложь;
		
		Если ОжиданиеРезультатаПечати Тогда
			Если РезультатПечатиПр = 0 Тогда
				Возврат Истина;
			Иначе
				Возврат Ложь;
			КонецеСли;	
		Иначе
			Возврат РезультатПечатиПр;
		КонецеСли;	
	#Иначе
		Возврат Ложь;
	#КонецЕсли
КонецФункции

&НаКлиенте
Функция ПроверкаУстановленностиПриложения() Экспорт
	#Если МобильноеПриложениеКлиент Тогда
		Зап = Новый ЗапускПриложенияМобильногоУстройства();
		Зап.Приложение = "zj.com.cn.bluetooth.sdk";
		Зап.ИмяКласса = "zj.com.cn.bluetooth.sdk.Test";
		
		
		РезультатПечати = Зап.Запустить(Ложь);
		Возврат РезультатПечати;
	#Иначе
		Возврат Ложь;
	#КонецЕсли
КонецФункции
