Функция Печать(Таб, НачПериода, КонПериода, Контрагент, СИтогамиПоДням, ДокОтчет = Неопределено) Экспорт
	Таб.Очистить();
	
	//ЗапАдминка = Новый Запрос;
	//ЗапАдминка.Текст = "ВЫБРАТЬ
	//				   |	ВЫБОР
	//				   |		КОГДА dbo_mv_orders.status <> 4
	//				   |			ТОГДА dbo_mv_orders.orderSumRUR_all
	//				   |		ИНАЧЕ 0
	//				   |	КОНЕЦ КАК ПолнаяСуммаЗаказа,
	//				   |	ВЫБОР
	//				   |		КОГДА dbo_mv_orders.status <> 4
	//				   |			ТОГДА dbo_mv_orders.serviceDC
	//				   |		ИНАЧЕ 0
	//				   |	КОНЕЦ КАК УслугиСД,
	//				   |	ВЫБОР
	//				   |		КОГДА dbo_mv_orders.status <> 4
	//				   |			ТОГДА dbo_mv_orders.cashService
	//				   |		ИНАЧЕ 0
	//				   |	КОНЕЦ КАК КассовоеОбслуживание,
	//				   |	dbo_mv_orders.orderIDStr КАК ВнешнийНомер
	//				   |ИЗ
	//				   |	ВнешнийИсточникДанных.ИнтернетМагазин.Таблица.dbo_mv_orders КАК dbo_mv_orders
	//				   |ГДЕ
	//				   |	dbo_mv_orders.completeDate МЕЖДУ &НачДата И &КонДата
	//				   |	И dbo_mv_orders.internetShopID = &internetShopID";
	//ЗапАдминка.УстановитьПараметр("internetShopID", 181);
	//ЗапАдминка.УстановитьПараметр("НачДата", НачалоДня(НачПериода));
	//ЗапАдминка.УстановитьПараметр("КонДата", КонецДня(КонПериода));
	//
	//РезАдминка = ЗапАдминка.Выполнить().Выгрузить();
	//резАдминка.Колонки.Добавить("ВнешнийНомер2");
	//Для Каждого Тек Из РезАдминка Цикл
	//	Тек.ВнешнийНомер2 = СокрЛП(Тек.ВнешнийНомер);
	//КонецЦикла;	
	
	
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	ОтчетПоМнениюПартнера.Сумма1 КАК СтоимостьГруза,
	            |	ОтчетПоМнениюПартнера.Сумма2 КАК СтоимостьВозврата,
	            |	ОтчетПоМнениюПартнера.Сумма3 КАК ИтРеал,
	            |	ОтчетПоМнениюПартнера.Сумма4 КАК АгентскоеВознаграждение,
	            |	ОтчетПоМнениюПартнера.Сумма5 КАК СуммаПолученнаяОтПокупателей,
	            |	ОтчетПоМнениюПартнера.Сумма6 КАК СтоимостьДоставки,
	            |	ОтчетПоМнениюПартнера.СтроковыйПараметр1 КАК ВидРабот,
	            |	ОтчетПоМнениюПартнера.ПараметрДаты1 КАК ДатаЗабора,
	            |	ОтчетПоМнениюПартнера.ПараметрДаты2 КАК ДатаПеречисления,
	            |	ОтчетПоМнениюПартнера.Заказ,
	            |	ОтчетПоМнениюПартнера.НомерЗаказа КАК НомерВнешнегоЗаказа,
	            |	ОтчетПоМнениюПартнера.НомерСтроки КАК НомерСтроки,
	            |	ОтчетПоМнениюПартнера.Период КАК ДатаДоставки,
	            |	ОтчетПоМнениюПартнера.КорСум,
	            |	ОтчетПоМнениюПартнера.Заказ.ТипОплаты КАК ТО
	            |ИЗ
	            |	РегистрНакопления.ОтчетПоМнениюПартнера КАК ОтчетПоМнениюПартнера
	            |ГДЕ
	            |	ОтчетПоМнениюПартнера.Период МЕЖДУ &НачПериода И &КонПериода
	            |	И ОтчетПоМнениюПартнера.Партнер = &Контрагент
	            |
	            |УПОРЯДОЧИТЬ ПО
	            |	НомерСтроки";
				
	Зап.УстановитьПараметр("НачПериода", НачалоДня(НачПериода));			
	Зап.УстановитьПараметр("КонПериода", КонецДня(КонПериода));
	Зап.УстановитьПараметр("Контрагент", Контрагент);
	
	Рез = Зап.Выполнить().Выгрузить();
	
	
	Мак = ПолучитьМакет("Макет");
	
	ОблШ = Мак.ПолучитьОбласть("Шапка");
	ОблС = Мак.ПолучитьОбласть("Строка");
	
	Таб.Вывести(ОблШ);
	
	НПП = 1;
	ИтСтГ = 0;
	ИтСтВ = 0;
	ИтСумР = 0;
	ИтСтДос= 0;
	ИтСумПол = 0;
	ИтАг = 0;
	
	
	
	//Таб2.Свернуть("НомерВнешнегоЗаказа, НомерЗаказа, ДатаДоставки, ДатаДоставки2", "СтоимостьВозврата, СтоимостьГруза");
	
	
	Сч = 0;				  
	МасСтр = Новый Массив;
	МассУже = Новый Массив;
	
	Для Каждого Тек Из Рез Цикл
		ЗаполнитьЗначенияСвойств(ОблС.Параметры, Тек);
		ОблС.Параметры.НПП = НПП;
		
		//Най = РезАдминка.Найти(Тек.Заказ.Номер);
		//если Най <> Неопределено Тогда
		//	Если Тек.ТО = 1 Тогда
		//		Если Най.ПолнаяСуммаЗаказа <> Тек.СуммаПолученнаяОтПокупателей Тогда
		//			Сообщить(Тек.НомерВнешнегоЗаказа + " - " + Формат(Най.ПолнаяСуммаЗаказа, "ЧДЦ=2; ЧГ=") + " - " + Формат(Тек.СуммаПолученнаяОтПокупателей, "ЧДЦ=2; ЧГ="));
		//		КонецеСли;	
		//	КонецеСли;	
		//КонецеСли;	
		
		Таб.Вывести(ОблС);
		НПП = НПП + 1;
		
		ИтСтГ = ИтСтГ + Тек.СтоимостьГруза;
		ИтСтВ = ИтСтВ + Тек.СтоимостьВозврата;
		ИтСумР = ИтСумР + Тек.ИтРеал;
		ИтСтДос= ИтСтДос + Тек.СтоимостьДоставки;
		//Если Тек.КорСум Тогда
		//	ИтСумПол = ИтСумПол + Тек.СтоимостьГруза - Тек.СтоимостьВозврата;
		//Иначе
			ИтСумПол = ИтСумПол + Тек.СуммаПолученнаяОтПокупателей;
		//КонецеСли;	
		
		ИтАг = ИтАг + Тек.АгентскоеВознаграждение;
	КонецЦикла;	
	
	
	ОблП = мак.ПолучитьОбласть("Подвал1");
	
	ОблП.Параметры.ИтСтГ = ИтСтГ;
	ОблП.Параметры.ИтСтВ = ИтСтВ;
	ОблП.Параметры.ИтСумР = ИтСумР;
	ОблП.Параметры.ИтСтДос = ИтСтДос;
	ОблП.Параметры.ИтСумПол = ИтСумПол;
	ОблП.Параметры.ИтАг = ИтАг;
	
	ОблП.Параметры.ИтСтГНДС = Окр(ИтСтГ - ИтСтГ/1.18, 2);
	ОблП.Параметры.ИтСтВНДС = Окр(ИтСтВ - ИтСтВ/1.18, 2);
	ОблП.Параметры.ИтСумРНДС = Окр(ИтСумР - ИтСумР/1.18, 2);
	Таб.Вывести(ОблП);
	
	
	Таб.ИмяПараметровПечати = "Приложение_4_ММ";
	Возврат Таб;
КонецФункции	