
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Движения.мгЗарплатаНачисления.Записывать = Истина;
	Движения.мгЗарплатаНачисления.Очистить();
	Для каждого ТекСтрокаНадбавкиПереработки Из НадбавкиПереработки Цикл
		Движение = Движения.мгЗарплатаНачисления.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ПериодРегистрации;
		Движение.Организация = ТекСтрокаНадбавкиПереработки.Организация;
		Движение.Терминал = Терминал;
		Движение.ВидНачисления = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.НадбавкиПоЗаказам");
		Движение.Сотрудник = ТекСтрокаНадбавкиПереработки.Сотрудник;
		Движение.Тариф = ТекСтрокаНадбавкиПереработки.Сумма;
	КонецЦикла;
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
