Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ТекОтбор = ЭтотОбъект.Отбор;
	Если ТекОтбор.СхемаРасчетаЗП.Использование Тогда
		СхемаРасчетаЗП = ТекОтбор.СхемаРасчетаЗП.Значение;
		СхемаРазрешена = СхемаРасчетаЗП.РазрешитьРедактирование Или зпРаботаСРасчетомЗарплатыСервер.НетЗаписиВРегистре("РегистрСведений.зпИсходныеДанныеРасчетаМинимальнойЗП", "СхемаРасчетаЗП", СхемаРасчетаЗП);
	Иначе
		СхемаРазрешена = Истина;
	КонецЕсли;
	Если ТекОтбор.ТарифРасчетаЗП.Использование Тогда
		ТарифРасчетаЗП = ТекОтбор.ТарифРасчетаЗП.Значение;
		ТарифРазрешен = ТарифРасчетаЗП.РазрешитьРедактирование Или зпРаботаСРасчетомЗарплатыСервер.НетЗаписиВРегистре("РегистрСведений.зпИсходныеДанныеРасчетаМинимальнойЗП", "ТарифРасчетаЗП", ТарифРасчетаЗП);
	Иначе
		ТарифРазрешен = Истина;
	КонецЕсли;
	
	Если Не (СхемаРазрешена И ТарифРазрешен) Тогда
		Отказ = Истина;
		Сообщить("Редактирование запрещено");
		Если Не СхемаРазрешена Тогда
			Сообщить("Обнаружены данные по Схеме расчета!");
		КонецЕсли;
		Если Не ТарифРазрешен Тогда
			Сообщить("Обнаружены данные по Тарифу расчета!");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
