
&НаСервере
Функция ПолучитьДвоичныеДанные()
	
	Запрос = новый Запрос("ВЫБРАТЬ
	                      |	ozone_БланкиЗаказов.Бланк
	                      |ИЗ
	                      |	РегистрСведений.ozone_БланкиЗаказов КАК ozone_БланкиЗаказов
	                      |ГДЕ
	                      |	ozone_БланкиЗаказов.Период = &Период
	                      |	И ozone_БланкиЗаказов.Заказ = &Заказ
	                      |	И ozone_БланкиЗаказов.ТипБланка = &ТипБланка");
	Запрос.УстановитьПараметр("Период", Запись.Период);
	Запрос.УстановитьПараметр("Заказ", Запись.Заказ);
	Запрос.УстановитьПараметр("ТипБланка", Запись.ТипБланка);
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда	
		ДвоичныеДанные = Рез.Бланк.Получить();	
		Возврат ДвоичныеДанные;
	Иначе
		Возврат Неопределено;	
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура Напечатать(Команда)
	
	ДвоичныеДанные = ПолучитьДвоичныеДанные();	
	
	Если ЗначениеЗаполнено(ДвоичныеДанные) Тогда		
		ПутьКФайлу = КаталогВременныхФайлов() +  "\" + Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd") + Запись.ТипБланка + Запись.Заказ.Номер + ".pdf";
		ДвоичныеДанные.Записать(ПутьКФайлу);
		ЗапуститьПриложение(ПутьКФайлу);		
	Иначе	
		#Если Клиент Тогда
			Сообщить("Бланк не найден");
		#КонецЕсли		
	КонецЕсли;
	
КонецПроцедуры
