
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Если ФормироватьДвиженияПоСостояниюЗаказов Тогда
		//// регистр СостоянияЗаказов
		Движения.СостоянияЗаказов.Записывать = Истина;
		Движения.СостоянияЗаказов.Очистить();
		
		Дост = БизнесПроцессы.новаМестнаяДоставка.НайтиПоНомеру(Заказ.Номер);
		
		
		Движение = Движения.СостоянияЗаказов.Добавить();
		Движение.Период = Дата;
		Движение.РезультатДоставки = РезультатДоставки;
		Движение.ПричинаНеВыполнения = ПричинаНевыполнения;
		Движение.Заказ = Заказ;
		Движение.ПричинаОтказа = ПричинаОтказа;
		Если Не Дост.Пустая() Тогда	
			Движение.Доставка = Дост.Ссылка;
		КонецЕСли;
		Движение.ДатаПереноса = ДатаПереноса;
		Движение.Экспедитор = Экспедитор;
		Движение.Водитель = Водитель;
	КонецеСли;
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ИзменениеТипаОплаты()
	если Заказ.СтатусИнтернетМагазина = 2 И Не ТипОплатыДо.Пустая() И Не ТипОплатыПосле.Пустая() И ТипОплатыПосле <> ТипОплатыДо Тогда
		Покл = Евген.СоздатьПодключениеКИнтернетМагазину();
		Евген.ЗапросКИнтернетМагазину("UPDATE _order set pay_type = " + Формат(ТипОплатыПосле.Код, "ЧГ=") + " where orderid = " + СокрЛП(Заказ.Номер));
	КонецеСли;	
Конецпроцедуры	
