Функция Сформировать(Таб, НачПериода, КонПериода, Контрагент) Экспорт
	Таб.Очистить();
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	МАКСИМУМ(ДанныеЗаказаВодителя.Дата) КАК ДатаДоставки,
	            |	ДанныеЗаказаВодителя.Реализация
	            |ПОМЕСТИТЬ ВТВремяДоставки
	            |ИЗ
	            |	Документ.ДанныеЗаказаВодителя КАК ДанныеЗаказаВодителя
	            |ГДЕ
	            |	ДанныеЗаказаВодителя.Реализация.ВладелецТовара = &ИнтернетМагазин
	            |
	            |СГРУППИРОВАТЬ ПО
	            |	ДанныеЗаказаВодителя.Реализация
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	СтатусыЗаказов.Заказ,
	            |	МАКСИМУМ(СтатусыЗаказов.ДокументРегистратор) КАК ДокументРегистратор
	            |ПОМЕСТИТЬ ВТСтатусы
	            |ИЗ
	            |	РегистрСведений.СтатусыЗаказов КАК СтатусыЗаказов
	            |ГДЕ
	            |	СтатусыЗаказов.Статус В (231, 232, 235)
	            |	И СтатусыЗаказов.Период МЕЖДУ &НачПериода И &КонПериода
	            |
	            |СГРУППИРОВАТЬ ПО
	            |	СтатусыЗаказов.Заказ
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	ДанныеЗаказаВодителя.Реализация,
	            |	МАКСИМУМ(ДанныеЗаказаВодителя.Ссылка) КАК Ссылка
	            |ПОМЕСТИТЬ ВТДЗВ
	            |ИЗ
	            |	Документ.ДанныеЗаказаВодителя КАК ДанныеЗаказаВодителя
	            |
	            |СГРУППИРОВАТЬ ПО
	            |	ДанныеЗаказаВодителя.Реализация
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	новаМестнаяДоставка.ВремяПрибытияС КАК ВремяПрибытияС,
	            |	новаМестнаяДоставка.ВремяПрибытияПо КАК ВремяПрибытияПо,
	            |	ВТВремяДоставки.ДатаДоставки КАК ДатаДоставкиПоФакту,
	            |	ВЫБОР
	            |		КОГДА СтатусыЗаказов.Статус = 235
	            |			ТОГДА ДанныеЗаказаВодителя.ПричинаОтказаПереноса
	            |		ИНАЧЕ """"
	            |	КОНЕЦ КАК ПричинаОтмены,
	            |	ВЫБОР
	            |		КОГДА СтатусыЗаказов.Статус = 232
	            |			ТОГДА ДанныеЗаказаВодителя.ПричинаОтказаПереноса
	            |		ИНАЧЕ """"
	            |	КОНЕЦ КАК ПричинаПереноса,
	            |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа КАК НомерЗаказа,
	            |	ВЫБОР
	            |		КОГДА СтатусыЗаказов.Статус = 235
	            |				ИЛИ СтатусыЗаказов.Статус = 232
	            |			ТОГДА ВЫБОР
	            |					КОГДА СтатусыЗаказов.Статус = 232
	            |						ТОГДА ""Перенос""
	            |					ИНАЧЕ ""Отмена""
	            |				КОНЕЦ
	            |		ИНАЧЕ ""Доставлен""
	            |	КОНЕЦ КАК СтатусЗаказа,
	            |	РеализацияТоваровУслуг.Дата КАК ДатаДоставки,
	            |	ВЫБОР
	            |		КОГДА СтатусыЗаказов.Статус <> 231
	            |			ТОГДА ВЫБОР
	            |					КОГДА ДанныеЗаказаВодителя.ПричинаНеВыполненияДоставки В (ЗНАЧЕНИЕ(Справочник.ПричиныНевыполненияДоставки.ПереносСЗаездом), ЗНАЧЕНИЕ(Справочник.ПричиныНевыполненияДоставки.ОтказКлиентаСЗаездом))
	            |						ТОГДА ИСТИНА
	            |					ИНАЧЕ ЛОЖЬ
	            |				КОНЕЦ
	            |		ИНАЧЕ ИСТИНА
	            |	КОНЕЦ КАК Ездили,
	            |	ДанныеЗаказаВодителя.Дата
	            |ИЗ
	            |	ВТСтатусы КАК ВТСтатусы
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	            |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ДанныеЗаказаВодителя КАК ДанныеЗаказаВодителя
	            |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДЗВ КАК ВТДЗВ
	            |				ПО ДанныеЗаказаВодителя.Ссылка = ВТДЗВ.Ссылка.Ссылка
	            |			ПО РеализацияТоваровУслуг.Ссылка = ДанныеЗаказаВодителя.Реализация.Ссылка
	            |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ БизнесПроцесс.новаМестнаяДоставка КАК новаМестнаяДоставка
	            |			ПО РеализацияТоваровУслуг.Номер = новаМестнаяДоставка.Номер
	            |			ЛЕВОЕ СОЕДИНЕНИЕ ВТВремяДоставки КАК ВТВремяДоставки
	            |			ПО РеализацияТоваровУслуг.Ссылка = ВТВремяДоставки.Реализация.Ссылка
	            |		ПО ВТСтатусы.Заказ.Ссылка = РеализацияТоваровУслуг.Ссылка
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЗаказов КАК СтатусыЗаказов
	            |		ПО (ВЫРАЗИТЬ(ВТСтатусы.ДокументРегистратор КАК Документ.ДанныеЗаказаВодителя).Ссылка = ВЫРАЗИТЬ(СтатусыЗаказов.ДокументРегистратор КАК Документ.ДанныеЗаказаВодителя).Ссылка)
	            |ГДЕ
	            |	ДанныеЗаказаВодителя.Дата МЕЖДУ &НачПериода И &КонПериода
	            |	И РеализацияТоваровУслуг.ВладелецТовара = &ИнтернетМагазин
	            |
	            |СГРУППИРОВАТЬ ПО
	            |	новаМестнаяДоставка.ВремяПрибытияС,
	            |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа,
	            |	ВТВремяДоставки.ДатаДоставки,
	            |	новаМестнаяДоставка.ВремяПрибытияПо,
	            |	РеализацияТоваровУслуг.Дата,
	            |	ДанныеЗаказаВодителя.Дата,
	            |	ВЫБОР
	            |		КОГДА СтатусыЗаказов.Статус = 235
	            |			ТОГДА ДанныеЗаказаВодителя.ПричинаОтказаПереноса
	            |		ИНАЧЕ """"
	            |	КОНЕЦ,
	            |	ВЫБОР
	            |		КОГДА СтатусыЗаказов.Статус = 235
	            |				ИЛИ СтатусыЗаказов.Статус = 232
	            |			ТОГДА ВЫБОР
	            |					КОГДА СтатусыЗаказов.Статус = 232
	            |						ТОГДА ""Перенос""
	            |					ИНАЧЕ ""Отмена""
	            |				КОНЕЦ
	            |		ИНАЧЕ ""Доставлен""
	            |	КОНЕЦ,
	            |	ВЫБОР
	            |		КОГДА СтатусыЗаказов.Статус = 232
	            |			ТОГДА ДанныеЗаказаВодителя.ПричинаОтказаПереноса
	            |		ИНАЧЕ """"
	            |	КОНЕЦ,
	            |	ВЫБОР
	            |		КОГДА СтатусыЗаказов.Статус <> 231
	            |			ТОГДА ВЫБОР
	            |					КОГДА ДанныеЗаказаВодителя.ПричинаНеВыполненияДоставки В (ЗНАЧЕНИЕ(Справочник.ПричиныНевыполненияДоставки.ПереносСЗаездом), ЗНАЧЕНИЕ(Справочник.ПричиныНевыполненияДоставки.ОтказКлиентаСЗаездом))
	            |						ТОГДА ИСТИНА
	            |					ИНАЧЕ ЛОЖЬ
	            |				КОНЕЦ
	            |		ИНАЧЕ ИСТИНА
	            |	КОНЕЦ
	            |
	            |УПОРЯДОЧИТЬ ПО
	            |	ДанныеЗаказаВодителя.Дата
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |УНИЧТОЖИТЬ ВТВремяДоставки
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |УНИЧТОЖИТЬ ВТСтатусы";
				
				
				
				
	Зап.УстановитьПараметр("НачПериода", НачалоДня(НачПериода));			
	Зап.УстановитьПараметр("КонПериода", КонецДня(КонПериода));			
	Зап.УстановитьПараметр("ИнтернетМагазин", Контрагент);			
	
	Рез = Зап.Выполнить().Выгрузить();
	
	
	Мак = ПолучитьМакет("Макет");
	ОблШ = Мак.ПолучитьОбласть("Шапка");
	ОблСтр = Мак.ПолучитьОбласть("Строка");
	Таб.Вывести(ОблШ);
	
	
	
	
	Для Каждого Тек Из Рез Цикл
		ЗаполнитьЗначенияСвойств(ОблСтр.параметры, Тек);
		
		ЧН = Час(Тек.ВремяПрибытияС);
		ЧК = Час(Тек.ВремяПрибытияПо);
		
		ЧС = Окр(ЧК-ЧН/2);
		
		МН = Минута(Тек.ВремяПрибытияС);
		МК = Минута(Тек.ВремяПрибытияПо);
		
		ОблСтр.Параметры.ПериодДоставки = "с " + Формат(ЧН, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=") + ":" + Формат(МН, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=") + " по " + Формат(ЧК, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=") + ":" + Формат(МК, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=");
		
		Если ЗначениеЗаполнено(Тек.ДатаДоставкиПоФакту) Тогда
			ЧН = Час(Тек.ДатаДоставкиПоФакту);
			МН = Минута(Тек.ДатаДоставкиПоФакту);
			Если Тек.СтатусЗаказа = "Отмена" Тогда
				Если Тек.Ездили Тогда
					ОблСтр.Параметры.ВремяПриезда = Формат(ЧН, "ЧЦ=2; ЧВН=; ЧГ=") + ":" + Формат(МН, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=");
				Иначе
					ОблСтр.Параметры.ВремяПриезда = "не ездили";
				КонецеСли;	
			Иначе
				ОблСтр.Параметры.ВремяПриезда = Формат(ЧН, "ЧЦ=2; ЧВН=; ЧГ=") + ":" + Формат(МН, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=");
			КонецеСли;
		Иначе
			ОблСтр.Параметры.ВремяПриезда = Формат(ЧС, "ЧЦ=2; ЧВН=; ЧГ=") + ":23";
		КонецеСли;
		Таб.Вывести(ОблСтр);
	КонецЦикла;
	
	
	Таб.ПолеСлева = 3;
	Таб.ПолеСнизу = 3;
	Таб.ПолеСверху = 3;
	Таб.ПолеСправа = 3;
	Таб.Автомасштаб = Истина;
	Таб.ТолькоПросмотр = 1;
	Таб.ИмяПараметровПечати = "Энтер_2";
	Возврат Таб;
КонецФункции