
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТекущийРейс") Тогда
		
		Элементы.Список.РежимВыбора = Истина;
		
		Заказ = Параметры.Заказ;
		Список.Параметры.УстановитьЗначениеПараметра("Ссылка", Параметры.ТекущийРейс);
		//Список.Параметры.УстановитьЗначениеПараметра("ДатаРейса", ТекущаяДата());
		Список.Параметры.УстановитьЗначениеПараметра("ДатаРейса", Дата(2017,07,28));
		
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ЭтаФорма.Элементы.Список.ДанныеСтроки(ВыбраннаяСтрока).Закрыт Тогда              
		
		Сообщить("Нельзя выбрать закрытый рейс");
		СтандартнаяОбработка = Ложь;
		Возврат;
		
	Иначе 
		
		СтандартнаяОбработка = Ложь;
		Закрыть(ЭтаФорма.Элементы.Список.ДанныеСтроки(ВыбраннаяСтрока).Ссылка);
		
	КонецЕсли;	
	
КонецПроцедуры
