
Функция ОбновитьДанные() Экспорт
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	РеализацияТоваровУслуг.Ссылка КАК Реализация,
	            |	ЕСТЬNULL(новаМестнаяДоставка.Ссылка, ИСТИНА) КАК ЭтоСамовывоз
	            |ПОМЕСТИТЬ ВТЗаказы
	            |ИЗ
	            |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	            |		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.новаМестнаяДоставка КАК новаМестнаяДоставка
	            |		ПО РеализацияТоваровУслуг.Номер = новаМестнаяДоставка.Номер
	            |ГДЕ
	            |	РеализацияТоваровУслуг.Дата >= ДАТАВРЕМЯ(2013, 11, 1)
	            |	И РеализацияТоваровУслуг.СтатусИнтернетМагазина = 2
	            |	И РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	ВТЗаказы.Реализация,
	            |	ЕСТЬNULL(ЗакрытыеЗаказы.Регистратор, ИСТИНА) КАК Открыт
	            |ПОМЕСТИТЬ ВТСамовывоз
	            |ИЗ
	            |	ВТЗаказы КАК ВТЗаказы
	            |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗакрытыеЗаказы КАК ЗакрытыеЗаказы
	            |		ПО ВТЗаказы.Реализация.Ссылка = ЗакрытыеЗаказы.Реализация.Ссылка
	            |ГДЕ
	            |	ВТЗаказы.ЭтоСамовывоз = ИСТИНА
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	ВТСамовывоз.Реализация КАК Самовывоз,
	            |	ВТСамовывоз.Реализация.Номер КАК Номер,
	            |	ВТСамовывоз.Реализация.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
	            |	ВТСамовывоз.Реализация.Контрагент.Наименование КАК Клиент,
	            |	ВТСамовывоз.Реализация.Дата КАК Дата
	            |ИЗ
	            |	ВТСамовывоз КАК ВТСамовывоз
	            |ГДЕ
	            |	ВТСамовывоз.Открыт = ИСТИНА
	            |
	            |УПОРЯДОЧИТЬ ПО
	            |	ВТСамовывоз.Реализация.Дата,
	            |	ВТСамовывоз.Реализация.Номер
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |УНИЧТОЖИТЬ ВТЗаказы
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |УНИЧТОЖИТЬ ВТСамовывоз";
				
	  Возврат Зап.Выполнить();
  КонецФункции
  
  

Функция ОбновитьДанныеПоКлиенту(Клиент) Экспорт
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	РеализацияТоваровУслуг.Ссылка КАК Реализация,
	            |	ЕСТЬNULL(новаМестнаяДоставка.Ссылка, ИСТИНА) КАК ЭтоСамовывоз
	            |ПОМЕСТИТЬ ВТЗаказы
	            |ИЗ
	            |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	            |		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.новаМестнаяДоставка КАК новаМестнаяДоставка
	            |		ПО РеализацияТоваровУслуг.Номер = новаМестнаяДоставка.Номер
	            |ГДЕ
	            |	РеализацияТоваровУслуг.Дата >= ДАТАВРЕМЯ(2013, 11, 1)
	            |	И РеализацияТоваровУслуг.СтатусИнтернетМагазина = 2
	            |	И РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	ВТЗаказы.Реализация,
	            |	ЕСТЬNULL(ЗакрытыеЗаказы.Регистратор, ИСТИНА) КАК Открыт
	            |ПОМЕСТИТЬ ВТСамовывоз
	            |ИЗ
	            |	ВТЗаказы КАК ВТЗаказы
	            |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗакрытыеЗаказы КАК ЗакрытыеЗаказы
	            |		ПО ВТЗаказы.Реализация.Ссылка = ЗакрытыеЗаказы.Реализация.Ссылка
	            |ГДЕ
	            |	ВТЗаказы.ЭтоСамовывоз = ИСТИНА
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	ВТСамовывоз.Реализация КАК Самовывоз,
	            |	ВТСамовывоз.Реализация.Номер КАК Номер,
	            |	ВТСамовывоз.Реализация.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
	            |	ВТСамовывоз.Реализация.Контрагент.Наименование КАК Клиент,
	            |	ВТСамовывоз.Реализация.Дата КАК Дата,
	            |	ВТСамовывоз.Реализация.ВладелецТовара КАК Магазин
	            |ИЗ
	            |	ВТСамовывоз КАК ВТСамовывоз
	            |ГДЕ
	            |	ВТСамовывоз.Открыт = ИСТИНА
	            |	И ВТСамовывоз.Реализация.Контрагент.Наименование ПОДОБНО &Клиент
	            |
	            |УПОРЯДОЧИТЬ ПО
	            |	ВТСамовывоз.Реализация.Дата,
	            |	ВТСамовывоз.Реализация.Номер,
	            |	Клиент
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |УНИЧТОЖИТЬ ВТЗаказы
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |УНИЧТОЖИТЬ ВТСамовывоз";
		Зап.УстановитьПараметр("Клиент", "%" + Клиент + "%");		
	  Возврат Зап.Выполнить();
  КонецФункции
  
  
