#Область ПрограммныйИнтерфейс
// Рассчитать подъем на сервере.
// 
// Параметры:
//  ДанныеЗаказа - Структура - Данные заказа
Процедура РассчитатьПодъемНаСервере(ДанныеЗаказа) Экспорт
	ДанныеПодъема = ПроцедурыРаботыСЗаказамиКлиентСервер.
		ПолучитьСтруктуруДанныеПолученияСведенийОПодъемеЗаказа(Формат(ДанныеЗаказа.Код, "ЧГ=;"), ВидПодъема, ЭтажПодъема, ТарифицируемыйВес);
	
	Результат = ПроцедурыОбменаСЦУ.ВыполнитьОбмен_ПолучитьДанныеПодъема(ДанныеПодъема);
	Если Результат.РезультатВызова Тогда
		КодПодъемногоБрейка = Результат.Брейк;
		СтоимостьПодъемаРассчитанная = Результат.СтоимостьПодъема;
		СтоимостьПодъемаПодтвержденная = Результат.СтоимостьПодъема;
	Иначе
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Ошибка при расчете подъема!";
		Сообщение.Сообщить();
	КонецЕсли;	
КонецПроцедуры


// Рассчитать подъем на сервере с проверкой.
Процедура РассчитатьПодъемНаСервереСПроверкой() Экспорт	
	ДанныеЗаказа = ПроцедурыРаботыСЗаказамиВызовСервера.ПолучитьДанныеЗаказа(Заказ);
	Если (ВидПодъема = Перечисления.ВидыПодъемовЗаказаНаЭтаж.Лифт Или ВидПодъема = Перечисления.ВидыПодъемовЗаказаНаЭтаж.РучнойПодъем)
	 И (ДанныеЗаказа.МетодОплатыПодъема = Перечисления.МетодыОплатыПодъемаЗаказа.ОплачиваетКлиент Или ДанныеЗаказа.МетодОплатыПодъема = Перечисления.МетодыОплатыПодъемаЗаказа.ОплачиваетПартнер) Тогда
		РассчитатьПодъемНаСервере(ДанныеЗаказа);
	Иначе
		КодПодъемногоБрейка = "";
		СтоимостьПодъемаРассчитанная = 0;
		СтоимостьПодъемаПодтвержденная = 0;
	КонецеСли;	
КонецПроцедуры

// Получить организацию по типу оплаты.
Процедура ПолучитьОрганизациюПоТипуОплаты() Экспорт
	ДанныеЗаказа = ПроцедурыРаботыСЗаказамиВызовСервера.ПолучитьДанныеЗаказа(Заказ);
	Если ВыбранныйТипОплаты = Справочники.ТипыОплат.Терминал Тогда
		Организация = Справочники.Организации.НайтиПоКоду(ДанныеЗаказа.КодОрганизацияОплатаТерминал);	
	ИначеЕсли ВыбранныйТипОплаты = Справочники.ТипыОплат.Наличные Тогда
		Организация = Справочники.Организации.НайтиПоКоду(ДанныеЗаказа.КодОрганизацияОплатаНаличные);		
	КонецЕсли;	
КонецПроцедуры	

// Заполнить данными рейса.
Процедура ЗаполнитьДаннымиРейса() Экспорт
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	Рейсы.ВыданТерминалAssist КАК ОплатаЧерезAssist
	|ИЗ
	|	Справочник.Рейсы КАК Рейсы
	|ГДЕ
	|	Рейсы.Ссылка = &ВыбранныйРейс";
	Запрос.УстановитьПараметр("ВыбранныйРейс", Рейс);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Выборка, Ссылка);
	КонецЕсли;	
КонецПроцедуры	

// Заполнить товары по заказу.
Процедура ЗаполнитьТоварыПоЗаказу() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗаказыТовары.НомерСтроки КАК НомерСтроки,
	|	ЗаказыТовары.Товар КАК Товар,
	|	ЗаказыТовары.Количество КАК Количество,
	|	ЗаказыТовары.Цена КАК Цена,
	|	ЗаказыТовары.Сумма КАК Сумма,
	|	ЗаказыТовары.ШК КАК ШК,
	|	ЗаказыТовары.КМ КАК КМ,
	|	ЗаказыТовары.ПоставщикТовара КАК ПоставщикТовара,
	|	ЗаказыТовары.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	Справочник.Заказы.Товары КАК ЗаказыТовары
	|ГДЕ
	|	ЗаказыТовары.Ссылка = &Заказ";
	Запрос.УстановитьПараметр("Заказ", Заказ);
	ВыборкаТоваров = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаТоваров.Следующий() Цикл
		НовСтрокаТовары = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрокаТовары, ВыборкаТоваров);
	КонецЦикла;	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр СтатусыЗаказов
	Движения.СтатусыЗаказов.Записывать = Истина;	
	Движение = Движения.СтатусыЗаказов.Добавить();
	Движение.Период = Дата;
	Движение.Заказ = Заказ;
	Движение.Рейс = Рейс;
	Движение.РезультатДоставки = РезультатДоставки;
	Движение.ПричинаОтказаПереноса = ПричинаОтказаПереноса;
	Движение.ДатаПереносаДоставки = ДатаПереносаДоставки;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ДанныеЗаполнения = Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецеСли;		
	ЗаборТарифнаяСетка = 			ДанныеЗаполнения.ТарифнаяСетка;
	ЗапретСменыТипаОплаты = 		ДанныеЗаполнения.ЗапретСменыТипаОплаты;
	ПечататьЧек = 					ДанныеЗаполнения.ПечататьЧек;
	ТарифицируемыйВес = 			ДанныеЗаполнения.ТарифицируемыйВес;
	ТипОплаты = 					ДанныеЗаполнения.ТипОплаты;
	ВыбранныйТипОплаты = 			ДанныеЗаполнения.ТипОплаты;
	АдресОтправкиЧекаEMAIL = 		ДанныеЗаполнения.ПолучательEMAIL;
	
	ТестоваяСреда = ПараметрыСеанса.ТестоваяСреда;
	ВерсияКонфигурации = Метаданные.Версия;	
КонецПроцедуры
#КонецОбласти	

