
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Водитель") Тогда
		Водитель = Параметры.Водитель;
	КонецЕсли;
	
	Если Параметры.Свойство("СхемаПолигонов") Тогда
		СхемаПолигонов = Параметры.СхемаПолигонов;
	КонецЕсли;
	
	Если Параметры.Свойство("СменаМаршрутизации") Тогда
		СменаМаршрутизации = Параметры.СменаМаршрутизации;
	КонецЕсли;

	Список.Параметры.УстановитьЗначениеПараметра("СхемаПолигональнойМаршрутизации", СхемаПолигонов);
	Список.Параметры.УстановитьЗначениеПараметра("СменаМаршрутизации", СменаМаршрутизации);

КонецПроцедуры

