
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Задача № 2540
	ТаблицаДвиженийВзаиморасчетовСКомитентами = РегистрыНакопления.ВзаиморасчетыСКомитентами.ТаблицаДвиженийПоРегистру();
	//Задача № 2540
	
	Движения.ВзаиморасчетыСКомитентамиПоЗаказам.Записывать = Истина;
	Движения.ВзаиморасчетыСКомитентамиПоЗаказам.Очистить();
	Движения.ВзаиморасчетыСКомитентамиПоЗаказам.БлокироватьДляИзменения = Истина;
		
	//Для каждого ТекСтрока Из ПроведенныеПлатежи Цикл
	//	
	//	СтруктураОтбора = Новый Структура("Контрагент", Текстрока.Контрагент);
	//	
	//	НайденныеСтроки = Заказы.НайтиСтроки(СтруктураОтбора); 
	//	
	//	Для каждого СтрокаЗаказ Из НайденныеСтроки Цикл
	//		Запись = Движения.ВзаиморасчетыСКомитентамиПоЗаказам.ДобавитьРасход();
	//		Запись.Период = КонецДня(ТекСтрока.ДатаВыписки);
	//		Запись.Организация = ТекСтрока.Организация;
	//		Запись.Комитент = ТекСтрока.Контрагент;
	//		Запись.ДатаВозникновенияЗадолженности = ТекСтрока.ДатаВозникновенияЗадолженности;
	//		Запись.ТипЗаказа = СтрокаЗаказ.ТипЗаказа;
	//		Запись.Заказ = СтрокаЗаказ.Заказ;
	//		Запись.Сумма = СтрокаЗаказ.Сумма;
	//		
	//		//Задача № 2540
	//		ЗаполнитьЗначенияСвойств(ТаблицаДвиженийВзаиморасчетовСКомитентами.Добавить(),  Запись);
	//		//Задача № 2540

	//	КонецЦикла; 
	//	
	//КонецЦикла; 
	
	Для каждого ТекСтрока Из Заказы Цикл
		
		СтруктураОтбора = Новый Структура("Контрагент", ТекСтрока.Контрагент);
		
		Если НЕ ЗначениеЗаполнено(ТекСтрока.ДатаВозникновенияЗадолженности) Тогда
			СтруктураОтбора.Вставить("ДатаВозникновенияЗадолженности", НачалоДня(ТекСтрока.Заказ.Дата));
		Иначе
			СтруктураОтбора.Вставить("ДатаВозникновенияЗадолженности", ТекСтрока.ДатаВозникновенияЗадолженности);			
		КонецЕсли; 
		
		НайденныеСтроки = ПроведенныеПлатежи.НайтиСтроки(СтруктураОтбора);
		
		Для каждого СтрокаВыписка Из НайденныеСтроки Цикл
		
			Запись = Движения.ВзаиморасчетыСКомитентамиПоЗаказам.ДобавитьРасход();
			Запись.Период = КонецДня(СтрокаВыписка.ДатаВыписки);
			Запись.Организация = СтрокаВыписка.Организация;
			Запись.Комитент = ТекСтрока.Контрагент;
			Запись.ДатаВозникновенияЗадолженности = СтрокаВыписка.ДатаВозникновенияЗадолженности;
			Запись.ТипЗаказа = ТекСтрока.ТипЗаказа;
			Запись.Заказ = ТекСтрока.Заказ;
			Запись.Сумма = ТекСтрока.Сумма;
		
		КонецЦикла; 
		
		//Задача № 2540
		ЗаполнитьЗначенияСвойств(ТаблицаДвиженийВзаиморасчетовСКомитентами.Добавить(),  Запись);
		//Задача № 2540
		
	КонецЦикла; 
	
	//Задача № 2540
	Движения.ВзаиморасчетыСКомитентами.СоздатьДвижения(ЭтотОбъект, ТаблицаДвиженийВзаиморасчетовСКомитентами);
	//Задача № 2540

КонецПроцедуры
