
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр СводПоЗарплате 
	Движения.СводПоЗарплате.Записывать = Истина;
	Движения.СводПоЗарплате.Очистить();
	Для Каждого ТекСтрокаФизЛица Из ФизЛица Цикл
		Движение = Движения.СводПоЗарплате.Добавить();
		Движение.Период = Дата;
		Если ТипЗнч(ТекСтрокаФизЛица.ФизЛицо) = Тип("СправочникСсылка.новаВодители") Тогда
			Движение.УчастникЭкипажа = Перечисления.УчастникЭкипажа.Водитель;
		ИначеЕсли ТипЗнч(ТекСтрокаФизЛица.ФизЛицо) = Тип("СправочникСсылка.новаЭкспедиторы") Тогда
			Движение.УчастникЭкипажа = Перечисления.УчастникЭкипажа.Экспедитор;
		КонецеСли;	
		Движение.ТипРасчетаЗарплаты = Перечисления.ТипыРасчетаЗарплаты.РасчетПоОкладу;
		Движение.ФизЛицо = ТекСтрокаФизЛица.ФизЛицо;
		Движение.Сумма = Окр(ТекСтрокаФизЛица.ОтработаноДней/КоличествоРабочихДнейПоГрафику * ТекСтрокаФизЛица.Оклад);
        Движение.ПоказательКоличества = ТекСтрокаФизЛица.ОтработаноДней;
        //+++++Серегин М.В. 29.02.2016 12:15:46 
        Движение.ТипНУ = Перечисления.ТипыНУЭкипажей.РасчетЗП;
        //-----Серегин М.В. 29.02.2016 12:15:47 
	КонецЦикла;

	// Миго-групп ШушлебинДА {
	// 26.06.2017 
	Движения.мгЗарплатаНачисления.Записывать = Истина;
	Движения.мгЗарплатаНачисления.Очистить();
	Для каждого ТекСтрокаФизЛица Из ФизЛица Цикл
		Если ТекСтрокаФизЛица.мгНачислениеЗаОсновнуюРаботу <> 0 Тогда
			Движение = Движения.мгЗарплатаНачисления.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = ПериодРегистрации;
			Движение.Организация = ТекСтрокаФизЛица.Организация;
			Движение.Терминал = мгТерминал;
			Движение.ВидНачисления = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.НачислениеОсновное");
			Движение.Сотрудник = ТекСтрокаФизЛица.ФизЛицо;
			Движение.Тариф = ТекСтрокаФизЛица.мгНачислениеЗаОсновнуюРаботу;
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "В строке " + Строка(ТекСтрокаФизЛица.НомерСтроки) + ", у сотрудника " + Строка(ТекСтрокаФизЛица.ФизЛицо) + " не заполнена сумма!";
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЦикла;
	//} ШушлебинДА
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
