
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	
	Движения.ОперативнаяЭкономикаЗаказов.Записывать = Истина;
	Движения.ОперативнаяЭкономикаЗаказов.Очистить();
	
	Для каждого Стр Из РаспределенныеРасходы Цикл
		
		Движение = Движения.ОперативнаяЭкономикаЗаказов.Добавить();
		
		Движение.Период = Дата;
		Движение.Регистратор = Ссылка;
		Движение.Партнер = Стр.Партнер;
		Движение.ИнтернетМагазин = Стр.Партнер;
		Движение.ТипЗаказа = Стр.ТипЗаказа;
		Движение.Заказ = Стр.Заказ;
		Движение.ДоходРасход = Перечисления.ДоходРасход.Расход;
		Движение.Статья = Стр.Статья;
		Движение.Рейс = Стр.Рейс;
		Движение.Сумма = Стр.Сумма;
		Движение.Показатель = Стр.Показатель;
		Движение.Транспорт = Стр.Рейс;	
		Движение.Водитель = Стр.Рейс.РейсМестнойДоставки.Водитель;
		Движение.Экспедитор = Стр.Рейс.РейсМестнойДоставки.Экспедитор;		
	
	КонецЦикла;
	
	
КонецПроцедуры
