
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// Вставить содержимое обработчика.
	Попытка
		ПодключениеКМагазину = Евген.СоздатьПодключениеКИнтернетМагазину(); 
	Исключение
		НормальныйХодВыполнения = Ложь;
		Возврат;
	КонецПопытки;
	
	
	Движения.СостоянияЗаказов.Очистить();
	Движения.СостоянияЗаказов.Записывать = Истина;

	
	Движения.ДатыДоставок.Очистить();
	Движения.ДатыДоставок.Записывать = Истина;
	
	СтрокаП = 	"Уважаемые партнеры
				|Заказы ниже были перенесены на " + Формат(ДатаПереноса, "ДЛФ=DD") + ", т.к. превысили допустимый лимит доставок в день
				|Просим Вас не отгружать заказы " + Формат(Дата, "ДЛФ=DD") + " и проинформировать клиентов об изменении даты доставки:" + Символы.пс;
	
	// Вставить содержимое обработчика.
	
	//Логистическая, Складская
	
	Для Каждого ТекК Из Контрагенты Цикл
		Струк = Новый Структура;
		Струк.Вставить("Контрагент", ТекК.Контрагент);
		Най = ПеренесенныеЗаказы.НайтиСтроки(Струк);
		
		СтрокаП = 	"Уважаемые партнеры
		|Заказы ниже были перенесены на " + Формат(ДатаПереноса, "ДЛФ=DD") + ", т.к. превысили допустимый лимит доставок в день
		|Просим Вас не отгружать заказы " + Формат(Дата, "ДЛФ=DD") + " и проинформировать клиентов об изменении даты доставки:" + Символы.пс;
		
		Для Сч = 0 По Най.Количество() - 1 Цикл
			
			Тек = Най[Сч];
			СтрокаП = СтрокаП + СокрЛП(Тек.заказ.Номер) + "/" + СокрЛП(Тек.заказ.НомерВнешнегоЗаказа) + "," + Символы.ПС;
			
			Д = БизнесПроцессы.новаМестнаяДоставка.НайтиПоНомеру(Тек.заказ.Номер).ПолучитьОбъект();
			
			Д.Дата = ДатаПереноса;
			
			ЧН = Час(Д.ВремяОтправленияС);
			ЧК = Час(Д.ВремяОтправленияПо);
			
			МН = Минута(Д.ВремяОтправленияС);
			МК = Минута(Д.ВремяОтправленияПо);
			
			ЧН_ = Час(Д.ВремяПрибытияС);
			ЧК_ = Час(Д.ВремяПрибытияПо);
			
			МН_ = Минута(Д.ВремяПрибытияС);
			МК_ = Минута(Д.ВремяПрибытияПо);
			
			
			Д.ВремяОтправленияС = Дата(Формат(Год(ДатаПереноса), "ЧГ=") + Формат(Месяц(ДатаПереноса), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(День(ДатаПереноса), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(ЧН, "ЧЦ=2; ЧВН=; ЧГ=") + Формат(МН, "ЧЦ=2; ЧВН=; ЧГ=") + "00");
			Д.ВремяОтправленияПо = Дата(Формат(Год(ДатаПереноса), "ЧГ=") + Формат(Месяц(ДатаПереноса), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(День(ДатаПереноса), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(ЧК, "ЧЦ=2; ЧВН=; ЧГ=") + Формат(МК, "ЧЦ=2; ЧВН=; ЧГ=") + "00");
			
			Д.ВремяПрибытияС = Дата(Формат(Год(ДатаПереноса), "ЧГ=") + Формат(Месяц(ДатаПереноса), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(День(ДатаПереноса), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(ЧН_, "ЧЦ=2; ЧВН=; ЧГ=") + Формат(МН_, "ЧЦ=2; ЧВН=; ЧГ=") + "00");
			Д.ВремяПрибытияПо = Дата(Формат(Год(ДатаПереноса), "ЧГ=") + Формат(Месяц(ДатаПереноса), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(День(ДатаПереноса), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(ЧК_, "ЧЦ=2; ЧВН=; ЧГ=") + Формат(МК_, "ЧЦ=2; ЧВН=; ЧГ=") + "00");
			
			Д.Записать();
			
			УстановитьДатуВАдминке(Тек.Заказ.Номер, ДатаПереноса, ПодключениеКМагазину);
			
			
			Док = Тек.Заказ.ПолучитьОбъект();
			Док.Дата = ДатаПереноса;
			Док.Записать(РежимЗаписиДокумента.Запись);
			Если Док.Проведен Тогда
				Док.Записать(РежимЗаписиДокумента.Проведение);
			КонецеСли;
			
			Нов = Движения.СостоянияЗаказов.Добавить();
			Нов.Период = Дата;
			Нов.Доставка = Д.Ссылка;
			Нов.ПричинаНеВыполнения = Справочники.ПричиныНеВыполненияДоставки.ПереносДоставки;
			Нов.ПричинаОтказа = ПричинаПереноса;
			
			Нов = Движения.ДатыДоставок.Добавить();
			Нов.ДатаДоставки = ДатаПереноса;
			Нов.Доставка = Д.Ссылка;
			Нов.Период = Дата;
			Нов.ПричинаИзмененияДаты = Перечисления.ПричиныИзмененияДатыДоставки.ПереносВСвязиСПревышениемЛимита;
		
		КонецЦикла;	
		
		если Най.Количество() <> 0 Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	РассылкиКонтрагентов.Почта
			|ИЗ
			|	РегистрСведений.РассылкиКонтрагентов КАК РассылкиКонтрагентов
			|ГДЕ
			|	РассылкиКонтрагентов.Контрагент = &Контрагент
			|	И РассылкиКонтрагентов.ТипРассылки В(&ТипРассылки)";
			МасТип = Новый Массив;
			МасТип.Добавить(Перечисления.ТипыРассылки.СкладскаяРассылка);
			МасТип.Добавить(Перечисления.ТипыРассылки.ЛогистическаяРассылка);
			Запрос.УстановитьПараметр("Контрагент", ТекК.Контрагент);
			Запрос.УстановитьПараметр("ТипРассылки", МасТип);
			Адр = Запрос.Выполнить().Выгрузить();
			
			МасП = Новый Массив;
			Для Каждого Тек Из Адр Цикл
				МасП.Добавить(Тек.Почта);
			КонецЦикла;	
			МасП.Добавить("logist@strizh-logistic.ru");
            //+++++Серегин М.В. 19.01.2016 11:51:47 
            //МасП.Добавить("yuriy.gnedov@strizh-logistic.ru");
            //-----Серегин М.В. 19.01.2016 11:51:48 
			//МасП.Добавить("pavel.nechaev@strizh-logistic.ru");
			//МасП.Добавить("evgeniy.marochkin@strizh-logistic.ru");
			//МасП.Добавить("pavel.nechaev@strizh-logistic.ru");
			
			
			lem.ОтправитьСообщение(МасП, "Перенесенные заказы (" + СокрЛП(ТекК.Контрагент.Наименование) + ") в связи с превышением лимита" ,СтрокаП,,"Логистическая компания ""Стриж""",,,,,МасТип);
		КонецеСли;
	КонецЦикла;
КонецПроцедуры



Процедура УстановитьДатуВАдминке(НомерЗ, ДатаЗ, Подкл) Экспорт
	Ткст = "
	|UPDATE _order
	|SET DeliveryDate = '" + Евген.ДатаВSQL(ДатаЗ, Ложь) + "'
	| WHERE orderId = " + Формат(НомерЗ, "ЧГ=") + "
	|EXEC mp_saveOrderHistory " + Формат(НомерЗ, "ЧГ=");
	Евген.ЗапросКИнтернетМагазину(Ткст, Подкл);
    //
    ////Серегин М.В. 30.07.2015 17:45:41 старый код 
    //Ткст = "
    //|UPDATE _order
    //|SET carid = 0
    //| WHERE orderId = " + Формат(НомерЗ, "ЧГ=") + "
    //|EXEC mp_saveOrderHistory " + Формат(НомерЗ, "ЧГ=");
    //Евген.ЗапросКИнтернетМагазину(Ткст, Подкл);
    ////Серегин М.В. 30.07.2015 17:45:49 новый
    Ткст = "
	|EXEC p1c_removeCarriageFromOrder " + Формат(НомерЗ, "ЧГ=") + "
	|EXEC mp_saveOrderHistory " + Формат(НомерЗ, "ЧГ=");
	Евген.ЗапросКИнтернетМагазину(Ткст, Подкл);
    //Серегин М.В. 30.07.2015 17:45:52 
	
КонецПроцедуры	


Процедура УстановитьСтатусСтрижаВАдминке(НомерЗ) Экспорт
	Попытка
		ПодключениеКМагазину = Евген.СоздатьПодключениеКИнтернетМагазину(); 
	Исключение
		НормальныйХодВыполнения = Ложь;
		Возврат;
	КонецПопытки;
	Ткст = "
	|UPDATE _order
	|SET Status = 2
	| WHERE orderId = " + Формат(НомерЗ, "ЧГ=") + "
	|EXEC mp_saveOrderHistory " + Формат(НомерЗ, "ЧГ=");
	Евген.ЗапросКИнтернетМагазину(Ткст, ПодключениеКМагазину);
КонецПроцедуры	

	
	