
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	
	Список.Параметры.УстановитьЗначениеПараметра("Состояние", Перечисления.СостояниеРаботникаОрганизации.ПринятНаРаботуВОрганизацию);
	Список.Параметры.УстановитьЗначениеПараметра("ТолькоЭкипажи", Параметры.Свойство("ТолькоЭкипажи"));
	
КонецПроцедуры

&НаСервере
Процедура УволенныеСотрудникиНаСервере()

	Элементы.ФормаУволенныеСотрудники.Пометка = Не Элементы.ФормаУволенныеСотрудники.Пометка;
	Если Элементы.ФормаУволенныеСотрудники.Пометка Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Состояние", Перечисления.СостояниеРаботникаОрганизации.Уволен);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("Состояние", Перечисления.СостояниеРаботникаОрганизации.ПринятНаРаботуВОрганизацию);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УволенныеСотрудники(Команда)
	УволенныеСотрудникиНаСервере();
КонецПроцедуры
