

&НаКлиенте
Процедура Сформировать(Команда)
    ТабличныйДокумент = ПечатьСпискаРейсов();
    ТабличныйДокумент.Показать();
КонецПроцедуры

&НаСервере
Функция ПечатьСпискаРейсов()
    Макет = Документы.Рейс.ПолучитьМакет("СписокРейсов");
    ТабличныйДокумент = Новый ТабличныйДокумент;
    
    ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
    ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |	ДокументРейс.Ссылка КАК Ссылка,
        |	ДокументРейс.ПометкаУдаления КАК ПометкаУдаления,
        |	ДокументРейс.Номер КАК Номер,
        |	ДокументРейс.Дата КАК Дата,
        |	ДокументРейс.Проведен КАК Проведен,
        |	ДокументРейс.Транспорт КАК Транспорт,
        |	ДокументРейс.Идентификатор КАК Идентификатор,
        |	ДокументРейс.НомерПалетты КАК НомерПалетты,
        |	ДокументРейс.РежимЗагрузкиДанных КАК РежимЗагрузкиДанных,
        |	ДокументРейс.РейсМестнойДоставки КАК РейсМестнойДоставки,
        |	ДокументРейс.МоментВремени КАК МоментВремени,
        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт КАК ПривязанныйТранспорт,
        |	ДокументРейс.ДатаРейса КАК ДатаРейса
        |ИЗ
        |	Документ.Рейс КАК ДокументРейс
        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних КАК ПривязкаМашинКРейсамСрезПоследних
        |		ПО (ПривязкаМашинКРейсамСрезПоследних.Рейс = ДокументРейс.Ссылка)
        |ГДЕ
        |	НЕ ДокументРейс.ПометкаУдаления
        |	И ДокументРейс.Дата МЕЖДУ &НачалоПериода И &КонецПериода
        |	И ДокументРейс.ТерминалДоставки = &ТерминалДоставки
        |
        |УПОРЯДОЧИТЬ ПО
        |	НомерПалетты
        |АВТОУПОРЯДОЧИВАНИЕ";
    
    Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
    Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	
	// Михушкин - 02.06.2017 - разделение по терминалам --->> 
	ТекТерминал = ПараметрыСеанса.ТерминалДоставки;
	Если НЕ ЗначениеЗаполнено(ТекТерминал) Тогда	
		ТекТерминал = Справочники.РегиональныеТерминалы.МоскваСтриж;
	КонецЕсли;
	Запрос.УстановитьПараметр("ТерминалДоставки", ТекТерминал);
	// <<--- Михушкин 
	
	РезультатЗапроса = Запрос.Выполнить();
    
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
    ТабличныйДокумент.Вывести(ОбластьШапка);
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
        ОбластьСтрока.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
        ТабличныйДокумент.Вывести(ОбластьСтрока);
    КонецЦикла;
    ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
    ТабличныйДокумент.АвтоМасштаб = Истина;
    Возврат ТабличныйДокумент;
   
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    Период.ДатаНачала = НачалоДня(ТекущаяДата());
    Период.ДатаОкончания = КонецДня(ТекущаяДата());
КонецПроцедуры
