Процедура ЗафиксироватьФактИнформированияСамовывоз(КоличествоЗаказов, ТипИнформирования, Терминал = Неопределено, ИнформированиеПроизведено = Истина, Пользователь = Неопределено) Экспорт
	Наб = РегистрыСведений.ЛогИнформированияПолучателейСамовывоза.СоздатьНаборЗаписей();
	
	Если Терминал = Неопределено Тогда
		Терминал = ПараметрыСеанса.ТерминалДоставки;
	КонецеСЛи;
	
	Если Пользователь = Неопределено Тогда
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецеСЛи;
	
	
	ТекВр = ТекущаяДата();
	
	Наб.Отбор.Терминал.Установить(Терминал);
	Наб.Отбор.ТипИнформирования.Установить(ТипИнформирования);
	Наб.Отбор.Период.Установить(ТекВр);
	
	Нов = Наб.Добавить();
	Нов.ТипИнформирования = ТипИнформирования;
	Нов.Терминал = Терминал;
	Нов.ИнформированиеПроизведено = ИнформированиеПроизведено;
	Нов.КоличествоЗаказовВВыборке = КоличествоЗаказов;
	Нов.Период = ТекВр;
	Нов.Пользователь = Пользователь;
	
	Наб.Записать();
КонецПроцедуры	

Функция ПолучитьРежимИнформированияПолучателейЗаказов() Экспорт
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	НастройкиУчетаОбщиеСрезПоследних.ТипИнформированияПолучателейЗаказов КАК ТипИнформированияПолучателейЗаказов
	            |ИЗ
	            |	РегистрСведений.НастройкиУчетаОбщие.СрезПоследних КАК НастройкиУчетаОбщиеСрезПоследних";
	
	Выб = Зап.Выполнить().Выбрать();
	
	Если Выб.Следующий() Тогда
		Если Не ЗначениеЗаполнено(Выб.ТипИнформированияПолучателейЗаказов) Тогда
			Возврат Перечисления.ТипыИнформированияПолучателейЗаказов.СМС;
		Иначе
			Возврат Выб.ТипИнформированияПолучателейЗаказов;
		КонецеСли;	
	Иначе 
		Возврат Перечисления.ТипыИнформированияПолучателейЗаказов.СМС;
	КонецеСли;	
КонецФункции	

//Асеев 24.02.2022 (Задача № 4745)>>>
Функция ПолучитьСсылкиНаОтслеживаниеЗаказов(МассивНомеровЗаказов) Экспорт
	
	ТаблицаСсылокНаОтслеживание = Новый ТаблицаЗначений;
	КолонкиТаблицы = ТаблицаСсылокНаОтслеживание.Колонки;
	КолонкиТаблицы.Добавить("НомерЗаказа");
	КолонкиТаблицы.Добавить("СсылкаНаОтслеживание");
	
	ШаблонЗаказ = Новый ФиксированнаяСтруктура("OrderId");
	
	МассивЗаказов = Новый Массив;
	Для Каждого НомерЗаказа Из МассивНомеровЗаказов Цикл
		СтруктураЗаказ = Новый Структура(ШаблонЗаказ);
		СтруктураЗаказ.OrderId = НомерЗаказа;
		МассивЗаказов.Добавить(СтруктураЗаказ);
	КонецЦикла;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("orders", МассивЗаказов);
	
	ВидМетода = Перечисления.ВидыЗапросовWEBСервис.getCustomerLinkResult;
	
	ПолученныеДанные = ИнтеграцияСАдминкойWEBСервис.ВыполнитьЗапросКАдминке(ВидМетода, ПараметрыЗапроса);
	Если Не ПолученныеДанные.Успешно Тогда
		Возврат ТаблицаСсылокНаОтслеживание;
	КонецЕсли;
	
	getCustomerLinkResult = ПолученныеДанные.Данные.getCustomerLinkResult;
	Если Не getCustomerLinkResult.Succeded Тогда
		Возврат ТаблицаСсылокНаОтслеживание;
	КонецЕсли;
	
	МассивДанных = getCustomerLinkResult.Data;
	Если Не МассивДанных.Количество() Тогда
		Возврат ТаблицаСсылокНаОтслеживание;
	КонецЕсли;
	
	Для Каждого СтруктураДанных Из МассивДанных Цикл
		СтрокаТаблицы = ТаблицаСсылокНаОтслеживание.Добавить();
		СтрокаТаблицы.НомерЗаказа = СтруктураДанных.OrderId;
		СтрокаТаблицы.СсылкаНаОтслеживание = СтруктураДанных.CustomerLink;
	КонецЦикла;
	
	Возврат ТаблицаСсылокНаОтслеживание;
	
КонецФункции
//Асеев 24.02.2022 (Задача № 4745)<<<

