Процедура ВыгрузитьТранспортировкуВДМ() Экспорт
	
	Если ПараметрыСеанса.ЭтоТестоваяСреда Тогда
		//Прокси = WSСсылки.DM_Transport_2019_02_test.СоздатьWSПрокси("urn:DetMir.ru:TransComp:Common", "TransComp_Transportion_OutService", "HTTP_Port");	
		Прокси = WSСсылки.DM_Transport_2022_06_test.СоздатьWSПрокси("urn:DetMir.ru:TransComp:Common", "TransComp_Transportion_OutService", "HTTP_Port");	
		Прокси.Пользователь = "WS_STRIZH";
		Прокси.Пароль = "Lq}28~br";
	Иначе	
		//Прокси = WSСсылки.DM_Transport_2019_02_work.СоздатьWSПрокси("urn:DetMir.ru:TransComp:Common", "TransComp_Transportion_OutService", "HTTP_Port");
		Прокси = WSСсылки.DM_Transport_2022_06_work.СоздатьWSПрокси("urn:DetMir.ru:TransComp:Common", "TransComp_Transportion_OutService", "HTTP_Port");
		Прокси.Пользователь = "WS_STRIZH";
		Прокси.Пароль = "Os$4qS}bl";
	КонецеСли;	
	//Прокси.Пользователь = "WS_STRIZH_L";
	//Прокси.Пароль = "7AyS)+%5%R8AEz";
	
	
	//Прокси.Пользователь = "WS_STRIZH";
	//Прокси.Пароль = "Os$4qS}bl";
	
	
	ТипОтправка = Прокси.ФабрикаXDTO.Пакеты.Получить("urn:DetMir.ru:TransComp:Common").Получить("TransCompTransportionReq");
	
	МассивДокументов = Прокси.ФабрикаXDTO.Создать(ТипОтправка.Свойства.Получить("Transportion").Тип);
	
	
	
	Отправка = Прокси.ФабрикаXDTO.Создать(ТипОтправка);
	Если СокрЛП(Контрагент.Код) = "Shop_428" Тогда
		Отправка.Partner = "STRIZH";
	ИначеЕсли СокрЛП(Контрагент.Код) = "Shop_169" Тогда
		Отправка.Partner = "MCLog";
	КонецеСли;
	
	
	РезультатВыгрузки = РаботаСВозвратамиСервер.ПолучитьСтатусПередачиТранспортировкиВДМ(Ссылка);
	
	GUID = Новый УникальныйИдентификатор();
	
	Отправка.GUID = Строка(GUID);
	
	ДокументКПередаче = Прокси.ФабрикаXDTO.Создать(ТипОтправка.Свойства.Получить("Transportion").Тип);
	
	Для Каждого ВозвратТовара Из Документы Цикл
		ВозвратКОтправке = Прокси.ФабрикаXDTO.Создать(ТипОтправка.Свойства.Получить("Transportion").Тип.Свойства.Получить("Deliveries").Тип);
		ВозвратКОтправке.DeliveryExNo = СокрЛП(ВозвратТовара.Документ.Номер) + "_" + Формат(Год(ВозвратТовара.Документ.Дата), "ЧГ=");
		ДокументКПередаче.Deliveries.Добавить(ВозвратКОтправке);
	КонецЦикла;	
	
	Если РезультатВыгрузки.Результат Тогда
		ДокументКПередаче.TypeOperation = "02";
	Иначе
		ДокументКПередаче.TypeOperation = "01";
	КонецеСли;	
	ДокументКПередаче.TranspPlace = "1000";
	ДокументКПередаче.TranspType = "ZINT";
	ДокументКПередаче.DocExtNo = СокрЛП(Номер);
	ДокументКПередаче.DocDate = Формат(Дата, "ДФ=dd.MM.yyyy");
	ДокументКПередаче.DeliveryPlanDate = Формат(ДатаРейса, "ДФ=dd.MM.yyyy");
	
	Отправка.Transportion.Добавить(ДокументКПередаче);
	
	Рез = Прокси.Transportion_Sync(Отправка);
	
	Струк = Новый Структура;
	Струк.Вставить("дмGUIDСообщения", GUID); 
	
	Для Каждого Тек Из Рез.TransportionResp Цикл
		Струк.Вставить("дмНомерСозданногоДокумента", Тек.DocNo); 
		Струк.Вставить("дмСтатус", Тек.Status); 
		Струк.Вставить("дмКомментарийКСтатусу", Тек.StatusInfo); 
		Струк.Вставить("ТипОперации", Перечисления.ТипыОперацийИнтеграцияДМПоВозвратам.ПередачаДанныхОТранспортировке); 
		СтрокаОшибок = "";
		Для Каждого ТекОшибка Из Тек.ErrData Цикл
			СтрокаОшибок = СтрокаОшибок + ТекОшибка.ErrorCode + "-" + ТекОшибка.ErrorText + ";";
		КонецЦикла;
		Струк.Вставить("дмОшибки", СтрокаОшибок); 
	КонецЦикла;	
	
	РаботаСВозвратамиСервер.ЗаписатьДополнительныеПараметрыПоВозврату(Ссылка, Струк);
КонецПроцедуры	