
Процедура ПриЗаписи(Отказ)
	
	//Асеев 31.01.2023 (Задача № 4977)>>>
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПараметрыКонтрагентовСрезПоследних.Контрагент КАК Ссылка
	|ИЗ
	|	РегистрСведений.ПараметрыКонтрагентов.СрезПоследних КАК ПараметрыКонтрагентовСрезПоследних
	|ГДЕ
	|	ПараметрыКонтрагентовСрезПоследних.ЛьготнаяКатегорияЭквайринга = &Ссылка";
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		МассивУзлов = РаботаСМобильнымПриложениемЭкипажейСервер.ПолучитьМассивУзловМП();
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;
	//Асеев 31.01.2023 (Задача № 4977)<<<

КонецПроцедуры
