//+++ БАО 22.05.2017 №874 
Функция ПолучитьМассивДоговорников() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Контрагенты.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.Код = &КодDirectCredit
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Контрагенты.Ссылка
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.Код = &КодPoscredit
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Контрагенты.Ссылка
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.Родитель.ОсновнойМагазин.Код = &КодPoscredit
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Контрагенты.Ссылка
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.Родитель.ОсновнойМагазин.Код = &КодDirectCredit
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Контрагенты.Ссылка
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.Родитель.Родитель.ОсновнойМагазин.Код = &КодPoscredit
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Контрагенты.Ссылка
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.Родитель.Родитель.ОсновнойМагазин.Код = &КодDirectCredit";
	
	
	Запрос.УстановитьПараметр("КодPoscredit","Shop_604 ");
	Запрос.УстановитьПараметр("КодDirectCredit","Shop_234");
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции
//--- БАО 22.05.2017 №874 

//+++ БАО 23.05.2017 №876
Функция ВернутьСтавкуНДСПоКодуАдминки(КодНДСАдминки) Экспорт 
	
	//+++ БАО 24.05.2017 №876
	
	//Если КодНДСАдминки = 0 Тогда
	//	Возврат Справочники.СтавкиНДСФЗ54.НДС0;
	//ИначеЕсли КодНДСАдминки = 10 Тогда
	//	Возврат Справочники.СтавкиНДСФЗ54.НДС10;
	//ИначеЕсли КодНДСАдминки = 18 Тогда
	//	Возврат Справочники.СтавкиНДСФЗ54.НДС18;
	//ИначеЕсли КодНДСАдминки = 20 Тогда
	//	Возврат Справочники.СтавкиНДСФЗ54.НДС20;
	//ИначеЕсли КодНДСАдминки = -1 Тогда
	//	Возврат Справочники.СтавкиНДСФЗ54.БезНДС;
	//Иначе //-2
	//	Возврат Справочники.СтавкиНДСФЗ54.ПустаяСсылка();
	//КонецЕсли;
	
	НайденныйЭлемент = Справочники.СтавкиНДСФЗ54.НайтиПоРеквизиту("КодВАдминке",  КодНДСАдминки);
	Возврат НайденныйЭлемент;
	
	//--- БАО 24.05.2017 №876
	
КонецФункции	
//--- БАО 23.05.2017 №876

//+++ БАО 08.06.2017 №1024 
Функция ДобавитьЗаписьВРегистрДокументыЗакрытыеДляИзменения(Документ, ЗакрытДляРедактирования, ИнициаторБлокировки = Неопределено) Экспорт 
	
	МенеджерЗаписи = РегистрыСведений.ДокументыЗакрытыеДляИзменения.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Документ = Документ;
	МенеджерЗаписи.ЗакрытДляРедактирования = ЗакрытДляРедактирования;
	//+Степанов Задача № 3439
	Если ИнициаторБлокировки <> Неопределено Тогда
		МенеджерЗаписи.ДокументРегистратор = ИнициаторБлокировки;		
	Иначе	
		МенеджерЗаписи.ДокументРегистратор = Документ;
	КонецЕсли;
	//-Степанов
	МенеджерЗаписи.Записать();
	
КонецФункции

Функция РейсЗакрыт(Документ) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументыЗакрытыеДляИзмененияСрезПоследних.ЗакрытДляРедактирования КАК ЗакрытДляРедактирования
		|ИЗ
		|	РегистрСведений.ДокументыЗакрытыеДляИзменения.СрезПоследних КАК ДокументыЗакрытыеДляИзмененияСрезПоследних
		|ГДЕ
		|	ДокументыЗакрытыеДляИзмененияСрезПоследних.Документ = &Документ";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда

		Возврат ВыборкаДетальныеЗаписи.ЗакрытДляРедактирования;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции	
//--- БАО 08.06.2017 №1024 

//+++ БАО 27.06.2017 №1180

Функция СформироватьНомераПалетПоМаркеТранспортаИПоВремениОкончанияРейсаПлюсПрефикс(Док) Экспорт 
	
	Запрос = Новый Запрос;
	//+++ БАО 25.09.2017 №1180
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	РейсПоездки.ПланируемоеВремяОкончанияПоездки КАК ВремяПрибытия,
	//               |	РейсПоездки.Ссылка.Ссылка КАК Рейс,
	//               |	ВЫБОР
	//               |		КОГДА РейсПоездки.Ссылка.Транспорт.Наименование ПОДОБНО ""WW%""
	//               |			ТОГДА 1
	//               |		КОГДА РейсПоездки.Ссылка.Транспорт.Наименование ПОДОБНО ""Ларгус%""
	//               |			ТОГДА 2
	//               |		КОГДА РейсПоездки.Ссылка.Транспорт.Наименование ПОДОБНО ""Наемник%""
	//               |				ИЛИ РейсПоездки.Ссылка.Транспорт.Наименование ПОДОБНО ""Наёмник%""
	//               |			ТОГДА 3
	//               |		ИНАЧЕ 4
	//               |	КОНЕЦ КАК Префикс
	//               |ИЗ
	//               |	Документ.Рейс.Поездки КАК РейсПоездки
	//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗагрузкаРейсовВероут.Рейсы КАК ЗагрузкаРейсовВероутРейсы
	//               |		ПО РейсПоездки.Ссылка.Ссылка = ЗагрузкаРейсовВероутРейсы.Рейс.Ссылка
	//               |ГДЕ
	//               |	ЗагрузкаРейсовВероутРейсы.Ссылка.Ссылка = &Док
	//               |
	//               |УПОРЯДОЧИТЬ ПО
	//               |	Префикс,
	//               |	РейсПоездки.ПланируемоеВремяОкончанияПоездки УБЫВ";
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	РейсПоездки.ПланируемоеВремяОкончанияПоездки КАК ВремяПрибытия,
	               |	РейсПоездки.Ссылка.Ссылка КАК Рейс,
	               |	РейсПоездки.Ссылка.Транспорт КАК Транспорт
	               |ПОМЕСТИТЬ ВТ_Рейсы
	               |ИЗ
	               |	Документ.Рейс.Поездки КАК РейсПоездки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗагрузкаРейсовВероут.Рейсы КАК ЗагрузкаРейсовВероутРейсы
	               |		ПО РейсПоездки.Ссылка.Ссылка = ЗагрузкаРейсовВероутРейсы.Рейс.Ссылка
	               |ГДЕ
	               |	ЗагрузкаРейсовВероутРейсы.Ссылка.Ссылка = &Док
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Рейсы.Транспорт КАК Транспорт,
	               |	МАКСИМУМ(ВсеРейсыПоТранспорту.Ссылка) КАК Ссылка
	               |ПОМЕСТИТЬ ВТ_ПоследниеРейсы
	               |ИЗ
	               |	ВТ_Рейсы КАК ВТ_Рейсы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Рейс КАК ВсеРейсыПоТранспорту
	               |		ПО ВТ_Рейсы.Транспорт = ВсеРейсыПоТранспорту.Транспорт
	               |ГДЕ
	               |	ВсеРейсыПоТранспорту.ДатаРейса <= &НачалоПрошлогоДня
	               |	И ВсеРейсыПоТранспорту.ПометкаУдаления = ЛОЖЬ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_Рейсы.Транспорт
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Рейсы.Рейс КАК Рейс,
	               |	МАКСИМУМ(ПривязкаМашинКРейсамСрезПоследних.Транспорт) КАК Транспорт
	               |ПОМЕСТИТЬ ВТ_Рейс_ТранспортПрошлогоДня
	               |ИЗ
	               |	ВТ_Рейсы КАК ВТ_Рейсы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПоследниеРейсы КАК ВТ_ПоследниеРейсы
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних(, ) КАК ПривязкаМашинКРейсамСрезПоследних
	               |			ПО ВТ_ПоследниеРейсы.Ссылка = ПривязкаМашинКРейсамСрезПоследних.Рейс
	               |		ПО ВТ_Рейсы.Транспорт = ВТ_ПоследниеРейсы.Транспорт
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_Рейсы.Рейс
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Рейсы.ВремяПрибытия КАК ВремяПрибытия,
	               |	ВТ_Рейсы.Рейс КАК Рейс,
	               |	ВЫБОР
	               |		КОГДА ВТ_Рейс_ТранспортПрошлогоДня.Транспорт ЕСТЬ NULL
	               |			ТОГДА 600
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ЕСТЬNULL(ВТ_Рейс_ТранспортПрошлогоДня.Транспорт.Родитель.Префикс, 0) = 0
	               |					ТОГДА 600
	               |				ИНАЧЕ ВТ_Рейс_ТранспортПрошлогоДня.Транспорт.Родитель.Префикс
	               |			КОНЕЦ
	               |	КОНЕЦ КАК Префикс,
	               |	ВЫБОР
	               |		КОГДА ВТ_Рейс_ТранспортПрошлогоДня.Транспорт ЕСТЬ NULL
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК НетПривязки,
	               |	ВТ_Рейс_ТранспортПрошлогоДня.Транспорт КАК Транспорт,
	               |	ВТ_Рейс_ТранспортПрошлогоДня.Транспорт.Родитель.Префикс КАК ПрефиксГруппы,
	               |	ВТ_Рейсы.Транспорт КАК ТранспортВероут
	               |ИЗ
	               |	ВТ_Рейсы КАК ВТ_Рейсы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Рейс_ТранспортПрошлогоДня КАК ВТ_Рейс_ТранспортПрошлогоДня
	               |		ПО ВТ_Рейсы.Рейс = ВТ_Рейс_ТранспортПрошлогоДня.Рейс
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Префикс,
	               |	ВремяПрибытия УБЫВ";



	
	//--- БАО 25.09.2017 №1180
	Запрос.УстановитьПараметр("Док", Док);
	Запрос.УстановитьПараметр("КонецПрошлогоДня", НачалоДня(ТекущаяДата())-1);
	Запрос.УстановитьПараметр("НачалоПрошлогоДня", НачалоДня(НачалоДня(ТекущаяДата())-1));
	
	

	Рез = Запрос.Выполнить().Выгрузить(); 
	
	ТекущийПрефикс = 0;
	НП = 1;
	
	//Для Тестов
	//Док = Документы.ЗагрузкаРейсовВероут.НайтиПоНомеру("000000910");
	//ПолучитьФорма("Обработка.ВыгрузкаМашинВВероут.Форма.ФормаУправляемая").СформироватьНомераПалетт(Док);
	
	
	Для Каждого Тек Из Рез Цикл
		Рейс = Тек.Рейс.ПолучитьОбъект();
		Рейс.НомерПалетты = НП;

			
		Если  ТекущийПрефикс <> Тек.Префикс Тогда
				НП = 1;
				ТекущийПрефикс = Тек.Префикс;
			КонецЕсли;	
			
			НПСтрока = Формат(НП,"ЧГ=0");  
			//Если Тек.НетПривязки Тогда
			//	НПСтрока =  НПСтрока + "600";	
			//Иначе
				НПСтрока = (Тек.Префикс) + НПСтрока;
			//КонецЕсли;	
			Рейс.НомерПалетты = Число(НПСтрока);
			
		Попытка
			
			Рейс.Записать(РежимЗаписиДокумента.Запись);
			
		Исключение

		КонецПопытки;
		
		НП = НП + 1;
		
	КонецЦикла;	
	
	Возврат Рез;
	
КонецФункции	

Функция СформироватьНомераПалетт(Загрузка) Экспорт
	
	Док = Загрузка.ПолучитьОбъект();
	
	Зап = Новый Запрос;
	Если Загрузка.РежимНазначенияНомеровПалет = Перечисления.РежимыНазначенияНомеровПалет.Случайно Или не значениезаполнено(Загрузка.РежимНазначенияНомеровПалет) Тогда
		Зап.Текст = "ВЫБРАТЬ
		|	ЗагрузкаРейсовВероутРейсы.Рейс.Ссылка КАК Рейс
		|ИЗ
		|	Документ.ЗагрузкаРейсовВероут.Рейсы КАК ЗагрузкаРейсовВероутРейсы
		|ГДЕ
		|	ЗагрузкаРейсовВероутРейсы.Ссылка.Ссылка = &Док
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗагрузкаРейсовВероутРейсы.Рейс.Транспорт.Наименование";
	ИначеЕсли Загрузка.РежимНазначенияНомеровПалет = Перечисления.РежимыНазначенияНомеровПалет.ПоВремениОкончанияРейса Тогда
		Зап.Текст = "ВЫБРАТЬ
		|	РейсПоездки.ПланируемоеВремяОкончанияПоездки КАК ВремяПрибытия,
		|	РейсПоездки.Ссылка.Ссылка КАК Рейс
		|ИЗ
		|	Документ.Рейс.Поездки КАК РейсПоездки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗагрузкаРейсовВероут.Рейсы КАК ЗагрузкаРейсовВероутРейсы
		|		ПО РейсПоездки.Ссылка.Ссылка = ЗагрузкаРейсовВероутРейсы.Рейс.Ссылка
		|ГДЕ
		|	ЗагрузкаРейсовВероутРейсы.Ссылка.Ссылка = &Док
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПланируемоеВремяОкончанияПоездки УБЫВ";
	ИначеЕсли Загрузка.РежимНазначенияНомеровПалет = Перечисления.РежимыНазначенияНомеровПалет.ПоМаркеТранспортаИПоВремениОкончанияРейса Тогда
		Зап.Текст = "ВЫБРАТЬ
		|	РейсПоездки.ПланируемоеВремяОкончанияПоездки КАК ВремяПрибытия,
		|	РейсПоездки.Ссылка.Ссылка КАК Рейс,
		|	ВЫБОР
		|		КОГДА РейсПоездки.Ссылка.Транспорт.Наименование ПОДОБНО ""Ларгус%""
		|			ТОГДА 3
		|		КОГДА РейсПоездки.Ссылка.Транспорт.Наименование ПОДОБНО ""WW%""
		|			ТОГДА 1
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК Приоритет
		|ИЗ
		|	Документ.Рейс.Поездки КАК РейсПоездки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗагрузкаРейсовВероут.Рейсы КАК ЗагрузкаРейсовВероутРейсы
		|		ПО РейсПоездки.Ссылка.Ссылка = ЗагрузкаРейсовВероутРейсы.Рейс.Ссылка
		|ГДЕ
		|	ЗагрузкаРейсовВероутРейсы.Ссылка.Ссылка = &Док
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет,
		|	РейсПоездки.ПланируемоеВремяОкончанияПоездки УБЫВ";
		
		//+++ БАО 27.06.2017 №1180
		
	ИначеЕсли Загрузка.РежимНазначенияНомеровПалет = Перечисления.РежимыНазначенияНомеровПалет.ПоМаркеТранспортаИПоВремениОкончанияРейсаПлюсПрефикс Тогда
		
	КонецеСли;	
	
	ТекущийПрефикс = 0;
	
	Если Загрузка.РежимНазначенияНомеровПалет = Перечисления.РежимыНазначенияНомеровПалет.ПоМаркеТранспортаИПоВремениОкончанияРейсаПлюсПрефикс Тогда
		
		Рез = baoВызовСервера.СформироватьНомераПалетПоМаркеТранспортаИПоВремениОкончанияРейсаПлюсПрефикс(Загрузка.Ссылка)
		
	Иначе
		
		Зап.УстановитьПараметр("Док", Загрузка.Ссылка);			
		
		Рез = Зап.Выполнить().Выгрузить(); 
		
		НП = 1; 
		
		Для Каждого Тек Из Рез Цикл
			
			Рейс = Тек.Рейс.ПолучитьОбъект();
			Рейс.НомерПалетты = НП;
			
			
			Попытка
				
				Рейс.Записать(РежимЗаписиДокумента.Запись);
				
			Исключение
				
			КонецПопытки;
			
			НП = НП + 1;
			
		КонецЦикла;	
		
	КонецЕсли;

	
	Док.ФормироватьНомераПалетт = Истина;
	Док.Записать(РежимЗаписиДокумента.Запись);
	
	Возврат Рез;
	
КонецФункции	

//--- БАО 27.06.2017 №1180

Функция ПолучитьУдаленноеЗакрытиеДляТранспортаПоРейсу(Рейс) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПривязкаМашинКРейсамСрезПоследних.Рейс КАК Рейс,
		|	ПривязкаМашинКРейсамСрезПоследних.Транспорт КАК Транспорт
		|ПОМЕСТИТЬ ВТ_ПривязкаМашинКРейсам
		|ИЗ
		|	РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних(, Рейс = &Рейс) КАК ПривязкаМашинКРейсамСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДополнительныеПараметрыТранспортаСрезПоследних.УдаленноеЗакрытиеРейсов КАК УдаленноеЗакрытиеРейсов
		|ИЗ
		|	РегистрСведений.ДополнительныеПараметрыТранспорта.СрезПоследних(
		|			,
		|			Транспорт В
		|				(ВЫБРАТЬ
		|					ВТ_ПривязкаМашинКРейсам.Транспорт КАК Транспорт
		|				ИЗ
		|					ВТ_ПривязкаМашинКРейсам КАК ВТ_ПривязкаМашинКРейсам)) КАК ДополнительныеПараметрыТранспортаСрезПоследних";
	
	Запрос.УстановитьПараметр("Рейс", Рейс);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда

		Возврат ВыборкаДетальныеЗаписи.УдаленноеЗакрытиеРейсов;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции
