Процедура РегламентЗагрузкаСхемПолигональнойМаршрутизации(КодРегиона = 1) Экспорт
	//Константы.ПрооисходитЗагрузкаСхемПланирования.Установить(Истина);
	ВидМетода = Перечисления.ВидыЗапросовWEBСервис.GetMapVersionsResult;
	
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   ПараметрыРегламентныхЗаданий.Значение КАК ДатаПоследнейЗагрузки
    |ИЗ
    |   РегистрСведений.ПараметрыРегламентныхЗаданий КАК ПараметрыРегламентныхЗаданий
    |ГДЕ
    |   ПараметрыРегламентныхЗаданий.Ключ = &ИмяКлюча";
	ИмяКлюча = "ДатаЗагрузкиСхемПолигональнойМаршрутизации_" + Формат(КодРегиона, "ЧГ=");
	Запрос.УстановитьПараметр("ИмяКлюча", ИмяКлюча);
	
    РезультатЗапроса = Запрос.Выполнить();
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
    Если ВыборкаДетальныеЗаписи.Следующий() Тогда
        ДатаЗагрузки = Дата(ВыборкаДетальныеЗаписи.ДатаПоследнейЗагрузки);
    Иначе
        ДатаЗагрузки = Дата("17530101120000");
	КонецЕсли;
    ДатаЗапроса = ТекущаяДата();
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ДатаВыборки", ДатаЗагрузки);
	ПараметрыЗапроса.Вставить("КодРегиона", Формат(КодРегиона, "ЧГ="));
	
	ПолученныеДанные = ИнтеграцияСАдминкойWEBСервис.ВыполнитьЗапросКАдминке(ВидМетода, ПараметрыЗапроса);
	Если Не ПолученныеДанные.Успешно Тогда
		//Константы.ПрооисходитЗагрузкаСхемПланирования.Установить(Ложь);
		Возврат;
	КонецеСли;	
	
	РезультатОбработки = ИнтеграцияСАдминкойWEBСервис.ОбработатьПолученныеДанные(ПолученныеДанные.Данные, ВидМетода);
	
	РезультатОбработкиПолученияАктивнойСхемыПланирования = ПолучитьАктуальнуюСхемуПолигональнойМаршрутизации(КодРегиона);
	
    Если ПолученныеДанные.Успешно И РезультатОбработки И РезультатОбработкиПолученияАктивнойСхемыПланирования Тогда 
        //Записываем в регистр сведений последнюю дату выгрузки данных
        НаборЗаписей = РегистрыСведений.ПараметрыРегламентныхЗаданий.СоздатьНаборЗаписей();
        НаборЗаписей.Отбор.Ключ.Установить(ИмяКлюча);
        Запись = НаборЗаписей.Добавить();
        Запись.Значение = smv.ДатаВСтроку(ДатаЗапроса);
        Запись.Ключ = ИмяКлюча;
        НаборЗаписей.Записать();
	КонецЕсли;
	//Константы.ПрооисходитЗагрузкаСхемПланирования.Установить(Ложь);
КонецПроцедуры	
	

Функция ЗагрузитьСхемыПолигональнойМаршрутизации(Данные, ВидМетода) Экспорт
	Таб = Новый ТаблицаЗначений();
	Таб.колонки.Добавить("CreateDate", Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	Таб.колонки.Добавить("versionID", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10,0)));
	Таб.колонки.Добавить("regionID", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10,0)));
	Если ВидМетода = Перечисления.ВидыЗапросовWEBСервис.GetMapVersionsResult Тогда
		Схемы = Данные.GetMapVersionsResult.Maps;
		Для Сч = 0 По Схемы.Количество() - 1 Цикл
			Нов = Таб.Добавить();
			ЗаполнитьЗначенияСвойств(Нов, Схемы[Сч]);
		КонецЦикла;	
	ИначеЕсли ВидМетода = Перечисления.ВидыЗапросовWEBСервис.CreateMapResult Тогда
		Схема = Данные.CreateMapResult.Map;
		Нов = Таб.Добавить();
		ЗаполнитьЗначенияСвойств(Нов, Схема);
		Нов.CreateDate = ТекущаяДата();
	КонецеСли;
	
	
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	Таб.createDate КАК createDate,
	            |	Таб.versionID КАК versionID,
	            |	Таб.regionID КАК regionID
	            |ПОМЕСТИТЬ ТабСхем
	            |ИЗ
	            |	&Таб КАК Таб
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	ТабСхем.createDate КАК createDate,
	            |	ТабСхем.versionID КАК versionID,
	            |	СхемыПолигональнойМаршрутизации.Ссылка КАК Схема,
	            |	ТабСхем.regionID КАК regionID
	            |ИЗ
	            |	ТабСхем КАК ТабСхем
	            |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СхемыПолигональнойМаршрутизации КАК СхемыПолигональнойМаршрутизации
	            |		ПО ТабСхем.versionID = СхемыПолигональнойМаршрутизации.id_Админка";
	Зап.УстановитьПараметр("Таб", Таб);
	
	Выб = Зап.Выполнить().Выбрать();
	МассивИдентификаторовСхем = Новый Массив;
	
	Пока Выб.Следующий() Цикл
		Если Не ЗначениеЗаполнено(Выб.Схема) Тогда
			ОбъектСхемы = Справочники.СхемыПолигональнойМаршрутизации.СоздатьЭлемент();
		Иначе
			ОбъектСхемы = Выб.Схема.ПолучитьОбъект();
		КонецеСли;
		
		ОбъектСхемы.ДатаСоздания = Выб.createDate;
		ОбъектСхемы.id_Админка = Выб.versionID;
		ОбъектСхемы.Терминал = Справочники.РегиональныеТерминалы.НайтиПоКоду(Выб.regionID);
		
		//CeHbKA #4131 04.09.2020
		Если Выб.regionID = 1 Тогда
			ОбъектСхемы.Карта = Справочники.КартыКонструктораКарт.ПММСК;
		ИначеЕсли Выб.regionID = 2 Тогда
			ОбъектСхемы.Карта = Справочники.КартыКонструктораКарт.ПМСПб;
		КонецЕсли;
		//CeHbKA #4131 04.09.2020
		
		ОбъектСхемы.Записать();
		МассивИдентификаторовСхем.Добавить(Выб.versionID);
	КонецЦикла;	
	
	//получение полигонов схем
	РезультатОбработки = ПолучитьПолигоныСхем(МассивИдентификаторовСхем);
	Если Не РезультатОбработки Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецеСли;	
КонецФункции	

//CeHbKA #4167 02.09.2020
//Функция ПолучитьПолигоныСхем(МассивИдентификаторовСхем) Экспорт
Функция ПолучитьПолигоныСхем(МассивИдентификаторовСхем, ConstructorId = Неопределено) Экспорт
//CeHbKA #4167 02.09.2020

	ВидМетода = Перечисления.ВидыЗапросовWEBСервис.GetMapResult;
	
	Для Каждого ИдентификаторСхемы из МассивИдентификаторовСхем Цикл
		ПараметрыЗапроса = Новый Структура;
		ПараметрыЗапроса.Вставить("ИдентификаторСхемы", ИдентификаторСхемы);
		ПолученныеДанные = ИнтеграцияСАдминкойWEBСервис.ВыполнитьЗапросКАдминке(ВидМетода, ПараметрыЗапроса);
		
		Если ПолученныеДанные.Успешно Тогда 
			//РезультатОбработки = ИнтеграцияСАдминкойWEBСервис.ОбработатьПолученныеДанные(ПолученныеДанные.Данные, ВидМетода);
			//CeHbKA #4167 02.09.2020
			РезультатОбработки = ИнтеграцияСАдминкойWEBСервис.ОбработатьПолученныеДанные(ПолученныеДанные.Данные, ВидМетода, ConstructorId);
			//CeHbKA #4167 02.09.2020

			Если Не РезультатОбработки Тогда
				Возврат Ложь;
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
КонецФункции

Функция ЗагрузитьПолигоныСхемы(Данные, ВидМетода) Экспорт
	//пакетная обработка здесь не подойдет, вложенная таблица
	Схема = Справочники.СхемыПолигональнойМаршрутизации.НайтиПоРеквизиту("id_Админка", Данные.GetMapResult.Map.versionId);
	//Если ВидМетода = Перечисления.ВидыЗапросовWEBСервис.GetMapVersionsResult Тогда
		Полигоны = Данные.GetMapResult.Map.Polygons;
	//ИначеЕсли ВидМетода = Перечисления.ВидыЗапросовWEBСервис.CreateMapResult Тогда
	//	Полигоны = Данные.CreateMapResult.Map.Polygons;
	//КонецеСли;
	
	Для Сч = 0 По Полигоны.Количество() - 1 Цикл
		Полигон = Полигоны[Сч];
		ПолигонСсылка = Справочники.ПолигоныМаршрутизации.НайтиПоРеквизиту("id_Админка", Полигон.id, , Схема);
		Если ПолигонСсылка.Пустая() Тогда
			ПолигонОбъект = Справочники.ПолигоныМаршрутизации.СоздатьЭлемент();
			ПолигонОбъект.Владелец = Схема;
		Иначе	
			ПолигонОбъект = ПолигонСсылка.ПолучитьОбъект();
			ПолигонОбъект.ТочкиПолигона.Очистить();
		КонецеСли;	
		
		ПолигонОбъект.id_Админка = Полигон.id;
		ПолигонОбъект.Наименование = СокрЛП(СтрЗаменить(Полигон.Name, Символы.ПС, ""));
		
		ТочкиПолигона = Полигон.PolygonPoints;
		Для СчТочки = 0 По ТочкиПолигона.Количество() - 1 Цикл
			Нов = ПолигонОбъект.ТочкиПолигона.Добавить();
			Нов.id = ТочкиПолигона[СчТочки].id;
			Нов.Широта = ТочкиПолигона[СчТочки].Latitude;
			Нов.Долгота = ТочкиПолигона[СчТочки].Longitude;
		КонецЦикла;	
		ПолигонОбъект.Записать();
	КонецЦикла;	
	
	Возврат Истина;
КонецФункции	

Функция ПолучитьАктуальнуюСхемуПолигональнойМаршрутизации(КодРегиона)
	ВидМетода = Перечисления.ВидыЗапросовWEBСервис.GetActiveMapVersionResult;
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("КодРегиона", Формат(КодРегиона, "ЧГ="));
	ПолученныеДанные = ИнтеграцияСАдминкойWEBСервис.ВыполнитьЗапросКАдминке(ВидМетода, ПараметрыЗапроса);
		
	Если ПолученныеДанные.Успешно Тогда 
		РезультатОбработки = ИнтеграцияСАдминкойWEBСервис.ОбработатьПолученныеДанные(ПолученныеДанные.Данные, ВидМетода);
		Если Не РезультатОбработки Тогда
			Возврат Ложь;
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

Функция УстановитьАктуальнуюСхемуПолигональнойМаршрутизации(Данные) Экспорт
	
	ИдентификаторСхемы = Данные.GetActiveMapVersionResult.Map.VersionId;
	Возврат УстановитьАктуальнуюСхемуПолигональнойМаршрутизацииВ1С(Данные.GetActiveMapVersionResult.Map.RegionId, Данные.GetActiveMapVersionResult.Map.VersionId);
КонецФункции	

Функция УстановитьПолигоныДляЗаказов(Данные) Экспорт
	
	//CeHbKA #4131 14.08.2020
	//В рамках задачи убираем данную строку и передаём GetPolygonsForOrdersResult.Data напрямую в параметр Данные
	//Данные = Данные.GetPolygonsForOrdersResult.Data;
	//CeHbKA #4131 14.08.2020	
	
	ТабПолигонов = Новый ТаблицаЗначений();
	ТабПолигонов.Колонки.Добавить("НомерЗаказа", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(10)));
	ТабПолигонов.Колонки.Добавить("НомерПолигона", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10,0)));
	ТабПолигонов.Колонки.Добавить("Широта", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(20,13)));
	ТабПолигонов.Колонки.Добавить("Долгота", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(20,13)));
	ТабПолигонов.Колонки.Добавить("НомерСхемы", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10,0)));
	Для Сч = 0 По Данные.Количество() - 1 Цикл
		Если Данные[Сч].Polygons = Неопределено Тогда 
			Продолжить;
		КонецеСли;	
		Если Данные[Сч].Polygons.Количество() <> 0 Тогда
			Нов = ТабПолигонов.Добавить();
			Нов.НомерЗаказа = Формат(Данные[Сч].OrderLocation.OrderId, "ЧГ=");
			Нов.НомерПолигона = Данные[Сч].Polygons[0].Id;
			Нов.НомерСхемы = Данные[Сч].VersionId;
			Нов.Широта = Данные[Сч].OrderLocation.Point.Latitude;
			Нов.Долгота = Данные[Сч].OrderLocation.Point.Longitude;
		КонецеСли;	
	КонецЦикла;	
	
	Если ТабПолигонов.Количество() = 0 Тогда
		Возврат Истина;
	КонецеСли;	
	
	Зап = Новый Запрос;
	//Зап.Текст = "ВЫБРАТЬ
	//            |	Таб.НомерЗаказа КАК НомерЗаказа,
	//            |	Таб.НомерПолигона КАК НомерПолигона,
	//            |	Таб.Широта КАК Широта,
	//            |	Таб.Долгота КАК Долгота
	//            |ПОМЕСТИТЬ ВТ_Таб
	//            |ИЗ
	//            |	&Таб КАК Таб
	//            |;
	//            |
	//            |////////////////////////////////////////////////////////////////////////////////
	//            |ВЫБРАТЬ
	//            |	АктивнаяСхемаПолигональнойМаршрутизацииСрезПоследних.СхемаПолигональнойМаршрутизации.Ссылка КАК Схема,
	//            |	ПолигоныМаршрутизации.Ссылка КАК Полигон,
	//            |	РеализацияТоваровУслуг.Ссылка КАК Заказ,
	//            |	ВТ_Таб.Широта КАК Широта,
	//            |	ВТ_Таб.Долгота КАК Долгота,
	//            |	РеализацияТоваровУслуг.Дата КАК ДатаДоставки
	//            |ИЗ
	//            |	ВТ_Таб КАК ВТ_Таб
	//            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПолигоныМаршрутизации КАК ПолигоныМаршрутизации
	//            |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АктивнаяСхемаПолигональнойМаршрутизации.СрезПоследних КАК АктивнаяСхемаПолигональнойМаршрутизацииСрезПоследних
	//            |			ПО ПолигоныМаршрутизации.Владелец.Ссылка = АктивнаяСхемаПолигональнойМаршрутизацииСрезПоследних.СхемаПолигональнойМаршрутизации.Ссылка
	//            |		ПО ВТ_Таб.НомерПолигона = ПолигоныМаршрутизации.id_Админка
	//            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	//            |		ПО ВТ_Таб.НомерЗаказа = РеализацияТоваровУслуг.Номер
	//            |
	//            |ОБЪЕДИНИТЬ ВСЕ
	//            |
	//            |ВЫБРАТЬ
	//            |	АктивнаяСхемаПолигональнойМаршрутизацииСрезПоследних.СхемаПолигональнойМаршрутизации.Ссылка,
	//            |	ПолигоныМаршрутизации.Ссылка,
	//            |	ЗаборТовара.Ссылка,
	//            |	ВТ_Таб.Широта,
	//            |	ВТ_Таб.Долгота,
	//            |	ЗаборТовара.Дата
	//            |ИЗ
	//            |	ВТ_Таб КАК ВТ_Таб
	//            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПолигоныМаршрутизации КАК ПолигоныМаршрутизации
	//            |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АктивнаяСхемаПолигональнойМаршрутизации.СрезПоследних КАК АктивнаяСхемаПолигональнойМаршрутизацииСрезПоследних
	//            |			ПО ПолигоныМаршрутизации.Владелец.Ссылка = АктивнаяСхемаПолигональнойМаршрутизацииСрезПоследних.СхемаПолигональнойМаршрутизации.Ссылка
	//            |		ПО ВТ_Таб.НомерПолигона = ПолигоныМаршрутизации.id_Админка
	//            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаборТовара КАК ЗаборТовара
	//            |		ПО ВТ_Таб.НомерЗаказа = ЗаборТовара.Номер";
	
	Зап.Текст = "ВЫБРАТЬ
	            |	Таб.НомерЗаказа КАК НомерЗаказа,
	            |	Таб.НомерПолигона КАК НомерПолигона,
	            |	Таб.Широта КАК Широта,
	            |	Таб.Долгота КАК Долгота,
	            |	Таб.НомерСхемы КАК НомерСхемы
	            |ПОМЕСТИТЬ ВТ_Таб
	            |ИЗ
	            |	&Таб КАК Таб
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	ПолигоныМаршрутизации.Ссылка КАК Полигон,
	            |	РеализацияТоваровУслуг.Ссылка КАК Заказ,
	            |	ВТ_Таб.Широта КАК Широта,
	            |	ВТ_Таб.Долгота КАК Долгота,
	            |	РеализацияТоваровУслуг.Дата КАК ДатаДоставки,
	            |	СхемыПолигональнойМаршрутизацииСправочник.Ссылка КАК Схема1С
	            |ИЗ
	            |	ВТ_Таб КАК ВТ_Таб
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПолигоныМаршрутизации КАК ПолигоныМаршрутизации
	            |		ПО ВТ_Таб.НомерПолигона = ПолигоныМаршрутизации.id_Админка
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	            |		ПО ВТ_Таб.НомерЗаказа = РеализацияТоваровУслуг.Номер
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СхемыПолигональнойМаршрутизации КАК СхемыПолигональнойМаршрутизацииСправочник
	            |		ПО ВТ_Таб.НомерСхемы = СхемыПолигональнойМаршрутизацииСправочник.id_Админка
	            |
	            |ОБЪЕДИНИТЬ ВСЕ
	            |
	            |ВЫБРАТЬ
	            |	ПолигоныМаршрутизации.Ссылка,
	            |	ЗаборТовара.Ссылка,
	            |	ВТ_Таб.Широта,
	            |	ВТ_Таб.Долгота,
	            |	ЗаборТовара.Дата,
	            |	СхемыПолигональнойМаршрутизации.Ссылка
	            |ИЗ
	            |	ВТ_Таб КАК ВТ_Таб
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПолигоныМаршрутизации КАК ПолигоныМаршрутизации
	            |		ПО ВТ_Таб.НомерПолигона = ПолигоныМаршрутизации.id_Админка
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаборТовара КАК ЗаборТовара
	            |		ПО ВТ_Таб.НомерЗаказа = ЗаборТовара.Номер
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СхемыПолигональнойМаршрутизации КАК СхемыПолигональнойМаршрутизации
	            |		ПО ВТ_Таб.НомерСхемы = СхемыПолигональнойМаршрутизации.id_Админка";
	
	
	Зап.УстановитьПараметр("Таб", ТабПолигонов);
	Выб = Зап.Выполнить().Выбрать();
	Пока Выб.Следующий() Цикл
		Наб = РегистрыСведений.ПолигоныМаршрутизацииЗаказов.СоздатьНаборЗаписей();
		ТекВр = ТекущаяДата();
		Наб.Отбор.Период.Установить(ТекВр);
		Наб.Отбор.СхемаМаршрутизации.Установить(Выб.Схема1С);
		Наб.Отбор.Заказ.Установить(Выб.Заказ);
		//Наб.Отбор.ДатаДоставки.Установить(Выб.ДатаДоставки);
		
		Нов = Наб.Добавить();
		Нов.Период = ТекВр;
		Нов.Заказ = Выб.Заказ;
		Нов.СхемаМаршрутизации = Выб.Схема1С;
		Нов.ПолигонМаршрутизации = Выб.Полигон;
		Нов.Широта = Выб.Широта;
		Нов.Долгота = Выб.Долгота;
		Нов.ДатаДоставки = Выб.ДатаДоставки;
		
		Наб.Записать();
	КонецЦикла;	
	
	
	
	Возврат Истина;
КонецФункции	

Функция ПолучитьПолигоныЗаказов(ДанныеЗаказов, ДатаАктуальностиСхем = Неопределено, Комментарий = Неопределено, disableUpdateCoords = Неопределено) Экспорт
	ВидМетода = Перечисления.ВидыЗапросовWEBСервис.GetPolygonsForOrdersResult;
	
	//Схема = АктивнаяСхемаПолигональнойМаршрутизации(Справочники.РегиональныеТерминалы.МоскваСтриж);
	//Если Не ЗначениеЗаполнено(Схема) Тогда                                                                  
	//	Возврат Ложь;
	//КонецеСли;	

	ПараметрыЗапроса = Новый Структура;
	//ПараметрыЗапроса.Вставить("versionId", Схема.id_Админка);
	Если ДатаАктуальностиСхем <> Неопределено Тогда
		ПараметрыЗапроса.Вставить("actualDate", ДатаАктуальностиСхем);
	КонецеСли;	
	
	МассивДанных = Новый Массив;
	
	Для Каждого Тек Из ДанныеЗаказов Цикл
		Струк = Новый Структура;
		Струк.Вставить("OrderId", Тек.НомерЗаказа);
		
		СтрукТочки = Новый Структура;
		СтрукТочки.Вставить("Id", 1);
		СтрукТочки.Вставить("Latitude", Тек.Широта);
		СтрукТочки.Вставить("Longitude", Тек.Долгота);
		
		Струк.Вставить("Point", СтрукТочки);
		
		МассивДанных.Добавить(Струк);
	КонецЦикла;	
	ПараметрыЗапроса.Вставить("ordersLocations", МассивДанных);
	
	//+Широков 24.12.2020 по письму
	ПараметрыЗапроса.Вставить("ordersКомментарий", Комментарий);
	//-Широков 24.12.2020 по письму
	
	//+Широков Задача 4193
	
	Если НЕ disableUpdateCoords = Неопределено Тогда //Широков Задача 4193 22.03.2021
		ПараметрыЗапроса.Вставить("disableUpdateCoords", disableUpdateCoords);
	КонецЕсли; //Широков Задача 4193 22.03.2021
	//-Широков Задача 4193
	
	ПолученныеДанные = ИнтеграцияСАдминкойWEBСервис.ВыполнитьЗапросКАдминке(ВидМетода, ПараметрыЗапроса);
	
	Если ПолученныеДанные.Успешно Тогда 
		
		РезультатОбработки = ИнтеграцияСАдминкойWEBСервис.ОбработатьПолученныеДанные(ПолученныеДанные.Данные, ВидМетода);
		
		//+Широков 24.12.2020 по письму
		//Закоментировано возможное решение ошибки
		//РезультатОбработки может быть не только булево , но и неопределено или соответствие
		Если ТипЗнч(РезультатОбработки) = Тип("Булево") Тогда
			//-Широков 24.12.2020 по письму
			Если Не РезультатОбработки Тогда
				Возврат Ложь;
			КонецЕсли;	
			//+Широков 24.12.2020 по письму
		Иначе
			Возврат Ложь;
		КонецЕсли;
		//-Широков 24.12.2020 по письму
	КонецЕсли;	
	
	Возврат Истина;
КонецФункции

//Функция ПолучитьПолигоныЗаказовПоТерминалам(ДанныеЗаказов) Экспорт
//	
//КонецФункции	

Функция АктивнаяСхемаПолигональнойМаршрутизации(Регион, ДатаДанных = Неопределено) Экспорт
	Если ДатаДанных = Неопределено Тогда
		ДатаДанных = ТекущаяДата();
	КонецеСли;	
	Струк = Новый Структура;
	Струк.Вставить("РегиональныйТерминал", Регион);
	Возврат РегистрыСведений.АктивнаяСхемаПолигональнойМаршрутизации.ПолучитьПоследнее(ДатаДанных, Струк).СхемаПолигональнойМаршрутизации;
КонецФункции	

Функция СоздатьНовуюСхемуМаршрутизации(КодРегиона) Экспорт

	ВидМетода = Перечисления.ВидыЗапросовWEBСервис.CreateMapResult;
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("КодРегиона", Формат(КодРегиона, "ЧГ="));
	//работает без передачи constructorId, т.к., эта функция вызывается только в контексте ПМ, внутри админки вшито, что если не передано - то дефолтная схема карт ПМ 
	//Если КодРегиона = 1 Тогда
	//	ПараметрыЗапроса.Вставить("constructorId", Справочники.КартыКонструктораКарт.ПММСК.ИдентификаторКарты);
	//ИначеЕсли КодРегиона = 2 Тогда
	//	ПараметрыЗапроса.Вставить("constructorId", Справочники.КартыКонструктораКарт.ПМСПб.ИдентификаторКарты);
	//КонецеСли;	
	
	ПолученныеДанные = ИнтеграцияСАдминкойWEBСервис.ВыполнитьЗапросКАдминке(ВидМетода, ПараметрыЗапроса);
	Если Не ПолученныеДанные.Успешно Тогда
		Возврат Ложь;
	Иначе
	КонецеСли;		
	
	РезультатОбработки = ИнтеграцияСАдминкойWEBСервис.ОбработатьПолученныеДанные(ПолученныеДанные.Данные, ВидМетода);	

	Возврат РезультатОбработки;
	
КонецФункции	

Функция УстановитьАктуальнуюСхемуПолигональнойМаршрутизацииВСистеме(ИдентификаторСхемы, КодРегиона) Экспорт
	ВидМетода = Перечисления.ВидыЗапросовWEBСервис.SetActiveMapVersionResult;
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ИдентификаторСхемы", ИдентификаторСхемы);
	ПараметрыЗапроса.Вставить("КодРегиона", Формат(КодРегиона, "ЧГ="));
	
	ПолученныеДанные = ИнтеграцияСАдминкойWEBСервис.ВыполнитьЗапросКАдминке(ВидМетода, ПараметрыЗапроса);
	Если Не ПолученныеДанные.Успешно Тогда
		Возврат Ложь;
	Иначе
		
	КонецеСли;		
	
	РезультатОбработки = ИнтеграцияСАдминкойWEBСервис.ОбработатьПолученныеДанные(ПолученныеДанные, ВидМетода);	
	Возврат РезультатОбработки;
КонецФункции	


Функция УстановитьАктуальнуюСхемуПолигональнойМаршрутизацииВ1С(КодРегиона, ИдентификаторСхемы) Экспорт
	
	//CeHbKA #4101 28.10.2020
	//ид схем ПМ и схем ЗП не пересекаются 
	//если схема ПМ не найдена, значит это схема ЗП и писать ничего не нужно
	Схема = Справочники.СхемыПолигональнойМаршрутизации.НайтиПоРеквизиту("id_Админка", ИдентификаторСхемы);
	
	Если Схема.Пустая() Тогда
		Возврат Истина
	КонецЕсли;
	//CeHbKA #4101 28.10.2020
	
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	АктивнаяСхемаПолигональнойМаршрутизацииСрезПоследних.СхемаПолигональнойМаршрутизации.id_Админка КАК ИдентификаторВБД
	            |ИЗ
	            |	РегистрСведений.АктивнаяСхемаПолигональнойМаршрутизации.СрезПоследних(, СхемаПолигональнойМаршрутизации.Терминал.Код = &КодТерминала) КАК АктивнаяСхемаПолигональнойМаршрутизацииСрезПоследних";
	Зап.УстановитьПараметр("КодТерминала", КодРегиона);
	Выб = Зап.Выполнить().Выбрать();
	
	НадоУстанавливатьСхему = Ложь;
	
	Если Не Выб.Следующий() Тогда
		НадоУстанавливатьСхему = Истина;
	ИначеЕсли Выб.ИдентификаторВБД <> ИдентификаторСхемы Тогда
		НадоУстанавливатьСхему = Истина;
	КонецеСли;	
	
	Регион = Справочники.РегиональныеТерминалы.НайтиПоКоду(КодРегиона);
	Если НадоУстанавливатьСхему Тогда
		//CeHbKA #4101 28.10.2020
		//Схема = Справочники.СхемыПолигональнойМаршрутизации.НайтиПоРеквизиту("id_Админка", ИдентификаторСхемы);
		//CeHbKA #4101 28.10.2020
				
		Наб = РегистрыСведений.АктивнаяСхемаПолигональнойМаршрутизации.СоздатьНаборЗаписей();
		ТекВр = ТекущаяДата();
		Наб.Отбор.Период.Установить(ТекВр);
		Наб.Отбор.РегиональныйТерминал.Установить(Регион);
		
		Нов = Наб.Добавить();
		Нов.СхемаПолигональнойМаршрутизации = Схема;
		нов.Период = ТекВр;
		Нов.РегиональныйТерминал = Регион;
		
		Наб.Записать();
	КонецеСли;
	
	Возврат Истина;
КонецФункции	

Функция ПолигонПоУмолчаниюСвободен(Полигон, СхемаПолигонов, Смена, ДатаЗапроса = Неопределено) Экспорт
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	ПланируемыеПолигоныЭкипажейСрезПоследних.Водитель КАК Водитель
	            |ИЗ
	            |	РегистрСведений.ПланируемыеПолигоныЭкипажей.СрезПоследних(&ДатаЗапроса, СхемаПолигональнойМаршрутизации.Ссылка = &СхемаПолигональнойМаршрутизации $СтрокаСмены$) КАК ПланируемыеПолигоныЭкипажейСрезПоследних
	            |ГДЕ
	            |	ПланируемыеПолигоныЭкипажейСрезПоследних.Полигон = &Полигон
	            |	И ПланируемыеПолигоныЭкипажейСрезПоследних.ПолигонУчитывается = ИСТИНА
				|	
	            |
	            |СГРУППИРОВАТЬ ПО
	            |	ПланируемыеПолигоныЭкипажейСрезПоследних.Водитель";
	Если ДатаЗапроса = Неопределено Тогда
		ДатаЗапроса = КонецДня(ТекущаяДата());
	КонецеСли;
	
	Если Не ЗначениеЗаполнено(Смена) Тогда
		Зап.Текст  = СтрЗаменить(Зап.Текст, "$СтрокаСмены$", "");
	Иначе
		Зап.Текст  = СтрЗаменить(Зап.Текст, "$СтрокаСмены$", " И СменаМаршрутизации = &Смена");
		Зап.УстановитьПараметр("Смена", Смена);
	КонецеСли;
	
	Зап.УстановитьПараметр("Полигон", Полигон);
	Зап.УстановитьПараметр("ДатаЗапроса", ДатаЗапроса);
	Зап.УстановитьПараметр("СхемаПолигональнойМаршрутизации", СхемаПолигонов);
	
	Выб = Зап.Выполнить().Выбрать();
	
	Струк = Новый Структура;
	
	Если Выб.Следующий() Тогда
		Струк.Вставить("Результат", Ложь);
		Струк.Вставить("Водитель", Выб.Водитель);
	Иначе	
		Струк.Вставить("Результат", Истина);
	КонецеСли;	
	
	Возврат Струк;
КонецФункции	

Функция ПользователюВключенаРаботаСПолигональнымМаршрутизатором() Экспорт
	Возврат УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "РабочееМестоПолигональнойМаршрутизации");
КонецФункции


Функция ИдентификаторСхемыПолигонов(СхемаПолигонов) Экспорт
	Возврат СхемаПолигонов.id_Админка
КонецФункции	


Функция КоординатыЦентраКарты(Регион) Экспорт
	Возврат Формат(Регион.ШиротаЦентраЗоны, "ЧРД=.; ЧГ=") + ", " + Формат(Регион.ДолготаЦентраЗоны, "ЧРД=.; ЧГ=");
КонецФункции	


#Область РаботаСКолонкамиКатегорий
Функция ВыполнитьЗапросПоКолонкамБрейков(СхемаЛогистическихБрейков) Экспорт
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	ЛогистическиеБрейки.Код КАК Код,
	            |	ВЫБОР
	            |		КОГДА ЛогистическиеБрейки.АббревиатураКолонкиВПолигональномМаршрутизаторе = """"
	            |			ТОГДА ЛогистическиеБрейки.Наименование
	            |		ИНАЧЕ ЛогистическиеБрейки.АббревиатураКолонкиВПолигональномМаршрутизаторе
	            |	КОНЕЦ КАК НазваниеКолонки,
	            |	ЛогистическиеБрейки.ТипЗаказа КАК ТипЗаказа
	            |ИЗ
	            |	Справочник.ЛогистическиеБрейки КАК ЛогистическиеБрейки
	            |ГДЕ
	            |	ЛогистическиеБрейки.Владелец = &СхемаЛогистическихБрейков
	            |	И ЛогистическиеБрейки.ПометкаУдаления = ЛОЖЬ
	            |
	            |УПОРЯДОЧИТЬ ПО
	            |	ЛогистическиеБрейки.ПорядокКолонки";
	Зап.УстановитьПараметр("СхемаЛогистическихБрейков", СхемаЛогистическихБрейков);
	
	Выб = Зап.Выполнить().Выбрать();
	Возврат Выб;
КонецФункции

Функция СформироватьКолонкиЗапросаДереваПолигонов(СхемаЛогистическихБрейков, Итоги = Ложь, СНазваниямиПолей = Истина) Экспорт
	Выб = ВыполнитьЗапросПоКолонкамБрейков(СхемаЛогистическихБрейков);
	Стр = "";
	Пока Выб.Следующий() Цикл
		НазваниеКолонки = СтрЗаменить(Выб.НазваниеКолонки, " ", "");
		Если Не Итоги Тогда
			Если Выб.ТипЗаказа <> Перечисления.ТипыЗаказов.Забор Тогда
				Стр = Стр + "	ВЫБОР
				|		КОГДА (ВТ_Заказы.КатегорияЗаказаКод = """ + Выб.Код + """)
				|				И ЕСТЬNULL(СтатусыПредварительногоЗакрытияРейсовСрезПоследних.СтатусПредварительногоЗакрытияРейса, ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытОкончательно)) <> ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытПредварительно)
				|			ТОГДА 1
				|		ИНАЧЕ 0
				|	КОНЕЦ";
				
				Если СНазваниямиПолей Тогда
					Стр = Стр + " КАК " + НазваниеКолонки + ",";
				Иначе
					Стр = Стр + ", ";
				КонецеСли;
				
				Стр = Стр + "	ВЫБОР
				|		КОГДА (ВТ_Заказы.КатегорияЗаказаКод = """ + Выб.Код + """)
				|				И ЕСТЬNULL(СтатусыПредварительногоЗакрытияРейсовСрезПоследних.СтатусПредварительногоЗакрытияРейса, ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытОкончательно)) = ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытПредварительно)
				|			ТОГДА 1
				|		ИНАЧЕ 0
				|	КОНЕЦ";
				
				Если СНазваниямиПолей Тогда
					Стр = Стр + " КАК " + НазваниеКолонки + "_,";
				Иначе
					Стр = Стр + ", ";
				КонецеСли;
			Иначе
				Стр = Стр + "	ВЫБОР
				|		КОГДА (ВТ_Заказы.КатегорияЗаказаКод = """ + Выб.Код + """)
				|			ТОГДА 1
				|		ИНАЧЕ 0
				|	КОНЕЦ";
				
				Если СНазваниямиПолей Тогда
					Стр = Стр + " КАК " + НазваниеКолонки + ",";
				Иначе
					Стр = Стр + ", ";
				КонецеСли;
			КонецеСли;			
		Иначе
			Если Выб.ТипЗаказа <> Перечисления.ТипыЗаказов.Забор Тогда
				Стр = Стр + "	СУММА(" + НазваниеКолонки + "), ";
				Стр = Стр + "	СУММА(" + НазваниеКолонки + "_),";
			Иначе
				Стр = Стр + "	СУММА(" + НазваниеКолонки + "), ";
			КонецеСли;	
		КонецеСли;
	КонецЦикла;
	
	//добавление полей с пустой категорией
	
	Если Не Итоги Тогда
		Стр = Стр + "	ВЫБОР
		|		КОГДА (ВТ_Заказы.КатегорияЗаказа = 1)
		|				И ЕСТЬNULL(СтатусыПредварительногоЗакрытияРейсовСрезПоследних.СтатусПредварительногоЗакрытияРейса, ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытОкончательно)) <> ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытПредварительно)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ";
		
		Если СНазваниямиПолей Тогда
			Стр = Стр + " КАК NK,";
		Иначе
			Стр = Стр + ", ";
		КонецеСли;
		
		Стр = Стр + "	ВЫБОР
		|		КОГДА (ВТ_Заказы.КатегорияЗаказа = 1)
		|				И ЕСТЬNULL(СтатусыПредварительногоЗакрытияРейсовСрезПоследних.СтатусПредварительногоЗакрытияРейса, ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытОкончательно)) = ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытПредварительно)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ";
		
		Если СНазваниямиПолей Тогда
			Стр = Стр + " КАК NK_,";
		Иначе
			Стр = Стр + ", ";
		КонецеСли;
	Иначе
		Стр = Стр + "	СУММА(NK), ";
		Стр = Стр + "	СУММА(NK_),";
	КонецеСли;
	//добавление полей с пустой категорией
	
	Возврат Стр;
КонецФункции
#КонецОбласти


#Область РаботаСФильтром
Функция СтрокаУсловийФильтра(ТабЭлементовФильтра, Дерево)
	СтрокаФильтра = "";
	Для Каждого Тек Из ТабЭлементовФильтра Цикл
		Если Тек.Активен Тогда
			Если Дерево = "ДеревоПолигоновСЗаказами" Тогда
				Если СокрЛП(Тек.СтрокаФильтровПолигонов) <> "" Тогда
					СтрокаФильтра = СтрокаФильтра + " ИЛИ " + Тек.СтрокаФильтровПолигонов;
				КонецЕсли;	
			ИначеЕсли Дерево = "ДеревоРейсовСЗаказами" Тогда
				Если СокрЛП(Тек.СтрокаФильтровРейсов) <> "" Тогда
					СтрокаФильтра = СтрокаФильтра + " ИЛИ " + Тек.СтрокаФильтровРейсов;
				КонецеСли;	
			КонецеСли;	
		КонецеСли;	
	КонецЦикла;	
	Если ЗначениеЗаполнено(СтрокаФильтра) Тогда
		Возврат " И (" + Прав(СтрокаФильтра, СтрДлина(СтрокаФильтра) - 5) + ")";
	Иначе	
		Возврат "";
	КонецеСли;	
КонецФункции
#КонецОбласти


//ПолигоныМаршрутизацииЗаказов.СрезПоследних убираем отсечку по дате, пренебрегаем некорректной изменением полигона заказа в "будущем", маршрутизация "задним числом" не нужна

#Область РаботаСДеревомПолигонов
Функция ТекстЗапросаПоДеревуПолигонов(МаршрутизацияЗакрыта, ТолькоРеализации)
	Если МаршрутизацияЗакрыта Тогда
		Возврат "ВЫБРАТЬ
		        |	РейсЗаказы.Заказ КАК Заказ,
		        |	РейсЗаказы.Ссылка КАК Рейс
		        |ПОМЕСТИТЬ ВТ_ЗаказыРейсов
		        |ИЗ
		        |	Документ.Рейс.Заказы КАК РейсЗаказы
		        |ГДЕ
		        |	РейсЗаказы.УдаленИзРейса = ЛОЖЬ
		        |	И РейсЗаказы.Ссылка.ДатаРейса = &ДатаНач
		        |	И РейсЗаказы.Ссылка.Проведен = ИСТИНА
		        |	И РейсЗаказы.Ссылка.ТерминалДоставки = &ТерминалДоставки @СтрокаФильтраСмена10@
		        |;
				//Асеев 29.08.2023 (Задача № 5117)>>>
		        |////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ВложенныйЗапрос.Ссылка КАК Ссылка
				|ПОМЕСТИТЬ ВТ_РТУ
				|ИЗ
				|	(ВЫБРАТЬ
				|		РеализацияТоваровУслуг.Ссылка КАК Ссылка
				|	ИЗ
				|		Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
				|	ГДЕ
				|		РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНач И &ДатаКон
				|		И РеализацияТоваровУслуг.СтатусИнтернетМагазина = 2
				|		И РеализацияТоваровУслуг.ТерминалДоставки = &ТерминалДоставки
				|		И НЕ РеализацияТоваровУслуг.ПометкаУдаления
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		СтатусыПредварительногоЗакрытияРейсовСрезПоследних.Заказ
				|	ИЗ
				|		РегистрСведений.СтатусыПредварительногоЗакрытияРейсов.СрезПоследних КАК СтатусыПредварительногоЗакрытияРейсовСрезПоследних
				|	ГДЕ
				|		СтатусыПредварительногоЗакрытияРейсовСрезПоследних.ДатаДоставкиЗаказа = &ДатаНач
				|		И СтатусыПредварительногоЗакрытияРейсовСрезПоследних.СтатусПредварительногоЗакрытияРейса = ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытПредварительно)
				|		И СтатусыПредварительногоЗакрытияРейсовСрезПоследних.Заказ.ТерминалДоставки = &ТерминалДоставки) КАК ВложенныйЗапрос
				|;
				//Асеев 29.08.2023 (Задача № 5117)<<<
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ВТ_РТУ.Ссылка КАК Заказ,
		        |	ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка) КАК ТипЗаказа,
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
		        |			ТОГДА 1
		        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
		        |			ТОГДА 1
		        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк
		        |	КОНЕЦ КАК КатегорияЗаказа,
		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияС КАК ВремяПрибытияС,
		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияПо КАК ВремяПрибытияПо,
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
		        |			ТОГДА 1
		        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
		        |			ТОГДА 1
		        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк.Код
		        |	КОНЕЦ КАК КатегорияЗаказаКод
		        |ПОМЕСТИТЬ ВТ_Заказы
		        |ИЗ
		        |	ВТ_РТУ КАК ВТ_РТУ
		        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
		        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АктуальнаяСхемаЛогистическихБрейков.СрезПоследних КАК АктуальнаяСхемаЛогистическихБрейковСрезПоследних
		        |			ПО ДополнительныеПараметрыЗаказа.СхемаЛогистическихБрейков.Ссылка = АктуальнаяСхемаЛогистическихБрейковСрезПоследних.СхемаЛогистическихБрейков.Ссылка
		        |		ПО ВТ_РТУ.Ссылка = ДополнительныеПараметрыЗаказа.Заказ.Ссылка
		        |			И (ДополнительныеПараметрыЗаказа.Доставка <> ЗНАЧЕНИЕ(БизнесПроцесс.новаМестнаяДоставка.ПустаяСсылка)) @СтрокаФильтраСмена11@
		        |ГДЕ
						//+Широков 24.06.2021 Задача 4607	
				|			(ДополнительныеПараметрыЗаказа.ВнешнийОператорМаршрутизации.Ссылка ЕСТЬ NULL)
						//-Широков 24.06.2021 Задача 4607	
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
		        |			ТОГДА 1
		        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
		        |			ТОГДА 1
		        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк
		        |	КОНЕЦ,
		        |	ВТ_РТУ.Ссылка,
		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияС,
		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияПо,
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
		        |			ТОГДА 1
		        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
		        |			ТОГДА 1
		        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк.Код
		        |	КОНЕЦ
		        |
		        |ОБЪЕДИНИТЬ ВСЕ
		        |
		        |ВЫБРАТЬ
		        |	ЗаборТовара.Ссылка,
		        |	ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор),
		        |	&ЗаборнаяКатегория,
		        |	ЗаборТовара.ВремяДоставкиС,
		        |	ЗаборТовара.ВремяДоставкиПо,
		        |	&ЗаборнаяКатегорияКод
		        |ИЗ
		        |	Документ.ЗаборТовара КАК ЗаборТовара
		        |ГДЕ
		        |	ЗаборТовара.Дата МЕЖДУ &ДатаНач И &ДатаКон
		        |	И ЗаборТовара.СтатусИнтернетМагазина = 2
		        |	И ЗаборТовара.ПометкаУдаления = ЛОЖЬ
		        |	И ЗаборТовара.ТерминалДоставки = &ТерминалДоставки
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ЗаборТовара.Ссылка,
		        |	ЗаборТовара.ВремяДоставкиС,
		        |	ЗаборТовара.ВремяДоставкиПо
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	0 КАК Отметка,
		        |	ЕСТЬNULL(ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации, """") КАК ПолигонМаршрутизации,
		        |	ВТ_Заказы.Заказ.Номер КАК НомерЗаказа, @ДополнениеПоПолям@
		        |	1 КАК Итого,
		        |	ВТ_Заказы.Заказ.Ссылка КАК ЗаказСсылка,
				//CeHbKA #3847 #24.03.2020
		        |	ВЫБОР
		        |		КОГДА ВТ_Заказы.Заказ.Ссылка ССЫЛКА Документ.РеализацияТоваровУслуг
		        |			ТОГДА ВТ_Заказы.Заказ.ДоставкаДеньВДень
		        |		ИНАЧЕ ЛОЖЬ
		        |	КОНЕЦ КАК ДоставкаДеньВДень,
				//CeHbKA #3847 #24.03.2020
		        |	"""" КАК УИД,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА 0
		        |		ИНАЧЕ ВТ_Заказы.Заказ.ОбщийВес
		        |	КОНЕЦ КАК ВесЗаказа,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_Заказы.Заказ.Контрагент
		        |		ИНАЧЕ ВТ_Заказы.Заказ.ВладелецТовара
		        |	КОНЕЦ КАК Партнер,
		        |	ВТ_Заказы.ВремяПрибытияС КАК ВремяПрибытияС,
		        |	ВТ_Заказы.ВремяПрибытияПо КАК ВремяПрибытияПо,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_Заказы.Заказ.ОбъемЗабора
		        |		ИНАЧЕ 0
		        |	КОНЕЦ КАК ОбъемЗабора,
		        |	ВТ_Заказы.КатегорияЗаказа КАК КатегорияЗаказа
				
				|ИЗ
				|	ВТ_Заказы КАК ВТ_Заказы
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПолигоныМаршрутизацииЗаказов.СрезПоследних(, СхемаМаршрутизации = &СхемаМаршрутизации) КАК ПолигоныМаршрутизацииЗаказовСрезПоследних
				|		ПО ВТ_Заказы.Заказ = ПолигоныМаршрутизацииЗаказовСрезПоследних.Заказ
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПредварительногоЗакрытияРейсов.СрезПоследних КАК СтатусыПредварительногоЗакрытияРейсовСрезПоследних
				|		ПО ВТ_Заказы.Заказ = СтатусыПредварительногоЗакрытияРейсовСрезПоследних.Заказ
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗаказыРейсов КАК ВТ_ЗаказыРейсов
				|		ПО ВТ_Заказы.Заказ = ВТ_ЗаказыРейсов.Заказ
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КорзинаПолигональнойМаршрутизации.СрезПоследних(
				|				,
				|				ДатаПланирования = &ДатаНач
				|					И ТерминалДоставки = &ТерминалДоставки) КАК КорзинаПолигональнойМаршрутизацииСрезПоследних
				|		ПО ВТ_Заказы.Заказ = КорзинаПолигональнойМаршрутизацииСрезПоследних.Заказ
				|			И (КорзинаПолигональнойМаршрутизацииСрезПоследних.ЗаказВКорзине = ИСТИНА)
				|ГДЕ
				|	ЕСТЬNULL(ВТ_ЗаказыРейсов.Рейс, ИСТИНА) = ИСТИНА
				|	И ЕСТЬNULL(КорзинаПолигональнойМаршрутизацииСрезПоследних.Период, ИСТИНА) = ИСТИНА @СтрокаФильтра@
				//CeHbKA #2626 #21.05.2019
				|	"+?(ТолькоРеализации, "И ВТ_Заказы.Заказ ССЫЛКА Документ.РеализацияТоваровУслуг ", "")+"
				//CeHbKA #2626 #21.05.2019						
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ВТ_Заказы.Заказ.Номер, @ДополнениеПоПолямГруппировки@
		        |	ЕСТЬNULL(ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации, """"),
		        |	ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации.Порядок,
		        |	ВТ_Заказы.Заказ.Ссылка,
				//CeHbKA #3847 #24.03.2020
		        |	ВЫБОР
		        |		КОГДА ВТ_Заказы.Заказ.Ссылка ССЫЛКА Документ.РеализацияТоваровУслуг
		        |			ТОГДА ВТ_Заказы.Заказ.ДоставкаДеньВДень
		        |		ИНАЧЕ ЛОЖЬ
		        |	КОНЕЦ,
				//CeHbKA #3847 #24.03.2020
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА 0
		        |		ИНАЧЕ ВТ_Заказы.Заказ.ОбщийВес
		        |	КОНЕЦ,
		        |	ВТ_Заказы.ВремяПрибытияС,
		        |	ВТ_Заказы.ВремяПрибытияПо,
		        |	ВТ_Заказы.КатегорияЗаказа,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_Заказы.Заказ.Контрагент
		        |		ИНАЧЕ ВТ_Заказы.Заказ.ВладелецТовара
		        |	КОНЕЦ,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_Заказы.Заказ.ОбъемЗабора
		        |		ИНАЧЕ 0
		        |	КОНЕЦ
		        |
		        |УПОРЯДОЧИТЬ ПО
		        |	ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации.Порядок
		        |ИТОГИ @ДополнениеПоПолямИтогов@
		        |	МИНИМУМ(Отметка),
		        |	СУММА(Итого)
		        |ПО
		        |	ПолигонМаршрутизации";
		
	Иначе	
		Возврат "ВЫБРАТЬ
		        |	ПолигоныИКатегорииЗаказовДляРейсов.Полигон КАК Полигон,
		        |	ПолигоныИКатегорииЗаказовДляРейсов.Смена КАК Смена,
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ПолигоныИКатегорииЗаказовДляРейсов.КатегорияЗаказа, ИСТИНА) = ИСТИНА
		        |			ТОГДА 1
		        |		КОГДА ПолигоныИКатегорииЗаказовДляРейсов.КатегорияЗаказа = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
		        |			ТОГДА 1
		        |		ИНАЧЕ ПолигоныИКатегорииЗаказовДляРейсов.КатегорияЗаказа
		        |	КОНЕЦ КАК КатегорияЗаказа,
		        |	ПолигоныИКатегорииЗаказовДляРейсов.Рейс КАК Рейс
		        |ПОМЕСТИТЬ ВТ_ПривязанныеПолигоныИКатегории
		        |ИЗ
		        |	РегистрСведений.ПолигоныИКатегорииЗаказовДляРейсов КАК ПолигоныИКатегорииЗаказовДляРейсов
		        |ГДЕ
		        |	ПолигоныИКатегорииЗаказовДляРейсов.Рейс.ДатаРейса = &ДатаНач
		        |	И ПолигоныИКатегорииЗаказовДляРейсов.Рейс.Проведен = ИСТИНА
		        |	И ПолигоныИКатегорииЗаказовДляРейсов.Рейс.ТерминалДоставки = &ТерминалДоставки @СтрокаФильтраСмена20@
		        |;
				//Асеев 29.08.2023 (Задача № 5117)>>>
		        |////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ВложенныйЗапрос.Ссылка КАК Ссылка
				|ПОМЕСТИТЬ ВТ_РТУ
				|ИЗ
				|	(ВЫБРАТЬ
				|		РеализацияТоваровУслуг.Ссылка КАК Ссылка
				|	ИЗ
				|		Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
				|	ГДЕ
				|		РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНач И &ДатаКон
				|		И РеализацияТоваровУслуг.СтатусИнтернетМагазина = 2
				|		И РеализацияТоваровУслуг.ТерминалДоставки = &ТерминалДоставки
				|		И НЕ РеализацияТоваровУслуг.ПометкаУдаления
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		СтатусыПредварительногоЗакрытияРейсовСрезПоследних.Заказ
				|	ИЗ
				|		РегистрСведений.СтатусыПредварительногоЗакрытияРейсов.СрезПоследних КАК СтатусыПредварительногоЗакрытияРейсовСрезПоследних
				|	ГДЕ
				|		СтатусыПредварительногоЗакрытияРейсовСрезПоследних.ДатаДоставкиЗаказа = &ДатаНач
				|		И СтатусыПредварительногоЗакрытияРейсовСрезПоследних.СтатусПредварительногоЗакрытияРейса = ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытПредварительно)
				|		И СтатусыПредварительногоЗакрытияРейсовСрезПоследних.Заказ.ТерминалДоставки = &ТерминалДоставки) КАК ВложенныйЗапрос
				|;
				//Асеев 29.08.2023 (Задача № 5117)<<<
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ВТ_РТУ.Ссылка КАК Заказ,
		        |	ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка) КАК ТипЗаказа,
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
		        |			ТОГДА 1
		        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
		        |			ТОГДА 1
		        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк
		        |	КОНЕЦ КАК КатегорияЗаказа,
		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияС КАК ВремяПрибытияС,
		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияПо КАК ВремяПрибытияПо,
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
		        |			ТОГДА 1
		        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
		        |			ТОГДА 1
		        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк.Код
		        |	КОНЕЦ КАК КатегорияЗаказаКод,
				|	isnull(ДополнительныеПараметрыЗаказа.Смена, Значение(Справочник.Смены.Смена1)) КАК Смена
		        |ПОМЕСТИТЬ ВТ_Заказы
		        |ИЗ
		        |	ВТ_РТУ КАК ВТ_РТУ
		        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
		        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АктуальнаяСхемаЛогистическихБрейков.СрезПоследних КАК АктуальнаяСхемаЛогистическихБрейковСрезПоследних
		        |			ПО ДополнительныеПараметрыЗаказа.СхемаЛогистическихБрейков.Ссылка = АктуальнаяСхемаЛогистическихБрейковСрезПоследних.СхемаЛогистическихБрейков.Ссылка
		        |		ПО ВТ_РТУ.Ссылка = ДополнительныеПараметрыЗаказа.Заказ.Ссылка
		        |			И (ДополнительныеПараметрыЗаказа.Доставка <> ЗНАЧЕНИЕ(БизнесПроцесс.новаМестнаяДоставка.ПустаяСсылка)) @СтрокаФильтраСмена21@
		        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КорзинаПолигональнойМаршрутизации.СрезПоследних(
		        |				,
		        |				ДатаПланирования = &ДатаНач
		        |					И ТерминалДоставки.Ссылка = &ТерминалДоставки) КАК КорзинаПолигональнойМаршрутизацииСрезПоследних
		        |		ПО (ВТ_РТУ.Ссылка = ВЫРАЗИТЬ(КорзинаПолигональнойМаршрутизацииСрезПоследних.Заказ КАК Документ.РеализацияТоваровУслуг).Ссылка)
		        |			И (КорзинаПолигональнойМаршрутизацииСрезПоследних.ЗаказВКорзине = ИСТИНА)
		        |ГДЕ
						//+Широков 24.06.2021 Задача 4607	
				|			(ДополнительныеПараметрыЗаказа.ВнешнийОператорМаршрутизации.Ссылка ЕСТЬ NULL)
						//-Широков 24.06.2021 Задача 4607	
		        |	И ЕСТЬNULL(КорзинаПолигональнойМаршрутизацииСрезПоследних.Период, ИСТИНА) = ИСТИНА
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
		        |			ТОГДА 1
		        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
		        |			ТОГДА 1
		        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк
		        |	КОНЕЦ,
		        |	ВТ_РТУ.Ссылка,
		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияС,
		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияПо,
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
		        |			ТОГДА 1
		        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
		        |			ТОГДА 1
		        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк.Код
		        |	КОНЕЦ,
				|	isnull(ДополнительныеПараметрыЗаказа.Смена, Значение(Справочник.Смены.Смена1))
		        |
		        |ОБЪЕДИНИТЬ ВСЕ
		        |
		        |ВЫБРАТЬ
		        |	ЗаборТовара.Ссылка,
		        |	ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор),
		        |	&ЗаборнаяКатегория,
		        |	ЗаборТовара.ВремяДоставкиС,
		        |	ЗаборТовара.ВремяДоставкиПо,
		        |	&ЗаборнаяКатегорияКод,
		        |	Значение(Справочник.Смены.Смена1)
		        |ИЗ
		        |	Документ.ЗаборТовара КАК ЗаборТовара
		        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КорзинаПолигональнойМаршрутизации.СрезПоследних(
		        |				,
		        |				ДатаПланирования = &ДатаНач
		        |					И ТерминалДоставки.Ссылка = &ТерминалДоставки) КАК КорзинаПолигональнойМаршрутизацииСрезПоследних
		        |		ПО (ЗаборТовара.Ссылка = ВЫРАЗИТЬ(КорзинаПолигональнойМаршрутизацииСрезПоследних.Заказ КАК Документ.ЗаборТовара).Ссылка)
		        |			И (КорзинаПолигональнойМаршрутизацииСрезПоследних.ЗаказВКорзине = ИСТИНА)
		        |ГДЕ
		        |	ЗаборТовара.Дата МЕЖДУ &ДатаНач И &ДатаКон
		        |	И ЗаборТовара.СтатусИнтернетМагазина = 2
		        |	И ЗаборТовара.ПометкаУдаления = ЛОЖЬ
		        |	И ЗаборТовара.ТерминалДоставки = &ТерминалДоставки
		        |	И ЕСТЬNULL(КорзинаПолигональнойМаршрутизацииСрезПоследних.Период, ИСТИНА) = ИСТИНА
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ЗаборТовара.Ссылка,
		        |	ЗаборТовара.ВремяДоставкиС,
		        |	ЗаборТовара.ВремяДоставкиПо
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Заказ КАК Заказ
		        |ПОМЕСТИТЬ ВТ_ИндивидуальноМаршрутизированныеЗаказы
		        |ИЗ
		        |	РегистрСведений.ИндивидуальнаяМаршрутизацияПоРейсам.СрезПоследних(, ДатаПланирования = &ДатаПланирования) КАК ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних
		        |ГДЕ
		        |	ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Рейс <> ЗНАЧЕНИЕ(Документ.Рейс.пустаяСсылка)
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	0 КАК Отметка,
		        |	ЕСТЬNULL(ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации, """") КАК ПолигонМаршрутизации,
		        |	ВТ_Заказы.Заказ.Номер КАК НомерЗаказа, @ДополнениеПоПолям@
		        |	1 КАК Итого,
		        |	ВТ_Заказы.Заказ.Ссылка КАК ЗаказСсылка,
				//CeHbKA #3847 #24.03.2020
		        |	ВЫБОР
		        |		КОГДА ВТ_Заказы.Заказ.Ссылка ССЫЛКА Документ.РеализацияТоваровУслуг
		        |			ТОГДА ВТ_Заказы.Заказ.ДоставкаДеньВДень
		        |		ИНАЧЕ ЛОЖЬ
		        |	КОНЕЦ КАК ДоставкаДеньВДень,
				//CeHbKA #3847 #24.03.2020
		        |	"""" КАК УИД,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА 0
		        |		ИНАЧЕ ВТ_Заказы.Заказ.ОбщийВес
		        |	КОНЕЦ КАК ВесЗаказа,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_Заказы.Заказ.Контрагент
		        |		ИНАЧЕ ВТ_Заказы.Заказ.ВладелецТовара
		        |	КОНЕЦ КАК Партнер,
		        |	ВТ_Заказы.ВремяПрибытияС КАК ВремяПрибытияС,
		        |	ВТ_Заказы.ВремяПрибытияПо КАК ВремяПрибытияПо,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_Заказы.Заказ.ОбъемЗабора
		        |		ИНАЧЕ 0
		        |	КОНЕЦ КАК ОбъемЗабора,
		        |	ВТ_Заказы.КатегорияЗаказа КАК КатегорияЗаказа
		        |ИЗ
		        |	ВТ_Заказы КАК ВТ_Заказы
		        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПолигоныМаршрутизацииЗаказов.СрезПоследних(, СхемаМаршрутизации = &СхемаМаршрутизации) КАК ПолигоныМаршрутизацииЗаказовСрезПоследних
		        |		ПО ВТ_Заказы.Заказ = ПолигоныМаршрутизацииЗаказовСрезПоследних.Заказ
		        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПредварительногоЗакрытияРейсов.СрезПоследних КАК СтатусыПредварительногоЗакрытияРейсовСрезПоследних
		        |		ПО ВТ_Заказы.Заказ = СтатусыПредварительногоЗакрытияРейсовСрезПоследних.Заказ
		        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПривязанныеПолигоныИКатегории КАК ВТ_ПривязанныеПолигоныИКатегории
		        |		ПО ВТ_Заказы.КатегорияЗаказа = ВТ_ПривязанныеПолигоныИКатегории.КатегорияЗаказа
		        |			И (ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации = ВТ_ПривязанныеПолигоныИКатегории.Полигон)
		        |			И (ВТ_Заказы.Смена = ВТ_ПривязанныеПолигоныИКатегории.Смена)
		        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИндивидуальноМаршрутизированныеЗаказы КАК ВТ_ИндивидуальноМаршрутизированныеЗаказы
		        |		ПО ВТ_Заказы.Заказ = ВТ_ИндивидуальноМаршрутизированныеЗаказы.Заказ
		        |ГДЕ
		        |	ЕСТЬNULL(ВТ_ПривязанныеПолигоныИКатегории.Рейс, ИСТИНА) = ИСТИНА
		        |	И ЕСТЬNULL(ВТ_ИндивидуальноМаршрутизированныеЗаказы.Заказ, ИСТИНА) = ИСТИНА @СтрокаФильтра@
				//CeHbKA #2626 #21.05.2019
				|	"+?(ТолькоРеализации, "И ВТ_Заказы.Заказ ССЫЛКА Документ.РеализацияТоваровУслуг ", "")+"
				//CeHbKA #2626 #21.05.2019						
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ВТ_Заказы.Заказ.Номер, @ДополнениеПоПолямГруппировки@
		        |	ЕСТЬNULL(ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации, """"),
		        |	ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации.Порядок,
		        |	ВТ_Заказы.Заказ.Ссылка,
				//CeHbKA #3847 #24.03.2020
		        |	ВЫБОР
		        |		КОГДА ВТ_Заказы.Заказ.Ссылка ССЫЛКА Документ.РеализацияТоваровУслуг
		        |			ТОГДА ВТ_Заказы.Заказ.ДоставкаДеньВДень
		        |		ИНАЧЕ ЛОЖЬ
		        |	КОНЕЦ,
				//CeHbKA #3847 #24.03.2020
		        |	ВТ_Заказы.ВремяПрибытияС,
		        |	ВТ_Заказы.ВремяПрибытияПо,
		        |	ВТ_Заказы.КатегорияЗаказа,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА 0
		        |		ИНАЧЕ ВТ_Заказы.Заказ.ОбщийВес
		        |	КОНЕЦ,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_Заказы.Заказ.Контрагент
		        |		ИНАЧЕ ВТ_Заказы.Заказ.ВладелецТовара
		        |	КОНЕЦ,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_Заказы.Заказ.ОбъемЗабора
		        |		ИНАЧЕ 0
		        |	КОНЕЦ
		        |
		        |УПОРЯДОЧИТЬ ПО
		        |	ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации.Порядок
		        |ИТОГИ @ДополнениеПоПолямИтогов@
		        |	МИНИМУМ(Отметка),
		        |	СУММА(Итого)
		        |ПО
		        |	ПолигонМаршрутизации";		
	КонецЕсли;	
КонецФункции

//CeHbKA #3663 25.11.2019
Функция ТекстЗапросаПоДеревуПолигонов_БезЗаказов(МаршрутизацияЗакрыта, ТолькоРеализации)
		Если МаршрутизацияЗакрыта Тогда
		Возврат "ВЫБРАТЬ
		        |	РейсЗаказы.Заказ КАК Заказ,
		        |	РейсЗаказы.Ссылка КАК Рейс
		        |ПОМЕСТИТЬ ВТ_ЗаказыРейсов
		        |ИЗ
		        |	Документ.Рейс.Заказы КАК РейсЗаказы
		        |ГДЕ
		        |	РейсЗаказы.УдаленИзРейса = ЛОЖЬ
		        |	И РейсЗаказы.Ссылка.ДатаРейса = &ДатаНач
		        |	И РейсЗаказы.Ссылка.Проведен = ИСТИНА
		        |	И РейсЗаказы.Ссылка.ТерминалДоставки = &ТерминалДоставки @СтрокаФильтраСмена10@
		        |;
				//Асеев 29.08.2023 (Задача № 5117)>>>
		        |////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ВложенныйЗапрос.Ссылка КАК Ссылка
				|ПОМЕСТИТЬ ВТ_РТУ
				|ИЗ
				|	(ВЫБРАТЬ
				|		РеализацияТоваровУслуг.Ссылка КАК Ссылка
				|	ИЗ
				|		Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
				|	ГДЕ
				|		РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНач И &ДатаКон
				|		И РеализацияТоваровУслуг.СтатусИнтернетМагазина = 2
				|		И РеализацияТоваровУслуг.ТерминалДоставки = &ТерминалДоставки
				|		И НЕ РеализацияТоваровУслуг.ПометкаУдаления
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		СтатусыПредварительногоЗакрытияРейсовСрезПоследних.Заказ
				|	ИЗ
				|		РегистрСведений.СтатусыПредварительногоЗакрытияРейсов.СрезПоследних КАК СтатусыПредварительногоЗакрытияРейсовСрезПоследних
				|	ГДЕ
				|		СтатусыПредварительногоЗакрытияРейсовСрезПоследних.ДатаДоставкиЗаказа = &ДатаНач
				|		И СтатусыПредварительногоЗакрытияРейсовСрезПоследних.СтатусПредварительногоЗакрытияРейса = ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытПредварительно)
				|		И СтатусыПредварительногоЗакрытияРейсовСрезПоследних.Заказ.ТерминалДоставки = &ТерминалДоставки) КАК ВложенныйЗапрос
				|;
				//Асеев 29.08.2023 (Задача № 5117)<<<
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ВТ_РТУ.Ссылка КАК Заказ,
		        |	ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка) КАК ТипЗаказа,
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
		        |			ТОГДА 1
		        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
		        |			ТОГДА 1
		        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк
		        |	КОНЕЦ КАК КатегорияЗаказа,
		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияС КАК ВремяПрибытияС,
		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияПо КАК ВремяПрибытияПо,
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
		        |			ТОГДА 1
		        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
		        |			ТОГДА 1
		        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк.Код
		        |	КОНЕЦ КАК КатегорияЗаказаКод
		        |ПОМЕСТИТЬ ВТ_Заказы
		        |ИЗ
		        |	ВТ_РТУ КАК ВТ_РТУ
		        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
		        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АктуальнаяСхемаЛогистическихБрейков.СрезПоследних КАК АктуальнаяСхемаЛогистическихБрейковСрезПоследних
		        |			ПО ДополнительныеПараметрыЗаказа.СхемаЛогистическихБрейков.Ссылка = АктуальнаяСхемаЛогистическихБрейковСрезПоследних.СхемаЛогистическихБрейков.Ссылка
		        |		ПО ВТ_РТУ.Ссылка = ДополнительныеПараметрыЗаказа.Заказ.Ссылка
		        |			И (ДополнительныеПараметрыЗаказа.Доставка <> ЗНАЧЕНИЕ(БизнесПроцесс.новаМестнаяДоставка.ПустаяСсылка)) @СтрокаФильтраСмена11@
		        |ГДЕ
						//+Широков 24.06.2021 Задача 4607	
				|			(ДополнительныеПараметрыЗаказа.ВнешнийОператорМаршрутизации.Ссылка ЕСТЬ NULL)
						//-Широков 24.06.2021 Задача 4607	
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
		        |			ТОГДА 1
		        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
		        |			ТОГДА 1
		        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк
		        |	КОНЕЦ,
		        |	ВТ_РТУ.Ссылка,
		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияС,
		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияПо,
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
		        |			ТОГДА 1
		        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
		        |			ТОГДА 1
		        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк.Код
		        |	КОНЕЦ
		        |
		        |ОБЪЕДИНИТЬ ВСЕ
		        |
		        |ВЫБРАТЬ
		        |	ЗаборТовара.Ссылка,
		        |	ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор),
		        |	&ЗаборнаяКатегория,
		        |	ЗаборТовара.ВремяДоставкиС,
		        |	ЗаборТовара.ВремяДоставкиПо,
		        |	&ЗаборнаяКатегорияКод
		        |ИЗ
		        |	Документ.ЗаборТовара КАК ЗаборТовара
		        |ГДЕ
		        |	ЗаборТовара.Дата МЕЖДУ &ДатаНач И &ДатаКон
		        |	И ЗаборТовара.СтатусИнтернетМагазина = 2
		        |	И ЗаборТовара.ПометкаУдаления = ЛОЖЬ
		        |	И ЗаборТовара.ТерминалДоставки = &ТерминалДоставки
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ЗаборТовара.Ссылка,
		        |	ЗаборТовара.ВремяДоставкиС,
		        |	ЗаборТовара.ВремяДоставкиПо
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	0 КАК Отметка,
		        |	ЕСТЬNULL(ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации, """") КАК ПолигонМаршрутизации,
		        |	ВТ_Заказы.Заказ.Номер КАК НомерЗаказа, @ДополнениеПоПолям@
		        |	1 КАК Итого,
		        |	ВТ_Заказы.Заказ.Ссылка КАК ЗаказСсылка,
		        |	"""" КАК УИД,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА 0
		        |		ИНАЧЕ ВТ_Заказы.Заказ.ОбщийВес
		        |	КОНЕЦ КАК ВесЗаказа,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_Заказы.Заказ.Контрагент
		        |		ИНАЧЕ ВТ_Заказы.Заказ.ВладелецТовара
		        |	КОНЕЦ КАК Партнер,
		        |	ВТ_Заказы.ВремяПрибытияС КАК ВремяПрибытияС,
		        |	ВТ_Заказы.ВремяПрибытияПо КАК ВремяПрибытияПо,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_Заказы.Заказ.ОбъемЗабора
		        |		ИНАЧЕ 0
		        |	КОНЕЦ КАК ОбъемЗабора,
		        |	ВТ_Заказы.КатегорияЗаказа КАК КатегорияЗаказа
				|ПОМЕСТИТЬ ВТ_Финал
				|ИЗ
				|	ВТ_Заказы КАК ВТ_Заказы
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПолигоныМаршрутизацииЗаказов.СрезПоследних(, СхемаМаршрутизации = &СхемаМаршрутизации) КАК ПолигоныМаршрутизацииЗаказовСрезПоследних
				|		ПО ВТ_Заказы.Заказ = ПолигоныМаршрутизацииЗаказовСрезПоследних.Заказ
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПредварительногоЗакрытияРейсов.СрезПоследних КАК СтатусыПредварительногоЗакрытияРейсовСрезПоследних
				|		ПО ВТ_Заказы.Заказ = СтатусыПредварительногоЗакрытияРейсовСрезПоследних.Заказ
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗаказыРейсов КАК ВТ_ЗаказыРейсов
				|		ПО ВТ_Заказы.Заказ = ВТ_ЗаказыРейсов.Заказ
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КорзинаПолигональнойМаршрутизации.СрезПоследних(
				|				,
				|				ДатаПланирования = &ДатаНач
				|					И ТерминалДоставки = &ТерминалДоставки) КАК КорзинаПолигональнойМаршрутизацииСрезПоследних
				|		ПО ВТ_Заказы.Заказ = КорзинаПолигональнойМаршрутизацииСрезПоследних.Заказ
				|			И (КорзинаПолигональнойМаршрутизацииСрезПоследних.ЗаказВКорзине = ИСТИНА)
				|ГДЕ
				|	ЕСТЬNULL(ВТ_ЗаказыРейсов.Рейс, ИСТИНА) = ИСТИНА
				|	И ЕСТЬNULL(КорзинаПолигональнойМаршрутизацииСрезПоследних.Период, ИСТИНА) = ИСТИНА @СтрокаФильтра@
				//CeHbKA #2626 #21.05.2019
				|	"+?(ТолькоРеализации, "И ВТ_Заказы.Заказ ССЫЛКА Документ.РеализацияТоваровУслуг ", "")+"
				//CeHbKA #2626 #21.05.2019						
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ВТ_Заказы.Заказ.Номер, @ДополнениеПоПолямГруппировки@
		        |	ЕСТЬNULL(ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации, """"),
		        |	ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации.Порядок,
		        |	ВТ_Заказы.Заказ.Ссылка,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА 0
		        |		ИНАЧЕ ВТ_Заказы.Заказ.ОбщийВес
		        |	КОНЕЦ,
		        |	ВТ_Заказы.ВремяПрибытияС,
		        |	ВТ_Заказы.ВремяПрибытияПо,
		        |	ВТ_Заказы.КатегорияЗаказа,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_Заказы.Заказ.Контрагент
		        |		ИНАЧЕ ВТ_Заказы.Заказ.ВладелецТовара
		        |	КОНЕЦ,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_Заказы.Заказ.ОбъемЗабора
		        |		ИНАЧЕ 0
		        |	КОНЕЦ
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ВТ_Финал.ПолигонМаршрутизации,
		        |	"""" КАК НомерЗаказа,
		        |	 @ДополнениеПоПолямИтогов@
		        |	МИНИМУМ(Отметка),
		        |	СУММА(Итого)
		        |ИЗ ВТ_Финал КАК ВТ_Финал
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ВТ_Финал.ПолигонМаршрутизации
		        |УПОРЯДОЧИТЬ ПО
		        |	ВТ_Финал.ПолигонМаршрутизации.Порядок";
		
	Иначе	
		Возврат "ВЫБРАТЬ
		        |	ПолигоныИКатегорииЗаказовДляРейсов.Полигон КАК Полигон,
		        |	ПолигоныИКатегорииЗаказовДляРейсов.Смена КАК Смена,
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ПолигоныИКатегорииЗаказовДляРейсов.КатегорияЗаказа, ИСТИНА) = ИСТИНА
		        |			ТОГДА 1
		        |		КОГДА ПолигоныИКатегорииЗаказовДляРейсов.КатегорияЗаказа = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
		        |			ТОГДА 1
		        |		ИНАЧЕ ПолигоныИКатегорииЗаказовДляРейсов.КатегорияЗаказа
		        |	КОНЕЦ КАК КатегорияЗаказа,
		        |	ПолигоныИКатегорииЗаказовДляРейсов.Рейс КАК Рейс
		        |ПОМЕСТИТЬ ВТ_ПривязанныеПолигоныИКатегории
		        |ИЗ
		        |	РегистрСведений.ПолигоныИКатегорииЗаказовДляРейсов КАК ПолигоныИКатегорииЗаказовДляРейсов
		        |ГДЕ
		        |	ПолигоныИКатегорииЗаказовДляРейсов.Рейс.ДатаРейса = &ДатаНач
		        |	И ПолигоныИКатегорииЗаказовДляРейсов.Рейс.Проведен = ИСТИНА
		        |	И ПолигоныИКатегорииЗаказовДляРейсов.Рейс.ТерминалДоставки = &ТерминалДоставки @СтрокаФильтраСмена20@
		        |;
				//Асеев 29.08.2023 (Задача № 5117)>>>
		        |////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ВложенныйЗапрос.Ссылка КАК Ссылка
				|ПОМЕСТИТЬ ВТ_РТУ
				|ИЗ
				|	(ВЫБРАТЬ
				|		РеализацияТоваровУслуг.Ссылка КАК Ссылка
				|	ИЗ
				|		Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
				|	ГДЕ
				|		РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНач И &ДатаКон
				|		И РеализацияТоваровУслуг.СтатусИнтернетМагазина = 2
				|		И РеализацияТоваровУслуг.ТерминалДоставки = &ТерминалДоставки
				|		И НЕ РеализацияТоваровУслуг.ПометкаУдаления
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		СтатусыПредварительногоЗакрытияРейсовСрезПоследних.Заказ
				|	ИЗ
				|		РегистрСведений.СтатусыПредварительногоЗакрытияРейсов.СрезПоследних КАК СтатусыПредварительногоЗакрытияРейсовСрезПоследних
				|	ГДЕ
				|		СтатусыПредварительногоЗакрытияРейсовСрезПоследних.ДатаДоставкиЗаказа = &ДатаНач
				|		И СтатусыПредварительногоЗакрытияРейсовСрезПоследних.СтатусПредварительногоЗакрытияРейса = ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытПредварительно)
				|		И СтатусыПредварительногоЗакрытияРейсовСрезПоследних.Заказ.ТерминалДоставки = &ТерминалДоставки) КАК ВложенныйЗапрос
				|;
				//Асеев 29.08.2023 (Задача № 5117)<<<
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ВТ_РТУ.Ссылка КАК Заказ,
		        |	ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка) КАК ТипЗаказа,
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
		        |			ТОГДА 1
		        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
		        |			ТОГДА 1
		        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк
		        |	КОНЕЦ КАК КатегорияЗаказа,
		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияС КАК ВремяПрибытияС,
		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияПо КАК ВремяПрибытияПо,
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
		        |			ТОГДА 1
		        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
		        |			ТОГДА 1
		        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк.Код
		        |	КОНЕЦ КАК КатегорияЗаказаКод,
				|	isnull(ДополнительныеПараметрыЗаказа.Смена, Значение(Справочник.Смены.Смена1)) КАК Смена
		        |ПОМЕСТИТЬ ВТ_Заказы
		        |ИЗ
		        |	ВТ_РТУ КАК ВТ_РТУ
		        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
		        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АктуальнаяСхемаЛогистическихБрейков.СрезПоследних КАК АктуальнаяСхемаЛогистическихБрейковСрезПоследних
		        |			ПО ДополнительныеПараметрыЗаказа.СхемаЛогистическихБрейков.Ссылка = АктуальнаяСхемаЛогистическихБрейковСрезПоследних.СхемаЛогистическихБрейков.Ссылка
		        |		ПО ВТ_РТУ.Ссылка = ДополнительныеПараметрыЗаказа.Заказ.Ссылка
		        |			И (ДополнительныеПараметрыЗаказа.Доставка <> ЗНАЧЕНИЕ(БизнесПроцесс.новаМестнаяДоставка.ПустаяСсылка)) @СтрокаФильтраСмена21@
		        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КорзинаПолигональнойМаршрутизации.СрезПоследних(
		        |				,
		        |				ДатаПланирования = &ДатаНач
		        |					И ТерминалДоставки.Ссылка = &ТерминалДоставки) КАК КорзинаПолигональнойМаршрутизацииСрезПоследних
		        |		ПО (ВТ_РТУ.Ссылка = ВЫРАЗИТЬ(КорзинаПолигональнойМаршрутизацииСрезПоследних.Заказ КАК Документ.РеализацияТоваровУслуг).Ссылка)
		        |			И (КорзинаПолигональнойМаршрутизацииСрезПоследних.ЗаказВКорзине = ИСТИНА)
		        |ГДЕ
						//+Широков 24.06.2021 Задача 4607	
				|			(ДополнительныеПараметрыЗаказа.ВнешнийОператорМаршрутизации.Ссылка ЕСТЬ NULL)
						//-Широков 24.06.2021 Задача 4607	
		        |	И ЕСТЬNULL(КорзинаПолигональнойМаршрутизацииСрезПоследних.Период, ИСТИНА) = ИСТИНА
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
		        |			ТОГДА 1
		        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
		        |			ТОГДА 1
		        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк
		        |	КОНЕЦ,
		        |	ВТ_РТУ.Ссылка,
		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияС,
		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияПо,
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
		        |			ТОГДА 1
		        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
		        |			ТОГДА 1
		        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк.Код
		        |	КОНЕЦ,
				|	isnull(ДополнительныеПараметрыЗаказа.Смена, Значение(Справочник.Смены.Смена1))
		        |
		        |ОБЪЕДИНИТЬ ВСЕ
		        |
		        |ВЫБРАТЬ
		        |	ЗаборТовара.Ссылка,
		        |	ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор),
		        |	&ЗаборнаяКатегория,
		        |	ЗаборТовара.ВремяДоставкиС,
		        |	ЗаборТовара.ВремяДоставкиПо,
		        |	&ЗаборнаяКатегорияКод,
		        |	Значение(Справочник.Смены.Смена1)
		        |ИЗ
		        |	Документ.ЗаборТовара КАК ЗаборТовара
		        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КорзинаПолигональнойМаршрутизации.СрезПоследних(
		        |				,
		        |				ДатаПланирования = &ДатаНач
		        |					И ТерминалДоставки.Ссылка = &ТерминалДоставки) КАК КорзинаПолигональнойМаршрутизацииСрезПоследних
		        |		ПО (ЗаборТовара.Ссылка = ВЫРАЗИТЬ(КорзинаПолигональнойМаршрутизацииСрезПоследних.Заказ КАК Документ.ЗаборТовара).Ссылка)
		        |			И (КорзинаПолигональнойМаршрутизацииСрезПоследних.ЗаказВКорзине = ИСТИНА)
		        |ГДЕ
		        |	ЗаборТовара.Дата МЕЖДУ &ДатаНач И &ДатаКон
		        |	И ЗаборТовара.СтатусИнтернетМагазина = 2
		        |	И ЗаборТовара.ПометкаУдаления = ЛОЖЬ
		        |	И ЗаборТовара.ТерминалДоставки = &ТерминалДоставки
		        |	И ЕСТЬNULL(КорзинаПолигональнойМаршрутизацииСрезПоследних.Период, ИСТИНА) = ИСТИНА
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ЗаборТовара.Ссылка,
		        |	ЗаборТовара.ВремяДоставкиС,
		        |	ЗаборТовара.ВремяДоставкиПо
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Заказ КАК Заказ
		        |ПОМЕСТИТЬ ВТ_ИндивидуальноМаршрутизированныеЗаказы
		        |ИЗ
		        |	РегистрСведений.ИндивидуальнаяМаршрутизацияПоРейсам.СрезПоследних(, ДатаПланирования = &ДатаПланирования) КАК ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних
		        |ГДЕ
		        |	ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Рейс <> ЗНАЧЕНИЕ(Документ.Рейс.пустаяСсылка)
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	0 КАК Отметка,
		        |	ЕСТЬNULL(ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации, """") КАК ПолигонМаршрутизации,
		        |	ВТ_Заказы.Заказ.Номер КАК НомерЗаказа, @ДополнениеПоПолям@
		        |	1 КАК Итого,
		        |	ВТ_Заказы.Заказ.Ссылка КАК ЗаказСсылка,
		        |	"""" КАК УИД,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА 0
		        |		ИНАЧЕ ВТ_Заказы.Заказ.ОбщийВес
		        |	КОНЕЦ КАК ВесЗаказа,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_Заказы.Заказ.Контрагент
		        |		ИНАЧЕ ВТ_Заказы.Заказ.ВладелецТовара
		        |	КОНЕЦ КАК Партнер,
		        |	ВТ_Заказы.ВремяПрибытияС КАК ВремяПрибытияС,
		        |	ВТ_Заказы.ВремяПрибытияПо КАК ВремяПрибытияПо,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_Заказы.Заказ.ОбъемЗабора
		        |		ИНАЧЕ 0
		        |	КОНЕЦ КАК ОбъемЗабора,
		        |	ВТ_Заказы.КатегорияЗаказа КАК КатегорияЗаказа
				|ПОМЕСТИТЬ ВТ_Финал
		        |ИЗ
		        |	ВТ_Заказы КАК ВТ_Заказы
		        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПолигоныМаршрутизацииЗаказов.СрезПоследних(, СхемаМаршрутизации = &СхемаМаршрутизации) КАК ПолигоныМаршрутизацииЗаказовСрезПоследних
		        |		ПО ВТ_Заказы.Заказ = ПолигоныМаршрутизацииЗаказовСрезПоследних.Заказ
		        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПредварительногоЗакрытияРейсов.СрезПоследних КАК СтатусыПредварительногоЗакрытияРейсовСрезПоследних
		        |		ПО ВТ_Заказы.Заказ = СтатусыПредварительногоЗакрытияРейсовСрезПоследних.Заказ
		        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПривязанныеПолигоныИКатегории КАК ВТ_ПривязанныеПолигоныИКатегории
		        |		ПО ВТ_Заказы.КатегорияЗаказа = ВТ_ПривязанныеПолигоныИКатегории.КатегорияЗаказа
		        |			И (ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации = ВТ_ПривязанныеПолигоныИКатегории.Полигон)
		        |			И (ВТ_Заказы.Смена = ВТ_ПривязанныеПолигоныИКатегории.Смена)
		        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИндивидуальноМаршрутизированныеЗаказы КАК ВТ_ИндивидуальноМаршрутизированныеЗаказы
		        |		ПО ВТ_Заказы.Заказ = ВТ_ИндивидуальноМаршрутизированныеЗаказы.Заказ
		        |ГДЕ
		        |	ЕСТЬNULL(ВТ_ПривязанныеПолигоныИКатегории.Рейс, ИСТИНА) = ИСТИНА
		        |	И ЕСТЬNULL(ВТ_ИндивидуальноМаршрутизированныеЗаказы.Заказ, ИСТИНА) = ИСТИНА @СтрокаФильтра@
				//CeHbKA #2626 #21.05.2019
				|	"+?(ТолькоРеализации, "И ВТ_Заказы.Заказ ССЫЛКА Документ.РеализацияТоваровУслуг ", "")+"
				//CeHbKA #2626 #21.05.2019						
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ВТ_Заказы.Заказ.Номер, @ДополнениеПоПолямГруппировки@
		        |	ЕСТЬNULL(ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации, """"),
		        |	ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации.Порядок,
		        |	ВТ_Заказы.Заказ.Ссылка,
		        |	ВТ_Заказы.ВремяПрибытияС,
		        |	ВТ_Заказы.ВремяПрибытияПо,
		        |	ВТ_Заказы.КатегорияЗаказа,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА 0
		        |		ИНАЧЕ ВТ_Заказы.Заказ.ОбщийВес
		        |	КОНЕЦ,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_Заказы.Заказ.Контрагент
		        |		ИНАЧЕ ВТ_Заказы.Заказ.ВладелецТовара
		        |	КОНЕЦ,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_Заказы.Заказ.ОбъемЗабора
		        |		ИНАЧЕ 0
		        |	КОНЕЦ
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ВТ_Финал.ПолигонМаршрутизации,
		        |	"""" КАК НомерЗаказа,
		        |	 @ДополнениеПоПолямИтогов@
		        |	МИНИМУМ(Отметка),
		        |	СУММА(Итого)
		        |ИЗ ВТ_Финал КАК ВТ_Финал
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ВТ_Финал.ПолигонМаршрутизации
		        |УПОРЯДОЧИТЬ ПО
		        |	ВТ_Финал.ПолигонМаршрутизации.Порядок";
	КонецЕсли;	

КонецФункции
//CeHbKA #3663 25.11.2019


Функция ТекстЗапросаПоДеревуПолигоновСтараяРабочая(МаршрутизацияЗакрыта)
	//+Широков 16.07.2021 Задача 4607	
    //Старый запрос
//	Если МаршрутизацияЗакрыта Тогда
//		Возврат "ВЫБРАТЬ
//		        |	РейсЗаказы.Заказ КАК Заказ,
//		        |	РейсЗаказы.Ссылка КАК Рейс
//		        |ПОМЕСТИТЬ ВТ_ЗаказыРейсов
//		        |ИЗ
//		        |	Документ.Рейс.Заказы КАК РейсЗаказы
//		        |ГДЕ
//		        |	РейсЗаказы.УдаленИзРейса = ЛОЖЬ
//		        |	И РейсЗаказы.Ссылка.ДатаРейса = &ДатаНач
//		        |	И РейсЗаказы.Ссылка.Проведен = ИСТИНА
//		        |	И РейсЗаказы.Ссылка.ТерминалДоставки = &ТерминалДоставки
//		        |;
//		        |
//		        |////////////////////////////////////////////////////////////////////////////////
//		        |ВЫБРАТЬ
//		        |	РеализацияТоваровУслуг.Ссылка КАК Заказ,
//		        |	ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка) КАК ТипЗаказа,
//		        |	ВЫБОР
//		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
//		        |			ТОГДА 1
//		        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
//		        |			ТОГДА 1
//		        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк
//		        |	КОНЕЦ КАК КатегорияЗаказа,
//		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияС КАК ВремяПрибытияС,
//		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияПо КАК ВремяПрибытияПо,
//		        |	ВЫБОР
//		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
//		        |			ТОГДА 1
//		        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
//		        |			ТОГДА 1
//		        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк.Код
//		        |	КОНЕЦ КАК КатегорияЗаказаКод
//		        |ПОМЕСТИТЬ ВТ_Заказы
//		        |ИЗ
//		        |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
//		        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
//		        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АктуальнаяСхемаЛогистическихБрейков.СрезПоследних КАК АктуальнаяСхемаЛогистическихБрейковСрезПоследних
//		        |			ПО ДополнительныеПараметрыЗаказа.СхемаЛогистическихБрейков.Ссылка = АктуальнаяСхемаЛогистическихБрейковСрезПоследних.СхемаЛогистическихБрейков.Ссылка
//		        |		ПО РеализацияТоваровУслуг.Ссылка = ДополнительныеПараметрыЗаказа.Заказ.Ссылка
//		        |			И (ДополнительныеПараметрыЗаказа.Доставка <> ЗНАЧЕНИЕ(БизнесПроцесс.новаМестнаяДоставка.ПустаяСсылка))
//		        |ГДЕ
//		        |	РеализацияТоваровУслуг.СтатусИнтернетМагазина = 2
//		        |	И РеализацияТоваровУслуг.ТерминалДоставки = &ТерминалДоставки
//		        |	И РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
//		        |	И РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНач И &ДатаКон
//		        |
//		        |СГРУППИРОВАТЬ ПО
//		        |	ВЫБОР
//		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
//		        |			ТОГДА 1
//		        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
//		        |			ТОГДА 1
//		        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк
//		        |	КОНЕЦ,
//		        |	РеализацияТоваровУслуг.Ссылка,
//		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияС,
//		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияПо,
//		        |	ВЫБОР
//		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
//		        |			ТОГДА 1
//		        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
//		        |			ТОГДА 1
//		        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк.Код
//		        |	КОНЕЦ
//		        |
//		        |ОБЪЕДИНИТЬ ВСЕ
//		        |
//		        |ВЫБРАТЬ
//		        |	ЗаборТовара.Ссылка,
//		        |	ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор),
//		        |	&ЗаборнаяКатегория,
//		        |	ЗаборТовара.ВремяДоставкиС,
//		        |	ЗаборТовара.ВремяДоставкиПо,
//		        |	&ЗаборнаяКатегорияКод
//		        |ИЗ
//		        |	Документ.ЗаборТовара КАК ЗаборТовара
//		        |ГДЕ
//		        |	ЗаборТовара.Дата МЕЖДУ &ДатаНач И &ДатаКон
//		        |	И ЗаборТовара.СтатусИнтернетМагазина = 2
//		        |	И ЗаборТовара.ПометкаУдаления = ЛОЖЬ
//		        |	И ЗаборТовара.ТерминалДоставки = &ТерминалДоставки
//		        |
//		        |СГРУППИРОВАТЬ ПО
//		        |	ЗаборТовара.Ссылка,
//		        |	ЗаборТовара.ВремяДоставкиС,
//		        |	ЗаборТовара.ВремяДоставкиПо
//		        |;
//		        |
//		        |////////////////////////////////////////////////////////////////////////////////
//		        |ВЫБРАТЬ
//		        |	0 КАК Отметка,
//		        |	ЕСТЬNULL(ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации, """") КАК ПолигонМаршрутизации,
//		        |	ВТ_Заказы.Заказ.Номер КАК НомерЗаказа, @ДополнениеПоПолям@
//		        |	1 КАК Итого,
//		        |	ВТ_Заказы.Заказ.Ссылка КАК ЗаказСсылка,
//		        |	"""" КАК УИД,
//		        |	ВЫБОР
//		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
//		        |			ТОГДА 0
//		        |		ИНАЧЕ ВТ_Заказы.Заказ.ОбщийВес
//		        |	КОНЕЦ КАК ВесЗаказа,
//		        |	ВЫБОР
//		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
//		        |			ТОГДА ВТ_Заказы.Заказ.Контрагент
//		        |		ИНАЧЕ ВТ_Заказы.Заказ.ВладелецТовара
//		        |	КОНЕЦ КАК Партнер,
//		        |	ВТ_Заказы.ВремяПрибытияС КАК ВремяПрибытияС,
//		        |	ВТ_Заказы.ВремяПрибытияПо КАК ВремяПрибытияПо,
//		        |	ВЫБОР
//		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
//		        |			ТОГДА ВТ_Заказы.Заказ.ОбъемЗабора
//		        |		ИНАЧЕ 0
//		        |	КОНЕЦ КАК ОбъемЗабора,
//		        |	ВТ_Заказы.КатегорияЗаказа КАК КатегорияЗаказа
//|ИЗ
//|	ВТ_Заказы КАК ВТ_Заказы
//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПолигоныМаршрутизацииЗаказов.СрезПоследних(, СхемаМаршрутизации = &СхемаМаршрутизации) КАК ПолигоныМаршрутизацииЗаказовСрезПоследних
//|		ПО ВТ_Заказы.Заказ = ПолигоныМаршрутизацииЗаказовСрезПоследних.Заказ
//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПредварительногоЗакрытияРейсов.СрезПоследних КАК СтатусыПредварительногоЗакрытияРейсовСрезПоследних
//|		ПО ВТ_Заказы.Заказ = СтатусыПредварительногоЗакрытияРейсовСрезПоследних.Заказ
//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗаказыРейсов КАК ВТ_ЗаказыРейсов
//|		ПО ВТ_Заказы.Заказ = ВТ_ЗаказыРейсов.Заказ
//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КорзинаПолигональнойМаршрутизации.СрезПоследних(
//|				,
//|				ДатаПланирования = &ДатаНач
//|					И ТерминалДоставки = &ТерминалДоставки) КАК КорзинаПолигональнойМаршрутизацииСрезПоследних
//|		ПО ВТ_Заказы.Заказ = КорзинаПолигональнойМаршрутизацииСрезПоследних.Заказ
//|			И (КорзинаПолигональнойМаршрутизацииСрезПоследних.ЗаказВКорзине = ИСТИНА)
//|ГДЕ
//|	ЕСТЬNULL(ВТ_ЗаказыРейсов.Рейс, ИСТИНА) = ИСТИНА
//|	И ЕСТЬNULL(КорзинаПолигональнойМаршрутизацииСрезПоследних.Период, ИСТИНА) = ИСТИНА @СтрокаФильтра@
//				
//				//|ИЗ
//				//|	ВТ_Заказы КАК ВТ_Заказы
//				//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПолигоныМаршрутизацииЗаказов.СрезПоследних(&ДатаКон, СхемаМаршрутизации = &СхемаМаршрутизации) КАК ПолигоныМаршрутизацииЗаказовСрезПоследних
//				//|		ПО ВТ_Заказы.Заказ = ПолигоныМаршрутизацииЗаказовСрезПоследних.Заказ
//				//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПредварительногоЗакрытияРейсов.СрезПоследних КАК СтатусыПредварительногоЗакрытияРейсовСрезПоследних
//				//|		ПО ВТ_Заказы.Заказ = СтатусыПредварительногоЗакрытияРейсовСрезПоследних.Заказ
//				//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗаказыРейсов КАК ВТ_ЗаказыРейсов
//				//|		ПО ВТ_Заказы.Заказ = ВТ_ЗаказыРейсов.Заказ
//				//|ГДЕ
//				//|	ЕСТЬNULL(ВТ_ЗаказыРейсов.Рейс, ИСТИНА) = ИСТИНА @СтрокаФильтра@
//		        |
//		        |СГРУППИРОВАТЬ ПО
//		        |	ВТ_Заказы.Заказ.Номер, @ДополнениеПоПолямГруппировки@
//		        |	ЕСТЬNULL(ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации, """"),
//		        |	ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации.Порядок,
//		        |	ВТ_Заказы.Заказ.Ссылка,
//		        |	ВЫБОР
//		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
//		        |			ТОГДА 0
//		        |		ИНАЧЕ ВТ_Заказы.Заказ.ОбщийВес
//		        |	КОНЕЦ,
//		        |	ВТ_Заказы.ВремяПрибытияС,
//		        |	ВТ_Заказы.ВремяПрибытияПо,
//		        |	ВТ_Заказы.КатегорияЗаказа,
//		        |	ВЫБОР
//		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
//		        |			ТОГДА ВТ_Заказы.Заказ.Контрагент
//		        |		ИНАЧЕ ВТ_Заказы.Заказ.ВладелецТовара
//		        |	КОНЕЦ,
//		        |	ВЫБОР
//		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
//		        |			ТОГДА ВТ_Заказы.Заказ.ОбъемЗабора
//		        |		ИНАЧЕ 0
//		        |	КОНЕЦ
//		        |
//		        |УПОРЯДОЧИТЬ ПО
//		        |	ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации.Порядок
//		        |ИТОГИ @ДополнениеПоПолямИтогов@
//		        |	МИНИМУМ(Отметка),
//		        |	СУММА(Итого)
//		        |ПО
//		        |	ПолигонМаршрутизации";
//		
//	Иначе	
//		Возврат "ВЫБРАТЬ
//		        |	ПолигоныИКатегорииЗаказовДляРейсов.Полигон КАК Полигон,
//		        |	ВЫБОР
//		        |		КОГДА ЕСТЬNULL(ПолигоныИКатегорииЗаказовДляРейсов.КатегорияЗаказа, ИСТИНА) = ИСТИНА
//		        |			ТОГДА 1
//		        |		КОГДА ПолигоныИКатегорииЗаказовДляРейсов.КатегорияЗаказа = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
//		        |			ТОГДА 1
//		        |		ИНАЧЕ ПолигоныИКатегорииЗаказовДляРейсов.КатегорияЗаказа
//		        |	КОНЕЦ КАК КатегорияЗаказа,
//		        |	ПолигоныИКатегорииЗаказовДляРейсов.Рейс КАК Рейс
//		        |ПОМЕСТИТЬ ВТ_ПривязанныеПолигоныИКатегории
//		        |ИЗ
//		        |	РегистрСведений.ПолигоныИКатегорииЗаказовДляРейсов КАК ПолигоныИКатегорииЗаказовДляРейсов
//		        |ГДЕ
//		        |	ПолигоныИКатегорииЗаказовДляРейсов.Рейс.ДатаРейса = &ДатаНач
//		        |	И ПолигоныИКатегорииЗаказовДляРейсов.Рейс.Проведен = ИСТИНА
//				|	И ПолигоныИКатегорииЗаказовДляРейсов.Рейс.ТерминалДоставки = &ТерминалДоставки
//		        |;
//		        |
//		        |////////////////////////////////////////////////////////////////////////////////
//		        |ВЫБРАТЬ
//		        |	РеализацияТоваровУслуг.Ссылка КАК Заказ,
//		        |	ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка) КАК ТипЗаказа,
//		        |	ВЫБОР
//		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
//		        |			ТОГДА 1
//		        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
//		        |			ТОГДА 1
//		        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк
//		        |	КОНЕЦ КАК КатегорияЗаказа,
//		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияС КАК ВремяПрибытияС,
//		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияПо КАК ВремяПрибытияПо,
//		        |	ВЫБОР
//		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
//		        |			ТОГДА 1
//		        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
//		        |			ТОГДА 1
//		        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк.Код
//		        |	КОНЕЦ КАК КатегорияЗаказаКод
//		        |ПОМЕСТИТЬ ВТ_Заказы
//		        |ИЗ
//		        |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
//		        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
//		        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АктуальнаяСхемаЛогистическихБрейков.СрезПоследних КАК АктуальнаяСхемаЛогистическихБрейковСрезПоследних
//		        |			ПО ДополнительныеПараметрыЗаказа.СхемаЛогистическихБрейков.Ссылка = АктуальнаяСхемаЛогистическихБрейковСрезПоследних.СхемаЛогистическихБрейков.Ссылка
//		        |		ПО РеализацияТоваровУслуг.Ссылка = ДополнительныеПараметрыЗаказа.Заказ.Ссылка
//		        |			И (ДополнительныеПараметрыЗаказа.Доставка <> ЗНАЧЕНИЕ(БизнесПроцесс.новаМестнаяДоставка.ПустаяСсылка))
//		        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КорзинаПолигональнойМаршрутизации.СрезПоследних(
//		        |				,
//		        |				ДатаПланирования = &ДатаНач
//		        |					И ТерминалДоставки.Ссылка = &ТерминалДоставки) КАК КорзинаПолигональнойМаршрутизацииСрезПоследних
//		        |		ПО (РеализацияТоваровУслуг.Ссылка = ВЫРАЗИТЬ(КорзинаПолигональнойМаршрутизацииСрезПоследних.Заказ КАК Документ.РеализацияТоваровУслуг).Ссылка)
//		        |			И (КорзинаПолигональнойМаршрутизацииСрезПоследних.ЗаказВКорзине = ИСТИНА)
//		        |ГДЕ
//		        |	РеализацияТоваровУслуг.СтатусИнтернетМагазина = 2
//		        |	И РеализацияТоваровУслуг.ТерминалДоставки = &ТерминалДоставки
//		        |	И РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
//		        |	И РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНач И &ДатаКон
//		        |	И ЕСТЬNULL(КорзинаПолигональнойМаршрутизацииСрезПоследних.Период, ИСТИНА) = ИСТИНА
//		        |
//		        |СГРУППИРОВАТЬ ПО
//		        |	ВЫБОР
//		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
//		        |			ТОГДА 1
//		        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
//		        |			ТОГДА 1
//		        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк
//		        |	КОНЕЦ,
//		        |	РеализацияТоваровУслуг.Ссылка,
//		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияС,
//		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияПо,
//		        |	ВЫБОР
//		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
//		        |			ТОГДА 1
//		        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
//		        |			ТОГДА 1
//		        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк.Код
//		        |	КОНЕЦ
//		        |
//		        |ОБЪЕДИНИТЬ ВСЕ
//		        |
//		        |ВЫБРАТЬ
//		        |	ЗаборТовара.Ссылка,
//		        |	ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор),
//		        |	&ЗаборнаяКатегория,
//		        |	ЗаборТовара.ВремяДоставкиС,
//		        |	ЗаборТовара.ВремяДоставкиПо,
//		        |	&ЗаборнаяКатегорияКод
//		        |ИЗ
//		        |	Документ.ЗаборТовара КАК ЗаборТовара
//		        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КорзинаПолигональнойМаршрутизации.СрезПоследних(
//		        |				,
//		        |				ДатаПланирования = &ДатаНач
//		        |					И ТерминалДоставки.Ссылка = &ТерминалДоставки) КАК КорзинаПолигональнойМаршрутизацииСрезПоследних
//		        |		ПО (ЗаборТовара.Ссылка = ВЫРАЗИТЬ(КорзинаПолигональнойМаршрутизацииСрезПоследних.Заказ КАК Документ.ЗаборТовара).Ссылка)
//		        |			И (КорзинаПолигональнойМаршрутизацииСрезПоследних.ЗаказВКорзине = ИСТИНА)
//		        |ГДЕ
//		        |	ЗаборТовара.Дата МЕЖДУ &ДатаНач И &ДатаКон
//		        |	И ЗаборТовара.СтатусИнтернетМагазина = 2
//		        |	И ЗаборТовара.ПометкаУдаления = ЛОЖЬ
//		        |	И ЗаборТовара.ТерминалДоставки = &ТерминалДоставки
//		        |	И ЕСТЬNULL(КорзинаПолигональнойМаршрутизацииСрезПоследних.Период, ИСТИНА) = ИСТИНА
//		        |
//		        |СГРУППИРОВАТЬ ПО
//		        |	ЗаборТовара.Ссылка,
//		        |	ЗаборТовара.ВремяДоставкиС,
//		        |	ЗаборТовара.ВремяДоставкиПо
//		        |;
//		        |
//		        |////////////////////////////////////////////////////////////////////////////////
//		        |ВЫБРАТЬ
//		        |	ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Заказ КАК Заказ
//		        |ПОМЕСТИТЬ ВТ_ИндивидуальноМаршрутизированныеЗаказы
//		        |ИЗ
//		        |	РегистрСведений.ИндивидуальнаяМаршрутизацияПоРейсам.СрезПоследних(, ДатаПланирования = &ДатаПланирования) КАК ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних
//		        |ГДЕ
//		        |	ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Рейс <> ЗНАЧЕНИЕ(Документ.Рейс.пустаяСсылка)
//		        |;
//		        |
//		        |////////////////////////////////////////////////////////////////////////////////
//		        |ВЫБРАТЬ
//		        |	0 КАК Отметка,
//		        |	ЕСТЬNULL(ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации, """") КАК ПолигонМаршрутизации,
//		        |	ВТ_Заказы.Заказ.Номер КАК НомерЗаказа, @ДополнениеПоПолям@
//		        |	1 КАК Итого,
//		        |	ВТ_Заказы.Заказ.Ссылка КАК ЗаказСсылка,
//		        |	"""" КАК УИД,
//		        |	ВЫБОР
//		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
//		        |			ТОГДА 0
//		        |		ИНАЧЕ ВТ_Заказы.Заказ.ОбщийВес
//		        |	КОНЕЦ КАК ВесЗаказа,
//		        |	ВЫБОР
//		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
//		        |			ТОГДА ВТ_Заказы.Заказ.Контрагент
//		        |		ИНАЧЕ ВТ_Заказы.Заказ.ВладелецТовара
//		        |	КОНЕЦ КАК Партнер,
//		        |	ВТ_Заказы.ВремяПрибытияС КАК ВремяПрибытияС,
//		        |	ВТ_Заказы.ВремяПрибытияПо КАК ВремяПрибытияПо,
//		        |	ВЫБОР
//		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
//		        |			ТОГДА ВТ_Заказы.Заказ.ОбъемЗабора
//		        |		ИНАЧЕ 0
//		        |	КОНЕЦ КАК ОбъемЗабора,
//		        |	ВТ_Заказы.КатегорияЗаказа КАК КатегорияЗаказа
//		        |ИЗ
//		        |	ВТ_Заказы КАК ВТ_Заказы
//		        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПолигоныМаршрутизацииЗаказов.СрезПоследних(, СхемаМаршрутизации = &СхемаМаршрутизации) КАК ПолигоныМаршрутизацииЗаказовСрезПоследних
//		        |		ПО ВТ_Заказы.Заказ = ПолигоныМаршрутизацииЗаказовСрезПоследних.Заказ
//		        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПредварительногоЗакрытияРейсов.СрезПоследних КАК СтатусыПредварительногоЗакрытияРейсовСрезПоследних
//		        |		ПО ВТ_Заказы.Заказ = СтатусыПредварительногоЗакрытияРейсовСрезПоследних.Заказ
//		        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПривязанныеПолигоныИКатегории КАК ВТ_ПривязанныеПолигоныИКатегории
//		        |		ПО ВТ_Заказы.КатегорияЗаказа = ВТ_ПривязанныеПолигоныИКатегории.КатегорияЗаказа
//		        |			И (ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации = ВТ_ПривязанныеПолигоныИКатегории.Полигон)
//		        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИндивидуальноМаршрутизированныеЗаказы КАК ВТ_ИндивидуальноМаршрутизированныеЗаказы
//		        |		ПО ВТ_Заказы.Заказ = ВТ_ИндивидуальноМаршрутизированныеЗаказы.Заказ
//		        |ГДЕ
//		        |	ЕСТЬNULL(ВТ_ПривязанныеПолигоныИКатегории.Рейс, ИСТИНА) = ИСТИНА
//		        |	И ЕСТЬNULL(ВТ_ИндивидуальноМаршрутизированныеЗаказы.Заказ, ИСТИНА) = ИСТИНА @СтрокаФильтра@
//		        |
//		        |СГРУППИРОВАТЬ ПО
//		        |	ВТ_Заказы.Заказ.Номер, @ДополнениеПоПолямГруппировки@
//		        |	ЕСТЬNULL(ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации, """"),
//		        |	ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации.Порядок,
//		        |	ВТ_Заказы.Заказ.Ссылка,
//		        |	ВТ_Заказы.ВремяПрибытияС,
//		        |	ВТ_Заказы.ВремяПрибытияПо,
//		        |	ВТ_Заказы.КатегорияЗаказа,
//		        |	ВЫБОР
//		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
//		        |			ТОГДА 0
//		        |		ИНАЧЕ ВТ_Заказы.Заказ.ОбщийВес
//		        |	КОНЕЦ,
//		        |	ВЫБОР
//		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
//		        |			ТОГДА ВТ_Заказы.Заказ.Контрагент
//		        |		ИНАЧЕ ВТ_Заказы.Заказ.ВладелецТовара
//		        |	КОНЕЦ,
//		        |	ВЫБОР
//		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
//		        |			ТОГДА ВТ_Заказы.Заказ.ОбъемЗабора
//		        |		ИНАЧЕ 0
//		        |	КОНЕЦ
//		        |
//		        |УПОРЯДОЧИТЬ ПО
//		        |	ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации.Порядок
//		        |ИТОГИ @ДополнениеПоПолямИтогов@
//		        |	МИНИМУМ(Отметка),
//		        |	СУММА(Итого)
//		        |ПО
//		        |	ПолигонМаршрутизации";		
//		
//	КонецеСли;	

//Новый запрос

	Если МаршрутизацияЗакрыта Тогда
		Возврат "ВЫБРАТЬ
		        |	РейсЗаказы.Заказ КАК Заказ,
		        |	РейсЗаказы.Ссылка КАК Рейс
		        |ПОМЕСТИТЬ ВТ_ЗаказыРейсов
		        |ИЗ
		        |	Документ.Рейс.Заказы КАК РейсЗаказы
		        |ГДЕ
		        |	РейсЗаказы.УдаленИзРейса = ЛОЖЬ
		        |	И РейсЗаказы.Ссылка.ДатаРейса = &ДатаНач
		        |	И РейсЗаказы.Ссылка.Проведен = ИСТИНА
		        |	И РейсЗаказы.Ссылка.ТерминалДоставки = &ТерминалДоставки
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	РеализацияТоваровУслуг.Ссылка КАК Заказ,
		        |	ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка) КАК ТипЗаказа,
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
		        |			ТОГДА 1
		        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
		        |			ТОГДА 1
		        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк
		        |	КОНЕЦ КАК КатегорияЗаказа,
		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияС КАК ВремяПрибытияС,
		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияПо КАК ВремяПрибытияПо,
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
		        |			ТОГДА 1
		        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
		        |			ТОГДА 1
		        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк.Код
		        |	КОНЕЦ КАК КатегорияЗаказаКод
		        |ПОМЕСТИТЬ ВТ_Заказы
		        |ИЗ
		        |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
		        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АктуальнаяСхемаЛогистическихБрейков.СрезПоследних КАК АктуальнаяСхемаЛогистическихБрейковСрезПоследних
		        |			ПО ДополнительныеПараметрыЗаказа.СхемаЛогистическихБрейков.Ссылка = АктуальнаяСхемаЛогистическихБрейковСрезПоследних.СхемаЛогистическихБрейков.Ссылка
		        |		ПО РеализацияТоваровУслуг.Ссылка = ДополнительныеПараметрыЗаказа.Заказ.Ссылка
		        |			И (ДополнительныеПараметрыЗаказа.Доставка <> ЗНАЧЕНИЕ(БизнесПроцесс.новаМестнаяДоставка.ПустаяСсылка))
		        |ГДЕ
		        |	РеализацияТоваровУслуг.СтатусИнтернетМагазина = 2
						//+Широков 24.06.2021 Задача 4607	
				|			И (ДополнительныеПараметрыЗаказа.ВнешнийОператорМаршрутизации.Ссылка ЕСТЬ NULL)
						//-Широков 24.06.2021 Задача 4607	
		        |	И РеализацияТоваровУслуг.ТерминалДоставки = &ТерминалДоставки
		        |	И РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
		        |	И РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНач И &ДатаКон
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
		        |			ТОГДА 1
		        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
		        |			ТОГДА 1
		        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк
		        |	КОНЕЦ,
		        |	РеализацияТоваровУслуг.Ссылка,
		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияС,
		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияПо,
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
		        |			ТОГДА 1
		        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
		        |			ТОГДА 1
		        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк.Код
		        |	КОНЕЦ
		        |
		        |ОБЪЕДИНИТЬ ВСЕ
		        |
		        |ВЫБРАТЬ
		        |	ЗаборТовара.Ссылка,
		        |	ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор),
		        |	&ЗаборнаяКатегория,
		        |	ЗаборТовара.ВремяДоставкиС,
		        |	ЗаборТовара.ВремяДоставкиПо,
		        |	&ЗаборнаяКатегорияКод
		        |ИЗ
		        |	Документ.ЗаборТовара КАК ЗаборТовара
		        |ГДЕ
		        |	ЗаборТовара.Дата МЕЖДУ &ДатаНач И &ДатаКон
		        |	И ЗаборТовара.СтатусИнтернетМагазина = 2
		        |	И ЗаборТовара.ПометкаУдаления = ЛОЖЬ
		        |	И ЗаборТовара.ТерминалДоставки = &ТерминалДоставки
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ЗаборТовара.Ссылка,
		        |	ЗаборТовара.ВремяДоставкиС,
		        |	ЗаборТовара.ВремяДоставкиПо
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	0 КАК Отметка,
		        |	ЕСТЬNULL(ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации, """") КАК ПолигонМаршрутизации,
		        |	ВТ_Заказы.Заказ.Номер КАК НомерЗаказа, @ДополнениеПоПолям@
		        |	1 КАК Итого,
		        |	ВТ_Заказы.Заказ.Ссылка КАК ЗаказСсылка,
		        |	"""" КАК УИД,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА 0
		        |		ИНАЧЕ ВТ_Заказы.Заказ.ОбщийВес
		        |	КОНЕЦ КАК ВесЗаказа,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_Заказы.Заказ.Контрагент
		        |		ИНАЧЕ ВТ_Заказы.Заказ.ВладелецТовара
		        |	КОНЕЦ КАК Партнер,
		        |	ВТ_Заказы.ВремяПрибытияС КАК ВремяПрибытияС,
		        |	ВТ_Заказы.ВремяПрибытияПо КАК ВремяПрибытияПо,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_Заказы.Заказ.ОбъемЗабора
		        |		ИНАЧЕ 0
		        |	КОНЕЦ КАК ОбъемЗабора,
		        |	ВТ_Заказы.КатегорияЗаказа КАК КатегорияЗаказа
				|ИЗ
				|	ВТ_Заказы КАК ВТ_Заказы
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПолигоныМаршрутизацииЗаказов.СрезПоследних(, СхемаМаршрутизации = &СхемаМаршрутизации) КАК ПолигоныМаршрутизацииЗаказовСрезПоследних
				|		ПО ВТ_Заказы.Заказ = ПолигоныМаршрутизацииЗаказовСрезПоследних.Заказ
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПредварительногоЗакрытияРейсов.СрезПоследних КАК СтатусыПредварительногоЗакрытияРейсовСрезПоследних
				|		ПО ВТ_Заказы.Заказ = СтатусыПредварительногоЗакрытияРейсовСрезПоследних.Заказ
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗаказыРейсов КАК ВТ_ЗаказыРейсов
				|		ПО ВТ_Заказы.Заказ = ВТ_ЗаказыРейсов.Заказ
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КорзинаПолигональнойМаршрутизации.СрезПоследних(
				|				,
				|				ДатаПланирования = &ДатаНач
				|					И ТерминалДоставки = &ТерминалДоставки) КАК КорзинаПолигональнойМаршрутизацииСрезПоследних
				|		ПО ВТ_Заказы.Заказ = КорзинаПолигональнойМаршрутизацииСрезПоследних.Заказ
				|			И (КорзинаПолигональнойМаршрутизацииСрезПоследних.ЗаказВКорзине = ИСТИНА)
				|ГДЕ
				|	ЕСТЬNULL(ВТ_ЗаказыРейсов.Рейс, ИСТИНА) = ИСТИНА
				|	И ЕСТЬNULL(КорзинаПолигональнойМаршрутизацииСрезПоследних.Период, ИСТИНА) = ИСТИНА @СтрокаФильтра@
				
				//|ИЗ
				//|	ВТ_Заказы КАК ВТ_Заказы
				//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПолигоныМаршрутизацииЗаказов.СрезПоследних(&ДатаКон, СхемаМаршрутизации = &СхемаМаршрутизации) КАК ПолигоныМаршрутизацииЗаказовСрезПоследних
				//|		ПО ВТ_Заказы.Заказ = ПолигоныМаршрутизацииЗаказовСрезПоследних.Заказ
				//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПредварительногоЗакрытияРейсов.СрезПоследних КАК СтатусыПредварительногоЗакрытияРейсовСрезПоследних
				//|		ПО ВТ_Заказы.Заказ = СтатусыПредварительногоЗакрытияРейсовСрезПоследних.Заказ
				//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗаказыРейсов КАК ВТ_ЗаказыРейсов
				//|		ПО ВТ_Заказы.Заказ = ВТ_ЗаказыРейсов.Заказ
				//|ГДЕ
				//|	ЕСТЬNULL(ВТ_ЗаказыРейсов.Рейс, ИСТИНА) = ИСТИНА @СтрокаФильтра@
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ВТ_Заказы.Заказ.Номер, @ДополнениеПоПолямГруппировки@
		        |	ЕСТЬNULL(ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации, """"),
		        |	ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации.Порядок,
		        |	ВТ_Заказы.Заказ.Ссылка,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА 0
		        |		ИНАЧЕ ВТ_Заказы.Заказ.ОбщийВес
		        |	КОНЕЦ,
		        |	ВТ_Заказы.ВремяПрибытияС,
		        |	ВТ_Заказы.ВремяПрибытияПо,
		        |	ВТ_Заказы.КатегорияЗаказа,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_Заказы.Заказ.Контрагент
		        |		ИНАЧЕ ВТ_Заказы.Заказ.ВладелецТовара
		        |	КОНЕЦ,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_Заказы.Заказ.ОбъемЗабора
		        |		ИНАЧЕ 0
		        |	КОНЕЦ
		        |
		        |УПОРЯДОЧИТЬ ПО
		        |	ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации.Порядок
		        |ИТОГИ @ДополнениеПоПолямИтогов@
		        |	МИНИМУМ(Отметка),
		        |	СУММА(Итого)
		        |ПО
		        |	ПолигонМаршрутизации";
		
	Иначе	
		Возврат "ВЫБРАТЬ
		        |	ПолигоныИКатегорииЗаказовДляРейсов.Полигон КАК Полигон,
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ПолигоныИКатегорииЗаказовДляРейсов.КатегорияЗаказа, ИСТИНА) = ИСТИНА
		        |			ТОГДА 1
		        |		КОГДА ПолигоныИКатегорииЗаказовДляРейсов.КатегорияЗаказа = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
		        |			ТОГДА 1
		        |		ИНАЧЕ ПолигоныИКатегорииЗаказовДляРейсов.КатегорияЗаказа
		        |	КОНЕЦ КАК КатегорияЗаказа,
		        |	ПолигоныИКатегорииЗаказовДляРейсов.Рейс КАК Рейс
		        |ПОМЕСТИТЬ ВТ_ПривязанныеПолигоныИКатегории
		        |ИЗ
		        |	РегистрСведений.ПолигоныИКатегорииЗаказовДляРейсов КАК ПолигоныИКатегорииЗаказовДляРейсов
		        |ГДЕ
		        |	ПолигоныИКатегорииЗаказовДляРейсов.Рейс.ДатаРейса = &ДатаНач
		        |	И ПолигоныИКатегорииЗаказовДляРейсов.Рейс.Проведен = ИСТИНА
				|	И ПолигоныИКатегорииЗаказовДляРейсов.Рейс.ТерминалДоставки = &ТерминалДоставки
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	РеализацияТоваровУслуг.Ссылка КАК Заказ,
		        |	ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка) КАК ТипЗаказа,
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
		        |			ТОГДА 1
		        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
		        |			ТОГДА 1
		        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк
		        |	КОНЕЦ КАК КатегорияЗаказа,
		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияС КАК ВремяПрибытияС,
		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияПо КАК ВремяПрибытияПо,
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
		        |			ТОГДА 1
		        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
		        |			ТОГДА 1
		        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк.Код
		        |	КОНЕЦ КАК КатегорияЗаказаКод
		        |ПОМЕСТИТЬ ВТ_Заказы
		        |ИЗ
		        |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
		        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АктуальнаяСхемаЛогистическихБрейков.СрезПоследних КАК АктуальнаяСхемаЛогистическихБрейковСрезПоследних
		        |			ПО ДополнительныеПараметрыЗаказа.СхемаЛогистическихБрейков.Ссылка = АктуальнаяСхемаЛогистическихБрейковСрезПоследних.СхемаЛогистическихБрейков.Ссылка
		        |		ПО РеализацияТоваровУслуг.Ссылка = ДополнительныеПараметрыЗаказа.Заказ.Ссылка
		        |			И (ДополнительныеПараметрыЗаказа.Доставка <> ЗНАЧЕНИЕ(БизнесПроцесс.новаМестнаяДоставка.ПустаяСсылка))
		        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КорзинаПолигональнойМаршрутизации.СрезПоследних(
		        |				,
		        |				ДатаПланирования = &ДатаНач
		        |					И ТерминалДоставки.Ссылка = &ТерминалДоставки) КАК КорзинаПолигональнойМаршрутизацииСрезПоследних
		        |		ПО (РеализацияТоваровУслуг.Ссылка = ВЫРАЗИТЬ(КорзинаПолигональнойМаршрутизацииСрезПоследних.Заказ КАК Документ.РеализацияТоваровУслуг).Ссылка)
		        |			И (КорзинаПолигональнойМаршрутизацииСрезПоследних.ЗаказВКорзине = ИСТИНА)
		        |ГДЕ
		        |	РеализацияТоваровУслуг.СтатусИнтернетМагазина = 2
						//+Широков 24.06.2021 Задача 4607	
				|			И (ДополнительныеПараметрыЗаказа.ВнешнийОператорМаршрутизации.Ссылка ЕСТЬ NULL)
						//-Широков 24.06.2021 Задача 4607	
		        |	И РеализацияТоваровУслуг.ТерминалДоставки = &ТерминалДоставки
		        |	И РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
		        |	И РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНач И &ДатаКон
		        |	И ЕСТЬNULL(КорзинаПолигональнойМаршрутизацииСрезПоследних.Период, ИСТИНА) = ИСТИНА
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
		        |			ТОГДА 1
		        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
		        |			ТОГДА 1
		        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк
		        |	КОНЕЦ,
		        |	РеализацияТоваровУслуг.Ссылка,
		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияС,
		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияПо,
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
		        |			ТОГДА 1
		        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
		        |			ТОГДА 1
		        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк.Код
		        |	КОНЕЦ
		        |
		        |ОБЪЕДИНИТЬ ВСЕ
		        |
		        |ВЫБРАТЬ
		        |	ЗаборТовара.Ссылка,
		        |	ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор),
		        |	&ЗаборнаяКатегория,
		        |	ЗаборТовара.ВремяДоставкиС,
		        |	ЗаборТовара.ВремяДоставкиПо,
		        |	&ЗаборнаяКатегорияКод
		        |ИЗ
		        |	Документ.ЗаборТовара КАК ЗаборТовара
		        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КорзинаПолигональнойМаршрутизации.СрезПоследних(
		        |				,
		        |				ДатаПланирования = &ДатаНач
		        |					И ТерминалДоставки.Ссылка = &ТерминалДоставки) КАК КорзинаПолигональнойМаршрутизацииСрезПоследних
		        |		ПО (ЗаборТовара.Ссылка = ВЫРАЗИТЬ(КорзинаПолигональнойМаршрутизацииСрезПоследних.Заказ КАК Документ.ЗаборТовара).Ссылка)
		        |			И (КорзинаПолигональнойМаршрутизацииСрезПоследних.ЗаказВКорзине = ИСТИНА)
		        |ГДЕ
		        |	ЗаборТовара.Дата МЕЖДУ &ДатаНач И &ДатаКон
		        |	И ЗаборТовара.СтатусИнтернетМагазина = 2
		        |	И ЗаборТовара.ПометкаУдаления = ЛОЖЬ
		        |	И ЗаборТовара.ТерминалДоставки = &ТерминалДоставки
		        |	И ЕСТЬNULL(КорзинаПолигональнойМаршрутизацииСрезПоследних.Период, ИСТИНА) = ИСТИНА
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ЗаборТовара.Ссылка,
		        |	ЗаборТовара.ВремяДоставкиС,
		        |	ЗаборТовара.ВремяДоставкиПо
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Заказ КАК Заказ
		        |ПОМЕСТИТЬ ВТ_ИндивидуальноМаршрутизированныеЗаказы
		        |ИЗ
		        |	РегистрСведений.ИндивидуальнаяМаршрутизацияПоРейсам.СрезПоследних(, ДатаПланирования = &ДатаПланирования) КАК ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних
		        |ГДЕ
		        |	ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Рейс <> ЗНАЧЕНИЕ(Документ.Рейс.пустаяСсылка)
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	0 КАК Отметка,
		        |	ЕСТЬNULL(ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации, """") КАК ПолигонМаршрутизации,
		        |	ВТ_Заказы.Заказ.Номер КАК НомерЗаказа, @ДополнениеПоПолям@
		        |	1 КАК Итого,
		        |	ВТ_Заказы.Заказ.Ссылка КАК ЗаказСсылка,
		        |	"""" КАК УИД,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА 0
		        |		ИНАЧЕ ВТ_Заказы.Заказ.ОбщийВес
		        |	КОНЕЦ КАК ВесЗаказа,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_Заказы.Заказ.Контрагент
		        |		ИНАЧЕ ВТ_Заказы.Заказ.ВладелецТовара
		        |	КОНЕЦ КАК Партнер,
		        |	ВТ_Заказы.ВремяПрибытияС КАК ВремяПрибытияС,
		        |	ВТ_Заказы.ВремяПрибытияПо КАК ВремяПрибытияПо,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_Заказы.Заказ.ОбъемЗабора
		        |		ИНАЧЕ 0
		        |	КОНЕЦ КАК ОбъемЗабора,
		        |	ВТ_Заказы.КатегорияЗаказа КАК КатегорияЗаказа
		        |ИЗ
		        |	ВТ_Заказы КАК ВТ_Заказы
		        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПолигоныМаршрутизацииЗаказов.СрезПоследних(, СхемаМаршрутизации = &СхемаМаршрутизации) КАК ПолигоныМаршрутизацииЗаказовСрезПоследних
		        |		ПО ВТ_Заказы.Заказ = ПолигоныМаршрутизацииЗаказовСрезПоследних.Заказ
		        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПредварительногоЗакрытияРейсов.СрезПоследних КАК СтатусыПредварительногоЗакрытияРейсовСрезПоследних
		        |		ПО ВТ_Заказы.Заказ = СтатусыПредварительногоЗакрытияРейсовСрезПоследних.Заказ
		        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПривязанныеПолигоныИКатегории КАК ВТ_ПривязанныеПолигоныИКатегории
		        |		ПО ВТ_Заказы.КатегорияЗаказа = ВТ_ПривязанныеПолигоныИКатегории.КатегорияЗаказа
		        |			И (ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации = ВТ_ПривязанныеПолигоныИКатегории.Полигон)
		        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИндивидуальноМаршрутизированныеЗаказы КАК ВТ_ИндивидуальноМаршрутизированныеЗаказы
		        |		ПО ВТ_Заказы.Заказ = ВТ_ИндивидуальноМаршрутизированныеЗаказы.Заказ
		        |ГДЕ
		        |	ЕСТЬNULL(ВТ_ПривязанныеПолигоныИКатегории.Рейс, ИСТИНА) = ИСТИНА
		        |	И ЕСТЬNULL(ВТ_ИндивидуальноМаршрутизированныеЗаказы.Заказ, ИСТИНА) = ИСТИНА @СтрокаФильтра@
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ВТ_Заказы.Заказ.Номер, @ДополнениеПоПолямГруппировки@
		        |	ЕСТЬNULL(ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации, """"),
		        |	ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации.Порядок,
		        |	ВТ_Заказы.Заказ.Ссылка,
		        |	ВТ_Заказы.ВремяПрибытияС,
		        |	ВТ_Заказы.ВремяПрибытияПо,
		        |	ВТ_Заказы.КатегорияЗаказа,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА 0
		        |		ИНАЧЕ ВТ_Заказы.Заказ.ОбщийВес
		        |	КОНЕЦ,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_Заказы.Заказ.Контрагент
		        |		ИНАЧЕ ВТ_Заказы.Заказ.ВладелецТовара
		        |	КОНЕЦ,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_Заказы.Заказ.ОбъемЗабора
		        |		ИНАЧЕ 0
		        |	КОНЕЦ
		        |
		        |УПОРЯДОЧИТЬ ПО
		        |	ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации.Порядок
		        |ИТОГИ @ДополнениеПоПолямИтогов@
		        |	МИНИМУМ(Отметка),
		        |	СУММА(Итого)
		        |ПО
		        |	ПолигонМаршрутизации";		
		
	КонецеСли;	
//-Широков 16.07.2021 Задача 4607	

КонецФункции


Процедура ОбновитьДанныеДереваПолигоновНаСервере(МаршрутизацияЗакрыта, ДатаПланирования, ПолигональнаяСхемаКарты, Регион, ЗаборнаяКатегория, СхемаЛогистическихБрейков, СписокДобавляемыхРеквизитов, СписокДобавляемыхЭлементов, ТабЭлементовФильтра, АдресХранилища, ПараметрОтбораПоГруппамПолигонов = Неопределено,Смена = Неопределено, БезЗаказов = Ложь) Экспорт
	Зап = Новый Запрос;
	
	//Зап.Текст = ТекстЗапросаПоДеревуПолигонов(МаршрутизацияЗакрыта);
	//CeHbKA #2626 #21.05.2019
	ТолькоРеализации = ?(Смена = Неопределено, Ложь, Смена <> Справочники.Смены.Смена1);
	Зап.Текст = ТекстЗапросаПоДеревуПолигонов(МаршрутизацияЗакрыта, ТолькоРеализации);
	//CeHbKA #2626 #21.05.2019
	
	//CeHbKA #3663 25.11.2019
	Если БезЗаказов Тогда
	//Если Истина Тогда//тест
		Зап.Текст = ТекстЗапросаПоДеревуПолигонов_БезЗаказов(МаршрутизацияЗакрыта, ТолькоРеализации);
	КонецЕсли;
	//CeHbKA #3663 25.11.2019
	
	ДополнениеЗапросаПоКолонкам = СформироватьКолонкиЗапросаДереваПолигонов(СхемаЛогистическихБрейков);
	Зап.Текст = СтрЗаменить(Зап.Текст, "@ДополнениеПоПолям@", ДополнениеЗапросаПоКолонкам);
			   
	ДополнениеЗапросаПоКолонкам = СформироватьКолонкиЗапросаДереваПолигонов(СхемаЛогистическихБрейков,, Ложь);
	Зап.Текст = СтрЗаменить(Зап.Текст, "@ДополнениеПоПолямГруппировки@", ДополнениеЗапросаПоКолонкам);
	
	ДополнениеЗапросаПоКолонкам = СформироватьКолонкиЗапросаДереваПолигонов(СхемаЛогистическихБрейков, Истина, Ложь);
	Зап.Текст = СтрЗаменить(Зап.Текст, "@ДополнениеПоПолямИтогов@", ДополнениеЗапросаПоКолонкам);
	
	// Якурнов 06.09.2018 11:24:30 // Добавим в строку фильтра Отбор По ГруппамПолигонов
	//>>>>>>>>>>>>>>>>>>>>>>>>>
	СтрокаФильтра = СтрокаУсловийФильтра(ТабЭлементовФильтра, "ДеревоПолигоновСЗаказами");
	
	Если ПараметрОтбораПоГруппамПолигонов <> Неопределено Тогда
		    СтрокаФильтра = СтрокаФильтра  + " И (ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации В (&ТаблПолигонов))";
			Зап.УстановитьПараметр("ТаблПолигонов",ПараметрОтбораПоГруппамПолигонов);
	КонецЕсли;

	Зап.Текст = СтрЗаменить(Зап.Текст, "@СтрокаФильтра@", СтрокаФильтра);
	//<<<<<<<<<<<<<<<<<<<<<<<<<
	
	//Зап.Текст = СтрЗаменить(Зап.Текст, "@СтрокаФильтра@", СтрокаУсловийФильтра(ТабЭлементовФильтра, "ДеревоПолигоновСЗаказами"));
	
	//CeHbKA #3179 11.06.2019 
	//ТекстПисьма = "Текст запроса полигоны: "+Символы.ПС+Зап.Текст+Символы.ПС+"Тип значения Смена: "+Символы.ПС+ТипЗнч(Смена)+Символы.ПС+"Тип значения Смена: "+Символы.ПС+ТипЗнч(Смена);
	//lem.ОтправитьСообщение("a.pryalkin@strizh-logistic.ru","Тест_ПМ",ТекстПисьма,,,,);
	//CeHbKA #3179 11.06.2019 
	
	// Якурнов: Отбор по Смене
	// >>>>>>>> Начало 23.10.2018 14:49:06 >>>>>>>>
	Если Смена <> Неопределено Тогда
		    СтрокаФильтраСмена10 = " И РейсЗаказы.Ссылка.СменаРейса = &СменаРейса";
			Зап.Текст = СтрЗаменить(Зап.Текст, "@СтрокаФильтраСмена10@",СтрокаФильтраСмена10);
			
			СтрокаФильтраСмена11 = " И (ДополнительныеПараметрыЗаказа.Смена = &СменаРейса)";
			Зап.Текст = СтрЗаменить(Зап.Текст, "@СтрокаФильтраСмена11@",СтрокаФильтраСмена11);

			
			//СтрокаФильтраСмена20 = " И ПолигоныИКатегорииЗаказовДляРейсов.Рейс.СменаРейса = &СменаРейса";
			//CeHbKA #3179 06.06.2019
			СтрокаФильтраСмена20 = " И ПолигоныИКатегорииЗаказовДляРейсов.Смена = &СменаРейса";
			//CeHbKA #3179 06.06.2019
			Зап.Текст = СтрЗаменить(Зап.Текст, "@СтрокаФильтраСмена20@",СтрокаФильтраСмена20);
			 
			
			СтрокаФильтраСмена21 = "  И (ДополнительныеПараметрыЗаказа.Смена = &СменаРейса)";
			Зап.Текст = СтрЗаменить(Зап.Текст, "@СтрокаФильтраСмена21@",СтрокаФильтраСмена21);
	
			Зап.УстановитьПараметр("СменаРейса",Смена);
	Иначе
			Зап.Текст = СтрЗаменить(Зап.Текст, "@СтрокаФильтраСмена10@","");
			Зап.Текст = СтрЗаменить(Зап.Текст, "@СтрокаФильтраСмена11@","");
			Зап.Текст = СтрЗаменить(Зап.Текст, "@СтрокаФильтраСмена20@","");
			Зап.Текст = СтрЗаменить(Зап.Текст, "@СтрокаФильтраСмена21@","");
	КонецЕсли;
	// <<<<<<<< Конец 23.10.2018 14:49:06 <<<<<<<<


	
	
	Зап.УстановитьПараметр("ДатаНач", НачалоДня(ДатаПланирования));
	Зап.УстановитьПараметр("ДатаКон", КонецДня(ДатаПланирования));
	Зап.УстановитьПараметр("СхемаМаршрутизации", ПолигональнаяСхемаКарты);
	Зап.УстановитьПараметр("ТерминалДоставки", Регион);
	Зап.УстановитьПараметр("ЗаборнаяКатегория", ЗаборнаяКатегория);
	Зап.УстановитьПараметр("ЗаборнаяКатегорияКод", ЗаборнаяКатегория.Код);
	Зап.УстановитьПараметр("ДатаПланирования", НачалоДня(ДатаПланирования));
	
	
	
	ДеревоПолигонов = Зап.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам); 
			
	ПоместитьВоВременноеХранилище(ДеревоПолигонов, АдресХранилища);
КонецПроцедуры	
#КонецОбласти


#Область РаботаСДеревомРейсов

Функция ТекстЗапросаПоДеревуРейсов(МаршрутизацияЗакрыта, ТолькоРеализации)
	Если МаршрутизацияЗакрыта Тогда
				Возврат "ВЫБРАТЬ
				        |	РеализацияТоваровУслуг.Ссылка КАК Заказ,
				        |	ВЫБОР
				        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
				        |			ТОГДА 1
				        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
				        |			ТОГДА 1
				        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк
				        |	КОНЕЦ КАК КатегорияЗаказа,
				        |	РейсЗаказы.Ссылка КАК Рейс,
				        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияС КАК ВремяПрибытияС,
				        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияПо КАК ВремяПрибытияПо,
				        |	ВЫБОР
				        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
				        |			ТОГДА 1
				        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
				        |			ТОГДА 1
				        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк.Код
				        |	КОНЕЦ КАК КатегорияЗаказаКод
				        |ПОМЕСТИТЬ ВТ_Заказы
				        |ИЗ
				        |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
				        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
				        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АктуальнаяСхемаЛогистическихБрейков.СрезПоследних КАК АктуальнаяСхемаЛогистическихБрейковСрезПоследних
				        |			ПО ДополнительныеПараметрыЗаказа.СхемаЛогистическихБрейков.Ссылка = АктуальнаяСхемаЛогистическихБрейковСрезПоследних.СхемаЛогистическихБрейков.Ссылка
				        |		ПО РеализацияТоваровУслуг.Ссылка = ДополнительныеПараметрыЗаказа.Заказ.Ссылка
						//|			И (ДополнительныеПараметрыЗаказа.Доставка <> ЗНАЧЕНИЕ(БизнесПроцесс.новаМестнаяДоставка.ПустаяСсылка))
						//CeHbKA #2626 #03.06.2019
						|			И (ДополнительныеПараметрыЗаказа.Доставка <> ЗНАЧЕНИЕ(БизнесПроцесс.новаМестнаяДоставка.ПустаяСсылка)) @СтрокаФильтраСмена11@
						//CeHbKA #2626 #03.06.2019
				        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Рейс.Заказы КАК РейсЗаказы
				        |		ПО (РеализацияТоваровУслуг.Ссылка = (ВЫРАЗИТЬ(РейсЗаказы.Заказ КАК Документ.РеализацияТоваровУслуг)))
				        |ГДЕ
				        |	РейсЗаказы.Ссылка.ДатаРейса = &ДатаНач
						//+Широков 24.06.2021 Задача 4607	
						|			И (ДополнительныеПараметрыЗаказа.ВнешнийОператорМаршрутизации.Ссылка ЕСТЬ NULL)
						//-Широков 24.06.2021 Задача 4607	
				        |	И РейсЗаказы.Ссылка.Проведен = ИСТИНА
				        |	И РейсЗаказы.УдаленИзРейса = ЛОЖЬ
				        |	И РейсЗаказы.Ссылка.ТерминалДоставки = &ТерминалДоставки
				        |
				        |СГРУППИРОВАТЬ ПО
				        |	РеализацияТоваровУслуг.Ссылка,
				        |	ВЫБОР
				        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
				        |			ТОГДА 1
				        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
				        |			ТОГДА 1
				        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк
				        |	КОНЕЦ,
				        |	РейсЗаказы.Ссылка,
				        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияС,
				        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияПо,
				        |	ВЫБОР
				        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
				        |			ТОГДА 1
				        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
				        |			ТОГДА 1
				        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк.Код
				        |	КОНЕЦ
				        |
				        |ОБЪЕДИНИТЬ ВСЕ
				        |
				        |ВЫБРАТЬ
				        |	ЗаборТовара.Ссылка,
				        |	&ЗаборнаяКатегория,
				        |	РейсЗаказы.Ссылка,
				        |	ЗаборТовара.ВремяДоставкиС,
				        |	ЗаборТовара.ВремяДоставкиПо,
				        |	&ЗаборнаяКатегорияКод
				        |ИЗ
				        |	Документ.Рейс.Заказы КАК РейсЗаказы
				        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаборТовара КАК ЗаборТовара
				        |		ПО ((ВЫРАЗИТЬ(РейсЗаказы.Заказ КАК Документ.ЗаборТовара)) = ЗаборТовара.Ссылка)
				        |ГДЕ
				        |	РейсЗаказы.Ссылка.Проведен = ИСТИНА
				        |	И РейсЗаказы.Ссылка.ДатаРейса = &ДатаНач
				        |	И РейсЗаказы.УдаленИзРейса = ЛОЖЬ
				        |	И РейсЗаказы.Ссылка.ТерминалДоставки = &ТерминалДоставки
				        |;
				        |
				        |////////////////////////////////////////////////////////////////////////////////
				        |ВЫБРАТЬ
				        |	РейсДокументДляПараметров.Ссылка КАК Рейс
				        |ПОМЕСТИТЬ ВТ_РейсыСПараметрами
				        |ИЗ
				        |	Документ.Рейс КАК РейсДокументДляПараметров
				        |ГДЕ
				        |	РейсДокументДляПараметров.Проведен = ИСТИНА
				        |	И РейсДокументДляПараметров.ДатаРейса = &ДатаНач
						//|	И РейсДокументДляПараметров.ТерминалДоставки = &ТерминалДоставки @СтрокаФильтраСмена@
						//CeHbKA #2626 #03.06.2019
						|	И РейсДокументДляПараметров.ТерминалДоставки = &ТерминалДоставки @СтрокаФильтраСмена12@
						//CeHbKA #2626 #03.06.2019
				        |;
				        |
				        |////////////////////////////////////////////////////////////////////////////////
				        |ВЫБРАТЬ
				        |	0 КАК Отметка,
				        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт КАК Транспорт,
				        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Код КАК ТранспортКод,
				        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Наименование КАК ТранспортНаименование,
				        |	ЕСТЬNULL(ВТ_Заказы.Заказ.Номер, ИСТИНА) КАК НомерЗаказа,@ДополнениеПоПолям@
				        |	ВЫБОР
				        |		КОГДА ЕСТЬNULL(ВТ_Заказы.Заказ, ИСТИНА) = ИСТИНА
				        |			ТОГДА 0
				        |		ИНАЧЕ 1
				        |	КОНЕЦ КАК Итого,
				        |	ПривязкаМашинКРейсамСрезПоследних.Водитель КАК Водитель,
				        |	ВТ_РейсыСПараметрами.Рейс.Ссылка КАК Рейс,
				        |	ВТ_РейсыСПараметрами.Рейс.РольРейса КАК РольРейса,
				        |	ВТ_РейсыСПараметрами.Рейс.СменаРейса КАК СменаРейса,
				        |	ВЫБОР
				        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации, ИСТИНА) = ИСТИНА
				        |			ТОГДА 40
				        |		КОГДА ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации = 0
				        |			ТОГДА 40
				        |		ИНАЧЕ ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации
				        |	КОНЕЦ КАК МаксимальноеКоличествоЗаказов,
				        |	ЛОЖЬ КАК ИндивидуальнаяМаршрутизация,
				        |	ВТ_Заказы.Заказ.Ссылка КАК ЗаказСсылка,
						//CeHbKA #3847 #24.03.2020
						|	ВЫБОР
				        |		КОГДА ВТ_Заказы.Заказ.Ссылка ССЫЛКА Документ.РеализацияТоваровУслуг
				        |			ТОГДА ВТ_Заказы.Заказ.ДоставкаДеньВДень
				        |		ИНАЧЕ ЛОЖЬ
				        |	КОНЕЦ КАК ДоставкаДеньВДень,
						//CeHbKA #3847 #24.03.2020
				        |	ПривязкаМашинКРейсамСрезПоследних.Экспедитор КАК Экспедитор,
				        |	ВЫБОР
				        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
				        |			ТОГДА 0
				        |		ИНАЧЕ ВТ_Заказы.Заказ.ОбщийВес
				        |	КОНЕЦ КАК ВесЗаказа,
				        |	ВЫБОР
				        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
				        |			ТОГДА ВТ_Заказы.Заказ.Контрагент
				        |		ИНАЧЕ ВТ_Заказы.Заказ.ВладелецТовара
				        |	КОНЕЦ КАК Партнер,
				        |	ВТ_Заказы.ВремяПрибытияС КАК ВремяПрибытияС,
				        |	ВТ_Заказы.ВремяПрибытияПо КАК ВремяПрибытияПо,
				        |	ВЫБОР
				        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
				        |			ТОГДА ВТ_Заказы.Заказ.ОбъемЗабора
				        |		ИНАЧЕ 0
				        |	КОНЕЦ КАК ОбъемЗабора,
						//Асеев 17.06.2022 (по письму ПМ)>>>
				        |	ВЫБОР
				        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
				        |			ТОГДА 0
				        |		ИНАЧЕ ВТ_Заказы.Заказ.ОбъёмЗаказа
				        |	КОНЕЦ КАК ОбъёмЗаказа,
						|	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Грузоподъемность * 1000 КАК Грузоподъемность,
						|	ПривязкаМашинКРейсамСрезПоследних.Транспорт.ОбъемКузова КАК ОбъемКузова,
						//Асеев 17.06.2022 (по письму ПМ)<<<
				        |	"""" КАК УИД,
				        |	ВТ_Заказы.КатегорияЗаказа КАК КатегорияЗаказа,
				        |	ЕСТЬNULL(ПроверенныеДокументыСрезПоследних.ДокументПроверен, ЛОЖЬ) КАК ДокументПроверен
				        |ИЗ
				        |	ВТ_РейсыСПараметрами КАК ВТ_РейсыСПараметрами
				        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Заказы КАК ВТ_Заказы
				        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПредварительногоЗакрытияРейсов.СрезПоследних КАК СтатусыПредварительногоЗакрытияРейсовСрезПоследних
				        |			ПО ВТ_Заказы.Заказ = СтатусыПредварительногоЗакрытияРейсовСрезПоследних.Заказ
				        |		ПО ВТ_РейсыСПараметрами.Рейс = ВТ_Заказы.Рейс @СтрокаФильтра@
				        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних КАК ПривязкаМашинКРейсамСрезПоследних
				        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыТранспорта.СрезПоследних КАК ДополнительныеПараметрыТранспортаСрезПоследних
				        |			ПО ПривязкаМашинКРейсамСрезПоследних.Транспорт.Ссылка = ДополнительныеПараметрыТранспортаСрезПоследних.Транспорт.Ссылка
				        |		ПО ВТ_РейсыСПараметрами.Рейс.Ссылка = ПривязкаМашинКРейсамСрезПоследних.Рейс.Ссылка @СтрокаФильтраВодителей@
				        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПроверенныеДокументы.СрезПоследних КАК ПроверенныеДокументыСрезПоследних
				        |		ПО ВТ_РейсыСПараметрами.Рейс = ПроверенныеДокументыСрезПоследних.Документ
						//CeHbKA #2626 #21.05.2019
				        |"+?(ТолькоРеализации, "ГДЕ ВТ_Заказы.Заказ ССЫЛКА Документ.РеализацияТоваровУслуг ", "")+"
						//CeHbKA #2626 #21.05.2019						
						|
				        |СГРУППИРОВАТЬ ПО
				        |	ЕСТЬNULL(ВТ_Заказы.Заказ.Номер, ИСТИНА), @ДополнениеПоПолямГруппировки@
				        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт,
				        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Код,
				        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Наименование,
				        |	ПривязкаМашинКРейсамСрезПоследних.Водитель,
				        |	ВТ_РейсыСПараметрами.Рейс.Ссылка,
				        |	ВТ_РейсыСПараметрами.Рейс.РольРейса,
				        |	ВТ_РейсыСПараметрами.Рейс.СменаРейса, 
				        |	ВЫБОР
				        |		КОГДА ЕСТЬNULL(ВТ_Заказы.Заказ, ИСТИНА) = ИСТИНА
				        |			ТОГДА 0
				        |		ИНАЧЕ 1
				        |	КОНЕЦ,
				        |	ВЫБОР
				        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации, ИСТИНА) = ИСТИНА
				        |			ТОГДА 40
				        |		КОГДА ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации = 0
				        |			ТОГДА 40
				        |		ИНАЧЕ ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации
				        |	КОНЕЦ,
				        |	ВТ_Заказы.Заказ.Ссылка,
						//CeHbKA #3847 #24.03.2020
						|	ВЫБОР
				        |		КОГДА ВТ_Заказы.Заказ.Ссылка ССЫЛКА Документ.РеализацияТоваровУслуг
				        |			ТОГДА ВТ_Заказы.Заказ.ДоставкаДеньВДень
				        |		ИНАЧЕ ЛОЖЬ
				        |	КОНЕЦ,
						//CeHbKA #3847 #24.03.2020
				        |	ПривязкаМашинКРейсамСрезПоследних.Экспедитор,
				        |	ВЫБОР
				        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
				        |			ТОГДА 0
				        |		ИНАЧЕ ВТ_Заказы.Заказ.ОбщийВес
				        |	КОНЕЦ,
				        |	ВЫБОР
				        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
				        |			ТОГДА ВТ_Заказы.Заказ.Контрагент
				        |		ИНАЧЕ ВТ_Заказы.Заказ.ВладелецТовара
				        |	КОНЕЦ,
				        |	ВТ_Заказы.ВремяПрибытияС,
				        |	ВТ_Заказы.ВремяПрибытияПо,
				        |	ВТ_Заказы.КатегорияЗаказа,
				        |	ВЫБОР
				        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
				        |			ТОГДА ВТ_Заказы.Заказ.ОбъемЗабора
				        |		ИНАЧЕ 0
				        |	КОНЕЦ,
				        |	ЕСТЬNULL(ПроверенныеДокументыСрезПоследних.ДокументПроверен, ЛОЖЬ),
						//Асеев 17.06.2022 (по письму ПМ)>>>
				        |	ВЫБОР
				        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
				        |			ТОГДА 0
				        |		ИНАЧЕ ВТ_Заказы.Заказ.ОбъёмЗаказа
				        |	КОНЕЦ,
						|	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Грузоподъемность * 1000,
						|	ПривязкаМашинКРейсамСрезПоследних.Транспорт.ОбъемКузова
						//Асеев 17.06.2022 (по письму ПМ)<<<
				        |
				        |УПОРЯДОЧИТЬ ПО
				        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Наименование
				        |ИТОГИ
				        |	МИНИМУМ(Отметка),
				        |	МАКСИМУМ(Транспорт),
				        |	МАКСИМУМ(ТранспортКод),
				        |	МАКСИМУМ(ТранспортНаименование),
				        |	СУММА(Итого),
						|	МИНИМУМ(ДокументПроверен),
				        |	МАКСИМУМ(Водитель),
				        |	МАКСИМУМ(РольРейса),  
				        |	МАКСИМУМ(СменаРейса),  @ДополнениеПоПолямИтогов@
				        |	МАКСИМУМ(МаксимальноеКоличествоЗаказов),
						//Асеев 17.06.2022 (по письму ПМ)>>>
						|	СУММА(ВесЗаказа),
						|	СУММА(ОбъемЗабора),
						|	СУММА(ОбъёмЗаказа),
						|	МАКСИМУМ(Грузоподъемность),
						|	МАКСИМУМ(ОбъемКузова)
						//Асеев 17.06.2022 (по письму ПМ)<<<
				        |ПО
				        |	Рейс";		
	Иначе
		Возврат "ВЫБРАТЬ
		        |	ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Заказ КАК Заказ,
		        |	ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Рейс КАК Рейс,
		        |	ДополнительныеПараметрыЗаказа.ЛогистическийБрейк КАК КатегорияЗаказа,
		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияС КАК ВремяПрибытияС,
		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияПо КАК ВремяПрибытияПо,
		        |	ДополнительныеПараметрыЗаказа.ЛогистическийБрейк.Код КАК КатегорияЗаказаКод
		        |ПОМЕСТИТЬ ВТ_ИндивидуальнаяМаршрутизация
		        |ИЗ
		        |	РегистрСведений.ИндивидуальнаяМаршрутизацияПоРейсам.СрезПоследних(, ДатаПланирования = &ДатаНач) КАК ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних
		        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
		        |		ПО ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Заказ = ДополнительныеПараметрыЗаказа.Заказ
		        |ГДЕ
		        |	ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Рейс.Ссылка <> ЗНАЧЕНИЕ(Документ.Рейс.ПустаяСсылка)
		        |	И ТИПЗНАЧЕНИЯ(ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Заказ.Ссылка) = ТИП(Документ.РеализацияТоваровУслуг)
		        |
		        |ОБЪЕДИНИТЬ
		        |
		        |ВЫБРАТЬ
		        |	ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Заказ,
		        |	ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Рейс,
		        |	&ЗаборнаяКатегория,
		        |	ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Заказ.ВремяДоставкиС,
		        |	ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Заказ.ВремяДоставкиПо,
		        |	&ЗаборнаяКатегорияКод
		        |ИЗ
		        |	РегистрСведений.ИндивидуальнаяМаршрутизацияПоРейсам.СрезПоследних(, ДатаПланирования = &ДатаНач) КАК ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних
		        |ГДЕ
		        |	ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Рейс.Ссылка <> ЗНАЧЕНИЕ(Документ.Рейс.ПустаяСсылка)
		        |	И ТИПЗНАЧЕНИЯ(ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
		        |;
				//Асеев 29.08.2023 (Задача № 5117)>>>
		        |////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ВложенныйЗапрос.Ссылка КАК Ссылка
				|ПОМЕСТИТЬ ВТ_РТУ
				|ИЗ
				|	(ВЫБРАТЬ
				|		РеализацияТоваровУслуг.Ссылка КАК Ссылка
				|	ИЗ
				|		Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
				|	ГДЕ
				|		РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНач И &ДатаКон
				|		И РеализацияТоваровУслуг.СтатусИнтернетМагазина = 2
				|		И РеализацияТоваровУслуг.ТерминалДоставки = &ТерминалДоставки
				|		И НЕ РеализацияТоваровУслуг.ПометкаУдаления
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		СтатусыПредварительногоЗакрытияРейсовСрезПоследних.Заказ
				|	ИЗ
				|		РегистрСведений.СтатусыПредварительногоЗакрытияРейсов.СрезПоследних КАК СтатусыПредварительногоЗакрытияРейсовСрезПоследних
				|	ГДЕ
				|		СтатусыПредварительногоЗакрытияРейсовСрезПоследних.ДатаДоставкиЗаказа = &ДатаНач
				|		И СтатусыПредварительногоЗакрытияРейсовСрезПоследних.СтатусПредварительногоЗакрытияРейса = ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытПредварительно)
				|		И СтатусыПредварительногоЗакрытияРейсовСрезПоследних.Заказ.ТерминалДоставки = &ТерминалДоставки) КАК ВложенныйЗапрос
				|;
				//Асеев 29.08.2023 (Задача № 5117)<<<
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ВТ_РТУ.Ссылка КАК Заказ,
		        |	ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка) КАК ТипЗаказа,
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
		        |			ТОГДА 1
		        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
		        |			ТОГДА 1
		        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк
		        |	КОНЕЦ КАК КатегорияЗаказа,
		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияС КАК ВремяПрибытияС,
		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияПо КАК ВремяПрибытияПо
				//CeHbKA #3179 #11.06.2019
		        |	,ДополнительныеПараметрыЗаказа.Смена КАК Смена
				//CeHbKA #3179 #11.06.2019
		        |ПОМЕСТИТЬ ВТ_Заказы_1
		        |ИЗ
		        |	ВТ_РТУ КАК ВТ_РТУ
		        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
		        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АктуальнаяСхемаЛогистическихБрейков.СрезПоследних КАК АктуальнаяСхемаЛогистическихБрейковСрезПоследних
		        |			ПО ДополнительныеПараметрыЗаказа.СхемаЛогистическихБрейков.Ссылка = АктуальнаяСхемаЛогистическихБрейковСрезПоследних.СхемаЛогистическихБрейков.Ссылка
		        |		ПО ВТ_РТУ.Ссылка = ДополнительныеПараметрыЗаказа.Заказ.Ссылка
				//|			И (ДополнительныеПараметрыЗаказа.Доставка <> ЗНАЧЕНИЕ(БизнесПроцесс.новаМестнаяДоставка.ПустаяСсылка))
				//CeHbKA #2626 #03.06.2019
				|			И (ДополнительныеПараметрыЗаказа.Доставка <> ЗНАЧЕНИЕ(БизнесПроцесс.новаМестнаяДоставка.ПустаяСсылка)) @СтрокаФильтраСмена11@
				//CeHbKA #2626 #03.06.2019
		        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КорзинаПолигональнойМаршрутизации.СрезПоследних(
		        |				,
		        |				ДатаПланирования = &ДатаНач
		        |					И ТерминалДоставки.Ссылка = &ТерминалДоставки) КАК КорзинаПолигональнойМаршрутизацииСрезПоследних
		        |		ПО (ВТ_РТУ.Ссылка = ВЫРАЗИТЬ(КорзинаПолигональнойМаршрутизацииСрезПоследних.Заказ КАК Документ.РеализацияТоваровУслуг).Ссылка)
		        |			И (КорзинаПолигональнойМаршрутизацииСрезПоследних.ЗаказВКорзине = ИСТИНА)
		        |ГДЕ
						//+Широков 24.06.2021 Задача 4607	
				|			(ДополнительныеПараметрыЗаказа.ВнешнийОператорМаршрутизации.Ссылка ЕСТЬ NULL)
						//-Широков 24.06.2021 Задача 4607	
		        |	И ЕСТЬNULL(КорзинаПолигональнойМаршрутизацииСрезПоследних.Период, ИСТИНА) = ИСТИНА
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ВТ_РТУ.Ссылка,
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
		        |			ТОГДА 1
		        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
		        |			ТОГДА 1
		        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк
		        |	КОНЕЦ,
		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияС,
		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияПо
				//CeHbKA #3179 #11.06.2019
		        |	,ДополнительныеПараметрыЗаказа.Смена
				//CeHbKA #3179 #11.06.2019
		        |
		        |ОБЪЕДИНИТЬ ВСЕ
		        |
		        |ВЫБРАТЬ
		        |	ЗаборТовара.Ссылка,
		        |	ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор),
		        |	&ЗаборнаяКатегория,
		        |	ЗаборТовара.ВремяДоставкиС,
		        |	ЗаборТовара.ВремяДоставкиПо
				//CeHbKA #3179 #11.06.2019
		        |	,Значение(Справочник.Смены.Смена1) КАК Смена
				//CeHbKA #3179 #11.06.2019
		        |ИЗ
		        |	Документ.ЗаборТовара КАК ЗаборТовара
		        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КорзинаПолигональнойМаршрутизации.СрезПоследних(
		        |				,
		        |				ДатаПланирования = &ДатаНач
		        |					И ТерминалДоставки.Ссылка = &ТерминалДоставки) КАК КорзинаПолигональнойМаршрутизацииСрезПоследних
		        |		ПО (ЗаборТовара.Ссылка = ВЫРАЗИТЬ(КорзинаПолигональнойМаршрутизацииСрезПоследних.Заказ КАК Документ.ЗаборТовара).Ссылка)
		        |			И (КорзинаПолигональнойМаршрутизацииСрезПоследних.ЗаказВКорзине = ИСТИНА)
		        |ГДЕ
		        |	ЗаборТовара.Дата МЕЖДУ &ДатаНач И &ДатаКон
		        |	И ЗаборТовара.СтатусИнтернетМагазина = 2
		        |	И ЗаборТовара.ПометкаУдаления = ЛОЖЬ
		        |	И ЗаборТовара.ТерминалДоставки = &ТерминалДоставки
		        |	И ЕСТЬNULL(КорзинаПолигональнойМаршрутизацииСрезПоследних.Период, ИСТИНА) = ИСТИНА
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ЗаборТовара.Ссылка,
		        |	ЗаборТовара.ВремяДоставкиС,
		        |	ЗаборТовара.ВремяДоставкиПо
				//CeHbKA #3179 #11.06.2019
		        |	,Значение(Справочник.Смены.Смена1)
				//CeHbKA #3179 #11.06.2019
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ВТ_Заказы_1.КатегорияЗаказа КАК КатегорияЗаказа,
		        |	ВТ_Заказы_1.КатегорияЗаказа.Код КАК КатегорияЗаказаКод,
		        |	ЕСТЬNULL(ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации, ЗНАЧЕНИЕ(Справочник.ПолигоныМаршрутизации.ПустаяСсылка)) КАК Полигон,
		        |	ВТ_Заказы_1.Заказ КАК Заказ,
		        |	ВТ_Заказы_1.ВремяПрибытияС КАК ВремяПрибытияС,
		        |	ВТ_Заказы_1.ВремяПрибытияПо КАК ВремяПрибытияПо
				//CeHbKA #3179 #11.06.2019
		        |	,ВТ_Заказы_1.Смена КАК Смена
				//CeHbKA #3179 #11.06.2019
		        |ПОМЕСТИТЬ ВТ_Заказы
		        |ИЗ
		        |	ВТ_Заказы_1 КАК ВТ_Заказы_1
		        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПолигоныМаршрутизацииЗаказов.СрезПоследних(, СхемаМаршрутизации.Ссылка = &СхемаМаршрутизации) КАК ПолигоныМаршрутизацииЗаказовСрезПоследних
		        |		ПО ВТ_Заказы_1.Заказ = ПолигоныМаршрутизацииЗаказовСрезПоследних.Заказ
		        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИндивидуальнаяМаршрутизация КАК ВТ_ИндивидуальнаяМаршрутизация
		        |		ПО ВТ_Заказы_1.Заказ = ВТ_ИндивидуальнаяМаршрутизация.Заказ
		        |ГДЕ
		        |	ЕСТЬNULL(ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации, ИСТИНА) <> ИСТИНА
		        |	И ЕСТЬNULL(ВТ_ИндивидуальнаяМаршрутизация.Заказ, ИСТИНА) = ИСТИНА
				//CeHbKA #2626 #21.05.2019
				|	"+?(ТолькоРеализации, "И ВТ_Заказы_1.Заказ ССЫЛКА Документ.РеализацияТоваровУслуг ", "")+"
				//CeHbKA #2626 #21.05.2019						
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ВТ_Заказы_1.КатегорияЗаказа,
		        |	ВТ_Заказы_1.КатегорияЗаказа.Код,
		        |	ЕСТЬNULL(ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации, ЗНАЧЕНИЕ(Справочник.ПолигоныМаршрутизации.ПустаяСсылка)),
		        |	ВТ_Заказы_1.Заказ,
		        |	ВТ_Заказы_1.ВремяПрибытияС,
		        |	ВТ_Заказы_1.ВремяПрибытияПо
				//CeHbKA #3179 #11.06.2019
		        |	,ВТ_Заказы_1.Смена
				//CeHbKA #3179 #11.06.2019
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	РейсДокументДляПараметров.Ссылка КАК Рейс,
		        |	ПолигоныИКатегорииЗаказовДляРейсов.Полигон КАК Полигон,
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ПолигоныИКатегорииЗаказовДляРейсов.КатегорияЗаказа, ИСТИНА) = ИСТИНА
		        |			ТОГДА ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
		        |		КОГДА ПолигоныИКатегорииЗаказовДляРейсов.КатегорияЗаказа = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
		        |			ТОГДА 1
		        |		ИНАЧЕ ПолигоныИКатегорииЗаказовДляРейсов.КатегорияЗаказа
		        |	КОНЕЦ КАК КатегорияЗаказа
				//CeHbKA #3179 #11.06.2019
		        |	,РейсДокументДляПараметров.Ссылка.СменаРейса КАК Смена
				//CeHbKA #3179 #11.06.2019
		        |ПОМЕСТИТЬ ВТ_РейсыСПараметрами
		        |ИЗ
		        |	Документ.Рейс КАК РейсДокументДляПараметров
		        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПолигоныИКатегорииЗаказовДляРейсов КАК ПолигоныИКатегорииЗаказовДляРейсов
		        |		ПО (ПолигоныИКатегорииЗаказовДляРейсов.Рейс = РейсДокументДляПараметров.Ссылка)
				//CeHbKA #3179 #11.06.2019
		        |		И (ПолигоныИКатегорииЗаказовДляРейсов.Смена = РейсДокументДляПараметров.Ссылка.СменаРейса)
				//CeHbKA #3179 #11.06.2019
		        |ГДЕ
		        |	РейсДокументДляПараметров.Проведен = ИСТИНА
		        |	И РейсДокументДляПараметров.ДатаРейса = &ДатаНач
		        |	И РейсДокументДляПараметров.МетодикаМаршрутизации = ЗНАЧЕНИЕ(Перечисление.МетодикаЛогистическойМаршрутизации.ПолигональнаяМаршрутизация)
				|	И РейсДокументДляПараметров.ТерминалДоставки = &ТерминалДоставки @СтрокаФильтраСмена12@
				//CeHbKA #2626 #03.06.2019
		        |	И РейсДокументДляПараметров.ТерминалДоставки = &ТерминалДоставки
				//CeHbKA #2626 #03.06.2019
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	0 КАК Отметка,
		        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт КАК Транспорт,
		        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Код КАК ТранспортКод,
		        |	"""" КАК УИД,
		        |	ЕСТЬNULL(ВТ_Заказы.Заказ.Номер, ИСТИНА) КАК НомерЗаказа, @ДополнениеПоПолям@
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ВТ_Заказы.Заказ, ИСТИНА) = ИСТИНА
		        |			ТОГДА 0
		        |		ИНАЧЕ 1
		        |	КОНЕЦ КАК Итого,
		        |	ПривязкаМашинКРейсамСрезПоследних.Водитель КАК Водитель,
		        |	ВТ_РейсыСПараметрами.Рейс.Ссылка КАК Рейс,
		        |	ВТ_РейсыСПараметрами.Рейс.РольРейса КАК РольРейса,
		        |	ВТ_РейсыСПараметрами.Рейс.СменаРейса КАК СменаРейса,
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации, ИСТИНА) = ИСТИНА
		        |			ТОГДА 40
		        |		КОГДА ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации = 0
		        |			ТОГДА 40
		        |		ИНАЧЕ ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации
		        |	КОНЕЦ КАК МаксимальноеКоличествоЗаказов,
		        |	ЛОЖЬ КАК ИндивидуальнаяМаршрутизация,
		        |	ВТ_Заказы.Заказ.Ссылка КАК ЗаказСсылка,
				//CeHbKA #3847 #24.03.2020
				|	ВЫБОР
		        |		КОГДА ВТ_Заказы.Заказ.Ссылка ССЫЛКА Документ.РеализацияТоваровУслуг
		        |			ТОГДА ВТ_Заказы.Заказ.ДоставкаДеньВДень
		        |		ИНАЧЕ ЛОЖЬ
		        |	КОНЕЦ КАК ДоставкаДеньВДень,
				//CeHbKA #3847 #24.03.2020
				|	ПривязкаМашинКРейсамСрезПоследних.Экспедитор КАК Экспедитор,
		        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Наименование КАК ТранспортНаименование,
		        |	ВТ_Заказы.ВремяПрибытияС КАК ВремяПрибытияС,
		        |	ВТ_Заказы.ВремяПрибытияПо КАК ВремяПрибытияПо,
		        |	ВТ_Заказы.КатегорияЗаказа КАК КатегорияЗаказа,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА 0
		        |		ИНАЧЕ ВТ_Заказы.Заказ.ОбщийВес
		        |	КОНЕЦ КАК ВесЗаказа,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_Заказы.Заказ.Контрагент
		        |		ИНАЧЕ ВТ_Заказы.Заказ.ВладелецТовара
		        |	КОНЕЦ КАК Партнер,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_Заказы.Заказ.ОбъемЗабора
		        |		ИНАЧЕ 0
		        |	КОНЕЦ КАК ОбъемЗабора,
		        |	ЕСТЬNULL(ПроверенныеДокументыСрезПоследних.ДокументПроверен, ЛОЖЬ) КАК ДокументПроверен,
				//Асеев 17.06.2022 (по письму ПМ)>>>
				|	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА 0
		        |		ИНАЧЕ ВТ_Заказы.Заказ.ОбъёмЗаказа
		        |	КОНЕЦ КАК ОбъёмЗаказа,
				|	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Грузоподъемность * 1000 КАК Грузоподъемность,
				|	ПривязкаМашинКРейсамСрезПоследних.Транспорт.ОбъемКузова КАК ОбъемКузова,
				//Асеев 17.06.2022 (по письму ПМ)<<<
				| Выбор когда ЕСТЬNULL(СтатусыПредварительногоЗакрытияРейсовСрезПоследних.СтатусПредварительногоЗакрытияРейса, ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытОкончательно)) = ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытПредварительно) Тогда
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ВТ_Заказы.Заказ, ИСТИНА) = ИСТИНА
		        |			ТОГДА 0
		        |		ИНАЧЕ 1
		        |	КОНЕЦ Иначе 0 Конец КАК ИтогоПредварительно,
				| ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации КАК ПолигонМаршрутизации
		        |ИЗ
		        |	ВТ_РейсыСПараметрами КАК ВТ_РейсыСПараметрами
		        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Заказы КАК ВТ_Заказы
		        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПредварительногоЗакрытияРейсов.СрезПоследних КАК СтатусыПредварительногоЗакрытияРейсовСрезПоследних
		        |			ПО ВТ_Заказы.Заказ = СтатусыПредварительногоЗакрытияРейсовСрезПоследних.Заказ
				|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПолигоныМаршрутизацииЗаказов.СрезПоследних(
				|					,
				//CeHbKA 22.10.2020
				|					СхемаМаршрутизации = &СхемаМаршрутизации И
				//CeHbKA 22.10.2020
				|					Заказ В
				|						(ВЫБРАТЬ
				|							ВТ_Заказы.Заказ КАК Заказ
				|						ИЗ
				|							ВТ_Заказы КАК ВТ_Заказы)) КАК ПолигоныМаршрутизацииЗаказовСрезПоследних
				|		ПО ВТ_Заказы.Заказ = ПолигоныМаршрутизацииЗаказовСрезПоследних.Заказ
				//CeHbKA 22.10.2020
				|			И ПолигоныМаршрутизацииЗаказовСрезПоследних.СхемаМаршрутизации = &СхемаМаршрутизации 			
				//CeHbKA 22.10.2020				
		        |		ПО ВТ_РейсыСПараметрами.Полигон = ВТ_Заказы.Полигон
		        |			И ВТ_РейсыСПараметрами.КатегорияЗаказа = ВТ_Заказы.КатегорияЗаказа
				//CeHbKA #3179 #11.06.2019
		        |			И ВТ_РейсыСПараметрами.Смена = ВТ_Заказы.Смена				
				//CeHbKA #3179 #11.06.2019
		        |			И (ЕСТЬNULL(ВТ_Заказы.Заказ, ИСТИНА) <> ИСТИНА) @СтрокаФильтра@
		        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних КАК ПривязкаМашинКРейсамСрезПоследних
		        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыТранспорта.СрезПоследних КАК ДополнительныеПараметрыТранспортаСрезПоследних
		        |			ПО ПривязкаМашинКРейсамСрезПоследних.Транспорт = ДополнительныеПараметрыТранспортаСрезПоследних.Транспорт
		        |		ПО ВТ_РейсыСПараметрами.Рейс = ПривязкаМашинКРейсамСрезПоследних.Рейс @СтрокаФильтраВодителей@
		        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПроверенныеДокументы.СрезПоследних КАК ПроверенныеДокументыСрезПоследних
		        |		ПО ВТ_РейсыСПараметрами.Рейс = ПроверенныеДокументыСрезПоследних.Документ
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ЕСТЬNULL(ВТ_Заказы.Заказ.Номер, ИСТИНА), @ДополнениеПоПолямГруппировки@
		        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт,
		        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Код,
		        |	ПривязкаМашинКРейсамСрезПоследних.Водитель,
		        |	ВТ_РейсыСПараметрами.Рейс.Ссылка,
		        |	ВТ_РейсыСПараметрами.Рейс.РольРейса,
		        |	ВТ_РейсыСПараметрами.Рейс.СменаРейса,
		        |	ЕСТЬNULL(ВТ_РейсыСПараметрами.Полигон, """"),
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ВТ_Заказы.Заказ, ИСТИНА) = ИСТИНА
		        |			ТОГДА 0
		        |		ИНАЧЕ 1
		        |	КОНЕЦ,
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации, ИСТИНА) = ИСТИНА
		        |			ТОГДА 40
		        |		КОГДА ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации = 0
		        |			ТОГДА 40
		        |		ИНАЧЕ ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации
		        |	КОНЕЦ,
		        |	ВТ_Заказы.Заказ.Ссылка,
				//CeHbKA #3847 #24.03.2020
				|	ВЫБОР
		        |		КОГДА ВТ_Заказы.Заказ.Ссылка ССЫЛКА Документ.РеализацияТоваровУслуг
		        |			ТОГДА ВТ_Заказы.Заказ.ДоставкаДеньВДень
		        |		ИНАЧЕ ЛОЖЬ
		        |	КОНЕЦ,
				//CeHbKA #3847 #24.03.2020
		        |	ПривязкаМашинКРейсамСрезПоследних.Экспедитор,
		        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Наименование,
		        |	ВТ_Заказы.ВремяПрибытияС,
		        |	ВТ_Заказы.ВремяПрибытияПо,
		        |	ВТ_Заказы.КатегорияЗаказа,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА 0
		        |		ИНАЧЕ ВТ_Заказы.Заказ.ОбщийВес
		        |	КОНЕЦ,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_Заказы.Заказ.Контрагент
		        |		ИНАЧЕ ВТ_Заказы.Заказ.ВладелецТовара
		        |	КОНЕЦ,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_Заказы.Заказ.ОбъемЗабора
		        |		ИНАЧЕ 0
		        |	КОНЕЦ,
		        |	ЕСТЬNULL(ПроверенныеДокументыСрезПоследних.ДокументПроверен, ЛОЖЬ),
				//Асеев 17.06.2022 (по письму ПМ)>>>
				|	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА 0
		        |		ИНАЧЕ ВТ_Заказы.Заказ.ОбъёмЗаказа
		        |	КОНЕЦ,
				|	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Грузоподъемность * 1000,
				|	ПривязкаМашинКРейсамСрезПоследних.Транспорт.ОбъемКузова,
				//Асеев 17.06.2022 (по письму ПМ)<<<
				| Выбор когда ЕСТЬNULL(СтатусыПредварительногоЗакрытияРейсовСрезПоследних.СтатусПредварительногоЗакрытияРейса, ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытОкончательно)) = ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытПредварительно) Тогда
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ВТ_Заказы.Заказ, ИСТИНА) = ИСТИНА
		        |			ТОГДА 0
		        |		ИНАЧЕ 1
		        |	КОНЕЦ Иначе 0 Конец,				
		        |   ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации
				|
		        |ОБЪЕДИНИТЬ ВСЕ
		        |
		        |ВЫБРАТЬ
		        |	0,
		        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт,
		        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Код,
		        |	"""",
		        |	ЕСТЬNULL(ВТ_ИндивидуальнаяМаршрутизация.Заказ.Номер, ИСТИНА), @ДополнениеПоПолямВторое@
		        |	1,
		        |	ПривязкаМашинКРейсамСрезПоследних.Водитель,
		        |	ВТ_РейсыСПараметрами.Рейс.Ссылка,
		        |	ВТ_РейсыСПараметрами.Рейс.РольРейса,
		        |	ВТ_РейсыСПараметрами.Рейс.СменаРейса,
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации, ИСТИНА) = ИСТИНА
		        |			ТОГДА 40
		        |		КОГДА ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации = 0
		        |			ТОГДА 40
		        |		ИНАЧЕ ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации
		        |	КОНЕЦ,
		        |	ИСТИНА,
		        |	ВТ_ИндивидуальнаяМаршрутизация.Заказ.Ссылка,
				//CeHbKA #3847 #24.03.2020
				|	ВЫБОР
		        |		КОГДА ВТ_ИндивидуальнаяМаршрутизация.Заказ.Ссылка ССЫЛКА Документ.РеализацияТоваровУслуг
		        |			ТОГДА ВТ_ИндивидуальнаяМаршрутизация.Заказ.ДоставкаДеньВДень
		        |		ИНАЧЕ ЛОЖЬ
		        |	КОНЕЦ КАК ДоставкаДеньВДень,
				//CeHbKA #3847 #24.03.2020
		        |	ПривязкаМашинКРейсамСрезПоследних.Экспедитор,
		        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Наименование,
		        |	ВТ_ИндивидуальнаяМаршрутизация.ВремяПрибытияС,
		        |	ВТ_ИндивидуальнаяМаршрутизация.ВремяПрибытияПо,
		        |	ВТ_ИндивидуальнаяМаршрутизация.КатегорияЗаказа,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ИндивидуальнаяМаршрутизация.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА 0
		        |		ИНАЧЕ ВТ_ИндивидуальнаяМаршрутизация.Заказ.ОбщийВес
		        |	КОНЕЦ,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ИндивидуальнаяМаршрутизация.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_ИндивидуальнаяМаршрутизация.Заказ.Контрагент
		        |		ИНАЧЕ ВТ_ИндивидуальнаяМаршрутизация.Заказ.ВладелецТовара
		        |	КОНЕЦ,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ИндивидуальнаяМаршрутизация.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_ИндивидуальнаяМаршрутизация.Заказ.ОбъемЗабора
		        |		ИНАЧЕ 0
		        |	КОНЕЦ,
		        |	ЕСТЬNULL(ПроверенныеДокументыСрезПоследних.ДокументПроверен, ЛОЖЬ),
				//Асеев 17.06.2022 (по письму ПМ)>>>
				|	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ИндивидуальнаяМаршрутизация.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА 0
		        |		ИНАЧЕ ВТ_ИндивидуальнаяМаршрутизация.Заказ.ОбъёмЗаказа
		        |	КОНЕЦ КАК ОбъёмЗаказа,
				|	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Грузоподъемность * 1000 КАК Грузоподъемность,
				|	ПривязкаМашинКРейсамСрезПоследних.Транспорт.ОбъемКузова КАК ОбъемКузова,
				//Асеев 17.06.2022 (по письму ПМ)<<<
				| Выбор когда ЕСТЬNULL(СтатусыПредварительногоЗакрытияРейсовСрезПоследних.СтатусПредварительногоЗакрытияРейса, ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытОкончательно)) = ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытПредварительно) Тогда
		   		| 1 Иначе 0 Конец,
				|	ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации
		        |ИЗ
		        |	ВТ_РейсыСПараметрами КАК ВТ_РейсыСПараметрами
		        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних(, ) КАК ПривязкаМашинКРейсамСрезПоследних
		        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыТранспорта.СрезПоследних КАК ДополнительныеПараметрыТранспортаСрезПоследних
		        |			ПО ПривязкаМашинКРейсамСрезПоследних.Транспорт = ДополнительныеПараметрыТранспортаСрезПоследних.Транспорт
		        |		ПО ВТ_РейсыСПараметрами.Рейс = ПривязкаМашинКРейсамСрезПоследних.Рейс
		        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ИндивидуальнаяМаршрутизация КАК ВТ_ИндивидуальнаяМаршрутизация
		        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПредварительногоЗакрытияРейсов.СрезПоследних КАК СтатусыПредварительногоЗакрытияРейсовСрезПоследних
		        |			ПО ВТ_ИндивидуальнаяМаршрутизация.Заказ = СтатусыПредварительногоЗакрытияРейсовСрезПоследних.Заказ
				|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПолигоныМаршрутизацииЗаказов.СрезПоследних(
				|			        ,
				//CeHbKA 22.10.2020
				|					СхемаМаршрутизации = &СхемаМаршрутизации И
				//CeHbKA 22.10.2020
				|			        Заказ В
				|			            (ВЫБРАТЬ
				|						    ВТ_ИндивидуальнаяМаршрутизация.Заказ КАК Заказ
				|						ИЗ
				|							ВТ_ИндивидуальнаяМаршрутизация КАК ВТ_ИндивидуальнаяМаршрутизация)) КАК ПолигоныМаршрутизацииЗаказовСрезПоследних
				|			ПО ВТ_ИндивидуальнаяМаршрутизация.Заказ = ПолигоныМаршрутизацииЗаказовСрезПоследних.Заказ				
				//CeHbKA 22.10.2020
				|			И ПолигоныМаршрутизацииЗаказовСрезПоследних.СхемаМаршрутизации = &СхемаМаршрутизации 			
				//CeHbKA 22.10.2020				
				|		ПО ВТ_РейсыСПараметрами.Рейс = ВТ_ИндивидуальнаяМаршрутизация.Рейс @СтрокаФильтраВторая@
		        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПроверенныеДокументы.СрезПоследних КАК ПроверенныеДокументыСрезПоследних
		        |		ПО ВТ_РейсыСПараметрами.Рейс = ПроверенныеДокументыСрезПоследних.Документ
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт,
		        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Код,
		        |	ЕСТЬNULL(ВТ_ИндивидуальнаяМаршрутизация.Заказ.Номер, ИСТИНА), @ДополнениеПоПолямГруппировкиВторое@
		        |	ПривязкаМашинКРейсамСрезПоследних.Водитель,
		        |	ВТ_РейсыСПараметрами.Рейс.Ссылка,
		        |	ВТ_РейсыСПараметрами.Рейс.РольРейса,
		        |	ВТ_РейсыСПараметрами.Рейс.СменаРейса,
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации, ИСТИНА) = ИСТИНА
		        |			ТОГДА 40
		        |		КОГДА ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации = 0
		        |			ТОГДА 40
		        |		ИНАЧЕ ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации
		        |	КОНЕЦ,
		        |	ВТ_ИндивидуальнаяМаршрутизация.Заказ.Ссылка,
				//CeHbKA #3847 #24.03.2020
				|	ВЫБОР
		        |		КОГДА ВТ_ИндивидуальнаяМаршрутизация.Заказ.Ссылка ССЫЛКА Документ.РеализацияТоваровУслуг
		        |			ТОГДА ВТ_ИндивидуальнаяМаршрутизация.Заказ.ДоставкаДеньВДень
		        |		ИНАЧЕ ЛОЖЬ
		        |	КОНЕЦ,
				//CeHbKA #3847 #24.03.2020
		        |	ПривязкаМашинКРейсамСрезПоследних.Экспедитор,
		        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Наименование,
		        |	ВТ_ИндивидуальнаяМаршрутизация.КатегорияЗаказа,
		        |	ВТ_ИндивидуальнаяМаршрутизация.ВремяПрибытияС,
		        |	ВТ_ИндивидуальнаяМаршрутизация.ВремяПрибытияПо,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ИндивидуальнаяМаршрутизация.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА 0
		        |		ИНАЧЕ ВТ_ИндивидуальнаяМаршрутизация.Заказ.ОбщийВес
		        |	КОНЕЦ,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ИндивидуальнаяМаршрутизация.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_ИндивидуальнаяМаршрутизация.Заказ.Контрагент
		        |		ИНАЧЕ ВТ_ИндивидуальнаяМаршрутизация.Заказ.ВладелецТовара
		        |	КОНЕЦ,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ИндивидуальнаяМаршрутизация.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_ИндивидуальнаяМаршрутизация.Заказ.ОбъемЗабора
		        |		ИНАЧЕ 0
		        |	КОНЕЦ,
		        |	ЕСТЬNULL(ПроверенныеДокументыСрезПоследних.ДокументПроверен, ЛОЖЬ),
				//Асеев 17.06.2022 (по письму ПМ)>>>
				|	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ИндивидуальнаяМаршрутизация.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА 0
		        |		ИНАЧЕ ВТ_ИндивидуальнаяМаршрутизация.Заказ.ОбъёмЗаказа
		        |	КОНЕЦ,
				|	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Грузоподъемность * 1000,
				|	ПривязкаМашинКРейсамСрезПоследних.Транспорт.ОбъемКузова,
				//Асеев 17.06.2022 (по письму ПМ)<<<
				| Выбор когда ЕСТЬNULL(СтатусыПредварительногоЗакрытияРейсовСрезПоследних.СтатусПредварительногоЗакрытияРейса, ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытОкончательно)) = ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытПредварительно) Тогда
		   		| 1 Иначе 0 Конец,
				|  ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации
		        |
		        |УПОРЯДОЧИТЬ ПО
		        |	ТранспортНаименование
		        |ИТОГИ
		        |	МИНИМУМ(Отметка),
				|	МИНИМУМ(ДокументПроверен),
		        |	МАКСИМУМ(Транспорт),
		        |	МАКСИМУМ(ТранспортКод),
		        |	СУММА(Итого),
		        |	МАКСИМУМ(Водитель),
		        |	МАКСИМУМ(РольРейса), 
				|	МАКСИМУМ(СменаРейса), @ДополнениеПоПолямИтогов@
		        |	МАКСИМУМ(МаксимальноеКоличествоЗаказов),
		        |	МАКСИМУМ(Экспедитор),
		        |	МАКСИМУМ(ТранспортНаименование),
		        |	СУММА(ВесЗаказа),
				|	СУММА(ИтогоПредварительно),
		        |	СУММА(ОбъемЗабора),
				//Асеев 17.06.2022 (по письму ПМ)>>>
				|	СУММА(ОбъёмЗаказа),
				|	МАКСИМУМ(Грузоподъемность),
				|	МАКСИМУМ(ОбъемКузова)
				//Асеев 17.06.2022 (по письму ПМ)<<<
		        |ПО
		        |	Рейс";
	КонецЕсли;	
	
КонецФункции	

//CeHbKA #3663 25.11.2019
Функция ТекстЗапросаПоДеревуРейсов_БезЗаказов(МаршрутизацияЗакрыта, ТолькоРеализации)
	Если МаршрутизацияЗакрыта Тогда
				Возврат "ВЫБРАТЬ
				        |	РеализацияТоваровУслуг.Ссылка КАК Заказ,
				        |	ВЫБОР
				        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
				        |			ТОГДА 1
				        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
				        |			ТОГДА 1
				        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк
				        |	КОНЕЦ КАК КатегорияЗаказа,
				        |	РейсЗаказы.Ссылка КАК Рейс,
				        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияС КАК ВремяПрибытияС,
				        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияПо КАК ВремяПрибытияПо,
				        |	ВЫБОР
				        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
				        |			ТОГДА 1
				        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
				        |			ТОГДА 1
				        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк.Код
				        |	КОНЕЦ КАК КатегорияЗаказаКод
				        |ПОМЕСТИТЬ ВТ_Заказы
				        |ИЗ
				        |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
				        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
				        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АктуальнаяСхемаЛогистическихБрейков.СрезПоследних КАК АктуальнаяСхемаЛогистическихБрейковСрезПоследних
				        |			ПО ДополнительныеПараметрыЗаказа.СхемаЛогистическихБрейков.Ссылка = АктуальнаяСхемаЛогистическихБрейковСрезПоследних.СхемаЛогистическихБрейков.Ссылка
				        |		ПО РеализацияТоваровУслуг.Ссылка = ДополнительныеПараметрыЗаказа.Заказ.Ссылка
						//|			И (ДополнительныеПараметрыЗаказа.Доставка <> ЗНАЧЕНИЕ(БизнесПроцесс.новаМестнаяДоставка.ПустаяСсылка))
						//CeHbKA #2626 #03.06.2019
						|			И (ДополнительныеПараметрыЗаказа.Доставка <> ЗНАЧЕНИЕ(БизнесПроцесс.новаМестнаяДоставка.ПустаяСсылка)) @СтрокаФильтраСмена11@
						//CeHbKA #2626 #03.06.2019
				        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Рейс.Заказы КАК РейсЗаказы
				        |		ПО (РеализацияТоваровУслуг.Ссылка = (ВЫРАЗИТЬ(РейсЗаказы.Заказ КАК Документ.РеализацияТоваровУслуг)))
				        |ГДЕ
				        |	РейсЗаказы.Ссылка.ДатаРейса = &ДатаНач
						//+Широков 24.06.2021 Задача 4607	
						|			И (ДополнительныеПараметрыЗаказа.ВнешнийОператорМаршрутизации.Ссылка ЕСТЬ NULL)
						//-Широков 24.06.2021 Задача 4607	
				        |	И РейсЗаказы.Ссылка.Проведен = ИСТИНА
				        |	И РейсЗаказы.УдаленИзРейса = ЛОЖЬ
				        |	И РейсЗаказы.Ссылка.ТерминалДоставки = &ТерминалДоставки
				        |
				        |СГРУППИРОВАТЬ ПО
				        |	РеализацияТоваровУслуг.Ссылка,
				        |	ВЫБОР
				        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
				        |			ТОГДА 1
				        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
				        |			ТОГДА 1
				        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк
				        |	КОНЕЦ,
				        |	РейсЗаказы.Ссылка,
				        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияС,
				        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияПо,
				        |	ВЫБОР
				        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
				        |			ТОГДА 1
				        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
				        |			ТОГДА 1
				        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк.Код
				        |	КОНЕЦ
				        |
				        |ОБЪЕДИНИТЬ ВСЕ
				        |
				        |ВЫБРАТЬ
				        |	ЗаборТовара.Ссылка,
				        |	&ЗаборнаяКатегория,
				        |	РейсЗаказы.Ссылка,
				        |	ЗаборТовара.ВремяДоставкиС,
				        |	ЗаборТовара.ВремяДоставкиПо,
				        |	&ЗаборнаяКатегорияКод
				        |ИЗ
				        |	Документ.Рейс.Заказы КАК РейсЗаказы
				        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаборТовара КАК ЗаборТовара
				        |		ПО ((ВЫРАЗИТЬ(РейсЗаказы.Заказ КАК Документ.ЗаборТовара)) = ЗаборТовара.Ссылка)
				        |ГДЕ
				        |	РейсЗаказы.Ссылка.Проведен = ИСТИНА
				        |	И РейсЗаказы.Ссылка.ДатаРейса = &ДатаНач
				        |	И РейсЗаказы.УдаленИзРейса = ЛОЖЬ
				        |	И РейсЗаказы.Ссылка.ТерминалДоставки = &ТерминалДоставки
				        |;
				        |
				        |////////////////////////////////////////////////////////////////////////////////
				        |ВЫБРАТЬ
				        |	РейсДокументДляПараметров.Ссылка КАК Рейс
				        |ПОМЕСТИТЬ ВТ_РейсыСПараметрами
				        |ИЗ
				        |	Документ.Рейс КАК РейсДокументДляПараметров
				        |ГДЕ
				        |	РейсДокументДляПараметров.Проведен = ИСТИНА
				        |	И РейсДокументДляПараметров.ДатаРейса = &ДатаНач
						//|	И РейсДокументДляПараметров.ТерминалДоставки = &ТерминалДоставки @СтрокаФильтраСмена@
						//CeHbKA #2626 #03.06.2019
						|	И РейсДокументДляПараметров.ТерминалДоставки = &ТерминалДоставки @СтрокаФильтраСмена12@
						//CeHbKA #2626 #03.06.2019
				        |;
				        |
				        |////////////////////////////////////////////////////////////////////////////////
				        |ВЫБРАТЬ
				        |	0 КАК Отметка,
				        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт КАК Транспорт,
				        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Код КАК ТранспортКод,
				        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Наименование КАК ТранспортНаименование,
				        |	ЕСТЬNULL(ВТ_Заказы.Заказ.Номер, ИСТИНА) КАК НомерЗаказа,@ДополнениеПоПолям@
				        |	ВЫБОР
				        |		КОГДА ЕСТЬNULL(ВТ_Заказы.Заказ, ИСТИНА) = ИСТИНА
				        |			ТОГДА 0
				        |		ИНАЧЕ 1
				        |	КОНЕЦ КАК Итого,
				        |	ПривязкаМашинКРейсамСрезПоследних.Водитель КАК Водитель,
				        |	ВТ_РейсыСПараметрами.Рейс.Ссылка КАК Рейс,
				        |	ВТ_РейсыСПараметрами.Рейс.РольРейса КАК РольРейса,
				        |	ВТ_РейсыСПараметрами.Рейс.СменаРейса КАК СменаРейса,
				        |	ВЫБОР
				        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации, ИСТИНА) = ИСТИНА
				        |			ТОГДА 40
				        |		КОГДА ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации = 0
				        |			ТОГДА 40
				        |		ИНАЧЕ ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации
				        |	КОНЕЦ КАК МаксимальноеКоличествоЗаказов,
				        |	ЛОЖЬ КАК ИндивидуальнаяМаршрутизация,
				        |	ВТ_Заказы.Заказ.Ссылка КАК ЗаказСсылка,
				        |	ПривязкаМашинКРейсамСрезПоследних.Экспедитор КАК Экспедитор,
				        |	ВЫБОР
				        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
				        |			ТОГДА 0
				        |		ИНАЧЕ ВТ_Заказы.Заказ.ОбщийВес
				        |	КОНЕЦ КАК ВесЗаказа,
				        |	ВЫБОР
				        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
				        |			ТОГДА ВТ_Заказы.Заказ.Контрагент
				        |		ИНАЧЕ ВТ_Заказы.Заказ.ВладелецТовара
				        |	КОНЕЦ КАК Партнер,
				        |	ВТ_Заказы.ВремяПрибытияС КАК ВремяПрибытияС,
				        |	ВТ_Заказы.ВремяПрибытияПо КАК ВремяПрибытияПо,
				        |	ВЫБОР
				        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
				        |			ТОГДА ВТ_Заказы.Заказ.ОбъемЗабора
				        |		ИНАЧЕ 0
				        |	КОНЕЦ КАК ОбъемЗабора,
				        |	"""" КАК УИД,
				        |	ВТ_Заказы.КатегорияЗаказа КАК КатегорияЗаказа,
				        |	ЕСТЬNULL(ПроверенныеДокументыСрезПоследних.ДокументПроверен, ЛОЖЬ) КАК ДокументПроверен
				        |ПОМЕСТИТЬ ВТ_Финал
						|ИЗ
				        |	ВТ_РейсыСПараметрами КАК ВТ_РейсыСПараметрами
				        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Заказы КАК ВТ_Заказы
				        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПредварительногоЗакрытияРейсов.СрезПоследних КАК СтатусыПредварительногоЗакрытияРейсовСрезПоследних
				        |			ПО ВТ_Заказы.Заказ = СтатусыПредварительногоЗакрытияРейсовСрезПоследних.Заказ
				        |		ПО ВТ_РейсыСПараметрами.Рейс = ВТ_Заказы.Рейс @СтрокаФильтра@
				        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних КАК ПривязкаМашинКРейсамСрезПоследних
				        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыТранспорта.СрезПоследних КАК ДополнительныеПараметрыТранспортаСрезПоследних
				        |			ПО ПривязкаМашинКРейсамСрезПоследних.Транспорт.Ссылка = ДополнительныеПараметрыТранспортаСрезПоследних.Транспорт.Ссылка
				        |		ПО ВТ_РейсыСПараметрами.Рейс.Ссылка = ПривязкаМашинКРейсамСрезПоследних.Рейс.Ссылка @СтрокаФильтраВодителей@
				        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПроверенныеДокументы.СрезПоследних КАК ПроверенныеДокументыСрезПоследних
				        |		ПО ВТ_РейсыСПараметрами.Рейс = ПроверенныеДокументыСрезПоследних.Документ
						//CeHbKA #2626 #21.05.2019
				        |"+?(ТолькоРеализации, "ГДЕ ВТ_Заказы.Заказ ССЫЛКА Документ.РеализацияТоваровУслуг ", "")+"
						//CeHbKA #2626 #21.05.2019						
						|
				        |СГРУППИРОВАТЬ ПО
				        |	ЕСТЬNULL(ВТ_Заказы.Заказ.Номер, ИСТИНА), @ДополнениеПоПолямГруппировки@
				        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт,
				        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Код,
				        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Наименование,
				        |	ПривязкаМашинКРейсамСрезПоследних.Водитель,
				        |	ВТ_РейсыСПараметрами.Рейс.Ссылка,
				        |	ВТ_РейсыСПараметрами.Рейс.РольРейса,
				        |	ВТ_РейсыСПараметрами.Рейс.СменаРейса, 
				        |	ВЫБОР
				        |		КОГДА ЕСТЬNULL(ВТ_Заказы.Заказ, ИСТИНА) = ИСТИНА
				        |			ТОГДА 0
				        |		ИНАЧЕ 1
				        |	КОНЕЦ,
				        |	ВЫБОР
				        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации, ИСТИНА) = ИСТИНА
				        |			ТОГДА 40
				        |		КОГДА ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации = 0
				        |			ТОГДА 40
				        |		ИНАЧЕ ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации
				        |	КОНЕЦ,
				        |	ВТ_Заказы.Заказ.Ссылка,
				        |	ПривязкаМашинКРейсамСрезПоследних.Экспедитор,
				        |	ВЫБОР
				        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
				        |			ТОГДА 0
				        |		ИНАЧЕ ВТ_Заказы.Заказ.ОбщийВес
				        |	КОНЕЦ,
				        |	ВЫБОР
				        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
				        |			ТОГДА ВТ_Заказы.Заказ.Контрагент
				        |		ИНАЧЕ ВТ_Заказы.Заказ.ВладелецТовара
				        |	КОНЕЦ,
				        |	ВТ_Заказы.ВремяПрибытияС,
				        |	ВТ_Заказы.ВремяПрибытияПо,
				        |	ВТ_Заказы.КатегорияЗаказа,
				        |	ВЫБОР
				        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
				        |			ТОГДА ВТ_Заказы.Заказ.ОбъемЗабора
				        |		ИНАЧЕ 0
				        |	КОНЕЦ,
				        |	ЕСТЬNULL(ПроверенныеДокументыСрезПоследних.ДокументПроверен, ЛОЖЬ)
				        |;
				        |
				        |////////////////////////////////////////////////////////////////////////////////
				        |ВЫБРАТЬ
				        |	Рейс,
				        |	МИНИМУМ(Отметка),
				        |	МАКСИМУМ(Транспорт),
				        |	МАКСИМУМ(ТранспортКод),
				        |	МАКСИМУМ(ТранспортНаименование),
						|	"""" КАК НомерЗаказа,
				        |	СУММА(Итого),
						|	МИНИМУМ(ДокументПроверен),
				        |	МАКСИМУМ(Водитель),
				        |	МАКСИМУМ(РольРейса),  
				        |	МАКСИМУМ(СменаРейса),  @ДополнениеПоПолямИтогов@
				        |	МАКСИМУМ(МаксимальноеКоличествоЗаказов)
				        |
				        |ИЗ ВТ_Финал КАК ВТ_Финал
				        |
				        |СГРУППИРОВАТЬ ПО
				        |	Рейс,
				        |	Транспорт
				        |
				        |УПОРЯДОЧИТЬ ПО
				        |	Транспорт.Наименование";
						
	Иначе
		Возврат "ВЫБРАТЬ
		        |	ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Заказ КАК Заказ,
		        |	ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Рейс КАК Рейс,
		        |	ДополнительныеПараметрыЗаказа.ЛогистическийБрейк КАК КатегорияЗаказа,
		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияС КАК ВремяПрибытияС,
		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияПо КАК ВремяПрибытияПо,
		        |	ДополнительныеПараметрыЗаказа.ЛогистическийБрейк.Код КАК КатегорияЗаказаКод
		        |ПОМЕСТИТЬ ВТ_ИндивидуальнаяМаршрутизация
		        |ИЗ
		        |	РегистрСведений.ИндивидуальнаяМаршрутизацияПоРейсам.СрезПоследних(, ДатаПланирования = &ДатаНач) КАК ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних
		        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
		        |		ПО ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Заказ = ДополнительныеПараметрыЗаказа.Заказ
		        |ГДЕ
		        |	ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Рейс.Ссылка <> ЗНАЧЕНИЕ(Документ.Рейс.ПустаяСсылка)
		        |	И ТИПЗНАЧЕНИЯ(ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Заказ.Ссылка) = ТИП(Документ.РеализацияТоваровУслуг)
		        |
		        |ОБЪЕДИНИТЬ
		        |
		        |ВЫБРАТЬ
		        |	ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Заказ,
		        |	ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Рейс,
		        |	&ЗаборнаяКатегория,
		        |	ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Заказ.ВремяДоставкиС,
		        |	ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Заказ.ВремяДоставкиПо,
		        |	&ЗаборнаяКатегорияКод
		        |ИЗ
		        |	РегистрСведений.ИндивидуальнаяМаршрутизацияПоРейсам.СрезПоследних(, ДатаПланирования = &ДатаНач) КАК ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних
		        |ГДЕ
		        |	ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Рейс.Ссылка <> ЗНАЧЕНИЕ(Документ.Рейс.ПустаяСсылка)
		        |	И ТИПЗНАЧЕНИЯ(ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
		        |;
				//Асеев 29.08.2023 (Задача № 5117)>>>
		        |////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ВложенныйЗапрос.Ссылка КАК Ссылка
				|ПОМЕСТИТЬ ВТ_РТУ
				|ИЗ
				|	(ВЫБРАТЬ
				|		РеализацияТоваровУслуг.Ссылка КАК Ссылка
				|	ИЗ
				|		Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
				|	ГДЕ
				|		РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНач И &ДатаКон
				|		И РеализацияТоваровУслуг.СтатусИнтернетМагазина = 2
				|		И РеализацияТоваровУслуг.ТерминалДоставки = &ТерминалДоставки
				|		И НЕ РеализацияТоваровУслуг.ПометкаУдаления
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		СтатусыПредварительногоЗакрытияРейсовСрезПоследних.Заказ
				|	ИЗ
				|		РегистрСведений.СтатусыПредварительногоЗакрытияРейсов.СрезПоследних КАК СтатусыПредварительногоЗакрытияРейсовСрезПоследних
				|	ГДЕ
				|		СтатусыПредварительногоЗакрытияРейсовСрезПоследних.ДатаДоставкиЗаказа = &ДатаНач
				|		И СтатусыПредварительногоЗакрытияРейсовСрезПоследних.СтатусПредварительногоЗакрытияРейса = ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытПредварительно)
				|		И СтатусыПредварительногоЗакрытияРейсовСрезПоследних.Заказ.ТерминалДоставки = &ТерминалДоставки) КАК ВложенныйЗапрос
				|;
				//Асеев 29.08.2023 (Задача № 5117)<<<
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ВТ_РТУ.Ссылка КАК Заказ,
		        |	ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка) КАК ТипЗаказа,
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
		        |			ТОГДА 1
		        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
		        |			ТОГДА 1
		        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк
		        |	КОНЕЦ КАК КатегорияЗаказа,
		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияС КАК ВремяПрибытияС,
		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияПо КАК ВремяПрибытияПо
				//CeHbKA #3179 #11.06.2019
		        |	,ДополнительныеПараметрыЗаказа.Смена КАК Смена
				//CeHbKA #3179 #11.06.2019
		        |ПОМЕСТИТЬ ВТ_Заказы_1
		        |ИЗ
		        |	ВТ_РТУ КАК ВТ_РТУ
		        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
		        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АктуальнаяСхемаЛогистическихБрейков.СрезПоследних КАК АктуальнаяСхемаЛогистическихБрейковСрезПоследних
		        |			ПО ДополнительныеПараметрыЗаказа.СхемаЛогистическихБрейков.Ссылка = АктуальнаяСхемаЛогистическихБрейковСрезПоследних.СхемаЛогистическихБрейков.Ссылка
		        |		ПО ВТ_РТУ.Ссылка = ДополнительныеПараметрыЗаказа.Заказ.Ссылка
				//|			И (ДополнительныеПараметрыЗаказа.Доставка <> ЗНАЧЕНИЕ(БизнесПроцесс.новаМестнаяДоставка.ПустаяСсылка))
				//CeHbKA #2626 #03.06.2019
				|			И (ДополнительныеПараметрыЗаказа.Доставка <> ЗНАЧЕНИЕ(БизнесПроцесс.новаМестнаяДоставка.ПустаяСсылка)) @СтрокаФильтраСмена11@
				//CeHbKA #2626 #03.06.2019
		        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КорзинаПолигональнойМаршрутизации.СрезПоследних(
		        |				,
		        |				ДатаПланирования = &ДатаНач
		        |					И ТерминалДоставки.Ссылка = &ТерминалДоставки) КАК КорзинаПолигональнойМаршрутизацииСрезПоследних
		        |		ПО (ВТ_РТУ.Ссылка = ВЫРАЗИТЬ(КорзинаПолигональнойМаршрутизацииСрезПоследних.Заказ КАК Документ.РеализацияТоваровУслуг).Ссылка)
		        |			И (КорзинаПолигональнойМаршрутизацииСрезПоследних.ЗаказВКорзине = ИСТИНА)
		        |ГДЕ
						//+Широков 24.06.2021 Задача 4607	
				|			(ДополнительныеПараметрыЗаказа.ВнешнийОператорМаршрутизации.Ссылка ЕСТЬ NULL)
					//-Широков 24.06.2021 Задача 4607	
		        |	И ЕСТЬNULL(КорзинаПолигональнойМаршрутизацииСрезПоследних.Период, ИСТИНА) = ИСТИНА
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ВТ_РТУ.Ссылка,
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
		        |			ТОГДА 1
		        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
		        |			ТОГДА 1
		        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк
		        |	КОНЕЦ,
		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияС,
		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияПо
				//CeHbKA #3179 #11.06.2019
		        |	,ДополнительныеПараметрыЗаказа.Смена
				//CeHbKA #3179 #11.06.2019
		        |
		        |ОБЪЕДИНИТЬ ВСЕ
		        |
		        |ВЫБРАТЬ
		        |	ЗаборТовара.Ссылка,
		        |	ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор),
		        |	&ЗаборнаяКатегория,
		        |	ЗаборТовара.ВремяДоставкиС,
		        |	ЗаборТовара.ВремяДоставкиПо
				//CeHbKA #3179 #11.06.2019
		        |	,Значение(Справочник.Смены.Смена1) КАК Смена
				//CeHbKA #3179 #11.06.2019
		        |ИЗ
		        |	Документ.ЗаборТовара КАК ЗаборТовара
		        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КорзинаПолигональнойМаршрутизации.СрезПоследних(
		        |				,
		        |				ДатаПланирования = &ДатаНач
		        |					И ТерминалДоставки.Ссылка = &ТерминалДоставки) КАК КорзинаПолигональнойМаршрутизацииСрезПоследних
		        |		ПО (ЗаборТовара.Ссылка = ВЫРАЗИТЬ(КорзинаПолигональнойМаршрутизацииСрезПоследних.Заказ КАК Документ.ЗаборТовара).Ссылка)
		        |			И (КорзинаПолигональнойМаршрутизацииСрезПоследних.ЗаказВКорзине = ИСТИНА)
		        |ГДЕ
		        |	ЗаборТовара.Дата МЕЖДУ &ДатаНач И &ДатаКон
		        |	И ЗаборТовара.СтатусИнтернетМагазина = 2
		        |	И ЗаборТовара.ПометкаУдаления = ЛОЖЬ
		        |	И ЗаборТовара.ТерминалДоставки = &ТерминалДоставки
		        |	И ЕСТЬNULL(КорзинаПолигональнойМаршрутизацииСрезПоследних.Период, ИСТИНА) = ИСТИНА
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ЗаборТовара.Ссылка,
		        |	ЗаборТовара.ВремяДоставкиС,
		        |	ЗаборТовара.ВремяДоставкиПо
				//CeHbKA #3179 #11.06.2019
		        |	,Значение(Справочник.Смены.Смена1)
				//CeHbKA #3179 #11.06.2019
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ВТ_Заказы_1.КатегорияЗаказа КАК КатегорияЗаказа,
		        |	ВТ_Заказы_1.КатегорияЗаказа.Код КАК КатегорияЗаказаКод,
		        |	ЕСТЬNULL(ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации, ЗНАЧЕНИЕ(Справочник.ПолигоныМаршрутизации.ПустаяСсылка)) КАК Полигон,
		        |	ВТ_Заказы_1.Заказ КАК Заказ,
		        |	ВТ_Заказы_1.ВремяПрибытияС КАК ВремяПрибытияС,
		        |	ВТ_Заказы_1.ВремяПрибытияПо КАК ВремяПрибытияПо
				//CeHbKA #3179 #11.06.2019
		        |	,ВТ_Заказы_1.Смена КАК Смена
				//CeHbKA #3179 #11.06.2019
		        |ПОМЕСТИТЬ ВТ_Заказы
		        |ИЗ
		        |	ВТ_Заказы_1 КАК ВТ_Заказы_1
		        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПолигоныМаршрутизацииЗаказов.СрезПоследних(, СхемаМаршрутизации.Ссылка = &СхемаМаршрутизации) КАК ПолигоныМаршрутизацииЗаказовСрезПоследних
		        |		ПО ВТ_Заказы_1.Заказ = ПолигоныМаршрутизацииЗаказовСрезПоследних.Заказ
		        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИндивидуальнаяМаршрутизация КАК ВТ_ИндивидуальнаяМаршрутизация
		        |		ПО ВТ_Заказы_1.Заказ = ВТ_ИндивидуальнаяМаршрутизация.Заказ
		        |ГДЕ
		        |	ЕСТЬNULL(ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации, ИСТИНА) <> ИСТИНА
		        |	И ЕСТЬNULL(ВТ_ИндивидуальнаяМаршрутизация.Заказ, ИСТИНА) = ИСТИНА
				//CeHbKA #2626 #21.05.2019
				|	"+?(ТолькоРеализации, "И ВТ_Заказы_1.Заказ ССЫЛКА Документ.РеализацияТоваровУслуг ", "")+"
				//CeHbKA #2626 #21.05.2019						
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ВТ_Заказы_1.КатегорияЗаказа,
		        |	ВТ_Заказы_1.КатегорияЗаказа.Код,
		        |	ЕСТЬNULL(ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации, ЗНАЧЕНИЕ(Справочник.ПолигоныМаршрутизации.ПустаяСсылка)),
		        |	ВТ_Заказы_1.Заказ,
		        |	ВТ_Заказы_1.ВремяПрибытияС,
		        |	ВТ_Заказы_1.ВремяПрибытияПо
				//CeHbKA #3179 #11.06.2019
		        |	,ВТ_Заказы_1.Смена
				//CeHbKA #3179 #11.06.2019
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	РейсДокументДляПараметров.Ссылка КАК Рейс,
		        |	ПолигоныИКатегорииЗаказовДляРейсов.Полигон КАК Полигон,
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ПолигоныИКатегорииЗаказовДляРейсов.КатегорияЗаказа, ИСТИНА) = ИСТИНА
		        |			ТОГДА ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
		        |		КОГДА ПолигоныИКатегорииЗаказовДляРейсов.КатегорияЗаказа = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
		        |			ТОГДА 1
		        |		ИНАЧЕ ПолигоныИКатегорииЗаказовДляРейсов.КатегорияЗаказа
		        |	КОНЕЦ КАК КатегорияЗаказа
				//CeHbKA #3179 #11.06.2019
		        |	,РейсДокументДляПараметров.Ссылка.СменаРейса КАК Смена
				//CeHbKA #3179 #11.06.2019
		        |ПОМЕСТИТЬ ВТ_РейсыСПараметрами
		        |ИЗ
		        |	Документ.Рейс КАК РейсДокументДляПараметров
		        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПолигоныИКатегорииЗаказовДляРейсов КАК ПолигоныИКатегорииЗаказовДляРейсов
		        |		ПО (ПолигоныИКатегорииЗаказовДляРейсов.Рейс = РейсДокументДляПараметров.Ссылка)
				//CeHbKA #3179 #11.06.2019
		        |		И (ПолигоныИКатегорииЗаказовДляРейсов.Смена = РейсДокументДляПараметров.Ссылка.СменаРейса)
				//CeHbKA #3179 #11.06.2019
		        |ГДЕ
		        |	РейсДокументДляПараметров.Проведен = ИСТИНА
		        |	И РейсДокументДляПараметров.ДатаРейса = &ДатаНач
		        |	И РейсДокументДляПараметров.МетодикаМаршрутизации = ЗНАЧЕНИЕ(Перечисление.МетодикаЛогистическойМаршрутизации.ПолигональнаяМаршрутизация)
				|	И РейсДокументДляПараметров.ТерминалДоставки = &ТерминалДоставки @СтрокаФильтраСмена12@
				//CeHbKA #2626 #03.06.2019
		        |	И РейсДокументДляПараметров.ТерминалДоставки = &ТерминалДоставки
				//CeHbKA #2626 #03.06.2019
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	0 КАК Отметка,
		        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт КАК Транспорт,
		        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Код КАК ТранспортКод,
		        |	"""" КАК УИД,
		        |	ЕСТЬNULL(ВТ_Заказы.Заказ.Номер, ИСТИНА) КАК НомерЗаказа, @ДополнениеПоПолям@
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ВТ_Заказы.Заказ, ИСТИНА) = ИСТИНА
		        |			ТОГДА 0
		        |		ИНАЧЕ 1
		        |	КОНЕЦ КАК Итого,
		        |	ПривязкаМашинКРейсамСрезПоследних.Водитель КАК Водитель,
		        |	ВТ_РейсыСПараметрами.Рейс.Ссылка КАК Рейс,
		        |	ВТ_РейсыСПараметрами.Рейс.РольРейса КАК РольРейса,
		        |	ВТ_РейсыСПараметрами.Рейс.СменаРейса КАК СменаРейса,
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации, ИСТИНА) = ИСТИНА
		        |			ТОГДА 40
		        |		КОГДА ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации = 0
		        |			ТОГДА 40
		        |		ИНАЧЕ ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации
		        |	КОНЕЦ КАК МаксимальноеКоличествоЗаказов,
		        |	ЛОЖЬ КАК ИндивидуальнаяМаршрутизация,
		        |	ВТ_Заказы.Заказ.Ссылка КАК ЗаказСсылка,
		        |	ПривязкаМашинКРейсамСрезПоследних.Экспедитор КАК Экспедитор,
		        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Наименование КАК ТранспортНаименование,
		        |	ВТ_Заказы.ВремяПрибытияС КАК ВремяПрибытияС,
		        |	ВТ_Заказы.ВремяПрибытияПо КАК ВремяПрибытияПо,
		        |	ВТ_Заказы.КатегорияЗаказа КАК КатегорияЗаказа,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА 0
		        |		ИНАЧЕ ВТ_Заказы.Заказ.ОбщийВес
		        |	КОНЕЦ КАК ВесЗаказа,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_Заказы.Заказ.Контрагент
		        |		ИНАЧЕ ВТ_Заказы.Заказ.ВладелецТовара
		        |	КОНЕЦ КАК Партнер,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_Заказы.Заказ.ОбъемЗабора
		        |		ИНАЧЕ 0
		        |	КОНЕЦ КАК ОбъемЗабора,
		        |	ЕСТЬNULL(ПроверенныеДокументыСрезПоследних.ДокументПроверен, ЛОЖЬ) КАК ДокументПроверен,
				| Выбор когда ЕСТЬNULL(СтатусыПредварительногоЗакрытияРейсовСрезПоследних.СтатусПредварительногоЗакрытияРейса, ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытОкончательно)) = ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытПредварительно) Тогда
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ВТ_Заказы.Заказ, ИСТИНА) = ИСТИНА
		        |			ТОГДА 0
		        |		ИНАЧЕ 1
		        |	КОНЕЦ Иначе 0 Конец КАК ИтогоПредварительно
				|ПОМЕСТИТЬ ВТ_Финал
		        |ИЗ
		        |	ВТ_РейсыСПараметрами КАК ВТ_РейсыСПараметрами
		        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Заказы КАК ВТ_Заказы
		        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПредварительногоЗакрытияРейсов.СрезПоследних КАК СтатусыПредварительногоЗакрытияРейсовСрезПоследних
		        |			ПО ВТ_Заказы.Заказ = СтатусыПредварительногоЗакрытияРейсовСрезПоследних.Заказ
		        |		ПО ВТ_РейсыСПараметрами.Полигон = ВТ_Заказы.Полигон
		        |			И ВТ_РейсыСПараметрами.КатегорияЗаказа = ВТ_Заказы.КатегорияЗаказа
				//CeHbKA #3179 #11.06.2019
		        |			И ВТ_РейсыСПараметрами.Смена = ВТ_Заказы.Смена				
				//CeHbKA #3179 #11.06.2019
		        |			И (ЕСТЬNULL(ВТ_Заказы.Заказ, ИСТИНА) <> ИСТИНА) @СтрокаФильтра@
		        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних КАК ПривязкаМашинКРейсамСрезПоследних
		        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыТранспорта.СрезПоследних КАК ДополнительныеПараметрыТранспортаСрезПоследних
		        |			ПО ПривязкаМашинКРейсамСрезПоследних.Транспорт = ДополнительныеПараметрыТранспортаСрезПоследних.Транспорт
		        |		ПО ВТ_РейсыСПараметрами.Рейс = ПривязкаМашинКРейсамСрезПоследних.Рейс @СтрокаФильтраВодителей@
		        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПроверенныеДокументы.СрезПоследних КАК ПроверенныеДокументыСрезПоследних
		        |		ПО ВТ_РейсыСПараметрами.Рейс = ПроверенныеДокументыСрезПоследних.Документ
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ЕСТЬNULL(ВТ_Заказы.Заказ.Номер, ИСТИНА), @ДополнениеПоПолямГруппировки@
		        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт,
		        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Код,
		        |	ПривязкаМашинКРейсамСрезПоследних.Водитель,
		        |	ВТ_РейсыСПараметрами.Рейс.Ссылка,
		        |	ВТ_РейсыСПараметрами.Рейс.РольРейса,
		        |	ВТ_РейсыСПараметрами.Рейс.СменаРейса,
		        |	ЕСТЬNULL(ВТ_РейсыСПараметрами.Полигон, """"),
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ВТ_Заказы.Заказ, ИСТИНА) = ИСТИНА
		        |			ТОГДА 0
		        |		ИНАЧЕ 1
		        |	КОНЕЦ,
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации, ИСТИНА) = ИСТИНА
		        |			ТОГДА 40
		        |		КОГДА ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации = 0
		        |			ТОГДА 40
		        |		ИНАЧЕ ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации
		        |	КОНЕЦ,
		        |	ВТ_Заказы.Заказ.Ссылка,
		        |	ПривязкаМашинКРейсамСрезПоследних.Экспедитор,
		        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Наименование,
		        |	ВТ_Заказы.ВремяПрибытияС,
		        |	ВТ_Заказы.ВремяПрибытияПо,
		        |	ВТ_Заказы.КатегорияЗаказа,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА 0
		        |		ИНАЧЕ ВТ_Заказы.Заказ.ОбщийВес
		        |	КОНЕЦ,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_Заказы.Заказ.Контрагент
		        |		ИНАЧЕ ВТ_Заказы.Заказ.ВладелецТовара
		        |	КОНЕЦ,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_Заказы.Заказ.ОбъемЗабора
		        |		ИНАЧЕ 0
		        |	КОНЕЦ,
		        |	ЕСТЬNULL(ПроверенныеДокументыСрезПоследних.ДокументПроверен, ЛОЖЬ),
				| Выбор когда ЕСТЬNULL(СтатусыПредварительногоЗакрытияРейсовСрезПоследних.СтатусПредварительногоЗакрытияРейса, ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытОкончательно)) = ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытПредварительно) Тогда
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ВТ_Заказы.Заказ, ИСТИНА) = ИСТИНА
		        |			ТОГДА 0
		        |		ИНАЧЕ 1
		        |	КОНЕЦ Иначе 0 Конец				
		        |
		        |ОБЪЕДИНИТЬ ВСЕ
		        |
		        |ВЫБРАТЬ
		        |	0,
		        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт,
		        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Код,
		        |	"""",
		        |	ЕСТЬNULL(ВТ_ИндивидуальнаяМаршрутизация.Заказ.Номер, ИСТИНА), @ДополнениеПоПолямВторое@
		        |	1,
		        |	ПривязкаМашинКРейсамСрезПоследних.Водитель,
		        |	ВТ_РейсыСПараметрами.Рейс.Ссылка,
		        |	ВТ_РейсыСПараметрами.Рейс.РольРейса,
		        |	ВТ_РейсыСПараметрами.Рейс.СменаРейса,
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации, ИСТИНА) = ИСТИНА
		        |			ТОГДА 40
		        |		КОГДА ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации = 0
		        |			ТОГДА 40
		        |		ИНАЧЕ ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации
		        |	КОНЕЦ,
		        |	ИСТИНА,
		        |	ВТ_ИндивидуальнаяМаршрутизация.Заказ.Ссылка,
		        |	ПривязкаМашинКРейсамСрезПоследних.Экспедитор,
		        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Наименование,
		        |	ВТ_ИндивидуальнаяМаршрутизация.ВремяПрибытияС,
		        |	ВТ_ИндивидуальнаяМаршрутизация.ВремяПрибытияПо,
		        |	ВТ_ИндивидуальнаяМаршрутизация.КатегорияЗаказа,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ИндивидуальнаяМаршрутизация.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА 0
		        |		ИНАЧЕ ВТ_ИндивидуальнаяМаршрутизация.Заказ.ОбщийВес
		        |	КОНЕЦ,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ИндивидуальнаяМаршрутизация.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_ИндивидуальнаяМаршрутизация.Заказ.Контрагент
		        |		ИНАЧЕ ВТ_ИндивидуальнаяМаршрутизация.Заказ.ВладелецТовара
		        |	КОНЕЦ,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ИндивидуальнаяМаршрутизация.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_ИндивидуальнаяМаршрутизация.Заказ.ОбъемЗабора
		        |		ИНАЧЕ 0
		        |	КОНЕЦ,
		        |	ЕСТЬNULL(ПроверенныеДокументыСрезПоследних.ДокументПроверен, ЛОЖЬ),
				| Выбор когда ЕСТЬNULL(СтатусыПредварительногоЗакрытияРейсовСрезПоследних.СтатусПредварительногоЗакрытияРейса, ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытОкончательно)) = ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытПредварительно) Тогда
		   		| 1 Иначе 0 Конец
		        |ИЗ
		        |	ВТ_РейсыСПараметрами КАК ВТ_РейсыСПараметрами
		        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних(, ) КАК ПривязкаМашинКРейсамСрезПоследних
		        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыТранспорта.СрезПоследних КАК ДополнительныеПараметрыТранспортаСрезПоследних
		        |			ПО ПривязкаМашинКРейсамСрезПоследних.Транспорт = ДополнительныеПараметрыТранспортаСрезПоследних.Транспорт
		        |		ПО ВТ_РейсыСПараметрами.Рейс = ПривязкаМашинКРейсамСрезПоследних.Рейс
		        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ИндивидуальнаяМаршрутизация КАК ВТ_ИндивидуальнаяМаршрутизация
		        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПредварительногоЗакрытияРейсов.СрезПоследних КАК СтатусыПредварительногоЗакрытияРейсовСрезПоследних
		        |			ПО ВТ_ИндивидуальнаяМаршрутизация.Заказ = СтатусыПредварительногоЗакрытияРейсовСрезПоследних.Заказ
		        |		ПО ВТ_РейсыСПараметрами.Рейс = ВТ_ИндивидуальнаяМаршрутизация.Рейс @СтрокаФильтраВторая@
		        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПроверенныеДокументы.СрезПоследних КАК ПроверенныеДокументыСрезПоследних
		        |		ПО ВТ_РейсыСПараметрами.Рейс = ПроверенныеДокументыСрезПоследних.Документ
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт,
		        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Код,
		        |	ЕСТЬNULL(ВТ_ИндивидуальнаяМаршрутизация.Заказ.Номер, ИСТИНА), @ДополнениеПоПолямГруппировкиВторое@
		        |	ПривязкаМашинКРейсамСрезПоследних.Водитель,
		        |	ВТ_РейсыСПараметрами.Рейс.Ссылка,
		        |	ВТ_РейсыСПараметрами.Рейс.РольРейса,
		        |	ВТ_РейсыСПараметрами.Рейс.СменаРейса,
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации, ИСТИНА) = ИСТИНА
		        |			ТОГДА 40
		        |		КОГДА ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации = 0
		        |			ТОГДА 40
		        |		ИНАЧЕ ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации
		        |	КОНЕЦ,
		        |	ВТ_ИндивидуальнаяМаршрутизация.Заказ.Ссылка,
		        |	ПривязкаМашинКРейсамСрезПоследних.Экспедитор,
		        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Наименование,
		        |	ВТ_ИндивидуальнаяМаршрутизация.КатегорияЗаказа,
		        |	ВТ_ИндивидуальнаяМаршрутизация.ВремяПрибытияС,
		        |	ВТ_ИндивидуальнаяМаршрутизация.ВремяПрибытияПо,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ИндивидуальнаяМаршрутизация.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА 0
		        |		ИНАЧЕ ВТ_ИндивидуальнаяМаршрутизация.Заказ.ОбщийВес
		        |	КОНЕЦ,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ИндивидуальнаяМаршрутизация.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_ИндивидуальнаяМаршрутизация.Заказ.Контрагент
		        |		ИНАЧЕ ВТ_ИндивидуальнаяМаршрутизация.Заказ.ВладелецТовара
		        |	КОНЕЦ,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ИндивидуальнаяМаршрутизация.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_ИндивидуальнаяМаршрутизация.Заказ.ОбъемЗабора
		        |		ИНАЧЕ 0
		        |	КОНЕЦ,
		        |	ЕСТЬNULL(ПроверенныеДокументыСрезПоследних.ДокументПроверен, ЛОЖЬ),
				| Выбор когда ЕСТЬNULL(СтатусыПредварительногоЗакрытияРейсовСрезПоследних.СтатусПредварительногоЗакрытияРейса, ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытОкончательно)) = ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытПредварительно) Тогда
		   		| 1 Иначе 0 Конец
		        |
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	Рейс,
				|	МИНИМУМ(Отметка),
				|	МАКСИМУМ(Транспорт),
				|	МАКСИМУМ(ТранспортКод),
				|	МАКСИМУМ(ТранспортНаименование),
				|	"""" КАК НомерЗаказа,
				|	СУММА(Итого),
				|	МИНИМУМ(ДокументПроверен),
				|	МАКСИМУМ(Водитель),
				|	МАКСИМУМ(РольРейса),  
				|	МАКСИМУМ(СменаРейса),  @ДополнениеПоПолямИтогов@
				|	МАКСИМУМ(МаксимальноеКоличествоЗаказов)
				|
				|ИЗ ВТ_Финал КАК ВТ_Финал
				|
				|СГРУППИРОВАТЬ ПО
				|	Рейс,
				|	Транспорт
				|
				|УПОРЯДОЧИТЬ ПО
				|	Транспорт.Наименование";
	КонецЕсли;	
	
КонецФункции	
//CeHbKA #3663 25.11.2019


Функция ТекстЗапросаПоДеревуРейсовСтараяРабочая(МаршрутизацияЗакрыта)
	//+Широков 16.07.2021 Задача 4607	
	//Старый запрос
	//Если МаршрутизацияЗакрыта Тогда
	//			Возврат "ВЫБРАТЬ
	//			        |	РеализацияТоваровУслуг.Ссылка КАК Заказ,
	//			        |	ВЫБОР
	//			        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
	//			        |			ТОГДА 1
	//			        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
	//			        |			ТОГДА 1
	//			        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк
	//			        |	КОНЕЦ КАК КатегорияЗаказа,
	//			        |	РейсЗаказы.Ссылка КАК Рейс,
	//			        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияС КАК ВремяПрибытияС,
	//			        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияПо КАК ВремяПрибытияПо,
	//			        |	ВЫБОР
	//			        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
	//			        |			ТОГДА 1
	//			        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
	//			        |			ТОГДА 1
	//			        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк.Код
	//			        |	КОНЕЦ КАК КатегорияЗаказаКод
	//			        |ПОМЕСТИТЬ ВТ_Заказы
	//			        |ИЗ
	//			        |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	//			        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
	//			        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АктуальнаяСхемаЛогистическихБрейков.СрезПоследних КАК АктуальнаяСхемаЛогистическихБрейковСрезПоследних
	//			        |			ПО ДополнительныеПараметрыЗаказа.СхемаЛогистическихБрейков.Ссылка = АктуальнаяСхемаЛогистическихБрейковСрезПоследних.СхемаЛогистическихБрейков.Ссылка
	//			        |		ПО РеализацияТоваровУслуг.Ссылка = ДополнительныеПараметрыЗаказа.Заказ.Ссылка
	//			        |			И (ДополнительныеПараметрыЗаказа.Доставка <> ЗНАЧЕНИЕ(БизнесПроцесс.новаМестнаяДоставка.ПустаяСсылка))
	//			        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Рейс.Заказы КАК РейсЗаказы
	//			        |		ПО (РеализацияТоваровУслуг.Ссылка = (ВЫРАЗИТЬ(РейсЗаказы.Заказ КАК Документ.РеализацияТоваровУслуг)))
	//			        |ГДЕ
	//			        |	РейсЗаказы.Ссылка.ДатаРейса = &ДатаНач
	//			        |	И РейсЗаказы.Ссылка.Проведен = ИСТИНА
	//			        |	И РейсЗаказы.УдаленИзРейса = ЛОЖЬ
	//			        |	И РейсЗаказы.Ссылка.ТерминалДоставки = &ТерминалДоставки
	//			        |
	//			        |СГРУППИРОВАТЬ ПО
	//			        |	РеализацияТоваровУслуг.Ссылка,
	//			        |	ВЫБОР
	//			        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
	//			        |			ТОГДА 1
	//			        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
	//			        |			ТОГДА 1
	//			        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк
	//			        |	КОНЕЦ,
	//			        |	РейсЗаказы.Ссылка,
	//			        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияС,
	//			        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияПо,
	//			        |	ВЫБОР
	//			        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
	//			        |			ТОГДА 1
	//			        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
	//			        |			ТОГДА 1
	//			        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк.Код
	//			        |	КОНЕЦ
	//			        |
	//			        |ОБЪЕДИНИТЬ ВСЕ
	//			        |
	//			        |ВЫБРАТЬ
	//			        |	ЗаборТовара.Ссылка,
	//			        |	&ЗаборнаяКатегория,
	//			        |	РейсЗаказы.Ссылка,
	//			        |	ЗаборТовара.ВремяДоставкиС,
	//			        |	ЗаборТовара.ВремяДоставкиПо,
	//			        |	&ЗаборнаяКатегорияКод
	//			        |ИЗ
	//			        |	Документ.Рейс.Заказы КАК РейсЗаказы
	//			        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаборТовара КАК ЗаборТовара
	//			        |		ПО ((ВЫРАЗИТЬ(РейсЗаказы.Заказ КАК Документ.ЗаборТовара)) = ЗаборТовара.Ссылка)
	//			        |ГДЕ
	//			        |	РейсЗаказы.Ссылка.Проведен = ИСТИНА
	//			        |	И РейсЗаказы.Ссылка.ДатаРейса = &ДатаНач
	//			        |	И РейсЗаказы.УдаленИзРейса = ЛОЖЬ
	//			        |	И РейсЗаказы.Ссылка.ТерминалДоставки = &ТерминалДоставки
	//			        |;
	//			        |
	//			        |////////////////////////////////////////////////////////////////////////////////
	//			        |ВЫБРАТЬ
	//			        |	РейсДокументДляПараметров.Ссылка КАК Рейс
	//			        |ПОМЕСТИТЬ ВТ_РейсыСПараметрами
	//			        |ИЗ
	//			        |	Документ.Рейс КАК РейсДокументДляПараметров
	//			        |ГДЕ
	//			        |	РейсДокументДляПараметров.Проведен = ИСТИНА
	//			        |	И РейсДокументДляПараметров.ДатаРейса = &ДатаНач
	//			        |	И РейсДокументДляПараметров.ТерминалДоставки = &ТерминалДоставки
	//			        |;
	//			        |
	//			        |////////////////////////////////////////////////////////////////////////////////
	//			        |ВЫБРАТЬ
	//			        |	0 КАК Отметка,
	//			        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт КАК Транспорт,
	//			        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Код КАК ТранспортКод,
	//			        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Наименование КАК ТранспортНаименование,
	//			        |	ЕСТЬNULL(ВТ_Заказы.Заказ.Номер, ИСТИНА) КАК НомерЗаказа,@ДополнениеПоПолям@
	//			        |	ВЫБОР
	//			        |		КОГДА ЕСТЬNULL(ВТ_Заказы.Заказ, ИСТИНА) = ИСТИНА
	//			        |			ТОГДА 0
	//			        |		ИНАЧЕ 1
	//			        |	КОНЕЦ КАК Итого,
	//			        |	ПривязкаМашинКРейсамСрезПоследних.Водитель КАК Водитель,
	//			        |	ВТ_РейсыСПараметрами.Рейс.Ссылка КАК Рейс,
	//			        |	ВТ_РейсыСПараметрами.Рейс.РольРейса КАК РольРейса,
	//			        |	ВЫБОР
	//			        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации, ИСТИНА) = ИСТИНА
	//			        |			ТОГДА 40
	//			        |		КОГДА ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации = 0
	//			        |			ТОГДА 40
	//			        |		ИНАЧЕ ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации
	//			        |	КОНЕЦ КАК МаксимальноеКоличествоЗаказов,
	//			        |	ЛОЖЬ КАК ИндивидуальнаяМаршрутизация,
	//			        |	ВТ_Заказы.Заказ.Ссылка КАК ЗаказСсылка,
	//			        |	ПривязкаМашинКРейсамСрезПоследних.Экспедитор КАК Экспедитор,
	//			        |	ВЫБОР
	//			        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
	//			        |			ТОГДА 0
	//			        |		ИНАЧЕ ВТ_Заказы.Заказ.ОбщийВес
	//			        |	КОНЕЦ КАК ВесЗаказа,
	//			        |	ВЫБОР
	//			        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
	//			        |			ТОГДА ВТ_Заказы.Заказ.Контрагент
	//			        |		ИНАЧЕ ВТ_Заказы.Заказ.ВладелецТовара
	//			        |	КОНЕЦ КАК Партнер,
	//			        |	ВТ_Заказы.ВремяПрибытияС КАК ВремяПрибытияС,
	//			        |	ВТ_Заказы.ВремяПрибытияПо КАК ВремяПрибытияПо,
	//			        |	ВЫБОР
	//			        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
	//			        |			ТОГДА ВТ_Заказы.Заказ.ОбъемЗабора
	//			        |		ИНАЧЕ 0
	//			        |	КОНЕЦ КАК ОбъемЗабора,
	//			        |	"""" КАК УИД,
	//			        |	ВТ_Заказы.КатегорияЗаказа КАК КатегорияЗаказа,
	//			        |	ЕСТЬNULL(ПроверенныеДокументыСрезПоследних.ДокументПроверен, ЛОЖЬ) КАК ДокументПроверен
	//			        |ИЗ
	//			        |	ВТ_РейсыСПараметрами КАК ВТ_РейсыСПараметрами
	//			        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Заказы КАК ВТ_Заказы
	//			        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПредварительногоЗакрытияРейсов.СрезПоследних КАК СтатусыПредварительногоЗакрытияРейсовСрезПоследних
	//			        |			ПО ВТ_Заказы.Заказ = СтатусыПредварительногоЗакрытияРейсовСрезПоследних.Заказ
	//			        |		ПО ВТ_РейсыСПараметрами.Рейс = ВТ_Заказы.Рейс @СтрокаФильтра@
	//			        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних КАК ПривязкаМашинКРейсамСрезПоследних
	//			        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыТранспорта.СрезПоследних КАК ДополнительныеПараметрыТранспортаСрезПоследних
	//			        |			ПО ПривязкаМашинКРейсамСрезПоследних.Транспорт.Ссылка = ДополнительныеПараметрыТранспортаСрезПоследних.Транспорт.Ссылка
	//			        |		ПО ВТ_РейсыСПараметрами.Рейс.Ссылка = ПривязкаМашинКРейсамСрезПоследних.Рейс.Ссылка @СтрокаФильтраВодителей@
	//			        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПроверенныеДокументы.СрезПоследних КАК ПроверенныеДокументыСрезПоследних
	//			        |		ПО ВТ_РейсыСПараметрами.Рейс = ПроверенныеДокументыСрезПоследних.Документ
	//			        |
	//			        |СГРУППИРОВАТЬ ПО
	//			        |	ЕСТЬNULL(ВТ_Заказы.Заказ.Номер, ИСТИНА), @ДополнениеПоПолямГруппировки@
	//			        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт,
	//			        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Код,
	//			        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Наименование,
	//			        |	ПривязкаМашинКРейсамСрезПоследних.Водитель,
	//			        |	ВТ_РейсыСПараметрами.Рейс.Ссылка,
	//			        |	ВТ_РейсыСПараметрами.Рейс.РольРейса,
	//			        |	ВЫБОР
	//			        |		КОГДА ЕСТЬNULL(ВТ_Заказы.Заказ, ИСТИНА) = ИСТИНА
	//			        |			ТОГДА 0
	//			        |		ИНАЧЕ 1
	//			        |	КОНЕЦ,
	//			        |	ВЫБОР
	//			        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации, ИСТИНА) = ИСТИНА
	//			        |			ТОГДА 40
	//			        |		КОГДА ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации = 0
	//			        |			ТОГДА 40
	//			        |		ИНАЧЕ ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации
	//			        |	КОНЕЦ,
	//			        |	ВТ_Заказы.Заказ.Ссылка,
	//			        |	ПривязкаМашинКРейсамСрезПоследних.Экспедитор,
	//			        |	ВЫБОР
	//			        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
	//			        |			ТОГДА 0
	//			        |		ИНАЧЕ ВТ_Заказы.Заказ.ОбщийВес
	//			        |	КОНЕЦ,
	//			        |	ВЫБОР
	//			        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
	//			        |			ТОГДА ВТ_Заказы.Заказ.Контрагент
	//			        |		ИНАЧЕ ВТ_Заказы.Заказ.ВладелецТовара
	//			        |	КОНЕЦ,
	//			        |	ВТ_Заказы.ВремяПрибытияС,
	//			        |	ВТ_Заказы.ВремяПрибытияПо,
	//			        |	ВТ_Заказы.КатегорияЗаказа,
	//			        |	ВЫБОР
	//			        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
	//			        |			ТОГДА ВТ_Заказы.Заказ.ОбъемЗабора
	//			        |		ИНАЧЕ 0
	//			        |	КОНЕЦ,
	//			        |	ЕСТЬNULL(ПроверенныеДокументыСрезПоследних.ДокументПроверен, ЛОЖЬ)
	//			        |
	//			        |УПОРЯДОЧИТЬ ПО
	//			        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Наименование
	//			        |ИТОГИ
	//			        |	МИНИМУМ(Отметка),
	//			        |	МАКСИМУМ(Транспорт),
	//			        |	МАКСИМУМ(ТранспортКод),
	//			        |	МАКСИМУМ(ТранспортНаименование),
	//			        |	СУММА(Итого),
	//					|	МИНИМУМ(ДокументПроверен),
	//			        |	МАКСИМУМ(Водитель),
	//			        |	МАКСИМУМ(РольРейса),  @ДополнениеПоПолямИтогов@
	//			        |	МАКСИМУМ(МаксимальноеКоличествоЗаказов)
	//			        |ПО
	//			        |	Рейс";		
	//Иначе
	//	Возврат "ВЫБРАТЬ
	//	        |	ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Заказ КАК Заказ,
	//	        |	ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Рейс КАК Рейс,
	//	        |	ДополнительныеПараметрыЗаказа.ЛогистическийБрейк КАК КатегорияЗаказа,
	//	        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияС КАК ВремяПрибытияС,
	//	        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияПо КАК ВремяПрибытияПо,
	//	        |	ДополнительныеПараметрыЗаказа.ЛогистическийБрейк.Код КАК КатегорияЗаказаКод
	//	        |ПОМЕСТИТЬ ВТ_ИндивидуальнаяМаршрутизация
	//	        |ИЗ
	//	        |	РегистрСведений.ИндивидуальнаяМаршрутизацияПоРейсам.СрезПоследних(, ДатаПланирования = &ДатаНач) КАК ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних
	//	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
	//	        |		ПО ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Заказ = ДополнительныеПараметрыЗаказа.Заказ
	//	        |ГДЕ
	//	        |	ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Рейс.Ссылка <> ЗНАЧЕНИЕ(Документ.Рейс.ПустаяСсылка)
	//	        |	И ТИПЗНАЧЕНИЯ(ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Заказ.Ссылка) = ТИП(Документ.РеализацияТоваровУслуг)
	//	        |
	//	        |ОБЪЕДИНИТЬ
	//	        |
	//	        |ВЫБРАТЬ
	//	        |	ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Заказ,
	//	        |	ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Рейс,
	//	        |	&ЗаборнаяКатегория,
	//	        |	ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Заказ.ВремяДоставкиС,
	//	        |	ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Заказ.ВремяДоставкиПо,
	//	        |	&ЗаборнаяКатегорияКод
	//	        |ИЗ
	//	        |	РегистрСведений.ИндивидуальнаяМаршрутизацияПоРейсам.СрезПоследних(, ДатаПланирования = &ДатаНач) КАК ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних
	//	        |ГДЕ
	//	        |	ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Рейс.Ссылка <> ЗНАЧЕНИЕ(Документ.Рейс.ПустаяСсылка)
	//	        |	И ТИПЗНАЧЕНИЯ(ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
	//	        |;
	//	        |
	//	        |////////////////////////////////////////////////////////////////////////////////
	//	        |ВЫБРАТЬ
	//	        |	РеализацияТоваровУслуг.Ссылка КАК Заказ,
	//	        |	ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка) КАК ТипЗаказа,
	//	        |	ВЫБОР
	//	        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
	//	        |			ТОГДА 1
	//	        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
	//	        |			ТОГДА 1
	//	        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк
	//	        |	КОНЕЦ КАК КатегорияЗаказа,
	//	        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияС КАК ВремяПрибытияС,
	//	        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияПо КАК ВремяПрибытияПо
	//	        |ПОМЕСТИТЬ ВТ_Заказы_1
	//	        |ИЗ
	//	        |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	//	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
	//	        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АктуальнаяСхемаЛогистическихБрейков.СрезПоследних КАК АктуальнаяСхемаЛогистическихБрейковСрезПоследних
	//	        |			ПО ДополнительныеПараметрыЗаказа.СхемаЛогистическихБрейков.Ссылка = АктуальнаяСхемаЛогистическихБрейковСрезПоследних.СхемаЛогистическихБрейков.Ссылка
	//	        |		ПО РеализацияТоваровУслуг.Ссылка = ДополнительныеПараметрыЗаказа.Заказ.Ссылка
	//	        |			И (ДополнительныеПараметрыЗаказа.Доставка <> ЗНАЧЕНИЕ(БизнесПроцесс.новаМестнаяДоставка.ПустаяСсылка))
	//	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КорзинаПолигональнойМаршрутизации.СрезПоследних(
	//	        |				,
	//	        |				ДатаПланирования = &ДатаНач
	//	        |					И ТерминалДоставки.Ссылка = &ТерминалДоставки) КАК КорзинаПолигональнойМаршрутизацииСрезПоследних
	//	        |		ПО (РеализацияТоваровУслуг.Ссылка = ВЫРАЗИТЬ(КорзинаПолигональнойМаршрутизацииСрезПоследних.Заказ КАК Документ.РеализацияТоваровУслуг).Ссылка)
	//	        |			И (КорзинаПолигональнойМаршрутизацииСрезПоследних.ЗаказВКорзине = ИСТИНА)
	//	        |ГДЕ
	//	        |	РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНач И &ДатаКон
	//	        |	И РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
	//	        |	И РеализацияТоваровУслуг.СтатусИнтернетМагазина = 2
	//	        |	И РеализацияТоваровУслуг.ТерминалДоставки = &ТерминалДоставки
	//	        |	И ЕСТЬNULL(КорзинаПолигональнойМаршрутизацииСрезПоследних.Период, ИСТИНА) = ИСТИНА
	//	        |
	//	        |СГРУППИРОВАТЬ ПО
	//	        |	РеализацияТоваровУслуг.Ссылка,
	//	        |	ВЫБОР
	//	        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
	//	        |			ТОГДА 1
	//	        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
	//	        |			ТОГДА 1
	//	        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк
	//	        |	КОНЕЦ,
	//	        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияС,
	//	        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияПо
	//	        |
	//	        |ОБЪЕДИНИТЬ ВСЕ
	//	        |
	//	        |ВЫБРАТЬ
	//	        |	ЗаборТовара.Ссылка,
	//	        |	ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор),
	//	        |	&ЗаборнаяКатегория,
	//	        |	ЗаборТовара.ВремяДоставкиС,
	//	        |	ЗаборТовара.ВремяДоставкиПо
	//	        |ИЗ
	//	        |	Документ.ЗаборТовара КАК ЗаборТовара
	//	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КорзинаПолигональнойМаршрутизации.СрезПоследних(
	//	        |				,
	//	        |				ДатаПланирования = &ДатаНач
	//	        |					И ТерминалДоставки.Ссылка = &ТерминалДоставки) КАК КорзинаПолигональнойМаршрутизацииСрезПоследних
	//	        |		ПО (ЗаборТовара.Ссылка = ВЫРАЗИТЬ(КорзинаПолигональнойМаршрутизацииСрезПоследних.Заказ КАК Документ.ЗаборТовара).Ссылка)
	//	        |			И (КорзинаПолигональнойМаршрутизацииСрезПоследних.ЗаказВКорзине = ИСТИНА)
	//	        |ГДЕ
	//	        |	ЗаборТовара.Дата МЕЖДУ &ДатаНач И &ДатаКон
	//	        |	И ЗаборТовара.СтатусИнтернетМагазина = 2
	//	        |	И ЗаборТовара.ПометкаУдаления = ЛОЖЬ
	//	        |	И ЗаборТовара.ТерминалДоставки = &ТерминалДоставки
	//	        |	И ЕСТЬNULL(КорзинаПолигональнойМаршрутизацииСрезПоследних.Период, ИСТИНА) = ИСТИНА
	//	        |
	//	        |СГРУППИРОВАТЬ ПО
	//	        |	ЗаборТовара.Ссылка,
	//	        |	ЗаборТовара.ВремяДоставкиС,
	//	        |	ЗаборТовара.ВремяДоставкиПо
	//	        |;
	//	        |
	//	        |////////////////////////////////////////////////////////////////////////////////
	//	        |ВЫБРАТЬ
	//	        |	ВТ_Заказы_1.КатегорияЗаказа КАК КатегорияЗаказа,
	//	        |	ВТ_Заказы_1.КатегорияЗаказа.Код КАК КатегорияЗаказаКод,
	//	        |	ЕСТЬNULL(ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации, ЗНАЧЕНИЕ(Справочник.ПолигоныМаршрутизации.ПустаяСсылка)) КАК Полигон,
	//	        |	ВТ_Заказы_1.Заказ КАК Заказ,
	//	        |	ВТ_Заказы_1.ВремяПрибытияС КАК ВремяПрибытияС,
	//	        |	ВТ_Заказы_1.ВремяПрибытияПо КАК ВремяПрибытияПо
	//	        |ПОМЕСТИТЬ ВТ_Заказы
	//	        |ИЗ
	//	        |	ВТ_Заказы_1 КАК ВТ_Заказы_1
	//	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПолигоныМаршрутизацииЗаказов.СрезПоследних(, СхемаМаршрутизации.Ссылка = &СхемаМаршрутизации) КАК ПолигоныМаршрутизацииЗаказовСрезПоследних
	//	        |		ПО ВТ_Заказы_1.Заказ = ПолигоныМаршрутизацииЗаказовСрезПоследних.Заказ
	//	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИндивидуальнаяМаршрутизация КАК ВТ_ИндивидуальнаяМаршрутизация
	//	        |		ПО ВТ_Заказы_1.Заказ = ВТ_ИндивидуальнаяМаршрутизация.Заказ
	//	        |ГДЕ
	//	        |	ЕСТЬNULL(ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации, ИСТИНА) <> ИСТИНА
	//	        |	И ЕСТЬNULL(ВТ_ИндивидуальнаяМаршрутизация.Заказ, ИСТИНА) = ИСТИНА
	//	        |
	//	        |СГРУППИРОВАТЬ ПО
	//	        |	ВТ_Заказы_1.КатегорияЗаказа,
	//	        |	ВТ_Заказы_1.КатегорияЗаказа.Код,
	//	        |	ЕСТЬNULL(ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации, ЗНАЧЕНИЕ(Справочник.ПолигоныМаршрутизации.ПустаяСсылка)),
	//	        |	ВТ_Заказы_1.Заказ,
	//	        |	ВТ_Заказы_1.ВремяПрибытияС,
	//	        |	ВТ_Заказы_1.ВремяПрибытияПо
	//	        |;
	//	        |
	//	        |////////////////////////////////////////////////////////////////////////////////
	//	        |ВЫБРАТЬ
	//	        |	РейсДокументДляПараметров.Ссылка КАК Рейс,
	//	        |	ПолигоныИКатегорииЗаказовДляРейсов.Полигон КАК Полигон,
	//	        |	ВЫБОР
	//	        |		КОГДА ЕСТЬNULL(ПолигоныИКатегорииЗаказовДляРейсов.КатегорияЗаказа, ИСТИНА) = ИСТИНА
	//	        |			ТОГДА ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
	//	        |		КОГДА ПолигоныИКатегорииЗаказовДляРейсов.КатегорияЗаказа = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
	//	        |			ТОГДА 1
	//	        |		ИНАЧЕ ПолигоныИКатегорииЗаказовДляРейсов.КатегорияЗаказа
	//	        |	КОНЕЦ КАК КатегорияЗаказа
	//	        |ПОМЕСТИТЬ ВТ_РейсыСПараметрами
	//	        |ИЗ
	//	        |	Документ.Рейс КАК РейсДокументДляПараметров
	//	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПолигоныИКатегорииЗаказовДляРейсов КАК ПолигоныИКатегорииЗаказовДляРейсов
	//	        |		ПО (ПолигоныИКатегорииЗаказовДляРейсов.Рейс = РейсДокументДляПараметров.Ссылка)
	//	        |ГДЕ
	//	        |	РейсДокументДляПараметров.Проведен = ИСТИНА
	//	        |	И РейсДокументДляПараметров.ДатаРейса = &ДатаНач
	//	        |	И РейсДокументДляПараметров.МетодикаМаршрутизации = ЗНАЧЕНИЕ(Перечисление.МетодикаЛогистическойМаршрутизации.ПолигональнаяМаршрутизация)
	//	        |	И РейсДокументДляПараметров.ТерминалДоставки = &ТерминалДоставки
	//	        |;
	//	        |
	//	        |////////////////////////////////////////////////////////////////////////////////
	//	        |ВЫБРАТЬ
	//	        |	0 КАК Отметка,
	//	        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт КАК Транспорт,
	//	        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Код КАК ТранспортКод,
	//	        |	"""" КАК УИД,
	//	        |	ЕСТЬNULL(ВТ_Заказы.Заказ.Номер, ИСТИНА) КАК НомерЗаказа, @ДополнениеПоПолям@
	//	        |	ВЫБОР
	//	        |		КОГДА ЕСТЬNULL(ВТ_Заказы.Заказ, ИСТИНА) = ИСТИНА
	//	        |			ТОГДА 0
	//	        |		ИНАЧЕ 1
	//	        |	КОНЕЦ КАК Итого,
	//	        |	ПривязкаМашинКРейсамСрезПоследних.Водитель КАК Водитель,
	//	        |	ВТ_РейсыСПараметрами.Рейс.Ссылка КАК Рейс,
	//	        |	ВТ_РейсыСПараметрами.Рейс.РольРейса КАК РольРейса,
	//	        |	ВЫБОР
	//	        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации, ИСТИНА) = ИСТИНА
	//	        |			ТОГДА 40
	//	        |		КОГДА ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации = 0
	//	        |			ТОГДА 40
	//	        |		ИНАЧЕ ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации
	//	        |	КОНЕЦ КАК МаксимальноеКоличествоЗаказов,
	//	        |	ЛОЖЬ КАК ИндивидуальнаяМаршрутизация,
	//	        |	ВТ_Заказы.Заказ.Ссылка КАК ЗаказСсылка,
	//	        |	ПривязкаМашинКРейсамСрезПоследних.Экспедитор КАК Экспедитор,
	//	        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Наименование КАК ТранспортНаименование,
	//	        |	ВТ_Заказы.ВремяПрибытияС КАК ВремяПрибытияС,
	//	        |	ВТ_Заказы.ВремяПрибытияПо КАК ВремяПрибытияПо,
	//	        |	ВТ_Заказы.КатегорияЗаказа КАК КатегорияЗаказа,
	//	        |	ВЫБОР
	//	        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
	//	        |			ТОГДА 0
	//	        |		ИНАЧЕ ВТ_Заказы.Заказ.ОбщийВес
	//	        |	КОНЕЦ КАК ВесЗаказа,
	//	        |	ВЫБОР
	//	        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
	//	        |			ТОГДА ВТ_Заказы.Заказ.Контрагент
	//	        |		ИНАЧЕ ВТ_Заказы.Заказ.ВладелецТовара
	//	        |	КОНЕЦ КАК Партнер,
	//	        |	ВЫБОР
	//	        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
	//	        |			ТОГДА ВТ_Заказы.Заказ.ОбъемЗабора
	//	        |		ИНАЧЕ 0
	//	        |	КОНЕЦ КАК ОбъемЗабора,
	//	        |	ЕСТЬNULL(ПроверенныеДокументыСрезПоследних.ДокументПроверен, ЛОЖЬ) КАК ДокументПроверен,
	//			| Выбор когда ЕСТЬNULL(СтатусыПредварительногоЗакрытияРейсовСрезПоследних.СтатусПредварительногоЗакрытияРейса, ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытОкончательно)) = ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытПредварительно) Тогда
	//	        |	ВЫБОР
	//	        |		КОГДА ЕСТЬNULL(ВТ_Заказы.Заказ, ИСТИНА) = ИСТИНА
	//	        |			ТОГДА 0
	//	        |		ИНАЧЕ 1
	//	        |	КОНЕЦ Иначе 0 Конец КАК ИтогоПредварительно
	//	        |ИЗ
	//	        |	ВТ_РейсыСПараметрами КАК ВТ_РейсыСПараметрами
	//	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Заказы КАК ВТ_Заказы
	//	        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПредварительногоЗакрытияРейсов.СрезПоследних КАК СтатусыПредварительногоЗакрытияРейсовСрезПоследних
	//	        |			ПО ВТ_Заказы.Заказ = СтатусыПредварительногоЗакрытияРейсовСрезПоследних.Заказ
	//	        |		ПО ВТ_РейсыСПараметрами.Полигон = ВТ_Заказы.Полигон
	//	        |			И ВТ_РейсыСПараметрами.КатегорияЗаказа = ВТ_Заказы.КатегорияЗаказа
	//	        |			И (ЕСТЬNULL(ВТ_Заказы.Заказ, ИСТИНА) <> ИСТИНА) @СтрокаФильтра@
	//	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних КАК ПривязкаМашинКРейсамСрезПоследних
	//	        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыТранспорта.СрезПоследних КАК ДополнительныеПараметрыТранспортаСрезПоследних
	//	        |			ПО ПривязкаМашинКРейсамСрезПоследних.Транспорт = ДополнительныеПараметрыТранспортаСрезПоследних.Транспорт
	//	        |		ПО ВТ_РейсыСПараметрами.Рейс = ПривязкаМашинКРейсамСрезПоследних.Рейс @СтрокаФильтраВодителей@
	//	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПроверенныеДокументы.СрезПоследних КАК ПроверенныеДокументыСрезПоследних
	//	        |		ПО ВТ_РейсыСПараметрами.Рейс = ПроверенныеДокументыСрезПоследних.Документ
	//	        |
	//	        |СГРУППИРОВАТЬ ПО
	//	        |	ЕСТЬNULL(ВТ_Заказы.Заказ.Номер, ИСТИНА), @ДополнениеПоПолямГруппировки@
	//	        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт,
	//	        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Код,
	//	        |	ПривязкаМашинКРейсамСрезПоследних.Водитель,
	//	        |	ВТ_РейсыСПараметрами.Рейс.Ссылка,
	//	        |	ВТ_РейсыСПараметрами.Рейс.РольРейса,
	//	        |	ЕСТЬNULL(ВТ_РейсыСПараметрами.Полигон, """"),
	//	        |	ВЫБОР
	//	        |		КОГДА ЕСТЬNULL(ВТ_Заказы.Заказ, ИСТИНА) = ИСТИНА
	//	        |			ТОГДА 0
	//	        |		ИНАЧЕ 1
	//	        |	КОНЕЦ,
	//	        |	ВЫБОР
	//	        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации, ИСТИНА) = ИСТИНА
	//	        |			ТОГДА 40
	//	        |		КОГДА ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации = 0
	//	        |			ТОГДА 40
	//	        |		ИНАЧЕ ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации
	//	        |	КОНЕЦ,
	//	        |	ВТ_Заказы.Заказ.Ссылка,
	//	        |	ПривязкаМашинКРейсамСрезПоследних.Экспедитор,
	//	        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Наименование,
	//	        |	ВТ_Заказы.ВремяПрибытияС,
	//	        |	ВТ_Заказы.ВремяПрибытияПо,
	//	        |	ВТ_Заказы.КатегорияЗаказа,
	//	        |	ВЫБОР
	//	        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
	//	        |			ТОГДА 0
	//	        |		ИНАЧЕ ВТ_Заказы.Заказ.ОбщийВес
	//	        |	КОНЕЦ,
	//	        |	ВЫБОР
	//	        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
	//	        |			ТОГДА ВТ_Заказы.Заказ.Контрагент
	//	        |		ИНАЧЕ ВТ_Заказы.Заказ.ВладелецТовара
	//	        |	КОНЕЦ,
	//	        |	ВЫБОР
	//	        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
	//	        |			ТОГДА ВТ_Заказы.Заказ.ОбъемЗабора
	//	        |		ИНАЧЕ 0
	//	        |	КОНЕЦ,
	//	        |	ЕСТЬNULL(ПроверенныеДокументыСрезПоследних.ДокументПроверен, ЛОЖЬ),
	//			| Выбор когда ЕСТЬNULL(СтатусыПредварительногоЗакрытияРейсовСрезПоследних.СтатусПредварительногоЗакрытияРейса, ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытОкончательно)) = ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытПредварительно) Тогда
	//	        |	ВЫБОР
	//	        |		КОГДА ЕСТЬNULL(ВТ_Заказы.Заказ, ИСТИНА) = ИСТИНА
	//	        |			ТОГДА 0
	//	        |		ИНАЧЕ 1
	//	        |	КОНЕЦ Иначе 0 Конец				
	//	        |
	//	        |ОБЪЕДИНИТЬ ВСЕ
	//	        |
	//	        |ВЫБРАТЬ
	//	        |	0,
	//	        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт,
	//	        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Код,
	//	        |	"""",
	//	        |	ЕСТЬNULL(ВТ_ИндивидуальнаяМаршрутизация.Заказ.Номер, ИСТИНА), @ДополнениеПоПолямВторое@
	//	        |	1,
	//	        |	ПривязкаМашинКРейсамСрезПоследних.Водитель,
	//	        |	ВТ_РейсыСПараметрами.Рейс.Ссылка,
	//	        |	ВТ_РейсыСПараметрами.Рейс.РольРейса,
	//	        |	ВЫБОР
	//	        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации, ИСТИНА) = ИСТИНА
	//	        |			ТОГДА 40
	//	        |		КОГДА ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации = 0
	//	        |			ТОГДА 40
	//	        |		ИНАЧЕ ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации
	//	        |	КОНЕЦ,
	//	        |	ИСТИНА,
	//	        |	ВТ_ИндивидуальнаяМаршрутизация.Заказ.Ссылка,
	//	        |	ПривязкаМашинКРейсамСрезПоследних.Экспедитор,
	//	        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Наименование,
	//	        |	ВТ_ИндивидуальнаяМаршрутизация.ВремяПрибытияС,
	//	        |	ВТ_ИндивидуальнаяМаршрутизация.ВремяПрибытияПо,
	//	        |	ВТ_ИндивидуальнаяМаршрутизация.КатегорияЗаказа,
	//	        |	ВЫБОР
	//	        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ИндивидуальнаяМаршрутизация.Заказ) = ТИП(Документ.ЗаборТовара)
	//	        |			ТОГДА 0
	//	        |		ИНАЧЕ ВТ_ИндивидуальнаяМаршрутизация.Заказ.ОбщийВес
	//	        |	КОНЕЦ,
	//	        |	ВЫБОР
	//	        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ИндивидуальнаяМаршрутизация.Заказ) = ТИП(Документ.ЗаборТовара)
	//	        |			ТОГДА ВТ_ИндивидуальнаяМаршрутизация.Заказ.Контрагент
	//	        |		ИНАЧЕ ВТ_ИндивидуальнаяМаршрутизация.Заказ.ВладелецТовара
	//	        |	КОНЕЦ,
	//	        |	ВЫБОР
	//	        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ИндивидуальнаяМаршрутизация.Заказ) = ТИП(Документ.ЗаборТовара)
	//	        |			ТОГДА ВТ_ИндивидуальнаяМаршрутизация.Заказ.ОбъемЗабора
	//	        |		ИНАЧЕ 0
	//	        |	КОНЕЦ,
	//	        |	ЕСТЬNULL(ПроверенныеДокументыСрезПоследних.ДокументПроверен, ЛОЖЬ),
	//			| Выбор когда ЕСТЬNULL(СтатусыПредварительногоЗакрытияРейсовСрезПоследних.СтатусПредварительногоЗакрытияРейса, ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытОкончательно)) = ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытПредварительно) Тогда
	//	   		| 1 Иначе 0 Конец
	//	        |ИЗ
	//	        |	ВТ_РейсыСПараметрами КАК ВТ_РейсыСПараметрами
	//	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних(, ) КАК ПривязкаМашинКРейсамСрезПоследних
	//	        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыТранспорта.СрезПоследних КАК ДополнительныеПараметрыТранспортаСрезПоследних
	//	        |			ПО ПривязкаМашинКРейсамСрезПоследних.Транспорт = ДополнительныеПараметрыТранспортаСрезПоследних.Транспорт
	//	        |		ПО ВТ_РейсыСПараметрами.Рейс = ПривязкаМашинКРейсамСрезПоследних.Рейс
	//	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ИндивидуальнаяМаршрутизация КАК ВТ_ИндивидуальнаяМаршрутизация
	//	        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПредварительногоЗакрытияРейсов.СрезПоследних КАК СтатусыПредварительногоЗакрытияРейсовСрезПоследних
	//	        |			ПО ВТ_ИндивидуальнаяМаршрутизация.Заказ = СтатусыПредварительногоЗакрытияРейсовСрезПоследних.Заказ
	//	        |		ПО ВТ_РейсыСПараметрами.Рейс = ВТ_ИндивидуальнаяМаршрутизация.Рейс @СтрокаФильтраВторая@
	//	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПроверенныеДокументы.СрезПоследних КАК ПроверенныеДокументыСрезПоследних
	//	        |		ПО ВТ_РейсыСПараметрами.Рейс = ПроверенныеДокументыСрезПоследних.Документ
	//	        |
	//	        |СГРУППИРОВАТЬ ПО
	//	        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт,
	//	        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Код,
	//	        |	ЕСТЬNULL(ВТ_ИндивидуальнаяМаршрутизация.Заказ.Номер, ИСТИНА), @ДополнениеПоПолямГруппировкиВторое@
	//	        |	ПривязкаМашинКРейсамСрезПоследних.Водитель,
	//	        |	ВТ_РейсыСПараметрами.Рейс.Ссылка,
	//	        |	ВТ_РейсыСПараметрами.Рейс.РольРейса,
	//	        |	ВЫБОР
	//	        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации, ИСТИНА) = ИСТИНА
	//	        |			ТОГДА 40
	//	        |		КОГДА ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации = 0
	//	        |			ТОГДА 40
	//	        |		ИНАЧЕ ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации
	//	        |	КОНЕЦ,
	//	        |	ВТ_ИндивидуальнаяМаршрутизация.Заказ.Ссылка,
	//	        |	ПривязкаМашинКРейсамСрезПоследних.Экспедитор,
	//	        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Наименование,
	//	        |	ВТ_ИндивидуальнаяМаршрутизация.КатегорияЗаказа,
	//	        |	ВТ_ИндивидуальнаяМаршрутизация.ВремяПрибытияС,
	//	        |	ВТ_ИндивидуальнаяМаршрутизация.ВремяПрибытияПо,
	//	        |	ВЫБОР
	//	        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ИндивидуальнаяМаршрутизация.Заказ) = ТИП(Документ.ЗаборТовара)
	//	        |			ТОГДА 0
	//	        |		ИНАЧЕ ВТ_ИндивидуальнаяМаршрутизация.Заказ.ОбщийВес
	//	        |	КОНЕЦ,
	//	        |	ВЫБОР
	//	        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ИндивидуальнаяМаршрутизация.Заказ) = ТИП(Документ.ЗаборТовара)
	//	        |			ТОГДА ВТ_ИндивидуальнаяМаршрутизация.Заказ.Контрагент
	//	        |		ИНАЧЕ ВТ_ИндивидуальнаяМаршрутизация.Заказ.ВладелецТовара
	//	        |	КОНЕЦ,
	//	        |	ВЫБОР
	//	        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ИндивидуальнаяМаршрутизация.Заказ) = ТИП(Документ.ЗаборТовара)
	//	        |			ТОГДА ВТ_ИндивидуальнаяМаршрутизация.Заказ.ОбъемЗабора
	//	        |		ИНАЧЕ 0
	//	        |	КОНЕЦ,
	//	        |	ЕСТЬNULL(ПроверенныеДокументыСрезПоследних.ДокументПроверен, ЛОЖЬ),
	//			| Выбор когда ЕСТЬNULL(СтатусыПредварительногоЗакрытияРейсовСрезПоследних.СтатусПредварительногоЗакрытияРейса, ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытОкончательно)) = ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытПредварительно) Тогда
	//	   		| 1 Иначе 0 Конец
	//	        |
	//	        |УПОРЯДОЧИТЬ ПО
	//	        |	ТранспортНаименование
	//	        |ИТОГИ
	//	        |	МИНИМУМ(Отметка),
	//			|	МИНИМУМ(ДокументПроверен),
	//	        |	МАКСИМУМ(Транспорт),
	//	        |	МАКСИМУМ(ТранспортКод),
	//	        |	СУММА(Итого),
	//	        |	МАКСИМУМ(Водитель),
	//	        |	МАКСИМУМ(РольРейса), @ДополнениеПоПолямИтогов@
	//	        |	МАКСИМУМ(МаксимальноеКоличествоЗаказов),
	//	        |	МАКСИМУМ(Экспедитор),
	//	        |	МАКСИМУМ(ТранспортНаименование),
	//	        |	СУММА(ВесЗаказа),
	//			|	СУММА(ИтогоПредварительно),
	//	        |	СУММА(ОбъемЗабора)
	//	        |ПО
	//	        |	Рейс";
	//	
	//КонецЕсли;
	
	//Новый запрос
	Если МаршрутизацияЗакрыта Тогда
				Возврат "ВЫБРАТЬ
				        |	РеализацияТоваровУслуг.Ссылка КАК Заказ,
				        |	ВЫБОР
				        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
				        |			ТОГДА 1
				        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
				        |			ТОГДА 1
				        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк
				        |	КОНЕЦ КАК КатегорияЗаказа,
				        |	РейсЗаказы.Ссылка КАК Рейс,
				        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияС КАК ВремяПрибытияС,
				        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияПо КАК ВремяПрибытияПо,
				        |	ВЫБОР
				        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
				        |			ТОГДА 1
				        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
				        |			ТОГДА 1
				        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк.Код
				        |	КОНЕЦ КАК КатегорияЗаказаКод
				        |ПОМЕСТИТЬ ВТ_Заказы
				        |ИЗ
				        |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
				        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
				        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АктуальнаяСхемаЛогистическихБрейков.СрезПоследних КАК АктуальнаяСхемаЛогистическихБрейковСрезПоследних
				        |			ПО ДополнительныеПараметрыЗаказа.СхемаЛогистическихБрейков.Ссылка = АктуальнаяСхемаЛогистическихБрейковСрезПоследних.СхемаЛогистическихБрейков.Ссылка
				        |		ПО РеализацияТоваровУслуг.Ссылка = ДополнительныеПараметрыЗаказа.Заказ.Ссылка
				        |			И (ДополнительныеПараметрыЗаказа.Доставка <> ЗНАЧЕНИЕ(БизнесПроцесс.новаМестнаяДоставка.ПустаяСсылка))
				        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Рейс.Заказы КАК РейсЗаказы
				        |		ПО (РеализацияТоваровУслуг.Ссылка = (ВЫРАЗИТЬ(РейсЗаказы.Заказ КАК Документ.РеализацияТоваровУслуг)))
				        |ГДЕ
				        |	РейсЗаказы.Ссылка.ДатаРейса = &ДатаНач
						//+Широков 24.06.2021 Задача 4607	
						|			И (ДополнительныеПараметрыЗаказа.ВнешнийОператорМаршрутизации.Ссылка ЕСТЬ NULL)
						//-Широков 24.06.2021 Задача 4607	
				        |	И РейсЗаказы.Ссылка.Проведен = ИСТИНА
				        |	И РейсЗаказы.УдаленИзРейса = ЛОЖЬ
				        |	И РейсЗаказы.Ссылка.ТерминалДоставки = &ТерминалДоставки
				        |
				        |СГРУППИРОВАТЬ ПО
				        |	РеализацияТоваровУслуг.Ссылка,
				        |	ВЫБОР
				        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
				        |			ТОГДА 1
				        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
				        |			ТОГДА 1
				        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк
				        |	КОНЕЦ,
				        |	РейсЗаказы.Ссылка,
				        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияС,
				        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияПо,
				        |	ВЫБОР
				        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
				        |			ТОГДА 1
				        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
				        |			ТОГДА 1
				        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк.Код
				        |	КОНЕЦ
				        |
				        |ОБЪЕДИНИТЬ ВСЕ
				        |
				        |ВЫБРАТЬ
				        |	ЗаборТовара.Ссылка,
				        |	&ЗаборнаяКатегория,
				        |	РейсЗаказы.Ссылка,
				        |	ЗаборТовара.ВремяДоставкиС,
				        |	ЗаборТовара.ВремяДоставкиПо,
				        |	&ЗаборнаяКатегорияКод
				        |ИЗ
				        |	Документ.Рейс.Заказы КАК РейсЗаказы
				        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаборТовара КАК ЗаборТовара
				        |		ПО ((ВЫРАЗИТЬ(РейсЗаказы.Заказ КАК Документ.ЗаборТовара)) = ЗаборТовара.Ссылка)
				        |ГДЕ
				        |	РейсЗаказы.Ссылка.Проведен = ИСТИНА
				        |	И РейсЗаказы.Ссылка.ДатаРейса = &ДатаНач
				        |	И РейсЗаказы.УдаленИзРейса = ЛОЖЬ
				        |	И РейсЗаказы.Ссылка.ТерминалДоставки = &ТерминалДоставки
				        |;
				        |
				        |////////////////////////////////////////////////////////////////////////////////
				        |ВЫБРАТЬ
				        |	РейсДокументДляПараметров.Ссылка КАК Рейс
				        |ПОМЕСТИТЬ ВТ_РейсыСПараметрами
				        |ИЗ
				        |	Документ.Рейс КАК РейсДокументДляПараметров
				        |ГДЕ
				        |	РейсДокументДляПараметров.Проведен = ИСТИНА
				        |	И РейсДокументДляПараметров.ДатаРейса = &ДатаНач
				        |	И РейсДокументДляПараметров.ТерминалДоставки = &ТерминалДоставки
				        |;
				        |
				        |////////////////////////////////////////////////////////////////////////////////
				        |ВЫБРАТЬ
				        |	0 КАК Отметка,
				        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт КАК Транспорт,
				        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Код КАК ТранспортКод,
				        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Наименование КАК ТранспортНаименование,
				        |	ЕСТЬNULL(ВТ_Заказы.Заказ.Номер, ИСТИНА) КАК НомерЗаказа,@ДополнениеПоПолям@
				        |	ВЫБОР
				        |		КОГДА ЕСТЬNULL(ВТ_Заказы.Заказ, ИСТИНА) = ИСТИНА
				        |			ТОГДА 0
				        |		ИНАЧЕ 1
				        |	КОНЕЦ КАК Итого,
				        |	ПривязкаМашинКРейсамСрезПоследних.Водитель КАК Водитель,
				        |	ВТ_РейсыСПараметрами.Рейс.Ссылка КАК Рейс,
				        |	ВТ_РейсыСПараметрами.Рейс.РольРейса КАК РольРейса,
				        |	ВЫБОР
				        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации, ИСТИНА) = ИСТИНА
				        |			ТОГДА 40
				        |		КОГДА ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации = 0
				        |			ТОГДА 40
				        |		ИНАЧЕ ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации
				        |	КОНЕЦ КАК МаксимальноеКоличествоЗаказов,
				        |	ЛОЖЬ КАК ИндивидуальнаяМаршрутизация,
				        |	ВТ_Заказы.Заказ.Ссылка КАК ЗаказСсылка,
				        |	ПривязкаМашинКРейсамСрезПоследних.Экспедитор КАК Экспедитор,
				        |	ВЫБОР
				        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
				        |			ТОГДА 0
				        |		ИНАЧЕ ВТ_Заказы.Заказ.ОбщийВес
				        |	КОНЕЦ КАК ВесЗаказа,
				        |	ВЫБОР
				        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
				        |			ТОГДА ВТ_Заказы.Заказ.Контрагент
				        |		ИНАЧЕ ВТ_Заказы.Заказ.ВладелецТовара
				        |	КОНЕЦ КАК Партнер,
				        |	ВТ_Заказы.ВремяПрибытияС КАК ВремяПрибытияС,
				        |	ВТ_Заказы.ВремяПрибытияПо КАК ВремяПрибытияПо,
				        |	ВЫБОР
				        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
				        |			ТОГДА ВТ_Заказы.Заказ.ОбъемЗабора
				        |		ИНАЧЕ 0
				        |	КОНЕЦ КАК ОбъемЗабора,
				        |	"""" КАК УИД,
				        |	ВТ_Заказы.КатегорияЗаказа КАК КатегорияЗаказа,
				        |	ЕСТЬNULL(ПроверенныеДокументыСрезПоследних.ДокументПроверен, ЛОЖЬ) КАК ДокументПроверен
				        |ИЗ
				        |	ВТ_РейсыСПараметрами КАК ВТ_РейсыСПараметрами
				        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Заказы КАК ВТ_Заказы
				        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПредварительногоЗакрытияРейсов.СрезПоследних КАК СтатусыПредварительногоЗакрытияРейсовСрезПоследних
				        |			ПО ВТ_Заказы.Заказ = СтатусыПредварительногоЗакрытияРейсовСрезПоследних.Заказ
				        |		ПО ВТ_РейсыСПараметрами.Рейс = ВТ_Заказы.Рейс @СтрокаФильтра@
				        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних КАК ПривязкаМашинКРейсамСрезПоследних
				        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыТранспорта.СрезПоследних КАК ДополнительныеПараметрыТранспортаСрезПоследних
				        |			ПО ПривязкаМашинКРейсамСрезПоследних.Транспорт.Ссылка = ДополнительныеПараметрыТранспортаСрезПоследних.Транспорт.Ссылка
				        |		ПО ВТ_РейсыСПараметрами.Рейс.Ссылка = ПривязкаМашинКРейсамСрезПоследних.Рейс.Ссылка @СтрокаФильтраВодителей@
				        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПроверенныеДокументы.СрезПоследних КАК ПроверенныеДокументыСрезПоследних
				        |		ПО ВТ_РейсыСПараметрами.Рейс = ПроверенныеДокументыСрезПоследних.Документ
				        |
				        |СГРУППИРОВАТЬ ПО
				        |	ЕСТЬNULL(ВТ_Заказы.Заказ.Номер, ИСТИНА), @ДополнениеПоПолямГруппировки@
				        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт,
				        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Код,
				        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Наименование,
				        |	ПривязкаМашинКРейсамСрезПоследних.Водитель,
				        |	ВТ_РейсыСПараметрами.Рейс.Ссылка,
				        |	ВТ_РейсыСПараметрами.Рейс.РольРейса,
				        |	ВЫБОР
				        |		КОГДА ЕСТЬNULL(ВТ_Заказы.Заказ, ИСТИНА) = ИСТИНА
				        |			ТОГДА 0
				        |		ИНАЧЕ 1
				        |	КОНЕЦ,
				        |	ВЫБОР
				        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации, ИСТИНА) = ИСТИНА
				        |			ТОГДА 40
				        |		КОГДА ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации = 0
				        |			ТОГДА 40
				        |		ИНАЧЕ ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации
				        |	КОНЕЦ,
				        |	ВТ_Заказы.Заказ.Ссылка,
				        |	ПривязкаМашинКРейсамСрезПоследних.Экспедитор,
				        |	ВЫБОР
				        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
				        |			ТОГДА 0
				        |		ИНАЧЕ ВТ_Заказы.Заказ.ОбщийВес
				        |	КОНЕЦ,
				        |	ВЫБОР
				        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
				        |			ТОГДА ВТ_Заказы.Заказ.Контрагент
				        |		ИНАЧЕ ВТ_Заказы.Заказ.ВладелецТовара
				        |	КОНЕЦ,
				        |	ВТ_Заказы.ВремяПрибытияС,
				        |	ВТ_Заказы.ВремяПрибытияПо,
				        |	ВТ_Заказы.КатегорияЗаказа,
				        |	ВЫБОР
				        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
				        |			ТОГДА ВТ_Заказы.Заказ.ОбъемЗабора
				        |		ИНАЧЕ 0
				        |	КОНЕЦ,
				        |	ЕСТЬNULL(ПроверенныеДокументыСрезПоследних.ДокументПроверен, ЛОЖЬ)
				        |
				        |УПОРЯДОЧИТЬ ПО
				        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Наименование
				        |ИТОГИ
				        |	МИНИМУМ(Отметка),
				        |	МАКСИМУМ(Транспорт),
				        |	МАКСИМУМ(ТранспортКод),
				        |	МАКСИМУМ(ТранспортНаименование),
				        |	СУММА(Итого),
						|	МИНИМУМ(ДокументПроверен),
				        |	МАКСИМУМ(Водитель),
				        |	МАКСИМУМ(РольРейса),  @ДополнениеПоПолямИтогов@
				        |	МАКСИМУМ(МаксимальноеКоличествоЗаказов)
				        |ПО
				        |	Рейс";		
	Иначе
		Возврат "ВЫБРАТЬ
		        |	ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Заказ КАК Заказ,
		        |	ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Рейс КАК Рейс,
		        |	ДополнительныеПараметрыЗаказа.ЛогистическийБрейк КАК КатегорияЗаказа,
		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияС КАК ВремяПрибытияС,
		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияПо КАК ВремяПрибытияПо,
		        |	ДополнительныеПараметрыЗаказа.ЛогистическийБрейк.Код КАК КатегорияЗаказаКод
		        |ПОМЕСТИТЬ ВТ_ИндивидуальнаяМаршрутизация
		        |ИЗ
		        |	РегистрСведений.ИндивидуальнаяМаршрутизацияПоРейсам.СрезПоследних(, ДатаПланирования = &ДатаНач) КАК ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних
		        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
		        |		ПО ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Заказ = ДополнительныеПараметрыЗаказа.Заказ
		        |ГДЕ
		        |	ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Рейс.Ссылка <> ЗНАЧЕНИЕ(Документ.Рейс.ПустаяСсылка)
		        |	И ТИПЗНАЧЕНИЯ(ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Заказ.Ссылка) = ТИП(Документ.РеализацияТоваровУслуг)
		        |
		        |ОБЪЕДИНИТЬ
		        |
		        |ВЫБРАТЬ
		        |	ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Заказ,
		        |	ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Рейс,
		        |	&ЗаборнаяКатегория,
		        |	ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Заказ.ВремяДоставкиС,
		        |	ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Заказ.ВремяДоставкиПо,
		        |	&ЗаборнаяКатегорияКод
		        |ИЗ
		        |	РегистрСведений.ИндивидуальнаяМаршрутизацияПоРейсам.СрезПоследних(, ДатаПланирования = &ДатаНач) КАК ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних
		        |ГДЕ
		        |	ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Рейс.Ссылка <> ЗНАЧЕНИЕ(Документ.Рейс.ПустаяСсылка)
		        |	И ТИПЗНАЧЕНИЯ(ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Заказ.Ссылка) = ТИП(Документ.ЗаборТовара)
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	РеализацияТоваровУслуг.Ссылка КАК Заказ,
		        |	ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка) КАК ТипЗаказа,
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
		        |			ТОГДА 1
		        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
		        |			ТОГДА 1
		        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк
		        |	КОНЕЦ КАК КатегорияЗаказа,
		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияС КАК ВремяПрибытияС,
		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияПо КАК ВремяПрибытияПо
		        |ПОМЕСТИТЬ ВТ_Заказы_1
		        |ИЗ
		        |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
		        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АктуальнаяСхемаЛогистическихБрейков.СрезПоследних КАК АктуальнаяСхемаЛогистическихБрейковСрезПоследних
		        |			ПО ДополнительныеПараметрыЗаказа.СхемаЛогистическихБрейков.Ссылка = АктуальнаяСхемаЛогистическихБрейковСрезПоследних.СхемаЛогистическихБрейков.Ссылка
		        |		ПО РеализацияТоваровУслуг.Ссылка = ДополнительныеПараметрыЗаказа.Заказ.Ссылка
		        |			И (ДополнительныеПараметрыЗаказа.Доставка <> ЗНАЧЕНИЕ(БизнесПроцесс.новаМестнаяДоставка.ПустаяСсылка))
		        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КорзинаПолигональнойМаршрутизации.СрезПоследних(
		        |				,
		        |				ДатаПланирования = &ДатаНач
		        |					И ТерминалДоставки.Ссылка = &ТерминалДоставки) КАК КорзинаПолигональнойМаршрутизацииСрезПоследних
		        |		ПО (РеализацияТоваровУслуг.Ссылка = ВЫРАЗИТЬ(КорзинаПолигональнойМаршрутизацииСрезПоследних.Заказ КАК Документ.РеализацияТоваровУслуг).Ссылка)
		        |			И (КорзинаПолигональнойМаршрутизацииСрезПоследних.ЗаказВКорзине = ИСТИНА)
		        |ГДЕ
		        |	РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНач И &ДатаКон
						//+Широков 24.06.2021 Задача 4607	
				|			И (ДополнительныеПараметрыЗаказа.ВнешнийОператорМаршрутизации.Ссылка ЕСТЬ NULL)
						//-Широков 24.06.2021 Задача 4607	
		        |	И РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
		        |	И РеализацияТоваровУслуг.СтатусИнтернетМагазина = 2
		        |	И РеализацияТоваровУслуг.ТерминалДоставки = &ТерминалДоставки
		        |	И ЕСТЬNULL(КорзинаПолигональнойМаршрутизацииСрезПоследних.Период, ИСТИНА) = ИСТИНА
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	РеализацияТоваровУслуг.Ссылка,
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ЛогистическийБрейк, ИСТИНА) = ИСТИНА
		        |			ТОГДА 1
		        |		КОГДА ДополнительныеПараметрыЗаказа.ЛогистическийБрейк = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
		        |			ТОГДА 1
		        |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ЛогистическийБрейк
		        |	КОНЕЦ,
		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияС,
		        |	ДополнительныеПараметрыЗаказа.Доставка.ВремяПрибытияПо
		        |
		        |ОБЪЕДИНИТЬ ВСЕ
		        |
		        |ВЫБРАТЬ
		        |	ЗаборТовара.Ссылка,
		        |	ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор),
		        |	&ЗаборнаяКатегория,
		        |	ЗаборТовара.ВремяДоставкиС,
		        |	ЗаборТовара.ВремяДоставкиПо
		        |ИЗ
		        |	Документ.ЗаборТовара КАК ЗаборТовара
		        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КорзинаПолигональнойМаршрутизации.СрезПоследних(
		        |				,
		        |				ДатаПланирования = &ДатаНач
		        |					И ТерминалДоставки.Ссылка = &ТерминалДоставки) КАК КорзинаПолигональнойМаршрутизацииСрезПоследних
		        |		ПО (ЗаборТовара.Ссылка = ВЫРАЗИТЬ(КорзинаПолигональнойМаршрутизацииСрезПоследних.Заказ КАК Документ.ЗаборТовара).Ссылка)
		        |			И (КорзинаПолигональнойМаршрутизацииСрезПоследних.ЗаказВКорзине = ИСТИНА)
		        |ГДЕ
		        |	ЗаборТовара.Дата МЕЖДУ &ДатаНач И &ДатаКон
		        |	И ЗаборТовара.СтатусИнтернетМагазина = 2
		        |	И ЗаборТовара.ПометкаУдаления = ЛОЖЬ
		        |	И ЗаборТовара.ТерминалДоставки = &ТерминалДоставки
		        |	И ЕСТЬNULL(КорзинаПолигональнойМаршрутизацииСрезПоследних.Период, ИСТИНА) = ИСТИНА
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ЗаборТовара.Ссылка,
		        |	ЗаборТовара.ВремяДоставкиС,
		        |	ЗаборТовара.ВремяДоставкиПо
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ВТ_Заказы_1.КатегорияЗаказа КАК КатегорияЗаказа,
		        |	ВТ_Заказы_1.КатегорияЗаказа.Код КАК КатегорияЗаказаКод,
		        |	ЕСТЬNULL(ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации, ЗНАЧЕНИЕ(Справочник.ПолигоныМаршрутизации.ПустаяСсылка)) КАК Полигон,
		        |	ВТ_Заказы_1.Заказ КАК Заказ,
		        |	ВТ_Заказы_1.ВремяПрибытияС КАК ВремяПрибытияС,
		        |	ВТ_Заказы_1.ВремяПрибытияПо КАК ВремяПрибытияПо
		        |ПОМЕСТИТЬ ВТ_Заказы
		        |ИЗ
		        |	ВТ_Заказы_1 КАК ВТ_Заказы_1
		        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПолигоныМаршрутизацииЗаказов.СрезПоследних(, СхемаМаршрутизации.Ссылка = &СхемаМаршрутизации) КАК ПолигоныМаршрутизацииЗаказовСрезПоследних
		        |		ПО ВТ_Заказы_1.Заказ = ПолигоныМаршрутизацииЗаказовСрезПоследних.Заказ
		        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИндивидуальнаяМаршрутизация КАК ВТ_ИндивидуальнаяМаршрутизация
		        |		ПО ВТ_Заказы_1.Заказ = ВТ_ИндивидуальнаяМаршрутизация.Заказ
		        |ГДЕ
		        |	ЕСТЬNULL(ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации, ИСТИНА) <> ИСТИНА
		        |	И ЕСТЬNULL(ВТ_ИндивидуальнаяМаршрутизация.Заказ, ИСТИНА) = ИСТИНА
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ВТ_Заказы_1.КатегорияЗаказа,
		        |	ВТ_Заказы_1.КатегорияЗаказа.Код,
		        |	ЕСТЬNULL(ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации, ЗНАЧЕНИЕ(Справочник.ПолигоныМаршрутизации.ПустаяСсылка)),
		        |	ВТ_Заказы_1.Заказ,
		        |	ВТ_Заказы_1.ВремяПрибытияС,
		        |	ВТ_Заказы_1.ВремяПрибытияПо
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	РейсДокументДляПараметров.Ссылка КАК Рейс,
		        |	ПолигоныИКатегорииЗаказовДляРейсов.Полигон КАК Полигон,
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ПолигоныИКатегорииЗаказовДляРейсов.КатегорияЗаказа, ИСТИНА) = ИСТИНА
		        |			ТОГДА ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
		        |		КОГДА ПолигоныИКатегорииЗаказовДляРейсов.КатегорияЗаказа = ЗНАЧЕНИЕ(Справочник.ЛогистическиеБрейки.ПустаяСсылка)
		        |			ТОГДА 1
		        |		ИНАЧЕ ПолигоныИКатегорииЗаказовДляРейсов.КатегорияЗаказа
		        |	КОНЕЦ КАК КатегорияЗаказа
		        |ПОМЕСТИТЬ ВТ_РейсыСПараметрами
		        |ИЗ
		        |	Документ.Рейс КАК РейсДокументДляПараметров
		        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПолигоныИКатегорииЗаказовДляРейсов КАК ПолигоныИКатегорииЗаказовДляРейсов
		        |		ПО (ПолигоныИКатегорииЗаказовДляРейсов.Рейс = РейсДокументДляПараметров.Ссылка)
		        |ГДЕ
		        |	РейсДокументДляПараметров.Проведен = ИСТИНА
		        |	И РейсДокументДляПараметров.ДатаРейса = &ДатаНач
		        |	И РейсДокументДляПараметров.МетодикаМаршрутизации = ЗНАЧЕНИЕ(Перечисление.МетодикаЛогистическойМаршрутизации.ПолигональнаяМаршрутизация)
		        |	И РейсДокументДляПараметров.ТерминалДоставки = &ТерминалДоставки
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	0 КАК Отметка,
		        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт КАК Транспорт,
		        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Код КАК ТранспортКод,
		        |	"""" КАК УИД,
		        |	ЕСТЬNULL(ВТ_Заказы.Заказ.Номер, ИСТИНА) КАК НомерЗаказа, @ДополнениеПоПолям@
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ВТ_Заказы.Заказ, ИСТИНА) = ИСТИНА
		        |			ТОГДА 0
		        |		ИНАЧЕ 1
		        |	КОНЕЦ КАК Итого,
		        |	ПривязкаМашинКРейсамСрезПоследних.Водитель КАК Водитель,
		        |	ВТ_РейсыСПараметрами.Рейс.Ссылка КАК Рейс,
		        |	ВТ_РейсыСПараметрами.Рейс.РольРейса КАК РольРейса,
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации, ИСТИНА) = ИСТИНА
		        |			ТОГДА 40
		        |		КОГДА ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации = 0
		        |			ТОГДА 40
		        |		ИНАЧЕ ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации
		        |	КОНЕЦ КАК МаксимальноеКоличествоЗаказов,
		        |	ЛОЖЬ КАК ИндивидуальнаяМаршрутизация,
		        |	ВТ_Заказы.Заказ.Ссылка КАК ЗаказСсылка,
		        |	ПривязкаМашинКРейсамСрезПоследних.Экспедитор КАК Экспедитор,
		        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Наименование КАК ТранспортНаименование,
		        |	ВТ_Заказы.ВремяПрибытияС КАК ВремяПрибытияС,
		        |	ВТ_Заказы.ВремяПрибытияПо КАК ВремяПрибытияПо,
		        |	ВТ_Заказы.КатегорияЗаказа КАК КатегорияЗаказа,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА 0
		        |		ИНАЧЕ ВТ_Заказы.Заказ.ОбщийВес
		        |	КОНЕЦ КАК ВесЗаказа,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_Заказы.Заказ.Контрагент
		        |		ИНАЧЕ ВТ_Заказы.Заказ.ВладелецТовара
		        |	КОНЕЦ КАК Партнер,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_Заказы.Заказ.ОбъемЗабора
		        |		ИНАЧЕ 0
		        |	КОНЕЦ КАК ОбъемЗабора,
		        |	ЕСТЬNULL(ПроверенныеДокументыСрезПоследних.ДокументПроверен, ЛОЖЬ) КАК ДокументПроверен,
				| Выбор когда ЕСТЬNULL(СтатусыПредварительногоЗакрытияРейсовСрезПоследних.СтатусПредварительногоЗакрытияРейса, ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытОкончательно)) = ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытПредварительно) Тогда
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ВТ_Заказы.Заказ, ИСТИНА) = ИСТИНА
		        |			ТОГДА 0
		        |		ИНАЧЕ 1
		        |	КОНЕЦ Иначе 0 Конец КАК ИтогоПредварительно
		        |ИЗ
		        |	ВТ_РейсыСПараметрами КАК ВТ_РейсыСПараметрами
		        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Заказы КАК ВТ_Заказы
		        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПредварительногоЗакрытияРейсов.СрезПоследних КАК СтатусыПредварительногоЗакрытияРейсовСрезПоследних
		        |			ПО ВТ_Заказы.Заказ = СтатусыПредварительногоЗакрытияРейсовСрезПоследних.Заказ
		        |		ПО ВТ_РейсыСПараметрами.Полигон = ВТ_Заказы.Полигон
		        |			И ВТ_РейсыСПараметрами.КатегорияЗаказа = ВТ_Заказы.КатегорияЗаказа
		        |			И (ЕСТЬNULL(ВТ_Заказы.Заказ, ИСТИНА) <> ИСТИНА) @СтрокаФильтра@
		        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних КАК ПривязкаМашинКРейсамСрезПоследних
		        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыТранспорта.СрезПоследних КАК ДополнительныеПараметрыТранспортаСрезПоследних
		        |			ПО ПривязкаМашинКРейсамСрезПоследних.Транспорт = ДополнительныеПараметрыТранспортаСрезПоследних.Транспорт
		        |		ПО ВТ_РейсыСПараметрами.Рейс = ПривязкаМашинКРейсамСрезПоследних.Рейс @СтрокаФильтраВодителей@
		        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПроверенныеДокументы.СрезПоследних КАК ПроверенныеДокументыСрезПоследних
		        |		ПО ВТ_РейсыСПараметрами.Рейс = ПроверенныеДокументыСрезПоследних.Документ
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ЕСТЬNULL(ВТ_Заказы.Заказ.Номер, ИСТИНА), @ДополнениеПоПолямГруппировки@
		        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт,
		        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Код,
		        |	ПривязкаМашинКРейсамСрезПоследних.Водитель,
		        |	ВТ_РейсыСПараметрами.Рейс.Ссылка,
		        |	ВТ_РейсыСПараметрами.Рейс.РольРейса,
		        |	ЕСТЬNULL(ВТ_РейсыСПараметрами.Полигон, """"),
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ВТ_Заказы.Заказ, ИСТИНА) = ИСТИНА
		        |			ТОГДА 0
		        |		ИНАЧЕ 1
		        |	КОНЕЦ,
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации, ИСТИНА) = ИСТИНА
		        |			ТОГДА 40
		        |		КОГДА ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации = 0
		        |			ТОГДА 40
		        |		ИНАЧЕ ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации
		        |	КОНЕЦ,
		        |	ВТ_Заказы.Заказ.Ссылка,
		        |	ПривязкаМашинКРейсамСрезПоследних.Экспедитор,
		        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Наименование,
		        |	ВТ_Заказы.ВремяПрибытияС,
		        |	ВТ_Заказы.ВремяПрибытияПо,
		        |	ВТ_Заказы.КатегорияЗаказа,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА 0
		        |		ИНАЧЕ ВТ_Заказы.Заказ.ОбщийВес
		        |	КОНЕЦ,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_Заказы.Заказ.Контрагент
		        |		ИНАЧЕ ВТ_Заказы.Заказ.ВладелецТовара
		        |	КОНЕЦ,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Заказы.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_Заказы.Заказ.ОбъемЗабора
		        |		ИНАЧЕ 0
		        |	КОНЕЦ,
		        |	ЕСТЬNULL(ПроверенныеДокументыСрезПоследних.ДокументПроверен, ЛОЖЬ),
				| Выбор когда ЕСТЬNULL(СтатусыПредварительногоЗакрытияРейсовСрезПоследних.СтатусПредварительногоЗакрытияРейса, ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытОкончательно)) = ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытПредварительно) Тогда
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ВТ_Заказы.Заказ, ИСТИНА) = ИСТИНА
		        |			ТОГДА 0
		        |		ИНАЧЕ 1
		        |	КОНЕЦ Иначе 0 Конец				
		        |
		        |ОБЪЕДИНИТЬ ВСЕ
		        |
		        |ВЫБРАТЬ
		        |	0,
		        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт,
		        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Код,
		        |	"""",
		        |	ЕСТЬNULL(ВТ_ИндивидуальнаяМаршрутизация.Заказ.Номер, ИСТИНА), @ДополнениеПоПолямВторое@
		        |	1,
		        |	ПривязкаМашинКРейсамСрезПоследних.Водитель,
		        |	ВТ_РейсыСПараметрами.Рейс.Ссылка,
		        |	ВТ_РейсыСПараметрами.Рейс.РольРейса,
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации, ИСТИНА) = ИСТИНА
		        |			ТОГДА 40
		        |		КОГДА ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации = 0
		        |			ТОГДА 40
		        |		ИНАЧЕ ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации
		        |	КОНЕЦ,
		        |	ИСТИНА,
		        |	ВТ_ИндивидуальнаяМаршрутизация.Заказ.Ссылка,
		        |	ПривязкаМашинКРейсамСрезПоследних.Экспедитор,
		        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Наименование,
		        |	ВТ_ИндивидуальнаяМаршрутизация.ВремяПрибытияС,
		        |	ВТ_ИндивидуальнаяМаршрутизация.ВремяПрибытияПо,
		        |	ВТ_ИндивидуальнаяМаршрутизация.КатегорияЗаказа,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ИндивидуальнаяМаршрутизация.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА 0
		        |		ИНАЧЕ ВТ_ИндивидуальнаяМаршрутизация.Заказ.ОбщийВес
		        |	КОНЕЦ,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ИндивидуальнаяМаршрутизация.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_ИндивидуальнаяМаршрутизация.Заказ.Контрагент
		        |		ИНАЧЕ ВТ_ИндивидуальнаяМаршрутизация.Заказ.ВладелецТовара
		        |	КОНЕЦ,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ИндивидуальнаяМаршрутизация.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_ИндивидуальнаяМаршрутизация.Заказ.ОбъемЗабора
		        |		ИНАЧЕ 0
		        |	КОНЕЦ,
		        |	ЕСТЬNULL(ПроверенныеДокументыСрезПоследних.ДокументПроверен, ЛОЖЬ),
				| Выбор когда ЕСТЬNULL(СтатусыПредварительногоЗакрытияРейсовСрезПоследних.СтатусПредварительногоЗакрытияРейса, ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытОкончательно)) = ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытПредварительно) Тогда
		   		| 1 Иначе 0 Конец
		        |ИЗ
		        |	ВТ_РейсыСПараметрами КАК ВТ_РейсыСПараметрами
		        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних(, ) КАК ПривязкаМашинКРейсамСрезПоследних
		        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыТранспорта.СрезПоследних КАК ДополнительныеПараметрыТранспортаСрезПоследних
		        |			ПО ПривязкаМашинКРейсамСрезПоследних.Транспорт = ДополнительныеПараметрыТранспортаСрезПоследних.Транспорт
		        |		ПО ВТ_РейсыСПараметрами.Рейс = ПривязкаМашинКРейсамСрезПоследних.Рейс
		        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ИндивидуальнаяМаршрутизация КАК ВТ_ИндивидуальнаяМаршрутизация
		        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПредварительногоЗакрытияРейсов.СрезПоследних КАК СтатусыПредварительногоЗакрытияРейсовСрезПоследних
		        |			ПО ВТ_ИндивидуальнаяМаршрутизация.Заказ = СтатусыПредварительногоЗакрытияРейсовСрезПоследних.Заказ
		        |		ПО ВТ_РейсыСПараметрами.Рейс = ВТ_ИндивидуальнаяМаршрутизация.Рейс @СтрокаФильтраВторая@
		        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПроверенныеДокументы.СрезПоследних КАК ПроверенныеДокументыСрезПоследних
		        |		ПО ВТ_РейсыСПараметрами.Рейс = ПроверенныеДокументыСрезПоследних.Документ
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт,
		        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Код,
		        |	ЕСТЬNULL(ВТ_ИндивидуальнаяМаршрутизация.Заказ.Номер, ИСТИНА), @ДополнениеПоПолямГруппировкиВторое@
		        |	ПривязкаМашинКРейсамСрезПоследних.Водитель,
		        |	ВТ_РейсыСПараметрами.Рейс.Ссылка,
		        |	ВТ_РейсыСПараметрами.Рейс.РольРейса,
		        |	ВЫБОР
		        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации, ИСТИНА) = ИСТИНА
		        |			ТОГДА 40
		        |		КОГДА ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации = 0
		        |			ТОГДА 40
		        |		ИНАЧЕ ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации
		        |	КОНЕЦ,
		        |	ВТ_ИндивидуальнаяМаршрутизация.Заказ.Ссылка,
		        |	ПривязкаМашинКРейсамСрезПоследних.Экспедитор,
		        |	ПривязкаМашинКРейсамСрезПоследних.Транспорт.Наименование,
		        |	ВТ_ИндивидуальнаяМаршрутизация.КатегорияЗаказа,
		        |	ВТ_ИндивидуальнаяМаршрутизация.ВремяПрибытияС,
		        |	ВТ_ИндивидуальнаяМаршрутизация.ВремяПрибытияПо,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ИндивидуальнаяМаршрутизация.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА 0
		        |		ИНАЧЕ ВТ_ИндивидуальнаяМаршрутизация.Заказ.ОбщийВес
		        |	КОНЕЦ,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ИндивидуальнаяМаршрутизация.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_ИндивидуальнаяМаршрутизация.Заказ.Контрагент
		        |		ИНАЧЕ ВТ_ИндивидуальнаяМаршрутизация.Заказ.ВладелецТовара
		        |	КОНЕЦ,
		        |	ВЫБОР
		        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ИндивидуальнаяМаршрутизация.Заказ) = ТИП(Документ.ЗаборТовара)
		        |			ТОГДА ВТ_ИндивидуальнаяМаршрутизация.Заказ.ОбъемЗабора
		        |		ИНАЧЕ 0
		        |	КОНЕЦ,
		        |	ЕСТЬNULL(ПроверенныеДокументыСрезПоследних.ДокументПроверен, ЛОЖЬ),
				| Выбор когда ЕСТЬNULL(СтатусыПредварительногоЗакрытияРейсовСрезПоследних.СтатусПредварительногоЗакрытияРейса, ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытОкончательно)) = ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытПредварительно) Тогда
		   		| 1 Иначе 0 Конец
		        |
		        |УПОРЯДОЧИТЬ ПО
		        |	ТранспортНаименование
		        |ИТОГИ
		        |	МИНИМУМ(Отметка),
				|	МИНИМУМ(ДокументПроверен),
		        |	МАКСИМУМ(Транспорт),
		        |	МАКСИМУМ(ТранспортКод),
		        |	СУММА(Итого),
		        |	МАКСИМУМ(Водитель),
		        |	МАКСИМУМ(РольРейса), @ДополнениеПоПолямИтогов@
		        |	МАКСИМУМ(МаксимальноеКоличествоЗаказов),
		        |	МАКСИМУМ(Экспедитор),
		        |	МАКСИМУМ(ТранспортНаименование),
		        |	СУММА(ВесЗаказа),
				|	СУММА(ИтогоПредварительно),
		        |	СУММА(ОбъемЗабора)
		        |ПО
		        |	Рейс";
		
	КонецЕсли;	
	
	//-Широков 16.07.2021 Задача 4607	
КонецФункции	


Процедура ОбновитьДанныеДереваРейсовНаСервере(МаршрутизацияЗакрыта, ДатаПланирования, ПолигональнаяСхемаКарты, Регион, ЗаборнаяКатегория, СхемаЛогистическихБрейков, СписокДобавляемыхРеквизитов, СписокДобавляемыхЭлементов, ТабЭлементовФильтра, АдресХранилища, ПараметрОтбораПоВодителямПривязанымКГруппамПолигонов = Неопределено, Смена = Неопределено, БезЗаказов = Ложь) Экспорт
	
	Зап = Новый Запрос;
	//Зап.Текст = ТекстЗапросаПоДеревуРейсов(МаршрутизацияЗакрыта);
	//CeHbKA #2626 #21.05.2019
	ТолькоРеализации = ?(Смена = Неопределено, Ложь, Смена <> Справочники.Смены.Смена1);
	Зап.Текст = ТекстЗапросаПоДеревуРейсов(МаршрутизацияЗакрыта, ТолькоРеализации);
	//CeHbKA #2626 #21.05.2019
	
	//CeHbKA #3663 25.11.2019
	Если БезЗаказов Тогда
	//Если Истина Тогда//тест
		Зап.Текст = ТекстЗапросаПоДеревуРейсов_БезЗаказов(МаршрутизацияЗакрыта, ТолькоРеализации);
	КонецЕсли; 
	//CeHbKA #3663 25.11.2019
	
	Зап.УстановитьПараметр("ДатаНач", НачалоДня(ДатаПланирования));
	Зап.УстановитьПараметр("ДатаКон", КонецДня(ДатаПланирования));
	Зап.УстановитьПараметр("СхемаМаршрутизации", ПолигональнаяСхемаКарты);
	Зап.УстановитьПараметр("ТерминалДоставки", Регион);
	Зап.УстановитьПараметр("ЗаборнаяКатегория", ЗаборнаяКатегория);
	Зап.УстановитьПараметр("ЗаборнаяКатегорияКод", ЗаборнаяКатегория.Код);
	
	
	
	ДополнениеЗапросаПоКолонкам = ПолигональнаяМаршрутизацияСервер.СформироватьКолонкиЗапросаДереваПолигонов(СхемаЛогистическихБрейков);
	Зап.Текст = СтрЗаменить(Зап.Текст, "@ДополнениеПоПолям@", ДополнениеЗапросаПоКолонкам);
			   
	ДополнениеЗапросаПоПолямГруппировки = ПолигональнаяМаршрутизацияСервер.СформироватьКолонкиЗапросаДереваПолигонов(СхемаЛогистическихБрейков,, Ложь);
	Зап.Текст = СтрЗаменить(Зап.Текст, "@ДополнениеПоПолямГруппировки@", ДополнениеЗапросаПоПолямГруппировки);
	
	ДополнениеЗапросаПоПолямИтогов = ПолигональнаяМаршрутизацияСервер.СформироватьКолонкиЗапросаДереваПолигонов(СхемаЛогистическихБрейков, Истина, Ложь);
	Зап.Текст = СтрЗаменить(Зап.Текст, "@ДополнениеПоПолямИтогов@", ДополнениеЗапросаПоПолямИтогов);
	
	
	Зап.Текст = СтрЗаменить(Зап.Текст, "@ДополнениеПоПолямВторое@", СтрЗаменить(ДополнениеЗапросаПоКолонкам, "ВТ_Заказы.", "ВТ_ИндивидуальнаяМаршрутизация."));
	Зап.Текст = СтрЗаменить(Зап.Текст, "@ДополнениеПоПолямГруппировкиВторое@", СтрЗаменить(ДополнениеЗапросаПоПолямГруппировки, "ВТ_Заказы.", "ВТ_ИндивидуальнаяМаршрутизация."));

	
	
	Зап.Текст = СтрЗаменить(Зап.Текст, "@СтрокаФильтра@", СтрокаУсловийФильтра(ТабЭлементовФильтра, "ДеревоРейсовСЗаказами"));
	Зап.Текст = СтрЗаменить(Зап.Текст, "@СтрокаФильтраВторая@", СтрЗаменить(СтрокаУсловийФильтра(ТабЭлементовФильтра, "ДеревоРейсовСЗаказами"), "ВТ_Заказы.", "ВТ_ИндивидуальнаяМаршрутизация."));
	
	// Якурнов 06.09.2018 11:24:30 // Добавим в строку фильтра Отбор По Водителям из ГруппамПолигонов
	//>>>>>>>>>>>>>>>>>>>>>>>>>
	Если ПараметрОтбораПоВодителямПривязанымКГруппамПолигонов <> Неопределено Тогда
		    СтрокаФильтра = " И (ПривязкаМашинКРейсамСрезПоследних.Водитель В (&ТаблВодителей))";
			Зап.Текст = СтрЗаменить(Зап.Текст, "@СтрокаФильтраВодителей@",СтрокаФильтра);
			
			Зап.УстановитьПараметр("ТаблВодителей",ПараметрОтбораПоВодителямПривязанымКГруппамПолигонов);
	Иначе
			Зап.Текст = СтрЗаменить(Зап.Текст, "@СтрокаФильтраВодителей@","");
	КонецЕсли;
	//<<<<<<<<<<<<<<<<<<<<<<<<<
	
	// Якурнов: Отбор по Смене
	// >>>>>>>> Начало 23.10.2018 14:49:06 >>>>>>>>
	
	//CeHbKA #3179 11.06.2019 
	//ТекстПисьма = "Текст запроса рейсы: "+Символы.ПС+Зап.Текст+Символы.ПС+"Тип значения Смена: "+Символы.ПС+ТипЗнч(Смена)+Символы.ПС+"Тип значения Смена: "+Символы.ПС+ТипЗнч(Смена);
	//lem.ОтправитьСообщение("a.pryalkin@strizh-logistic.ru","Тест_ПМ",ТекстПисьма,,,,);
	//CeHbKA #3179 11.06.2019 

	Если Смена <> Неопределено Тогда
		
			//CeHbKA #2626 #03.06.2019
		    СтрокаФильтраСмена10 = " И ПолигоныИКатегорииЗаказовДляРейсов.Смена = &СменаРейса";
			Зап.Текст = СтрЗаменить(Зап.Текст, "@СтрокаФильтраСмена10@",СтрокаФильтраСмена10);
			
			СтрокаФильтраСмена11 = " И (ДополнительныеПараметрыЗаказа.Смена = &СменаРейса)";
			Зап.Текст = СтрЗаменить(Зап.Текст, "@СтрокаФильтраСмена11@",СтрокаФильтраСмена11);
			//CeHbKA #2626 #03.06.2019
			
			СтрокаФильтра = " И РейсДокументДляПараметров.Ссылка.СменаРейса = &СменаРейса";
			Зап.Текст = СтрЗаменить(Зап.Текст, "@СтрокаФильтраСмена12@",СтрокаФильтра);
			
			Зап.УстановитьПараметр("СменаРейса",Смена);
	Иначе
			//Зап.Текст = СтрЗаменить(Зап.Текст, "@СтрокаФильтраСмена@","");
			//CeHbKA #2626 #03.06.2019
			Зап.Текст = СтрЗаменить(Зап.Текст, "@СтрокаФильтраСмена10@","");
			Зап.Текст = СтрЗаменить(Зап.Текст, "@СтрокаФильтраСмена11@","");
			Зап.Текст = СтрЗаменить(Зап.Текст, "@СтрокаФильтраСмена12@","");
			//CeHbKA #2626 #03.06.2019
	КонецЕсли;
	// <<<<<<<< Конец 23.10.2018 14:49:06 <<<<<<<<
	
	ДеревоРейсов = Зап.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам); 
		
	ПоместитьВоВременноеХранилище(ДеревоРейсов, АдресХранилища);
	
КонецПроцедуры
#КонецОбласти

//CeHbKA #3131 17.05.2019
Процедура ОбработатьРейсыВПотоке(ТаблицаРейсов, Регион, Событие, ДатаПланирования) Экспорт
	
	//определяем максимальное количество потоков 
	ЧислоПотоков = 8; 
	ЧислоСтрокВТаблице = ТаблицаРейсов.Количество(); 
	
	//объем порции данных для обработки каждым потоком 
	РазмерПорции = Цел(ЧислоСтрокВТаблице/ЧислоПотоков); 
	
	// массив, где будут храниться фоновые задания 
	МассивЗаданий = Новый Массив; 
	
	Для НомерПотока = 1 По ЧислоПотоков Цикл 
		
		//определяем индекс для начала обработки данных данным потоком 
		//разные потоки обрабатывают разные части таблицы 
		ИндексНачала = (НомерПотока-1)*РазмерПорции; 
		
		Если (НомерПотока = ЧислоПотоков) Тогда 
			//если это последний поток, то он обрабатывает все оставшиеся данные 
			//т.к. число потоков может не быть кратно количеству строк в таблице 
			РазмерПорции = ЧислоСтрокВТаблице-(ЧислоПотоков*РазмерПорции)+РазмерПорции; 
		КонецЕсли; 
		
		//определяем массив параметров для процедуры 
		НаборПараметров = Новый Массив; 
		НаборПараметров.Добавить(ТаблицаРейсов); 
		НаборПараметров.Добавить(ИндексНачала); 
		НаборПараметров.Добавить(РазмерПорции); 
		НаборПараметров.Добавить(Регион); 
		НаборПараметров.Добавить(Событие); 
		НаборПараметров.Добавить(ДатаПланирования); 
		
		//запуск фонового задания 
		Задание = ФоновыеЗадания.Выполнить("ПолигональнаяМаршрутизацияСервер.ОбработатьРейс", НаборПараметров); 
		
		//добавляем задание в массив, чтобы потом отследить выполнение 
		МассивЗаданий.Добавить(Задание); 
		
	КонецЦикла; 
	
	//проверим результат выполнения фоновых заданий 
	Если МассивЗаданий.Количество() > 0 Тогда 
		
		Попытка
			ФоновыеЗадания.ОжидатьЗавершения(МассивЗаданий); 
			УчетКонтроляВремениСервер.ЗаписатьРСКонтрольВремени(Событие, "", Истина, ТекущаяДата()+1,, Регион, ДатаПланирования);
		Исключение 
			//действия в случае ошибки 
			Сообщить(ОписаниеОшибки());
		КонецПопытки; 
		
	КонецЕсли;	
		
КонецПроцедуры

Процедура ОбработатьРейс(ТаблицаРейсов, ИндексНачала, РазмерПорции, Регион, Событие, ДатаПланирования) Экспорт 
		
	//обновляем цену только для определенной части таблицы 
	Для Сч = 1 По РазмерПорции Цикл 
		
		Индекс = ?(Сч=1, ИндексНачала, Индекс+1); 
				
		РейсОбъект = ТаблицаРейсов[Индекс].Рейс.ПолучитьОбъект();
		РейсОбъект.Заказы.Очистить();
		
		Заказы = ТаблицаРейсов[Индекс].Заказы;
		
		Для каждого Выб Из Заказы Цикл
			Нов = РейсОбъект.Заказы.Добавить();
			ЗаполнитьЗначенияСвойств(Нов, Выб);
		КонецЦикла; 
		
		Попытка
			РейсОбъект.Записать(РежимЗаписиДокумента.Запись);
			РейсОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Сообщить(ОписаниеОшибки());		
		КонецПопытки; 
		
		УчетКонтроляВремениСервер.ЗаписатьРСКонтрольВремени(Событие, РейсОбъект.Ссылка, Истина,,, Регион, ДатаПланирования);
		
	КонецЦикла; 
		
КонецПроцедуры
 
//CeHbKA #3131 17.05.2019

//CeHbKA #4131 14.08.2020
Функция ОбработатьМассивДанныхПоПолигонам(Данные) Экспорт
	
	МассивДанныхОбщий = Данные.GetPolygonsForOrdersResult.Data;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КартыКонструктораКарт.Ссылка КАК КартаКонструктора,
		|	КартыКонструктораКарт.ИдентификаторКарты КАК ИдентификаторКарты
		|ИЗ
		|	Справочник.КартыКонструктораКарт КАК КартыКонструктораКарт
		|ГДЕ
		|	НЕ КартыКонструктораКарт.ЭтоГруппа
		|	И НЕ КартыКонструктораКарт.ПометкаУдаления
		|	И КартыКонструктораКарт.ИдентификаторКарты <> """"";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//КонецЦикла;
	
	МассивДанныхПМ = Новый Массив;
	МассивДанныхЗП = Новый Массив;
	
	Для каждого СтруктураЗаказ из МассивДанныхОбщий цикл
		
		ИдентификаторКарты = СтруктураЗаказ.OrderLocation.ConstructorId;
		
		ВыборкаДетальныеЗаписи.Сбросить();
		
		СтруктураПоиска = Новый Структура("ИдентификаторКарты", ИдентификаторКарты);
		
		Пока ВыборкаДетальныеЗаписи.НайтиСледующий(СтруктураПоиска) Цикл
			
			Если ВыборкаДетальныеЗаписи.КартаКонструктора = Справочники.КартыКонструктораКарт.ПММСК
				ИЛИ ВыборкаДетальныеЗаписи.КартаКонструктора = Справочники.КартыКонструктораКарт.ПМСПб Тогда
				
				МассивДанныхПМ.Добавить(СтруктураЗаказ);
				
			КонецЕсли;
			
			Если ВыборкаДетальныеЗаписи.КартаКонструктора = Справочники.КартыКонструктораКарт.ЗПДоставкиМСК
				ИЛИ ВыборкаДетальныеЗаписи.КартаКонструктора = Справочники.КартыКонструктораКарт.ЗПДоставкиСПб
				ИЛИ ВыборкаДетальныеЗаписи.КартаКонструктора = Справочники.КартыКонструктораКарт.ЗПЗаборыМСК 
				ИЛИ ВыборкаДетальныеЗаписи.КартаКонструктора = Справочники.КартыКонструктораКарт.ЗПЗаборыСПб Тогда
				
				МассивДанныхЗП.Добавить(СтруктураЗаказ);
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЦикла;
		
	Если МассивДанныхПМ.Количество() > 0 Тогда
		Результат = ПолигональнаяМаршрутизацияСервер.УстановитьПолигоныДляЗаказов(МассивДанныхПМ);
	КонецЕсли; 
	
	Если МассивДанныхЗП.Количество() > 0 Тогда
		Результат = зпРаботаСРасчетомЗарплатыСервер.ПолучитьЗоныДоставкиДляЗаказов(МассивДанныхЗП);	
	КонецЕсли; 
		
	Возврат Результат;
	
КонецФункции 
//CeHbKA #4131 14.08.2020