
/////////////////////СОБЫТИЯ ФОРМЫ/////////////////////////
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		
	НастройкиЯндексМаршрутизации = ОбработкаОбъект.ПолучитьНастройкиМодуля();
	
	Если ТипЗнч(НастройкиЯндексМаршрутизации) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, НастройкиЯндексМаршрутизации);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Отказ = Модифицированность;
	
	Если Отказ Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеОтветаНаВопросОЗакрытии", ЭтаФорма);
		
		ПоказатьВопрос(ОписаниеОповещения, "Изменённые данные не будут сохранены! Продолжить?", РежимДиалогаВопрос.ДаНет,,,,);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросОЗакрытии(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли; 
	
КонецПроцедуры // ()

/////////////////////КОМАНДЫ ФОРМЫ/////////////////////////
&НаКлиенте
Процедура ЗагрузитьНастройкиИзФайла(Команда)
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтаФорма);
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.Фильтр = "Файл настроек модуля | " + "*.dni";
	ДиалогВыбораФайла.Заголовок = "Выберите файл для хранения настроек";
	ДиалогВыбораФайла.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайла(Результат, ДопПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбран файл хранения настроек - загрузка настроек отменена!";
		Сообщение.Сообщить(); 
		Возврат;
	КонецЕсли; 	

	Для каждого ВыбранныйФайл Из Результат Цикл
		ЗагрузитьДеревоСобытийИзФайлаНаСервере(ВыбранныйФайл);			
	КонецЦикла; 
	
КонецПроцедуры // ()
 
&НаКлиенте
Процедура ЗагрузитьДеревоСобытийИзФайлаНаСервере(ФайлНастроекМодуля)

	ЧтениеXML = Новый ЧтениеXML;
	Фабрика = Новый ФабрикаXDTO;
	ЧтениеXML.ОткрытьФайл(ФайлНастроекМодуля);
	
	КореньДанные = Фабрика.ПрочитатьXML(ЧтениеXML);
		
	ДанныеФайла = КореньДанные.Элемент;
	
	Для Каждого СтрокаДанных Из ДанныеФайла Цикл 

		Если СтрокаДанных.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаДанных.Значение) Тогда
			Продолжить;
		КонецЕсли; 
		
		ЭтаФорма[СтрокаДанных.Имя] = СтрокаДанных.Значение;
		
		Модифицированность = Истина;
		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиВФайл(Команда)

	//ФайлНастроекМодуляНачалоВыбора(ФайлНастроекМодуля,, Ложь, "Сохранение", "*.dni");
	//Если Не ЗначениеЗаполнено(ФайлНастроекМодуля) Тогда
	//	Сообщить("Не выбран файл хранения настроек - сохранение настроек отменено!", СтатусСообщения.Важное);
	//	Возврат;
	//КонецЕсли;
	//
	//НастройкиОбработки = ПолучитьТекстФайлаНастроек();
	//Файл = Новый ЗаписьТекста(ФайлНастроекМодуля);
	//Файл.ЗаписатьСтроку(НастройкиОбработки);
	//Файл.Закрыть();
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораФайлаПриСохранении", ЭтаФорма);
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.Фильтр = "Файл настроек модуля | " + "*.dni";
	ДиалогВыбораФайла.Заголовок = "Выберите файл для хранения настроек";
	ДиалогВыбораФайла.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайлаПриСохранении(Результат, ДопПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбран файл хранения настроек - сохранение настроек отменено!";
		Сообщение.Сообщить(); 
		Возврат;
	КонецЕсли; 	

	Для каждого ВыбранныйФайл Из Результат Цикл
		НастройкиОбработки = ПолучитьТекстФайлаНастроек();
		Файл = Новый ЗаписьТекста(ВыбранныйФайл);
		Файл.ЗаписатьСтроку(НастройкиОбработки);
		Файл.Закрыть();
	КонецЦикла; 
	
КонецПроцедуры // ()

&НаКлиенте
Функция ПолучитьТекстФайлаНастроек()
		
	НастройкиОбработки = "";
	
	НастройкиОбработки = НастройкиОбработки + "idКомпании=" 				+ idКомпании + Символы.ПС;
	НастройкиОбработки = НастройкиОбработки + "mark_delivered_radius=" 		+ mark_delivered_radius + Символы.ПС;
	НастройкиОбработки = НастройкиОбработки + "merge_multiorders=" 			+ merge_multiorders + Символы.ПС;
	НастройкиОбработки = НастройкиОбработки + "penalize_late_service=" 		+ penalize_late_service + Символы.ПС;
	НастройкиОбработки = НастройкиОбработки + "proximity_factor=" 			+ proximity_factor + Символы.ПС;
	
	НастройкиОбработки = НастройкиОбработки + "АдресЗапросаРезультата="		+ АдресЗапросаРезультата + Символы.ПС;
	НастройкиОбработки = НастройкиОбработки + "АдресОтправкиЗапроса=" 		+ АдресОтправкиЗапроса + Символы.ПС;
	НастройкиОбработки = НастройкиОбработки + "АдресПросмотраРезультатов=" 	+ АдресПросмотраРезультатов + Символы.ПС;
	НастройкиОбработки = НастройкиОбработки + "АдресСервисаГеокодирование=" + АдресСервисаГеокодирование + Символы.ПС;
	НастройкиОбработки = НастройкиОбработки + "АдресСервисаМаршрутизация=" 	+ АдресСервисаМаршрутизация + Символы.ПС;
	
	НастройкиОбработки = НастройкиОбработки + "ВременноеОкно=" 				+ ВременноеОкно + Символы.ПС;
	НастройкиОбработки = НастройкиОбработки + "ВремяОбслуживанияАдрес=" 	+ ВремяОбслуживанияАдрес + Символы.ПС;
	НастройкиОбработки = НастройкиОбработки + "ВремяОбслуживанияЗаказ=" 	+ ВремяОбслуживанияЗаказ + Символы.ПС;
	
	НастройкиОбработки = НастройкиОбработки + "Демокоординаты=" 			+ Демокоординаты + Символы.ПС;
	НастройкиОбработки = НастройкиОбработки + "ЖесткоеВременноеОкно=" 		+ ЖесткоеВременноеОкно + Символы.ПС;
	НастройкиОбработки = НастройкиОбработки + "КлючAPI_Геокодирование=" 	+ КлючAPI_Геокодирование + Символы.ПС;
	НастройкиОбработки = НастройкиОбработки + "КлючAPI_ЯндексМаршрутизация="+ КлючAPI_ЯндексМаршрутизация + Символы.ПС;

	НастройкиОбработки = НастройкиОбработки + "ОбластьПоискаДолгота="		+ ОбластьПоискаДолгота + Символы.ПС;
	НастройкиОбработки = НастройкиОбработки + "ОбластьПоискаШирота="		+ ОбластьПоискаШирота + Символы.ПС;
	НастройкиОбработки = НастройкиОбработки + "СтатусЗаказаПоУмолчанию="	+ СтатусЗаказаПоУмолчанию + Символы.ПС;
	НастройкиОбработки = НастройкиОбработки + "ТипЗаказа="					+ ТипЗаказа + Символы.ПС;
	
	НастройкиОбработки = НастройкиОбработки + "Токен_ЯндексМониторинг="		+ Токен_ЯндексМониторинг + Символы.ПС;
	НастройкиОбработки = НастройкиОбработки + "ШтрафыДляЗаказов="			+ ШтрафыДляЗаказов + Символы.ПС;
	
	Возврат НастройкиОбработки;
	
КонецФункции

&НаКлиенте
Процедура Применить(Команда)
	
	СохранитьНастройкиИнтеграции();
	
	Модифицированность = Ложь;
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиИнтеграции()

	НастройкиЯндексМаршрутизации = Новый Структура();	
	НастройкиЯндексМаршрутизации.Вставить("balanced_groups", balanced_groups);
	НастройкиЯндексМаршрутизации.Вставить("idКомпании", idКомпании);
	НастройкиЯндексМаршрутизации.Вставить("mark_delivered_radius", mark_delivered_radius);
	НастройкиЯндексМаршрутизации.Вставить("merge_multiorders", merge_multiorders);
	НастройкиЯндексМаршрутизации.Вставить("penalize_late_service", penalize_late_service);
	НастройкиЯндексМаршрутизации.Вставить("proximity_factor", proximity_factor);
	НастройкиЯндексМаршрутизации.Вставить("АдресЗапросаРезультата", АдресЗапросаРезультата);
	НастройкиЯндексМаршрутизации.Вставить("АдресОтправкиЗапроса", АдресОтправкиЗапроса);
	НастройкиЯндексМаршрутизации.Вставить("АдресПросмотраРезультатов", АдресПросмотраРезультатов);
	НастройкиЯндексМаршрутизации.Вставить("АдресСервисаГеокодирование", АдресСервисаГеокодирование);
	НастройкиЯндексМаршрутизации.Вставить("АдресСервисаМаршрутизация", АдресСервисаМаршрутизация);
	НастройкиЯндексМаршрутизации.Вставить("ВременноеОкно", ВременноеОкно);
	НастройкиЯндексМаршрутизации.Вставить("ВремяОбслуживанияАдрес", ВремяОбслуживанияАдрес);
	НастройкиЯндексМаршрутизации.Вставить("ВремяОбслуживанияЗаказ", ВремяОбслуживанияЗаказ);
	НастройкиЯндексМаршрутизации.Вставить("Демокоординаты", Демокоординаты);
	НастройкиЯндексМаршрутизации.Вставить("ЖесткоеВременноеОкно", ЖесткоеВременноеОкно);
	НастройкиЯндексМаршрутизации.Вставить("КлючAPI_Геокодирование", КлючAPI_Геокодирование);
	НастройкиЯндексМаршрутизации.Вставить("КлючAPI_ЯндексМаршрутизация", КлючAPI_ЯндексМаршрутизация);
	НастройкиЯндексМаршрутизации.Вставить("ОбластьПоискаДолгота", ОбластьПоискаДолгота);
	НастройкиЯндексМаршрутизации.Вставить("ОбластьПоискаШирота", ОбластьПоискаШирота);
	НастройкиЯндексМаршрутизации.Вставить("СтатусЗаказаПоУмолчанию", СтатусЗаказаПоУмолчанию);
	НастройкиЯндексМаршрутизации.Вставить("ТипЗаказа", ТипЗаказа);
	НастройкиЯндексМаршрутизации.Вставить("Токен_ЯндексМониторинг", Токен_ЯндексМониторинг);
	НастройкиЯндексМаршрутизации.Вставить("ШтрафыДляЗаказов", ШтрафыДляЗаказов);
	
	ХранилищеОбщихНастроек.Сохранить("Обработка.СТРИЖ_ИнтегрцияЯндексМаршрутизация",, НастройкиЯндексМаршрутизации);
	
КонецПроцедуры // ()
 
&НаКлиенте
Процедура КомандаЗакрыть(Команда)
	Закрыть();
КонецПроцедуры


