
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр мгЗначенияКатегорийЗаказов
	Движения.мгЗначенияКатегорийЗаказов.Записывать = Истина;
	Движения.мгЗначенияКатегорийЗаказов.Очистить();
	Для Каждого ТекСтрокаДанные Из Данные Цикл
		Движение = Движения.мгЗначенияКатегорийЗаказов.Добавить();
		Движение.Период = Дата;
		Движение.Категория = ТекСтрокаДанные.Категория;
		Движение.ВесЗаказаОт = ТекСтрокаДанные.ВесЗаказаОт;
		Движение.ВключительноОт = ТекСтрокаДанные.ВключительноОт;
		Движение.ВесЗаказаДо = ТекСтрокаДанные.ВесЗаказаДо;
		Движение.ВключительноДо = ТекСтрокаДанные.ВключительноДо;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
