
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    ТолькоПросмотр = Истина;
КонецПроцедуры

&НаКлиенте
Процедура информировать(Команда)
	
	ИнформироватьПолучателей();
КонецПроцедуры

&НаСервере
Функция ПолучитьМакетНаСервере()
	ДОбъект = РеквизитФормыВЗначение("Объект");
	Макет = ДОбъект.ПолучитьМакет("МакетНакладной");
	Возврат Макет;
КонецФункции	


&НаКлиенте
Процедура ИнформироватьПолучателей() Экспорт 
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	СменыПочтовыеАдреса.Адрес КАК Адрес
	            |ИЗ
	            |	Справочник.Смены.ПочтовыеАдреса КАК СменыПочтовыеАдреса
	            |ГДЕ
	            |	СменыПочтовыеАдреса.ИнформироватьОПриходеНакладной = ИСТИНА
	            |	И СменыПочтовыеАдреса.Ссылка.Ссылка = &Смена
	            |
	            |УПОРЯДОЧИТЬ ПО
	            |	Адрес";
	
	Зап.УстановитьПараметр("Смена", Объект.Смена.Ссылка);
	Таб = Зап.Выполнить().Выгрузить();
	
	МасП = Таб.ВыгрузитьКолонку("Адрес");
	
	Если масП.Количество() = 0 Тогда
		Возврат;
	КонецеСли;	
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	
	СхемаКомпоновкиДанных = ПолучитьМакетНаСервере();
	СтруктураВариантов = Новый Структура;
	пВарианты = СхемаКомпоновкиДанных.ВариантыНастроек;
	Для Каждого пЭл ИЗ пВарианты Цикл
		СтруктураВариантов.Вставить(пЭл.Имя,пЭл.Настройки);
	КонецЦикла;
	КомпоновщикНастроек.ЗагрузитьНастройки(СтруктураВариантов.Основной);
	
	//КомпоновщикНастроек.Настройки.параметрыданных.Элементы[2].Значение = Период;
	//КомпоновщикНастроек.Настройки.параметрыданных.Элементы[2].использование = Истина;
	
	КомпоновщикНастроек.Настройки.отбор.элементы[0].ПравоеЗначение = Объект.Ссылка;
	КомпоновщикНастроек.Настройки.отбор.элементы[0].ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	КомпоновщикНастроек.Настройки.отбор.элементы[0].Использование = Истина;
	
	Настройки = КомпоновщикНастроек.Настройки;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,Настройки);	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,,, Истина);
	
	Результат = Новый ТабличныйДокумент;
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Г = Новый УникальныйИдентификатор;
	ПутьКФайлу = КаталогВременныхФайлов() +  "\" + Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd") + "_" + "список заказов" + ".xls";
	Результат.Записать(ПутьКФайлу, ТипФайлаТабличногоДокумента.XLS);
	
 	Отпр = lem.ОтправитьСообщение(МасП, "Список заказов вторая смена", "Список заказов вторая смена", ПутьКФайлу, "Логистическая компания ""Стриж""") ;

КонецПроцедуры	


