
&НаКлиенте
Процедура ОбъектПоискаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = новый СписокЗначений;
	ДанныеВыбора.ЗагрузитьЗначения(СписокТипов());
	
КонецПроцедуры

&НаСервере
Функция СписокТипов() 
		
	СопоставлениеТипа = Новый Соответствие;
	СопоставлениеТипа.Вставить("Справочники", "СправочникСсылка");
	СопоставлениеТипа.Вставить("Документы", "ДокументСсылка");
	СопоставлениеТипа.Вставить("БизнесПроцессы", "БизнесПроцессСсылка");
	СопоставлениеТипа.Вставить("Задачи", "ЗадачаСсылка");
	
	СписокТипов = Новый Массив;
	
	Если ТипОбъекта = "" тогда Возврат СписокТипов КонецЕсли;	
	
	Для Каждого ОбъектМетаданных Из Метаданные[ТипОбъекта] Цикл
		
		СписокТипов.Добавить(СопоставлениеТипа.Получить(ТипОбъекта) + "." + ОбъектМетаданных.Имя);
		
	КонецЦикла;	
	
	Возврат СписокТипов;
	
КонецФункции	

&НаСервере
Процедура НайтиСсылкиНаСервере()
	
	МассивОбработанных = Новый массив;
	
	СопоставлениеТипа = Новый Соответствие;
	СопоставлениеТипа.Вставить("Справочники", "СправочникСсылка");
	СопоставлениеТипа.Вставить("Документы", "ДокументСсылка");
	СопоставлениеТипа.Вставить("БизнесПроцессы", "БизнесПроцессСсылка");
	СопоставлениеТипа.Вставить("Задачи", "ЗадачаСсылка");
	
	Дерево = РеквизитФормыВЗначение("ДеревоСсылок");	
	Дерево.Строки.Очистить();
	
	Корень = Дерево.Строки.Добавить();
	Корень.Объект = ОбъектПоиска;
	//МассивОбработанных.Добавить(ОбъектПоиска);
	
	ДобавитьСтрокуСсылки(Корень, СопоставлениеТипа, МассивОбработанных);
	
	ЗначениеВРеквизитФормы(Дерево, "ДеревоСсылок");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуСсылки(СтрокаДерева, СопоставлениеТипа, МассивОбработанных)
	
	Если Не МассивОбработанных.Найти(СтрокаДерева.Объект) = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ТипТекущегоОбъекта = Тип(СтрокаДерева.Объект);
	
	Для Каждого Тип Из СопоставлениеТипа Цикл
		
		Для Каждого ОбъектМетаданных Из Метаданные[Тип.Ключ] Цикл
			
			Для Каждого РеквизитОбъекта Из ОбъектМетаданных.Реквизиты Цикл
				
				ТипыРеквизита = РеквизитОбъекта.Тип.Типы();
				ТипыРеквизита = ТипыРеквизита.Количество();
				
				Если РеквизитОбъекта.Тип.СодержитТип(ТипТекущегоОбъекта)  Тогда				
					
					Если ИсключитьРеквизитыОбщегоТипа И ТипыРеквизита > 50 Тогда
						Продолжить;
					КонецЕсли;	
					
					ТипСсылки = СтрокиТипаОбъекта(ОбъектМетаданных);
					
					Если Не ТипСсылки = Неопределено тогда
						
						МассивОбработанных.Добавить(СтрокаДерева.Объект);
						
						ПодчиненнаяСтрока = СтрокаДерева.Строки.Добавить();
						ПодчиненнаяСтрока.Объект = ТипСсылки;
						ПодчиненнаяСтрока.Реквизит = РеквизитОбъекта.Имя;
						
						ДобавитьСтрокуСсылки(ПодчиненнаяСтрока, СопоставлениеТипа, МассивОбработанных);
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;	
			
			Для Каждого ТЧ Из ОбъектМетаданных.ТабличныеЧасти Цикл
				
				Для Каждого РеквизитТЧ Из ТЧ.Реквизиты Цикл
					
					ТипыРеквизита = РеквизитОбъекта.Тип.Типы();
					ТипыРеквизита = ТипыРеквизита.Количество();
				
					Если РеквизитТЧ.Тип.СодержитТип(ТипТекущегоОбъекта) Тогда
						
						Если ИсключитьРеквизитыОбщегоТипа И ТипыРеквизита > 50 Тогда
							Продолжить;
						КонецЕсли;	
						
						ТипСсылки = СтрокиТипаОбъекта(ОбъектМетаданных);
						
						Если Не ТипСсылки = Неопределено тогда
							
							МассивОбработанных.Добавить(СтрокаДерева.Объект);
							
							ПодчиненнаяСтрока = СтрокаДерева.Строки.Добавить();
							ПодчиненнаяСтрока.Объект = ТипСсылки;
							ПодчиненнаяСтрока.Реквизит = "ТЧ." + ТЧ.Имя + "." + РеквизитТЧ.Имя;
							
							ДобавитьСтрокуСсылки(ПодчиненнаяСтрока, СопоставлениеТипа, МассивОбработанных);
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;	
				
			КонецЦикла;	
			
		КонецЦикла;	
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СтрокиТипаОбъекта(ОбъектСсылки)
	
	Если Метаданные.Справочники.Содержит(ОбъектСсылки) тогда
		Возврат "СправочникСсылка." + ОбъектСсылки.Имя;
	ИначеЕсли  Метаданные.Документы.Содержит(ОбъектСсылки) 	тогда
		Возврат "ДокументСсылка." + ОбъектСсылки.Имя;
	ИначеЕсли  Метаданные.БизнесПроцессы.Содержит(ОбъектСсылки) тогда	
		Возврат "БизнесПроцессСсылка." + ОбъектСсылки.Имя;
	ИначеЕсли  Метаданные.Задачи.Содержит(ОбъектСсылки) тогда	
		Возврат "ЗадачаСсылка." + ОбъектСсылки.Имя;	
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции	

&НаКлиенте
Процедура НайтиСсылки(Команда)
	НайтиСсылкиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТипОбъектаПриИзменении(Элемент)
	ОбъектПоиска = "";
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИсключитьРеквизитыОбщегоТипа = Истина;
КонецПроцедуры
