
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//есть ли записи в данном периоде РН.зпНачислениеЗП
	Если ПроверитьДвиженияЗаПериод() Тогда
		Отказ = Истина;
		Сообщить("Документ не проведен! Движения за период уже есть!");
	КонецЕсли;
	
	//незакрыт ли документ РС.ДокументыЗакрытыеДляИзменения
	Если ПроверитьДокументНаЗакрытиеДляИзменения() Тогда
		Отказ = Истина;
		Сообщить("Документ не проведен! Документ закрыти на изменения!");
	КонецЕсли;
	
	//не закрыт ли расчетный период (по РС.зпЗакрытыеРасчетныеПериоды) 
	Если ПроверитьЗакрытРасчетныйПериод() Тогда
		Отказ = Истина;
		Сообщить("Документ не проведен! Закрыт расчетный период!");
	Конецесли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Движения.зпНачислениеЗП.Записывать = Истина;
	Движения.зпНачислениеЗП.Очистить();
	
	Для Каждого СтрокаТЧ_Нач Из НачисленияПоЗаказам Цикл
		
		//CeHbKA #4397 17.12.2020
		Если СтрокаТЧ_Нач.ОплатаПоМинимальнойСтавке Тогда
			Продолжить;
		КонецЕсли; 
		//CeHbKA #4397 17.12.2020
		
		Запись = Движения.зпНачислениеЗП.Добавить();
		Запись.Регистратор 		= Ссылка;
		Запись.Регион 			= Регион;
		Запись.СхемаРасчетаЗП 	= СхемаРасчетаЗП;
		Запись.ТарифРасчетаЗП 	= ТарифРасчетаЗП;
		ЗаполнитьЗначенияСвойств(Запись, СтрокаТЧ_Нач);
		
	КонецЦикла;	
	
	//CeHbKA #4397 17.12.2020
	Для каждого СтрокаТЧ_Мин Из ПримененныеМинимальныеСтавки Цикл
		Запись = Движения.зпНачислениеЗП.Добавить();
		Запись.Регистратор = Ссылка;
		Запись.Регион = Регион;
		Запись.СхемаРасчетаЗП = СхемаРасчетаЗП;
		Запись.ТарифРасчетаЗП = ТарифРасчетаЗП;
		ЗаполнитьЗначенияСвойств(Запись, СтрокаТЧ_Мин);
		Запись.Сумма = СтрокаТЧ_Мин.СуммаПоМинимальнойСтавке;
		Запись.ЭтоМинимальнаяСтавка = Истина;
	КонецЦикла; 
	//CeHbKA #4397 17.12.2020	
	
	//Геннадий #4457 01.02.2021 ->
	Для каждого СтрокаТЧ_ПоЧасам Из НачисленияПоЧасовойОплаты Цикл
		Запись = Движения.зпНачислениеЗП.Добавить();
		Запись.Регистратор 		= Ссылка;
		Запись.Регион 		  	= Регион;
		Запись.СхемаРасчетаЗП 	= СхемаРасчетаЗП;
		Запись.ТарифРасчетаЗП 	= ТарифРасчетаЗП;
		ЗаполнитьЗначенияСвойств(Запись, СтрокаТЧ_ПоЧасам);
		Запись.ЭтоМинимальнаяСтавка = Истина;
	КонецЦикла; 
	//Геннадий 01.02.2021 <-
	
	//Геннадий #4681 30.09.2021 ->
	Для каждого СтрокаТЧ_ПоСменам Из НачислениеПоСменам Цикл
		Запись = Движения.зпНачислениеЗП.Добавить();
		Запись.Регистратор 		= Ссылка;
		Запись.Регион 		  	= Регион;
		Запись.СхемаРасчетаЗП 	= СхемаРасчетаЗП;
		Запись.ТарифРасчетаЗП 	= ТарифРасчетаЗП;
		ЗаполнитьЗначенияСвойств(Запись, СтрокаТЧ_ПоСменам);
		Запись.Сумма = СтрокаТЧ_ПоСменам.СуммаИтого;
	КонецЦикла; 
	//Геннадий <-
	
КонецПроцедуры

Функция ПроверитьДвиженияЗаПериод() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	зпНачислениеЗП.Период КАК Период,
		|	зпНачислениеЗП.Регистратор КАК Регистратор,
		|	зпНачислениеЗП.Сумма КАК Сумма
		|ИЗ
		|	РегистрНакопления.зпНачислениеЗП КАК зпНачислениеЗП
		|ГДЕ
		|	зпНачислениеЗП.Период = &Период";
	
	Запрос.УстановитьПараметр("Период", НачалоМесяца(МесяцРасчета));//делать через месяц расчета
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат ?(ВыборкаДетальныеЗаписи.Следующий(), Истина, Ложь);
	
КонецФункции

Функция ПроверитьДокументНаЗакрытиеДляИзменения() Экспорт//Вызывается перед записью документа
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументыЗакрытыеДляИзмененияСрезПоследних.ЗакрытДляРедактирования КАК ЗакрытДляРедактирования
		|ИЗ
		|	РегистрСведений.ДокументыЗакрытыеДляИзменения.СрезПоследних(&ТекДата, Документ = &Документ) КАК ДокументыЗакрытыеДляИзмененияСрезПоследних";
	
	Запрос.УстановитьПараметр("Документ", Ссылка);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат ?(ВыборкаДетальныеЗаписи.Следующий(), ВыборкаДетальныеЗаписи.ЗакрытДляРедактирования, Ложь);
	
КонецФункции

Функция ПроверитьЗакрытРасчетныйПериод()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	зпЗакрытыеРасчетныеПериодыСрезПоследних.Регион КАК Регион1,
		|	зпЗакрытыеРасчетныеПериодыСрезПоследних.РасчетныйПериод КАК РасчетныйПериод1,
		|	зпЗакрытыеРасчетныеПериодыСрезПоследних.ПериодЗакрыт КАК ПериодЗакрыт1
		|ИЗ
		|	РегистрСведений.зпЗакрытыеРасчетныеПериоды.СрезПоследних(&РасчетныйПериод, ) КАК зпЗакрытыеРасчетныеПериодыСрезПоследних
		|ГДЕ
		|	зпЗакрытыеРасчетныеПериодыСрезПоследних.Регион = &Регион
		|	И зпЗакрытыеРасчетныеПериодыСрезПоследних.РасчетныйПериод = &РасчетныйПериод
		|	И зпЗакрытыеРасчетныеПериодыСрезПоследних.ПериодЗакрыт";
	
	Запрос.УстановитьПараметр("РасчетныйПериод", НачалоМесяца(МесяцРасчета));
	Запрос.УстановитьПараметр("Регион", Регион);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат ?(ВыборкаДетальныеЗаписи.Следующий(), Истина, Ложь);
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ПроверитьДокументНаЗакрытиеДляИзменения() Тогда
		Отказ = Истина;
		Сообщить("Документ закрыт на изменения!");
	КонецЕсли;
	
КонецПроцедуры
