
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Ссылка.Пустая() Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Брейк", Ссылка);
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК Поле1
		|ИЗ
		|	РегистрСведений.зпМинимальныеСтавки КАК зпМинимальныеСтавки
		|ГДЕ
		|	зпМинимальныеСтавки.БрейкОтработанныхДней = &Брейк
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА
		|ИЗ
		|	РегистрСведений.зпМинимальныеСтавки КАК зпМинимальныеСтавки
		|ГДЕ
		|	зпМинимальныеСтавки.БрейкМинимальногоПроцентаВыполнения = &Брейк";
		
		Если Не Запрос.Выполнить().Пустой() Тогда
			Отказ = Истина;
			Сообщить("Редактирование запрещено");
			Сообщить("Обнаружены данные по Брейку!");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
