#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр СтатусыЗаказов
	Движения.СтатусыЗаказов.Записывать = Истина;
	Движение = Движения.СтатусыЗаказов.Добавить();
	Движение.Период = Дата;
	Движение.Заказ = Заказ;
	Движение.Рейс = Рейс;
	Движение.РезультатДоставки = СтатусДоставки;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ	
КонецПроцедуры
#КонецОбласти	 