
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	//Если Не Ссылка.Пустая() Тогда
	//	Зап = Новый Запрос;
	//	
	//	Зап.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	//	|	ПечатьЧековПоДоставкамДоставки.Ссылка
	//	|ИЗ
	//	|	Документ.ПечатьЧековПоДоставкам.Доставки КАК ПечатьЧековПоДоставкамДоставки
	//	|ГДЕ
	//	|	ПечатьЧековПоДоставкамДоставки.СвязкаККМ = &СвязкаККМ
	//	|	И ПечатьЧековПоДоставкамДоставки.Ссылка.Проведен = ИСТИНА";
	//	Зап.УстановитьПараметр("СвязкаККМ", Ссылка);			
	//	
	//	Рез = Зап.Выполнить().Выбрать();
	//	
	//	Если Рез.Следующий() Тогда
	//		Отказ = Истина;
	//	КонецеСли;
	//КонецеСли;
КонецПроцедуры
