
Процедура ПередЗаписью(Отказ)
	
	//Асеев 21.03.2024 (Задача № 5243)>>>
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УжеЗаписан = Не ЭтоНовый();
	Если УжеЗаписан Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК Поле1
		|ИЗ
		|	РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
		|ГДЕ
		|	ДополнительныеПараметрыЗаказа.СхемаЛогистическихБрейков = &Ссылка";
		Если Не Запрос.Выполнить().Пустой() Тогда
			Отказ = Истина;
			Сообщить("Схема брейков уже участвует в расчетах!");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	//Асеев 21.03.2024 (Задача № 5243)<<<
	
КонецПроцедуры
