
// Начать замер времени выполнения ключевой операции
//
// Параметры:
//  КодКлючевойОперации - Строка, код элемента справочника "КлючевыеОперации"
//
// Возвращаемое значение:
//  Число - время начала замера
//
Функция НачатьЗамерВремени(КлючеваяОперация, Описание = "",ПодключатьОбработчикОжидания = Ложь) Экспорт
	
	КлючеваяОперацияСсылка = APDEX_ОценкаПроизводительностиСерверВызовСервера.ПолучитьОперацию(КлючеваяОперация);
		
	Если ПодключатьОбработчикОжидания тогда
		#Если Клиент Тогда
			
			ВремяНачала = APDEX_ОценкаПроизводительностиСерверВызовСервера.ЗафиксироватьВремяНачала(КлючеваяОперацияСсылка, Ложь, Описание);
			ПодключитьОбработчикОжидания("APDEX_ЗакончитьЗамерВремениАвто", 0.1, Истина);
			
		#ИначеЕсли Сервер Тогда
			
			ВремяНачала = APDEX_ОценкаПроизводительностиСерверВызовСервера.ЗафиксироватьВремяНачала(КлючеваяОперацияСсылка, Истина, Описание);
			
		#КонецЕсли
		
	Иначе
		
		ВремяНачала = APDEX_ОценкаПроизводительностиСерверВызовСервера.ЗафиксироватьВремяНачала(КлючеваяОперацияСсылка, Истина, Описание);
		
	КонецЕсли;
	
	Возврат ВремяНачала;
	
КонецФункции

// Закончить замер времени выполнения ключевой операции
//
// Возвращаемое значение:
//  Число - время окончания замера
//
Функция ЗакончитьЗамерВремени(КлючеваяОперация = Неопределено, Описание = "", ТекстЗапроса ="") Экспорт
	
	КлючеваяОперацияСсылка = APDEX_ОценкаПроизводительностиСерверВызовСервера.ПолучитьОперацию(КлючеваяОперация);
	Возврат APDEX_ОценкаПроизводительностиСерверВызовСервера.ЗафиксироватьВремяОкончания(КлючеваяОперацияСсылка, Ложь, Описание, ТекстЗапроса);
	
КонецФункции

Процедура НачатьЗамерПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	//+++ БАО 29.06.2017 №1208 
	
	//Временно отключаем
	Возврат;
	
	Попытка	
		//--- БАО 29.06.2017 №1208 	
		Если (РежимЗаписи = РежимЗаписиДокумента.Проведение) Тогда
			Описание = ""+Источник.Ссылка;
			Операция = APDEX_ОценкаПроизводительностиСерверВызовСервера.ПолучитьОперацию(Источник.Ссылка);
			НачатьЗамерВремени(Операция, Описание);
		КонецЕсли;
		//+++ БАО 29.06.2017 №1208 
	Исключение
	КонецПопытки;
	//--- БАО 29.06.2017 №1208 

КонецПроцедуры

Процедура ЗакончитьЗамерОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	//+++ БАО 29.06.2017 №1208 
	
	//Временно отключаем
	Возврат;
	
	Попытка	
		//--- БАО 29.06.2017 №1208 	
		Описание = ""+Источник.Ссылка;
		Операция = APDEX_ОценкаПроизводительностиСерверВызовСервера.ПолучитьОперацию(Источник.Ссылка);
		ЗакончитьЗамерВремени(Операция, Описание);
		
		//+++ БАО 29.06.2017 №1208 
	Исключение
	КонецПопытки;
	//--- БАО 29.06.2017 №1208 

КонецПроцедуры

	

