
&НаСервере
Процедура УволенныеСотрудникиНаСервере()
	
	Элементы.ФормаУволенныеСотрудники.Пометка = Не Элементы.ФормаУволенныеСотрудники.Пометка;
	УстановитьУволенные();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУволенные()
	
	Если Элементы.ФормаУволенныеСотрудники.Пометка Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Состояние", Перечисления.СостояниеРаботникаОрганизации.Уволен);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("Состояние", Перечисления.СостояниеРаботникаОрганизации.ПринятНаРаботуВОрганизацию);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УволенныеСотрудники(Команда)
	УволенныеСотрудникиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	
	УстановитьУволенные();
	
	ДатаРедактирования = ТекущаяДата();
	
	Список.Параметры.УстановитьЗначениеПараметра("ДатаРедактирования", КонецДня(ДатаРедактирования));
	
	УстановитьСотрудникиРоли();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСотрудникиРоли()
	
	Если Элементы.ФормаСотрудникиРоли.Пометка Тогда
		Заголовок = "Экспедиторы (Роль Экспедитор на " + Формат(ДатаРедактирования, "ДФ=dd.MM.yyyy") + ")";
		Список.Параметры.УстановитьЗначениеПараметра("СотрудникиРоли", Истина);
	Иначе
		Заголовок = "Экспедиторы (все роли)";
		Список.Параметры.УстановитьЗначениеПараметра("СотрудникиРоли", Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СотрудникиРолиНаСервере()
	
	Элементы.ФормаСотрудникиРоли.Пометка = Не Элементы.ФормаСотрудникиРоли.Пометка;
	УстановитьСотрудникиРоли();
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиРоли(Команда)
	СотрудникиРолиНаСервере();
КонецПроцедуры
