
#Область ОбработчикиСобытий
&НаКлиенте
Асинх Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("Справочник.Заказы.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);

	Если Не ЗначениеЗаполнено(ПараметрКоманды) Тогда
		Возврат;
	КонецЕсли;	
	
	ФормаВызова = ПараметрыВыполненияКоманды.Источник;
	
	Если Не ФормаВызова.ПоВыбранномуРейсуРаспечатанМЛ Тогда
		ПоказатьОповещениеПользователя("По рейсу не распечатан МЛ!", "По рейсу не распечатан МЛ!");
		Возврат;
	КонецеСли;	
	
	ДанныеЗаказа = ПроцедурыРаботыСЗаказамиВызовСервера.ПолучитьДанныеЗаказа(ПараметрКоманды);
	
	Если ДанныеЗаказа.ПодписаниеИВозвратСопрДокументов Тогда
		СтрокаКПоказу = "ВНИМАНИЕ!!!!" + Символы.ПС + 
					"Необходимо:" + Символы.ПС +
					"1) Подписать и вернуть документы" + Символы.ПС +
					"2) Сфотографировать документы в МП";
		ШрифтФормСтрока = ОбщегоНазначенияСервер.ПолучитьШрифтПредупреждениеПользователю();
		ФормСтрока = Новый ФорматированнаяСтрока(СтрокаКПоказу, ШрифтФормСтрока); 
		ПоказатьПредупреждение(, ФормСтрока);
	КонецеСли;
	
	
	СписокРезультатыДоставки = 
		ПроцедурыРаботыСЗаказамиВызовСервера.ПолучитьСписокРезультатовДоставки(ДанныеЗаказа.ТипЗаказа);
	

	
	ВыбранныйСтатус = Ждать СписокРезультатыДоставки.ВыбратьЭлементАсинх("Укажите статус..");
	
	Если ВыбранныйСтатус <> Неопределено Тогда
		
		ДанныеСтатуса = ВыбранныйСтатус.Значение;
		
		Если Не ДанныеСтатуса.ЭтоКДоставке И Не ДанныеСтатуса.ЭтоДоставка Тогда
			
			СписокПричинОтказаПереноса = 
				ПроцедурыРаботыСЗаказамиВызовСервера.ПолучитьСписокПричинОтказовПереносовПоРезультатуДоставки(ДанныеСтатуса.РезультатДоставки, ДанныеЗаказа.ТипЗаказа);				
			ВыбраннаяПричинаОтказаПереноса = Ждать СписокПричинОтказаПереноса.ВыбратьЭлементАсинх("Укажите причину отказа/переноса..");
			Если ВыбраннаяПричинаОтказаПереноса = Неопределено Тогда
				Возврат;
			КонецеСли;	
							
			ПараметрыСтатуса = ПроцедурыРаботыСЗаказамиКлиентСервер.
				ПолучитьСтруктуруДанныеУстановкиРезультатаДоставки(ДанныеЗаказа.Заказ, ФормаВызова.ВыбранныйРейс, ДанныеСтатуса.РезультатДоставки, ВыбраннаяПричинаОтказаПереноса.Значение);
				
			Если ДанныеСтатуса.ЭтоПеренос Тогда
				//работа с датой переноса
				ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаОповещенияУстановкаДатыПереносаЗаказаАсинх", ПроцедурыРаботыСЗаказамиКлиент);
				ПараметрыСтатуса.Вставить("КалендарьДоставки", ДанныеЗаказа.КалендарьДоставки);
				ПараметрыСтатуса.Вставить("ДатаРейса", ФормаВызова.ВыбранныйРейсДатаРейса);
				ОткрытьФорму("ОбщаяФорма.ФормаВводаДаты", ПараметрыСтатуса,,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			Иначе
				ДанныеПодъемаИПримерки = Ждать ПроцедурыРаботыСЗаказамиКлиент.СборДанныхРезультатаДоставкиПослеПереносаИлиЗаездаПоЗаказуАсинх(ПараметрыСтатуса);
				Если ДанныеПодъемаИПримерки = Неопределено Тогда
					Возврат;
				КонецЕсли;	
				БСПКлиент.ДополнитьСтруктуру(ПараметрыСтатуса, ДанныеПодъемаИПримерки);
				ПроцедурыРаботыСЗаказамиВызовСервера.УстановитьСтатусДоставкиЗаказа(ПараметрыСтатуса);
				Оповестить("ИзмененСтатус");
			КонецеСли;	
		ИначеЕсли ДанныеСтатуса.ЭтоКДоставке Тогда
			//TODO: установка признака ВозвратНаДоставку
			ПараметрыСтатуса = ПроцедурыРаботыСЗаказамиКлиентСервер.
				ПолучитьСтруктуруДанныеУстановкиРезультатаДоставки(ДанныеЗаказа.Заказ, ФормаВызова.ВыбранныйРейс, ДанныеСтатуса.РезультатДоставки);
			ПараметрыСтатуса.Вставить("ВозвратНаДоставку", Истина);	
			ПроцедурыРаботыСЗаказамиВызовСервера.УстановитьСтатусДоставкиЗаказа(ПараметрыСтатуса);			
		ИначеЕсли ДанныеСтатуса.ЭтоДоставка Тогда	
			
			ПараметрыСтатуса = ПроцедурыРаботыСЗаказамиКлиентСервер.
				ПолучитьСтруктуруДанныеУстановкиРезультатаДоставки(ДанныеЗаказа.Заказ, ФормаВызова.ВыбранныйРейс, ДанныеСтатуса.РезультатДоставки);
			
			Если ЗначениеЗаполнено(ДанныеЗаказа.КодИдентификацииКлиента) И ДанныеСтатуса.ЭтоДоставка Тогда
				ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаОповещенияВводКИКАсинх", ПроцедурыРаботыСЗаказамиКлиент);
				ПараметрыСтатуса.Вставить("ТребуемыйКод", ДанныеЗаказа.КодИдентификацииКлиента);
				ОткрытьФорму("ОбщаяФорма.ФормаВводаКИК", ПараметрыСтатуса,,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			Иначе
				ПроцедурыРаботыСЗаказамиКлиент.СборДанныхПоложительногоРезультатаДоставкиАсинх(ПараметрыСтатуса);
			КонецеСли;	
		КонецеСли;	
	КонецеСли;	
КонецПроцедуры
#КонецОбласти

