Процедура Сформировать(Т, СписокНомеров) Экспорт
	Т.Очистить();
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа,
	            |	РеализацияТоваровУслуг.Ссылка КАК Док,
				|ПОДСТРОКА(РеализацияТоваровУслуг.НомерВнешнегоЗаказа, 6, 8) Как Н
	            |ИЗ
	            |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	            |ГДЕ
	            |	(ПОДСТРОКА(РеализацияТоваровУслуг.НомерВнешнегоЗаказа, 6, 8) В (&МасНомеров)
	            |			ИЛИ РеализацияТоваровУслуг.НомерВнешнегоЗаказа В (&МасНомеров) ИЛИ РеализацияТоваровУслуг.Номер В (&МасНомеров))";
				
	Зап.УстановитьПараметр("МасНомеров", СписокНомеров);			
	Рез = Зап.Выполнить().Выгрузить();
	
	МасСсылок = Рез.ВыгрузитьКолонку("Док");
	
	
	Зап5 = Новый Запрос;
	Зап5.Текст = "ВЫБРАТЬ
	             |	ЗакрытыеЗаказы.Период,
	             |	ЗакрытыеЗаказы.Регистратор,
	             |	ЗакрытыеЗаказы.НомерСтроки,
	             |	ЗакрытыеЗаказы.Активность,
	             |	ЗакрытыеЗаказы.ТипЗаказа,
	             |	ЗакрытыеЗаказы.Транспорт,
	             |	ЗакрытыеЗаказы.ИнтернетМагазин,
	             |	ЗакрытыеЗаказы.КатегорияДоставки,
	             |	ЗакрытыеЗаказы.Водитель,
	             |	ЗакрытыеЗаказы.Экспедитор,
	             |	ЗакрытыеЗаказы.Клиент,
	             |	ЗакрытыеЗаказы.Реализация,
	             |	ЗакрытыеЗаказы.ТипОплаты,
	             |	ЗакрытыеЗаказы.СтатусЗаказа,
	             |	ЗакрытыеЗаказы.ПричинаНевыполнения,
	             |	ЗакрытыеЗаказы.СтатусИнтернетМагазина,
	             |	ЗакрытыеЗаказы.ПричинаОтказа,
	             |	ЗакрытыеЗаказы.СуммаОценочная,
	             |	ЗакрытыеЗаказы.СуммаПолученная,
	             |	ЗакрытыеЗаказы.СуммаДоставкиДоМКАД,
	             |	ЗакрытыеЗаказы.СуммаДоставкиЗаМКАД,
	             |	ЗакрытыеЗаказы.УслугиСД,
	             |	ЗакрытыеЗаказы.БанковскаяКомиссия,
	             |	ЗакрытыеЗаказы.КассовоеОбслуживание,
	             |	ЗакрытыеЗаказы.СуммаВозврата,
	             |	ЗакрытыеЗаказы.Масса,
	             |	ЗакрытыеЗаказы.СуммаЧастичногоВозврата,
	             |	ЗакрытыеЗаказы.ОплаченоКлиентовНал,
	             |	ЗакрытыеЗаказы.АгентскоеВознаграждение,
	             |	ЗакрытыеЗаказы.Поступление,
	             |	ЗакрытыеЗаказы.Списание,
	             |	ЗакрытыеЗаказы.Оприходование,
	             |	ЗакрытыеЗаказы.Перемещение,
	             |	ЗакрытыеЗаказы.Доставка,
	             |	ЗакрытыеЗаказы.Возврат,
	             |	ЗакрытыеЗаказы.ПризнакВозврата
	             |ИЗ
	             |	РегистрНакопления.ЗакрытыеЗаказы КАК ЗакрытыеЗаказы
	             |ГДЕ
	             |	ЗакрытыеЗаказы.Реализация В(&МасСсылок)";
				 
	Зап5.УстановитьПараметр("МасСсылок", МасСсылок);			 
	Рез5 = Зап5.Выполнить().Выгрузить();
	
	Зап2 = Новый ЗАпрос;
	Зап2.Текст = "ВЫБРАТЬ
	             |	ВЫБОР
	             |		КОГДА ЕСТЬNULL(ЗагрузкаСТСДШтрихкоды.Ссылка, ИСТИНА) = ИСТИНА
	             |			ТОГДА 0
	             |		ИНАЧЕ 1
	             |	КОНЕЦ КАК ЕстьВТСД,
	             |	0 КАК ЕстьВВозврате,
	             |	РеализацияТоваровУслуг.Ссылка,
	             |	РеализацияТоваровУслуг.СтатусИнтернетМагазина,
	             |	РеализацияТоваровУслуг.Дата
	             |ИЗ
	             |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗагрузкаСТСД.Штрихкоды КАК ЗагрузкаСТСДШтрихкоды
	             |		ПО РеализацияТоваровУслуг.Ссылка = ЗагрузкаСТСДШтрихкоды.Заказ.Ссылка
	             |ГДЕ
	             |	РеализацияТоваровУслуг.Ссылка В(&МасСсылок)";
				 //|ОБЪЕДИНИТЬ ВСЕ
				 
	Зап3 = Новый Запрос;
	Зап4 = Новый Запрос;
	Зап3.Текст = "ВЫБРАТЬ
	             |	ВЫБОР
	             |		КОГДА ЕСТЬNULL(ВозвратТоваровПоставщикуТовары.Ссылка, ИСТИНА) = ИСТИНА
	             |			ТОГДА 0
	             |		ИНАЧЕ 1
	             |	КОНЕЦ КАК ЕстьВВозврате,
	             |	РеализацияТоваровУслуг.Ссылка,
	             |	РеализацияТоваровУслуг.СтатусИнтернетМагазина,
	             |	ВЫБОР
	             |		КОГДА ЕСТЬNULL(ВозвратТоваровПоставщикуТовары.Ссылка, ИСТИНА) = ИСТИНА
	             |			ТОГДА 0
	             |		ИНАЧЕ ВозвратТоваровПоставщикуТовары.Ссылка.Дата
	             |	КОНЕЦ КАК ДатаАкта,
	             |	ВЫБОР
	             |		КОГДА ЕСТЬNULL(ВозвратТоваровПоставщикуТовары.Ссылка, ИСТИНА) = ИСТИНА
	             |			ТОГДА 0
	             |		ИНАЧЕ ВозвратТоваровПоставщикуТовары.Ссылка.Номер
	             |	КОНЕЦ КАК НомерАкта,
	             |	ВозвратТоваровПоставщикуТовары.Ссылка.Ссылка КАК Док
	             |ИЗ
	             |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	             |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровПоставщику.Товары КАК ВозвратТоваровПоставщикуТовары
	             |			ПО (ПоступлениеТоваровУслуг.Ссылка = ВозвратТоваровПоставщикуТовары.ДокументПоступления.Ссылка
	             |					И ВозвратТоваровПоставщикуТовары.Ссылка.Проведен = ИСТИНА)
	             |		ПО РеализацияТоваровУслуг.Номер = ПоступлениеТоваровУслуг.Номер
	             |ГДЕ
	             |	РеализацияТоваровУслуг.Ссылка В(&МасСсылок)";
				 
	Зап4.Текст = "ВЫБРАТЬ
	             |	ВЫБОР
	             |		КОГДА ЕСТЬNULL(Накладная003Заказы.Ссылка, ИСТИНА) = ИСТИНА
	             |			ТОГДА 0
	             |		ИНАЧЕ 1
	             |	КОНЕЦ КАК ЕстьВАкте,
	             |	РеализацияТоваровУслуг.Ссылка,
	             |	РеализацияТоваровУслуг.СтатусИнтернетМагазина,
	             |	ВЫБОР
	             |		КОГДА ЕСТЬNULL(Накладная003Заказы.Ссылка, ИСТИНА) = ИСТИНА
	             |			ТОГДА 0
	             |		ИНАЧЕ Накладная003Заказы.Ссылка.Дата
	             |	КОНЕЦ КАК ДатаАкта,
	             |	ВЫБОР
	             |		КОГДА ЕСТЬNULL(Накладная003Заказы.Ссылка, ИСТИНА) = ИСТИНА
	             |			ТОГДА 0
	             |		ИНАЧЕ Накладная003Заказы.Ссылка.Номер
	             |	КОНЕЦ КАК НомерАкта,
	             |	Накладная003Заказы.Ссылка.Ссылка КАК Док
	             |ИЗ
	             |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Накладная003.Заказы КАК Накладная003Заказы
	             |		ПО РеализацияТоваровУслуг.Ссылка = Накладная003Заказы.Заказ.Ссылка
	             |ГДЕ
	             |	РеализацияТоваровУслуг.Ссылка В(&МасСсылок)";
	Зап3.УстановитьПараметр("МасСсылок", МасСсылок);
	Рез3 = Зап3.Выполнить().Выгрузить();
	Зап4.УстановитьПараметр("МасСсылок", МасСсылок);
	Рез4 = Зап4.Выполнить().Выгрузить();
				 
	Зап2.УстановитьПараметр("МасСсылок", МасСсылок);
	Рез2 = Зап2.Выполнить().Выгрузить();
	
	Мак = ПолучитьМакет("Макет");
	Обл = Мак.ПолучитьОбласть("Строка");
	ОблШ = Мак.ПолучитьОбласть("Шапка");
	
	//Для Каждого Тек Из Рез Цикл
	//	Сообщить(Тек.Н);
	//КонецЦикла;	
	
	Т.Вывести(ОблШ);
	
	НПП = 1;
	Для Каждого Тек Из СписокНомеров Цикл
		СтрукНом = Новый Структура;
		СтрукНом.Вставить("НомерВнешнегоЗаказа", Тек);
		
		НайСтроки = Рез.НайтиСтроки(СтрукНом);
		
		Для СчСтр = 0 По НайСтроки.Количество() - 1 Цикл
			Обл.Параметры.НПП = НПП;
			Обл.Параметры.Номер = Тек;
			Най = НайСТроки[СчСтр];
			Если Най <> Неопределено Тогда
				Обл.Параметры.ЕстьВСистеме = истина;
				Най2 = Рез2.Найти(Най.Док);
				Най3 = Рез3.Найти(Най.Док);
				Най4 = Рез4.Найти(Най.Док);
				Най5 = Рез5.Найти(Най.Док);
				Если Най3.ЕстьВВозврате = 1 Тогда
					Обл.Параметры.ЕстьВВозврате = Най3.НомерАкта + " от " + Формат(Най3.ДатаАкта, "ДЛФ=D");
					Обл.Параметры.Док = Най3.Док;
				Иначе
					Обл.Параметры.ЕстьВВозврате = Ложь;
				КонецеСли;	
				
				Если Най4.ЕстьВАкте = 1 Тогда
					Обл.Параметры.ЕстьВАкте = Най4.НомерАкта + " от " + Формат(Най4.ДатаАкта, "ДЛФ=D");
					Обл.Параметры.Док = Най4.Док;
				Иначе
					Обл.Параметры.ЕстьВАкте = Ложь;
				КонецеСли;	
				
				
				Если Най2.ЕстьВТСД = 1 Тогда
					Обл.Параметры.ЕстьВТСД = Истина;
				Иначе
					Обл.Параметры.ЕстьВТСД = Ложь;
				КонецеСли;	
				
				Если Най5 <> Неопределено Тогда
					Если Най5.СтатусИнтернетМагазина = Справочники.СтатусЗаказаИнтернетМагазина.ЗаказЗакрыт тогда
						Обл.Параметры.Доставлен = Най5.Период;
					Иначе	
						Обл.Параметры.Доставлен = "";
					КонецеСли;	
					Обл.параметры.Статус = Най5.Статусзаказа;
				КонецеСли;
			Иначе
				Обл.Параметры.ЕстьВСистеме = Ложь;
				Обл.Параметры.ЕстьВТСД = Ложь;
				Обл.Параметры.ЕстьВВозврате = Ложь;
				Обл.Параметры.Доставлен = Ложь;
			КонецеСли;	
			НПП = НПП + 1;
			т.Вывести(Обл);
		КонецЦикла;
		
	КонецЦикла;	
	
КонецПроцедуры	
