&НаКлиенте
Перем ДатаНач Экспорт;
&НаКлиенте
Перем ДатаКон Экспорт;

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "СписокТочкаПрибытия" Тогда
		Най = БизнесПроцессы.новаМестнаяДоставка.НайтиПоНомеру(Элементы.Список.ТекущиеДанные.Номер);
		Если Не Най.Пустая() Тогда
			Т = Най.ТочкаПрибытия.ПолучитьФорму("ИсправленнаяФормаЭлемента");
			Т.Открыть();
			//Ф = Т.ОткрытьФорму("ФормаБизнесПроцесса");
			//Ф.Открыть();
			
			//Д = Новый Структура("Ключ", Най.ТочкаПрибытия.ссылка);
			//Форма = ПолучитьФорму("Справочник.новаТочкиДоставки.Форма.ИсправленнаяФормаЭлемента", Д);
			//Форма.Открыть();
		КонецеСли;	
		//Если ЗначениеЗаполнено(В) Тогда
		//	Д = Док.ПолучитьОбъект();
		//	Д.Водитель = В;
		//	Д.Записать(РежимЗаписиДокумента.Запись);
		//	Элементы.СписокДокументов.Обновить();
		//КонецеСли;	
	КонецеСли;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список.Параметры.УстановитьЗначениеПараметра("ДатаНач", НачалоДня(ТекущаяДата()));
	Список.Параметры.УстановитьЗначениеПараметра("ДатаКон", КонецДня(ТекущаяДата()));
	Список.Параметры.УстановитьЗначениеПараметра("ТолькоРазные", Объект.ПоказыватьТолькоРазные);
КонецПроцедуры


&НаКлиенте
Процедура ИнтервалВидимости(Команда)
	// Вставить содержимое обработчика.
	Инт = Новый ДиалогРедактированияСтандартногоПериода();
	Инт.Период = Новый СтандартныйПериод(ДатаНач, ДатаКон);
	Если Инт.Редактировать() Тогда
		ДатаНач = Инт.Период.ДатаНачала;
		ДатаКон = Инт.Период.ДатаОкончания;
		Список.Параметры.УстановитьЗначениеПараметра("ДатаНач", ДатаНач);
		Список.Параметры.УстановитьЗначениеПараметра("ДатаКон", ДатаКон);
		Элементы.Список.Обновить();
	КонецЕСли;	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьТолькоРазныеПриИзменении(Элемент)
	Список.Параметры.УстановитьЗначениеПараметра("ДатаНач", ДатаНач);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаКон", ДатаКон);
	Список.Параметры.УстановитьЗначениеПараметра("ТолькоРазные", Объект.ПоказыватьТолькоРазные);
КонецПроцедуры


ДатаНач = НачалоДня(ТекущаяДата() + 86400);
ДатаКон = КонецДня(ТекущаяДата() + 86400);
