
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("Справочник.Оборудование.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);

	СписокОборудования = Новый Массив;
	СписокОборудования.Добавить(ПараметрКоманды);
	
	СтатусЕдиницыОборудования = ПредопределенноеЗначение("Перечисление.СтатусыЕдиницыОборудования.ВРемонте");
	
	РегионыВыбора = УчетОборудованияСервер.ПолучитьРегионыВыбора();
	Если РегионыВыбора = Неопределено Тогда
		УчетОборудованияКлиент.ПоказатьВопросОСменеСтатуса(СтатусЕдиницыОборудования, СписокОборудования, ПараметрыВыполненияКоманды.Источник);
	Иначе
		Регионы = Новый СписокЗначений;
		Регионы.ЗагрузитьЗначения(РегионыВыбора);
		
		УчетОборудованияКлиент.ПоказатьВопросОСменеСтатусаСВыборомРегиона(СтатусЕдиницыОборудования, СписокОборудования, ПараметрыВыполненияКоманды.Источник, Регионы);
	КонецЕсли;
	
КонецПроцедуры
