
&НаКлиенте
Процедура СерверСБалансером1ПриИзменении(Элемент)
	
	Если Объект.СерверСБалансером Тогда
		Объект.ИмяСеревера = "courier.common.yandex.ru";
		Объект.ПрефиксСервиса = "/api/v1/companies/7/";
		Объект.РазмерПорцииДанных = 10000;
	Иначе 	
		Объект.ИмяСеревера = "yandex.ru";
		Объект.ПрефиксСервиса = "/courier/api/v1/companies/7/";		
		Объект.РазмерПорцииДанных = 10;
	КонецЕсли;	

	
	
	ЭтаФорма.ВладелецФормы.Объект.ИмяСеревера = Объект.ИмяСеревера;
	ЭтаФорма.ВладелецФормы.Объект.ПрефиксСервиса = Объект.ПрефиксСервиса;
	ЭтаФорма.ВладелецФормы.Объект.РазмерПорцииДанных = Объект.РазмерПорцииДанных;
	ЭтаФорма.ВладелецФормы.Объект.СерверСБалансером = Объект.СерверСБалансером;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Объект.ИмяСеревера = ЭтаФорма.ВладелецФормы.Объект.ИмяСеревера;
	Объект.ПрефиксСервиса = ЭтаФорма.ВладелецФормы.Объект.ПрефиксСервиса;
	Объект.РазмерПорцииДанных = ЭтаФорма.ВладелецФормы.Объект.РазмерПорцииДанных;
	Объект.СерверСБалансером = ЭтаФорма.ВладелецФормы.Объект.СерверСБалансером;
	
КонецПроцедуры
