
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Контрагенты.Ссылка КАК Ссылка,
	               |	Контрагенты.Ссылка КАК Контрагент,
	               |	Контрагенты.Код КАК Код,
	               |	Контрагенты.ОсновнойМагазин КАК ОсновнойМагазин,
	               |	Контрагенты.Родитель КАК Родитель
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.Родитель = &Родитель
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Контрагенты.Наименование";
	Запрос.УстановитьПараметр("Родитель",Справочники.Контрагенты.НайтиПоНаименованию("Комитенты"));
	Выборка = Запрос.Выполнить().Выгрузить();
	Контрагенты.Очистить();
	Контрагенты.Загрузить(Выборка);
КонецПроцедуры


Процедура Выбрать()
	МассивСтрока = Новый Массив; 
	МассивСтрока.Добавить(Тип("Строка"));
	КвалификаторСтроки = Новый КвалификаторыСтроки(100, ДопустимаяДлина.Переменная);
	ОписаниеТиповСтрока = Новый ОписаниеТипов(МассивСтрока, , КвалификаторСтроки);
	МассивБулево = Новый Массив;
	МассивБулево.Добавить(Тип("Булево"));
	ОписаниеТиповБулево = Новый ОписаниеТипов(МассивБулево);
	
	ВыбранныеСтроки = Новый ТаблицаЗначений;
	ВыбранныеСтроки.Колонки.Добавить("ИмяФильтра", 		ОписаниеТиповСтрока);
	ВыбранныеСтроки.Колонки.Добавить("ОписаниеФильтра", ОписаниеТиповСтрока);
	ВыбранныеСтроки.Колонки.Добавить("ПредставлениеФильтра", ОписаниеТиповСтрока);
	ВыбранныеСтроки.Колонки.Добавить("ОписаниеТипов");
	
	ОповеститьОВыборе(ВыбранныеСтроки);
КонецПроцедуры

&НаСервере
Процедура УстановитьКонтрагента(нКонтрагент);
	Контрагент = нКонтрагент;	
КонецПроцедуры

&НаСервере
Функция ПолучитьВыделенныеСтроки();
	МассивКонтрагентов = Новый СписокЗначений;
	Для Каждого СтрокаТаблицы ИЗ Контрагенты Цикл
		Если СтрокаТаблицы.v Тогда
			МассивКонтрагентов.Добавить(СтрокаТаблицы.Контрагент);
		КонецЕсли;
	КонецЦикла;
	Возврат МассивКонтрагентов;
КонецФункции

&НаКлиенте
Процедура КонтрагентыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	КомандаВыбрать(Неопределено);
КонецПроцедуры


&НаКлиенте
Процедура КомандаВыбрать(Команда)
	МассивКонтрагентов = ПолучитьВыделенныеСтроки();
	Для Каждого ВыделеннаяСтрокаТаблицы ИЗ Элементы.Контрагенты.ВыделенныеСтроки Цикл
		СтрокаИзТаблицы = Контрагенты.НайтиПоИдентификатору(ВыделеннаяСтрокаТаблицы);
		Если МассивКонтрагентов.НайтиПоЗначению(СтрокаИзТаблицы.Контрагент) = Неопределено Тогда
			МассивКонтрагентов.Добавить(СтрокаИзТаблицы.Контрагент);
		КонецЕсли;
	КонецЦикла;
	
	ОповеститьОВыборе(МассивКонтрагентов);
КонецПроцедуры


&НаКлиенте
Процедура КомандаВыделитьВсе(Команда)
	Для Каждого СтрокаТаблицы ИЗ Контрагенты Цикл
		СтрокаТаблицы.v = Истина;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура КомандаОтменитьВыделение(Команда)
		Для Каждого СтрокаТаблицы ИЗ Контрагенты Цикл
		СтрокаТаблицы.v = Ложь;
	КонецЦикла;

КонецПроцедуры

