
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Если Не ЗначениеЗаполнено(Объект.Ответственный) Тогда	
			Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;		
		КонецЕсли;
	КонецЕсли;
	
	//Элементы.ТоварыРеализацияВладелецТовара.Видимость = НЕ Объект.Сделка.Пустая() И Объект.Сделка.Вскрытые;
	
	//Асеев 20.05.2022 (Задача № 4809)>>>
	Если Объект.Проведен Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	Если Объект.ТипВозврата = Справочники.ТипыВозврата.ВнесистемныйВозврат Тогда
		Элементы.ГруппаТовары.Видимость = Ложь;
		Элементы.ГруппаВнесистемныйВозврат.Видимость = Истина;
	Иначе
		Элементы.ГруппаТовары.Видимость = Истина;
		Элементы.ГруппаВнесистемныйВозврат.Видимость = Ложь;
		//Модифицированность = Истина;
		//Асеев 20.05.2022 (Задача № 4809)<<<
		ЗаполнитьРеализацию();
		
		Если ПараметрыСеанса.oz_МагазинOZON = Объект.Контрагент Тогда
			Элементы.ГруппаПараметрыOZONe.Видимость = Ложь;
		КонецЕсли;
		
		//Асеев 20.05.2022 (Задача № 4809)>>>
		//перенесено из ПриОткрытии
		//Если Объект.Проведен Тогда
		//	ЭтаФорма.ТолькоПросмотр = Истина;
		//КонецЕсли;
		
		Элементы.Надпись_отправлениеРасформировано.Видимость = Ложь;
		Если Объект.ОтправлениеРасформировано Тогда
			ЭтаФорма.ТолькоПросмотр = Истина;
			Элементы.Надпись_отправлениеРасформировано.Заголовок = "Отправление расформировано!";
			Элементы.Надпись_отправлениеРасформировано.Видимость = Истина;
		КонецЕсли;
		
		Если Модифицированность Тогда
			Записать();
		КонецЕсли;
		//Асеев 20.05.2022 (Задача № 4809)<<<
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//Асеев 20.05.2022 (Задача № 4809)>>>
	//Если Объект.Проведен Тогда
	//	ЭтаФорма.ТолькоПросмотр = Истина;
	//КонецЕсли;
	//
	//Элементы.Надпись_отправлениеРасформировано.Видимость = Ложь;
	//Если Объект.ОтправлениеРасформировано Тогда
	//	ЭтаФорма.ТолькоПросмотр = Истина;
	//	Элементы.Надпись_отправлениеРасформировано.Заголовок = "Отправление расформировано!";
	//	Элементы.Надпись_отправлениеРасформировано.Видимость = Истина;
	//КонецЕсли;
	//
	//Если Модифицированность Тогда
	//	Записать();
	//КонецЕсли;
	//Асеев 20.05.2022 (Задача № 4809)<<<

КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если Объект.Проведен Тогда	
		ЭтаФорма.ТолькоПросмотр = Истина;		
	КонецЕсли;
	
	УстановитьСтатусПоЗаказам();
КонецПроцедуры

&НаСервере
Процедура УстановитьСтатусПоЗаказам()
	Если Объект.Проведен Тогда
		//СписокМеню = ПолучитьСписокСтатусов();
		//Результат = ВыбратьИзМеню(СписокМеню,Элемент);
	    
		//Если Результат <> Неопределено Тогда
	        //Форма = ОткрытьФорму("Документ.ГрупповаяУстановкаСтатусовСкладскогоУчета.Форма.ФормаДокумента");
	        //ОбъетФормы = Форма.Объект;
	        ДокументОбъектГУССУ = Документы.ГрупповаяУстановкаСтатусовСкладскогоУчета.СоздатьДокумент();
	        ДокументОбъектГУССУ.Дата = ТекущаяДата();
	        ДокументОбъектГУССУ.Основание = Объект.Ссылка;
	        ДокументОбъектГУССУ.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	        ДокументОбъектГУССУ.СтатусСкладскогоУчета = Справочники.СтатусыСкладскогоУчета.ПодготовленКВозврату;
			
			ДокументОбъектГУССУ.ТерминалОбработки = Объект.ТерминалОбработки; //Задача № 3047 
			
	        //ОбъетФормы.Основание = Ссылка;
	        //ОбъетФормы.СтатусСкладскогоУчета = Результат.Значение;
	        Выборка = ПолучитьДанныеЗаказы();
	        Пока Выборка.Следующий() Цикл
	            //СтрокаТЧ = ОбъетФормы.СтатусыЗаказов.Добавить();
	            СтрокаТЧ = ДокументОбъектГУССУ.СтатусыЗаказов.Добавить();
	            ЗаполнитьЗначенияСвойств(СтрокаТЧ,Выборка);
	            СтрокаТЧ.СтатусСкладскогоУчета = Справочники.СтатусыСкладскогоУчета.ПодготовленКВозврату;
	        КонецЦикла;
	        ДокументОбъектГУССУ.Записать(РежимЗаписиДокумента.Проведение);
		//КонецЕсли;
	КонецЕсли;
КонецПроцедуры	


Процедура ЗаполнитьРеализацию()	
	
	
	// МАС - 06.03.2018 - Дозаполним организацию из договора --->> 
	Если НЕ ЗначениеЗаполнено(Объект.Организация) И ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда		
		Объект.Организация = Объект.ДоговорКонтрагента.Организация;		
	КонецЕсли;
	// <<--- МАС 
	
	
	Для каждого Стр Из Объект.Товары Цикл		
		Если НЕ ЗначениеЗаполнено(Стр.Реализация) И ЗначениеЗаполнено(Стр.ДокументПоступления) Тогда		
			НайРеализ = Документы.РеализацияТоваровУслуг.НайтиПоНомеру(СокрЛП(Стр.ДокументПоступления.Номер));
			Если ЗначениеЗаполнено(НайРеализ) Тогда		
				Стр.Реализация  = НайРеализ;	
				Стр.НомерЗаказа = НайРеализ.Номер;
				Модифицированность = Истина;
			КонецЕсли;
		КонецЕсли;				
	КонецЦикла;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ПечатьВозвратнойнакладной(Команда)
	
	ТабДок = ПечатьВозвратнойнакладнойНаСервере();		
	ТабДок.Показать();
	
КонецПроцедуры

&НаСервере
Функция ПечатьВозвратнойнакладнойНаСервере()
			
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.Защита = Ложь;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	
	//Асеев 20.05.2022 (Задача № 4809)>>>
	Если Модифицированность Тогда
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	КонецЕсли;
	
	Если Объект.ТипВозврата = Справочники.ТипыВозврата.ВнесистемныйВозврат Тогда
		
		Документы.ВозвратТоваровПоставщику.ПечатьВнесистемнойВозвратнойНакладной(ТабДок, Объект.Ссылка);
		
	Иначе
		//Асеев 20.05.2022 (Задача № 4809)<<<
		
		ДокОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.ВозвратТоваровПоставщику"));
		
		Если Объект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_227") ИЛИ Объект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_181") Тогда	
			//ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
			ДокОбъект.ПечатьВозвратнойНакладной_ММС003(ТабДок);	
			
			//Геннадий 10.11.2021 ++
			//Яндекс.Доставка
		ИначеЕсли 
			(Объект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_833") И 
			(Объект.СкладМагазина.Код = 40187 ИЛИ Объект.СкладМагазина.Код = 9578 ИЛИ Объект.СкладМагазина.Код = 9577)) ИЛИ 
			
			(Объект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_883") И  
			(Объект.СкладМагазина.Код = 82803 ИЛИ Объект.СкладМагазина.Код = 82804 ИЛИ Объект.СкладМагазина.Код = 82805)) Тогда
			
			ДокОбъект.ПечатьВозвратнойНакладнойЯндекс(ТабДок);
			
			//Геннадий 10.11.2021 --
		Иначе	
			ДокОбъект.ПечатьВозвратнойНакладной(ТабДок);		
		КонецЕсли;			
		
	КонецЕсли;
	
	Возврат ТабДок;
	

КонецФункции


&НаКлиенте
Процедура ОтправитьДанныеПартнеру(Команда)
		
	Рез = ОтправитьДанныеПартнеруНаСервер();		
	Если Рез.Успешно Тогда
		Сообщить("Данные успешно получены (" + Рез.Ответ + ")");	
	Иначе	
		Сообщить("Получение данных не подтверждено!");
	КонецЕсли;
		
КонецПроцедуры


Функция ОтправитьДанныеПартнеруНаСервер()
		
	СурогатныйОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.ВозвратТоваровПоставщику"));
	СурогатныйОбъект.ВыгрузкаДМ();			
	
	Рез = ПроверитьОтправкуДанныхНаСервере();	
	
	Возврат Рез;	

КонецФункции // ()


&НаКлиенте
Процедура ПроверитьОтправкуДанных(Команда)
		
	Рез = ПроверитьОтправкуДанныхНаСервере();		
	Если Рез.Успешно Тогда
		Сообщить("Данные успешно получены (" + Рез.Ответ + ")");
		ОтветНаВопрос = Неопределено;

		ПоказатьВопрос(Новый ОписаниеОповещения("ПроверитьОтправкуДанныхЗавершение", ЭтотОбъект), "Распечатать ШК ЕО?", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да);	
	Иначе	
		Сообщить("Получение данных не подтверждено!");
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьОтправкуДанныхЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ОтветНаВопрос = РезультатВопроса;
	Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда
		НапечататьШК_ЕО_ДМ(Неопределено);
	КонецеСли;

КонецПроцедуры


Функция ПроверитьОтправкуДанныхНаСервере()
		
	СурогатныйОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.ВозвратТоваровПоставщику"));	
	Результат = СурогатныйОбъект.СтатусВыгрузкиДМ();	
	Если Результат = 0 Тогда	
		Стр = новый Структура();
		Стр.Вставить("Ответ", "");
		Стр.Вставить("Успешно", Ложь);	
	Иначе
		Стр = новый Структура();
		Стр.Вставить("Ответ", Результат.Ответ);
		Стр.Вставить("Успешно", Истина);	    
	КонецЕсли;
	
	Возврат Стр;
	
КонецФункции // ()

Функция ПолучитьДанныеЗаказы()
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |   ВозвратТоваровПоставщикуТовары.Ссылка.СтатусВозврата КАК СтатусСкладскогоУчета,
        |   РеализацияТоваровУслуг.Ссылка КАК Заказ,
        |   ВозвратТоваровПоставщикуТовары.ТипЗаказа КАК ТипЗаказа
        |ИЗ
        |   Документ.ВозвратТоваровПоставщику.Товары КАК ВозвратТоваровПоставщикуТовары
        |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
        |       ПО (ЕСТЬNULL(ВозвратТоваровПоставщикуТовары.ДокументПоступления.Номер, ВозвратТоваровПоставщикуТовары.ВозвратТоваровОтПокупателя.Номер) = РеализацияТоваровУслуг.Номер)
        |ГДЕ
        |   ВозвратТоваровПоставщикуТовары.Ссылка.Ссылка = &Ссылка
        |
        |СГРУППИРОВАТЬ ПО
        |   ВозвратТоваровПоставщикуТовары.Ссылка.СтатусВозврата,
        |   РеализацияТоваровУслуг.Ссылка,
        |   ВозвратТоваровПоставщикуТовары.ТипЗаказа";
    
    Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
    Возврат ВыборкаДетальныеЗаписи;


КонецФункции 

&НаСервере
Функция НапечататьШК_ЕО_ДМНаСервере()
	СурогатныйОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.ВозвратТоваровПоставщику"));	
	ТабДок = СурогатныйОбъект.ПолучитьТабДокШКТранспортировки();	
	Возврат ТабДок;
КонецФункции

&НаКлиенте
Процедура НапечататьШК_ЕО_ДМ(Команда)
	ТабДок = НапечататьШК_ЕО_ДМНаСервере();
	Если ТабДок <> Неопределено Тогда 
		ТабДок.показать("ШК ЕО ДМ");
	КонецеСли;	
КонецПроцедуры


