Функция ПечатьПоРейсу_старая(Рейс,ТабличныйДокумент) Экспорт
    //ТабличныйДокумент = Новый ТабличныйДокумент;
	// Михушкин --->> 
	//Макет = ПолучитьМакет("Макет");
	Макет = ПолучитьМакет("МакетНовый");
	//Макет = ПолучитьМакет("МакетУрезанный");
	// <<--- Михушкин 
    
    //ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
    //ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
    //ОбластьИтоги = Макет.ПолучитьОбласть("Итоги");
    //ОбластьПодвалПодпись = Макет.ПолучитьОбласть("ПодвалПодпись");
    //ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифы");
    
    //ОбластьШапкаОтрыв = Макет.ПолучитьОбласть("ШапкаОтрыв");
    //ОбластьСтрокаОтрыв = Макет.ПолучитьОбласть("СтрокаОтрыв");
    //ОбластьИтогиОтрыв = Макет.ПолучитьОбласть("ИтогиОтрыв");
    //ОбластьПодвалПодписьОтрыв = Макет.ПолучитьОбласть("ПодвалПодписьОтрыв");
    //ОбластьПодвалТарифыОтрыв = Макет.ПолучитьОбласть("ПодвалТарифыОтрыв");
    
    Запрос = Новый Запрос;
    Запрос.Текст = ТекстЗапросаПоРейсам();
    Запрос.УстановитьПараметр("Рейс", Рейс);
    РезультатЗапроса = Запрос.Выполнить();
    
    ВыборкаТипЗаказа = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
    
    Пока ВыборкаТипЗаказа.Следующий() Цикл
        // Вставить обработку выборки ВыборкаТипЗаказа
    
        ВыборкаНомер = ВыборкаТипЗаказа.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
    
		Пока ВыборкаНомер.Следующий() Цикл
			
			Если ВыборкаНомер.Озон Тогда			
				Продолжить;		
			КонецЕсли;			
			
            Если ВыборкаНомер.ТипЗаказа = Перечисления.ТипыЗаказов.Доставка Тогда
                ПечатьПоРейсуДоставка(ТабличныйДокумент,Макет,ВыборкаНомер);
            ИначеЕсли ВыборкаНомер.ТипЗаказа = Перечисления.ТипыЗаказов.Забор Тогда 
                ПечатьПоРейсуЗабор(ТабличныйДокумент,Макет,ВыборкаНомер);
            КонецЕсли;
			
            ////Выводим отрывную часть
            
            
            
            //ТабличныйДокумент.Вывести(ОбластьШапкаОтрыв);
            ////Строка
            //ВыборкаДетальныеЗаписи2 = ВыборкаНомерТоварногоЧека.Выбрать();
            //НомерСтроки = 0;
            //Пока ВыборкаДетальныеЗаписи2.Следующий() Цикл
            //    ОбластьСтрокаОтрыв = Макет.ПолучитьОбласть("СтрокаОтрыв");
            //    НомерСтроки = НомерСтроки+1;
            //    ОбластьСтрокаОтрыв.Параметры.Заполнить(ВыборкаДетальныеЗаписи2);
            //    ОбластьСтрокаОтрыв.Параметры.НомерСтроки = НомерСтроки;
            //    ОбластьСтрокаОтрыв.Параметры.ID_Код = СокрЛП(ВыборкаДетальныеЗаписи2.НоменклатураКод)+"/"+ВыборкаДетальныеЗаписи2.НоменклатураАртикул;
            //    ТабличныйДокумент.Вывести(ОбластьСтрокаОтрыв);
            //КонецЦикла;
            //
            //ТабличныйДокумент.Вывести(ОбластьИтогиОтрыв);
            //ТабличныйДокумент.Вывести(ОбластьПодвалПодписьОтрыв);
            //
            //Следующая страница
            //ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
            
            
        КонецЦикла;
    КонецЦикла;
    
    ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
    ТабличныйДокумент.АвтоМасштаб = Истина;
    

КонецФункции // ПечатьПоРейсу()

Функция ПечатьПоРейсуДоставка(ТабличныйДокумент,Макет,ВыборкаНомерТоварногоЧека, Реж = 1, МассивОбластей = Неопределено)

		//МассивОбластей = Новый Массив;
        #Область Шапка
        ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		//ОбластьШапкаОтрыв = Макет.ПолучитьОбласть("ШапкаОтрыв");
        
        ОбластьШапка.Параметры.Заполнить(ВыборкаНомерТоварногоЧека);
        ОбластьШапка.Параметры.ДатаИнтервалДоставкиЗаказа = Формат(ВыборкаНомерТоварногоЧека.ДатаДоставки,"ДФ=dd.MM.yyyy") + " с "+ Формат(ВыборкаНомерТоварногоЧека.ВремяПрибытияС,"ДФ=ЧЧ:мм") + " до "+Формат(ВыборкаНомерТоварногоЧека.ВремяПрибытияПо,"ДФ=ЧЧ:мм")+СтрокаПЕРЕНОС(ВыборкаНомерТоварногоЧека.Доставка);
        //ОбластьШапка.Параметры.Покупатель = СокрЛП(ВыборкаНомерТоварногоЧека.Покупатель)+"/"+ВыборкаНомерТоварногоЧека.ТелефонДоставки;
		//ОбластьШапка.Параметры.НомерТоварногоЧека = "д"+СокрЛП(ВыборкаНомерТоварногоЧека.Номер)+"/"+СокрЛП(ВыборкаНомерТоварногоЧека.НомерВнешнегоЗаказа);
		
		//Если ЗначениеЗаполнено(ВыборкаНомерТоварногоЧека.ДополнительныйНомерЗаказа) Тогда		
		//	ОбластьШапка.Параметры.НомерТоварногоЧека = СокрЛП(ВыборкаНомерТоварногоЧека.Номер)+"/"+СокрЛП(ВыборкаНомерТоварногоЧека.ДополнительныйНомерЗаказа);			
		//Иначе	
			ОбластьШапка.Параметры.НомерТоварногоЧека = СокрЛП(ВыборкаНомерТоварногоЧека.Номер)+"/"+СокрЛП(ВыборкаНомерТоварногоЧека.НомерВнешнегоЗаказа);			
		//КонецЕсли;
				
        ОбластьШапка.Параметры.СтрокаПродавецАгент = СтрокаПродавецАгент(ВыборкаНомерТоварногоЧека);
		
		Если ВыборкаНомерТоварногоЧека.Контрагент.Код = "Shop_234 " И ЗначениеЗаполнено(ВыборкаНомерТоварногоЧека.Заказ) Тогда
			ОбластьШапка.Параметры.ПодарочнаяПозиция = ?(ВыборкаНомерТоварногоЧека.Заказ.ПодарочныеПозиции.Количество(), ВыборкаНомерТоварногоЧека.Заказ.ПодарочныеПозиции[0].Номенклатура, "");			
		КонецЕсли;
		
		//+++ БАО 15.08.2017 №1678 
		//Если рэИнтеграцияРэдЭкспресс.ЭтоРЭД(ВыборкаНомерТоварногоЧека.Контрагент) Тогда
		//	ОбластьШапка.Параметры.Стриж = "РЕД";
		//Иначе
		//	ОбластьШапка.Параметры.Стриж = "Стриж";
		//КонецЕсли;	
		//--- БАО 15.08.2017 №1678 

		
		
        //Логотипы,название и штрихкод
        Логотипы = ПолучитьЛоготипыКомпании(ВыборкаНомерТоварногоЧека.Контрагент);
        Если ЗначениеЗаполнено(Логотипы) Тогда
            //ОбластьШапка.Рисунки.ЛоготипЛевый.Картинка = Логотипы.Левый.Получить();
			//ОбластьШапка.Рисунки.ЛоготипПравый.Картинка = Логотипы.Правый.Получить();
			
			// Якурнов 23.10.2018 10:09:56 Проверка на заполненое значение и присвоение картинки 
			ЛеваяКартинка = Логотипы.Левый.Получить();
			Если ЗначениеЗаполнено(ЛеваяКартинка) Тогда
				Попытка
					ОбластьШапка.Рисунки.ЛоготипЛевый.Картинка = ЛеваяКартинка;	
				Исключение
					Сообщить("в бланке по заказу " + СокрЛП(ВыборкаНомерТоварногоЧека.Номер) + " произошла ошибка при выводе логотипа.");
				КонецПопытки;
			КонецЕсли;
			
			ПраваяКартинка = Логотипы.Правый.Получить();
			Если ЗначениеЗаполнено(ПраваяКартинка) Тогда
				Попытка
					ОбластьШапка.Рисунки.ЛоготипПравый.Картинка = ПраваяКартинка;	
				Исключение
					Сообщить("в бланке по заказу " + СокрЛП(ВыборкаНомерТоварногоЧека.Номер) + " произошла ошибка при выводе логотипа.");
				КонецПопытки;
			КонецЕсли;
			
        КонецЕсли;
        
        Если Не ЗначениеЗаполнено(ОбластьШапка.Рисунки.ЛоготипЛевый.Картинка) Тогда
            ОбластьШапка.Рисунки.ЛоготипЛевый.ВыводитьНаПечать = Ложь;
            ОбластьШапка.Параметры.Назв = ВыборкаНомерТоварногоЧека.Контрагент;
        КонецЕСли;	
        
        Если Не ЗначениеЗаполнено(ОбластьШапка.Рисунки.ЛоготипПравый.Картинка) Тогда
            ОбластьШапка.Рисунки.ЛоготипПравый.ВыводитьНаПечать = Ложь;
            ОбластьШапка.Параметры.Телефон = ВыборкаНомерТоварногоЧека.ТелефонИнтернетМагазина;
        КонецЕСли;
        
        //+++++Серегин М.В. 20.01.2016 17:49:13 даже тут без костылей никак
        Если ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_248") Или ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_601") Тогда
            ОбластьШапка.Параметры.Назв = "YD";
		ИначеЕсли ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_752") Тогда
			//ОбластьШапка.Параметры.Назв = "Я.Беру!";
			ОбластьШапка.Параметры.Назв = "Беру!";
        КонецЕсли;
        //-----Серегин М.В. 20.01.2016 17:49:27
		
		//-> Дробница Р. 01.08.2018		
		Если Реж = 1 Тогда
			попытка
				ОбластьШапка.Параметры.Штрихкод = may.ПолучитьШКCode_39(СокрЛП(ВыборкаНомерТоварногоЧека.Номер));
				//	ОбластьШапка.Рисунки.Штрихкод.Объект.barcode = "37" + Формат((Число(ВыборкаНомерТоварногоЧека.Номер)), "ЧЦ=10; ЧВН=; ЧГ="); 
			исключение
			конецпопытки;
		Иначе
			ОбластьШапка.Рисунки.ШК.Текст = lem.глСформироватьБарКодEAN13("37" + Формат((Число(ВыборкаНомерТоварногоЧека.Номер)), "ЧЦ=10; ЧВН=; ЧГ=") + "0");
		КонецеСли;	
		//<- Дробница Р. 01.08.2018	
		
        ТабличныйДокумент.Вывести(ОбластьШапка);
		МассивОбластей.Добавить(ОбластьШапка);
        
        //Заполняем Шапку отрыва, выводим потом
		//ОбластьШапкаОтрыв.Параметры.Заполнить(ВыборкаНомерТоварногоЧека);
		//ОбластьШапкаОтрыв.Параметры.ДатаИнтервалДоставкиЗаказа = Формат(ВыборкаНомерТоварногоЧека.ДатаДоставки,"ДФ=dd.MM.yyyy") + " с "+ Формат(ВыборкаНомерТоварногоЧека.ВремяПрибытияС,"ДФ=ЧЧ:мм") + " до "+Формат(ВыборкаНомерТоварногоЧека.ВремяПрибытияПо,"ДФ=ЧЧ:мм")+СтрокаПЕРЕНОС(ВыборкаНомерТоварногоЧека.Доставка);
		//ОбластьШапкаОтрыв.Параметры.НомерТоварногоЧека = "д"+СокрЛП(ВыборкаНомерТоварногоЧека.Номер)+"/"+СокрЛП(ВыборкаНомерТоварногоЧека.НомерВнешнегоЗаказа);	
		
		//Если ЗначениеЗаполнено(ВыборкаНомерТоварногоЧека.ДополнительныйНомерЗаказа) Тогда		
		//	ОбластьШапкаОтрыв.Параметры.НомерТоварногоЧека = СокрЛП(ВыборкаНомерТоварногоЧека.Номер)+"/"+СокрЛП(ВыборкаНомерТоварногоЧека.ДополнительныйНомерЗаказа);
		//Иначе	
		//	ОбластьШапкаОтрыв.Параметры.НомерТоварногоЧека = СокрЛП(ВыборкаНомерТоварногоЧека.Номер)+"/"+СокрЛП(ВыборкаНомерТоварногоЧека.НомерВнешнегоЗаказа);			
		//КонецЕсли;
		
		
		//ОбластьШапкаОтрыв.Параметры.НомерТоварногоЧека = СокрЛП(ВыборкаНомерТоварногоЧека.Номер)+"/"+СокрЛП(ВыборкаНомерТоварногоЧека.НомерВнешнегоЗаказа);
		
		//ОбластьШапкаОтрыв.Параметры.СтрокаПродавецАгент = СтрокаПродавецАгент(ВыборкаНомерТоварногоЧека);
        
        Если ЗначениеЗаполнено(Логотипы) Тогда
            //ОбластьШапкаОтрыв.Рисунки.ЛоготипЛевыйОтрыв.Картинка = Логотипы.Левый.Получить();
			//ОбластьШапкаОтрыв.Рисунки.ЛоготипПравыйОтрыв.Картинка = Логотипы.Правый.Получить();
			ПраваяКартинка = Логотипы.Правый.Получить();
			//Если ЗначениеЗаполнено(ПраваяКартинка) Тогда
			//	ОбластьШапкаОтрыв.Рисунки.ЛоготипПравыйОтрыв.Картинка = ПраваяКартинка;	
			//КонецЕсли;
        КонецЕсли;
        
        //Если Не ЗначениеЗаполнено(ОбластьШапкаОтрыв.Рисунки.ЛоготипЛевыйОтрыв.Картинка) Тогда
        //    ОбластьШапкаОтрыв.Рисунки.ЛоготипЛевыйОтрыв.ВыводитьНаПечать = Ложь;
        //    ОбластьШапкаОтрыв.Параметры.Назв = ВыборкаНомерТоварногоЧека.Контрагент;
        //КонецЕСли;	
        
		//Если Не ЗначениеЗаполнено(ОбластьШапкаОтрыв.Рисунки.ЛоготипПравыйОтрыв.Картинка) Тогда
		//    ОбластьШапкаОтрыв.Рисунки.ЛоготипПравыйОтрыв.ВыводитьНаПечать = Ложь;
		//    ОбластьШапкаОтрыв.Параметры.Телефон = ВыборкаНомерТоварногоЧека.ТелефонИнтернетМагазина;
		//КонецЕСли;
        
        #КонецОбласти 
        
        #Область Строки
        ВыборкаДетальныеЗаписи = ВыборкаНомерТоварногоЧека.Выбрать();
        НомерСтроки = 0;
        Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
            ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
            
            НомерСтроки = НомерСтроки+1;
            ОбластьСтрока.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
            ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
			//+++ БАО 10.10.2017 №
			//---ОбластьСтрока.Параметры.ID_Код = СокрЛП(ВыборкаДетальныеЗаписи.НоменклатураКод)+"/"+ВыборкаДетальныеЗаписи.НоменклатураАртикул;
			ОбластьСтрока.Параметры.ID_Код = ВыборкаДетальныеЗаписи.НоменклатураАртикул;
			//--- БАО 10.10.2017 №
            ТабличныйДокумент.Вывести(ОбластьСтрока);
			МассивОбластей.Добавить(ОбластьСтрока);
            
        КонецЦикла;
        #КонецОбласти 
        
        #Область Итоги
        Если ВыборкаНомерТоварногоЧека.УчитыватьИтогоКОплате Тогда //+++++Серегин М.В. 01.03.2016 9:59:24 было  ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_248") Тогда
            ОбластьИтоги = Макет.ПолучитьОбласть("ИтогиЯндекс");
            Если ВыборкаНомерТоварногоЧека.ТипОплатыСсылка = Справочники.ТипыОплат.ОплаченоВМагазине ИЛИ ВыборкаНомерТоварногоЧека.ТипОплатыСсылка = Справочники.ТипыОплат.БезРасчетов Тогда // Задача № 2901
                ОбластьИтоги.Параметры.СуммаКОплате = 0;
            Иначе
                ОбластьИтоги.Параметры.СуммаКОплате = ВыборкаНомерТоварногоЧека.КОплатеКлиентом;//+++++Серегин М.В. 01.03.2016 10:00:01 было ВыборкаНомерТоварногоЧека.Сумма;
            КонецЕсли;
        Иначе 
            ОбластьИтоги = Макет.ПолучитьОбласть("Итоги");
		КонецЕсли;
		
        ОбластьИтоги.Параметры.Заполнить(ВыборкаНомерТоварногоЧека);
        Вес003 = ПолучитьВесНакладная003ПоДоставке(ВыборкаНомерТоварногоЧека.Номер);
        Если ЗначениеЗаполнено(Вес003) Тогда 
            ОбластьИтоги.Параметры.Вес = Вес003;
		КонецЕсли;
			
		// МАС - 03.08.2017 - №1394 --->> 
		Попытка
			Если ВыборкаНомерТоварногоЧека.ТипОплатыСсылка = Справочники.ТипыОплат.ОплаченоВМагазине ИЛИ ВыборкаНомерТоварногоЧека.ТипОплатыСсылка = Справочники.ТипыОплат.БезРасчетов Тогда // Задача № 2901
				ОбластьИтоги.Параметры.СуммаКОплате = "ОПЛАЧЕНО";
			КонецЕсли;				
		Исключение		
		КонецПопытки;
		// <<--- МАС
		
		Если ОбластьИтоги.Параметры.Вес = 0 И ЗначениеЗаполнено(ВыборкаНомерТоварногоЧека.Заказ) Тогда
			ОбластьИтоги.Параметры.Вес = ВыборкаНомерТоварногоЧека.Заказ.ОбщийВес;		
		КонецЕсли;
		
        ОбластьИтоги.Параметры.Вес = Формат(ОбластьИтоги.Параметры.Вес,"ЧЦ=14; ЧДЦ=1; ЧГ=0")+" ("+ ?(ЗначениеЗаполнено(ВыборкаНомерТоварногоЧека.КатегорияДляРасчетаЗП), ВыборкаНомерТоварногоЧека.КатегорияДляРасчетаЗП.Родитель, ВыборкаНомерТоварногоЧека.КатегорияДоставки)+")";
        
        ТабличныйДокумент.Вывести(ОбластьИтоги);
		МассивОбластей.Добавить(ОбластьИтоги);
		
		//// Михушкин - 30.06.2016 - Яндекс.Такси --->>
		//Если ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_181") 
		//	ИЛИ ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_227") 
		//	ИЛИ ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_428") Тогда
		//Иначе
		//	ЯндексПромо = Макет.ПолучитьОбласть("ЯндексПромо");
		//	ТабличныйДокумент.Вывести(ЯндексПромо);
		//КонецЕсли;
		//// <<--- Михушкин
			        
        //+++++Серегин М.В. 25.01.2016 10:23:35 
		//+++ БАО 10.10.2017 №
		//---Если ВыборкаНомерТоварногоЧека.ТипОплатыСсылка = Справочники.ТипыОплат.ВКредит Тогда
		Если ВыборкаНомерТоварногоЧека.ТипОплатыСсылка = Справочники.ТипыОплат.ВКредит
			 И ВыборкаНомерТоварногоЧека.УчитыватьИтогоКОплате	Тогда
			
		//--- БАО 10.10.2017 №	
			ОбластьКредит = Макет.ПолучитьОбласть("Кредит");
			ОбластьКредит.Параметры.СуммаКредита = ВыборкаНомерТоварногоЧека.ПредоплатаПоКредиту;
			ОбластьКредит.Параметры.СуммаКОплате = ВыборкаНомерТоварногоЧека.Сумма - ВыборкаНомерТоварногоЧека.ПредоплатаПоКредиту;
            ТабличныйДокумент.Вывести(ОбластьКредит);
			МассивОбластей.Добавить(ОбластьКредит);
        КонецЕсли;
        //-----Серегин М.В. 25.01.2016 10:23:38 
        
        
        //Заполняем Итоги отрыв, выводим потом
		//Если ВыборкаНомерТоварногоЧека.УчитыватьИтогоКОплате Тогда //+++++Серегин М.В. 01.03.2016 10:00:33 было ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_248") Тогда
		//    ОбластьИтогиОтрыв = Макет.ПолучитьОбласть("ИтогиЯндексОтрыв");
		//    Если ВыборкаНомерТоварногоЧека.ТипОплатыСсылка = Справочники.ТипыОплат.ОплаченоВМагазине Тогда
		//        ОбластьИтогиОтрыв.Параметры.СуммаКОплате = 0;
		//    Иначе
		//        ОбластьИтогиОтрыв.Параметры.СуммаКОплате = ВыборкаНомерТоварногоЧека.КОплатеКлиентом;//+++++Серегин М.В. 01.03.2016 10:00:51 было ВыборкаНомерТоварногоЧека.Сумма;
		//    КонецЕсли;
		//Иначе 
		//    ОбластьИтогиОтрыв = Макет.ПолучитьОбласть("ИтогиОтрыв");
		//КонецЕсли;
		//ОбластьИтогиОтрыв.Параметры.Заполнить(ВыборкаНомерТоварногоЧека);
		//Вес003 = ПолучитьВесНакладная003ПоДоставке(ВыборкаНомерТоварногоЧека.Номер);
		//Если ЗначениеЗаполнено(Вес003) Тогда 
		//    ОбластьИтогиОтрыв.Параметры.Вес = Вес003;
		//КонецЕсли;
		
		//ОбластьИтогиОтрыв.Параметры.Вес = Формат(ОбластьИтогиОтрыв.Параметры.Вес,"ЧЦ=14; ЧДЦ=1; ЧГ=0")+" ("+?(ЗначениеЗаполнено(ВыборкаНомерТоварногоЧека.КатегорияДляРасчетаЗП), ВыборкаНомерТоварногоЧека.КатегорияДляРасчетаЗП.Родитель, ВыборкаНомерТоварногоЧека.КатегорияДоставки)+")";
		//ОбластьИтогиОтрыв.Параметры.Вес = Формат(ОбластьИтогиОтрыв.Параметры.Вес,"ЧЦ=14; ЧДЦ=1; ЧГ=0")+" ("+ВыборкаНомерТоварногоЧека.КатегорияДоставки+")";
        
        //+++++Серегин М.В. 25.01.2016 10:23:35
		//ОбластьКредитОтрыв = Неопределено;
		//Если ВыборкаНомерТоварногоЧека.ТипОплатыСсылка = Справочники.ТипыОплат.ВКредит Тогда
		//	ОбластьКредитОтрыв = Макет.ПолучитьОбласть("КредитОтрыв");
		//	ОбластьКредитОтрыв.Параметры.СуммаКредита = ВыборкаНомерТоварногоЧека.ПредоплатаПоКредиту;
		//	ОбластьКредитОтрыв.Параметры.СуммаКОплате = ВыборкаНомерТоварногоЧека.Сумма - ВыборкаНомерТоварногоЧека.ПредоплатаПоКредиту;
		//    
		//КонецЕсли;
        //-----Серегин М.В. 25.01.2016 10:23:38 
        
        #КонецОбласти         
        
        #Область Подвал
        ОбластьПодвалПодпись = Макет.ПолучитьОбласть("ПодвалПодпись");
		//ОбластьПодвалПодписьОтрыв = Макет.ПолучитьОбласть("ПодвалПодписьОтрыв");
		
		//// Михушкин - 30.06.2016 - Яндекс.Такси --->>
		//Если ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_181") 
		//	ИЛИ ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_227") 
		//	ИЛИ ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_428") Тогда
		//	ОбластьПодвалПодписьОтрыв = Макет.ПолучитьОбласть("ПодвалПодписьОтрыв");				
		//Иначе			
		//	ОбластьПодвалПодписьОтрыв = Макет.ПолучитьОбласть("ПодвалПодписьОтрыв_ЯндексПромо");
		//КонецЕсли;
		//// <<--- Михушкин
		
		
		
		// Михушкин - Программное заполнение тарифов подъемов --->>
		ПодъемыПрограммно = Ложь;
		ЧетыреКолонкиНаЛифте = Ложь;
		Запрос_ОбластьПодвалТарифы = Новый Запрос("ВЫБРАТЬ
		                                          |	ВариантыТаблицыПодъемовТаблица2016.ТипПодъемаНаЭтаж,
		                                          |	ВариантыТаблицыПодъемовТаблица2016.ВесОт КАК ВесОт,
		                                          |	ВариантыТаблицыПодъемовТаблица2016.ВесДо,
		                                          |	ВариантыТаблицыПодъемовТаблица2016.СтоимостьПодъема
		                                          |ИЗ
		                                          |	РегистрСведений.ВариантыТаблицыПодъемовВБланкахЗаказов.СрезПоследних(, Контрагент = &Контрагент) КАК ВариантыТаблицыПодъемовВБланкахЗаказовСрезПоследних
		                                          |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыТаблицыПодъемов.Таблица2016 КАК ВариантыТаблицыПодъемовТаблица2016
		                                          |		ПО ВариантыТаблицыПодъемовВБланкахЗаказовСрезПоследних.ВариантТаблицыПодъемов.Ссылка = ВариантыТаблицыПодъемовТаблица2016.Ссылка
		                                          |ГДЕ
		                                          |	ВариантыТаблицыПодъемовТаблица2016.ТипПодъемаНаЭтаж <> ЗНАЧЕНИЕ(Перечисление.ТипПодъемаНаЭтаж.ПустаяСсылка)
		                                          |
		                                          |УПОРЯДОЧИТЬ ПО
		                                          |	ВесОт");
		Запрос_ОбластьПодвалТарифы.УстановитьПараметр("Контрагент", ВыборкаНомерТоварногоЧека.Контрагент);
		РезультатОбластьПодвалТарифы = Запрос_ОбластьПодвалТарифы.Выполнить();
		ПредварительноПодвалТарифы = Запрос_ОбластьПодвалТарифы.Выполнить().Выгрузить();
		
		Если ПредварительноПодвалТарифы.Количество() Тогда			
			ПодъемыПрограммно = Истина;
			НайКолПод = ПредварительноПодвалТарифы.НайтиСтроки(Новый Структура("ТипПодъемаНаЭтаж", Перечисления.ТипПодъемаНаЭтаж.ПодъемЗаказаНаЛифте));
			Если НайКолПод.Количество() > 2 Тогда
				ЧетыреКолонкиНаЛифте = Истина;	
			Иначе	
	            ЧетыреКолонкиНаЛифте = Ложь;
			КонецЕсли;		
		КонецЕсли;
		
		
		
        Если ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_248") Или ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_601") Или ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_752") Тогда
            Если ВыборкаНомерТоварногоЧека.МетодОплатыПодъёма = Перечисления.МетодыОплатыПодъёмаЗаказа.ОплачиваетПартнер Тогда
                ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифыЯндексБезТаблицы");
			Иначе
				Если ПодъемыПрограммно Тогда
					
					ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифыЯндексПрограммно_5Колонок");
					//Если ЧетыреКолонкиНаЛифте Тогда					
					//	ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифыЯндексПрограммно_4Колонки");					
					//Иначе					
					//	ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифыЯндексПрограммно");						
					//КонецЕсли;											
				Иначе			
					ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифыЯндекс");					
				КонецЕсли;
            КонецЕсли;
        Иначе
            Если ВыборкаНомерТоварногоЧека.МетодОплатыПодъёма = Перечисления.МетодыОплатыПодъёмаЗаказа.ОплачиваетПартнер Тогда
                ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифыБезТаблицы");
			Иначе
				Если ПодъемыПрограммно Тогда	
					
					ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифыПрограммно_5Колонок");
					//Если ЧетыреКолонкиНаЛифте Тогда	
					//	ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифыПрограммно_4Колонки");
					//Иначе					
					//	ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифыПрограммно");						
					//КонецЕсли;
									
				Иначе			
					ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифы");					
				КонецЕсли;									
            КонецЕсли;
        КонецЕсли;
        ОбластьПодвалПодпись.Параметры.Заполнить(ВыборкаНомерТоварногоЧека);
        //+++++Серегин М.В. 20.02.2016 16:26:53 
        Если ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_248") Или ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_601") Или ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_752") Тогда
            ОбластьПодвалПодпись.Параметры.НадписьОжидание = ВыборкаНомерТоварногоЧека.СОжиданием;
        КонецЕсли;
        //-----Серегин М.В. 20.02.2016 16:26:55 
        ТабличныйДокумент.Вывести(ОбластьПодвалПодпись);
		МассивОбластей.Добавить(ОбластьПодвалПодпись);
        		
		Попытка		
		Если ПодъемыПрограммно Тогда
			
			Рез_ОбластьПодвалТарифы = РезультатОбластьПодвалТарифы.Выбрать();
			НомерСтрБезЛифта = 1;
			НомерСтрНаЛифте = 1;
			
			Пока Рез_ОбластьПодвалТарифы.Следующий() Цикл
				Если Рез_ОбластьПодвалТарифы.ТипПодъемаНаЭтаж = Перечисления.ТипПодъемаНаЭтаж.ПодъемЗаказаБезЛифта Тогда		
					Если НомерСтрБезЛифта < 6 Тогда
						ОбластьПодвалТарифы.Параметры["Диапазон"+НомерСтрБезЛифта] = "от "+Рез_ОбластьПодвалТарифы.ВесОт + " - до " + Рез_ОбластьПодвалТарифы.ВесДо;
						ОбластьПодвалТарифы.Параметры["Значение"+НомерСтрБезЛифта] = Рез_ОбластьПодвалТарифы.СтоимостьПодъема;
						НомерСтрБезЛифта = НомерСтрБезЛифта + 1;
					КонецЕсли;
				ИначеЕсли Рез_ОбластьПодвалТарифы.ТипПодъемаНаЭтаж = Перечисления.ТипПодъемаНаЭтаж.ПодъемЗаказаНаЛифте Тогда	
					Если НомерСтрНаЛифте < 6 Тогда
						ОбластьПодвалТарифы.Параметры["ДиапазонНаЛифте"+НомерСтрНаЛифте] = "от "+Рез_ОбластьПодвалТарифы.ВесОт + " - до " + Рез_ОбластьПодвалТарифы.ВесДо;
						ОбластьПодвалТарифы.Параметры["ЗначениеНаЛифте"+НомерСтрНаЛифте] = Рез_ОбластьПодвалТарифы.СтоимостьПодъема;				
					    НомерСтрНаЛифте = НомерСтрНаЛифте + 1;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;	
	Исключение
		Сообщить("Проблема при формировании таблицы подъёмов для заказа " + СокрЛП(ВыборкаНомерТоварногоЧека.Номер) + "!! Сообщите об этом в IT отдел, пожалуйста!", СтатусСообщения.ОченьВажное);
		КонецПопытки;
		// <<--- Михушкин 
		
		ОбластьПодвалТарифы.Параметры.ДатаВремяПечати = ТекущаяДата();

		ВыводитьОбластьПодвалТарифы = Истина;
		
		// Михушкин --->> 	
		Если ВыборкаНомерТоварногоЧека.МетодОплатыПодъёма = Перечисления.МетодыОплатыПодъёмаЗаказа.ОплачиваетПартнер 
			ИЛИ ВыборкаНомерТоварногоЧека.МетодОплатыПодъёма = Перечисления.МетодыОплатыПодъёмаЗаказа.ОпределяетсяНастройкамиЗаказа И ВыборкаНомерТоварногоЧека.ПодъемОплачен = Истина Тогда
		    ОбластьПодвалТарифы.Параметры.ПодъемОплачен = "ДА";
			ОбластьПодвалТарифы.Параметры.СуммаПолученаСКлиентом = "ДЕНЕГ ЗА ПОДЪЕМ НЕ БЕРЕМ";
			
			ВыводитьОбластьПодвалТарифы = Ложь;
			
		ИначеЕсли ВыборкаНомерТоварногоЧека.МетодОплатыПодъёма = Перечисления.МетодыОплатыПодъёмаЗаказа.ОплачиваетКлиент 
			ИЛИ ВыборкаНомерТоварногоЧека.МетодОплатыПодъёма = Перечисления.МетодыОплатыПодъёмаЗаказа.ОпределяетсяНастройкамиЗаказа И ВыборкаНомерТоварногоЧека.ПодъемОплачен = Ложь Тогда
		    ОбластьПодвалТарифы.Параметры.ПодъемОплачен = "НЕТ";
		ИначеЕсли ВыборкаНомерТоварногоЧека.МетодОплатыПодъёма = Перечисления.МетодыОплатыПодъёмаЗаказа.ОпределяетсяПоКомментарию Тогда 	
			ОбластьПодвалТарифы.Параметры.ПодъемОплачен = "ПО КОММЕНТАРИЮ";
		КонецЕсли;		
		// <<--- Михушкин
		
		Если ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_181") Тогда
			ОбластьПодвалТарифы.Параметры.ПодъемОплачен = "Да, кроме КГТ по лестнице";
		КонецЕсли;
		
		Если ВыводитьОбластьПодвалТарифы Тогда
			 ТабличныйДокумент.Вывести(ОбластьПодвалТарифы);	
			 МассивОбластей.Добавить(ОбластьПодвалТарифы);
		КонецЕсли;
       
        #КонецОбласти 
        
        
        #Область ПроверкаВыводОтрывнойЧасти
        Пропуск = Макет.ПолучитьОбласть("Пропуск");
       
		//МассивОбластей.Добавить(ОбластьШапкаОтрыв);
        ВыборкаДетальныеЗаписиПроверка = ВыборкаНомерТоварногоЧека.Выбрать();
        НомерСтроки = 0;
		//Пока ВыборкаДетальныеЗаписиПроверка.Следующий() Цикл
		//    ОбластьСтрокаОтрыв = Макет.ПолучитьОбласть("СтрокаОтрыв");
		//    НомерСтроки = НомерСтроки+1;
		//    ОбластьСтрокаОтрыв.Параметры.Заполнить(ВыборкаДетальныеЗаписиПроверка);
		//    ОбластьСтрокаОтрыв.Параметры.НомерСтроки = НомерСтроки;
		//    ОбластьСтрокаОтрыв.Параметры.ID_Код = СокрЛП(ВыборкаДетальныеЗаписиПроверка.НоменклатураКод)+"/"+ВыборкаДетальныеЗаписиПроверка.НоменклатураАртикул;
		//    МассивОбластей.Добавить(ОбластьСтрокаОтрыв);
		//КонецЦикла;
		//МассивОбластей.Добавить(ОбластьИтогиОтрыв);
		//МассивОбластей.Добавить(ОбластьПодвалПодписьОтрыв);
        
		//Если ВыборкаНомерТоварногоЧека.ТипОплатыСсылка = Справочники.ТипыОплат.ВКредит Тогда
		//    МассивОбластей.Добавить(ОбластьКредитОтрыв);
		//КонецЕсли;
        
		//Если НЕ ТабличныйДокумент.ПроверитьВывод(МассивОбластей) Тогда
		//    ВыводОтрывнойЧастиНаСледующейСтранице(ВыборкаНомерТоварногоЧека,ТабличныйДокумент,,Макет,ОбластьИтогиОтрыв,ОбластьПодвалПодписьОтрыв,ОбластьКредитОтрыв);
		//Иначе
		//    МассивОбластей.Добавить(Пропуск);
		//    ВыводОтрывнойЧастиВнизу(МассивОбластей,ВыборкаНомерТоварногоЧека,ТабличныйДокумент,,Макет,ОбластьИтогиОтрыв,ОбластьПодвалПодписьОтрыв,Пропуск,ОбластьКредитОтрыв);
		//КонецЕсли;	
        #КонецОбласти 
		//ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		//Если НЕ ТабличныйДокумент.ПроверитьВывод(МассивОбластей) Тогда		
		//	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();	
		//	МассивОбластей = Новый Массив;
		//КонецЕсли;
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
        Возврат ТабличныйДокумент;
		
КонецФункции // ()

Функция ПечатьПоРейсуЗабор(ТабличныйДокумент,Макет,ВыборкаНомерТоварногоЧека, Реж = 1, МассивОбластей = Неопределено)
	
        БланкАкси = Ложь;
		
        #Область Шапка
		Если ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_438") Тогда   //Аксиомус
			ОбластьШапка = Макет.ПолучитьОбласть("ШапкаЗаборАкси");
			БланкАкси = Истина;
        Иначе    
	        ОбластьШапка = Макет.ПолучитьОбласть("ШапкаЗабор");
		КонецЕсли;	
        
        ОбластьШапка.Параметры.Заполнить(ВыборкаНомерТоварногоЧека);
        ОбластьШапка.Параметры.ДатаЗабора = Формат(ВыборкаНомерТоварногоЧека.ДатаЗабора,"ДФ=dd-MM-yyyy");
        //ОбластьШапка.Параметры.ДатаДоставки = Формат(ВыборкаНомерТоварногоЧека.ДатаДоставки,"ДФ=dd-MM-yyyy");
        ОбластьШапка.Параметры.ДатаИнтервалДоставкиЗаказа = Формат(ВыборкаНомерТоварногоЧека.ДатаДоставки,"ДФ=dd.MM.yyyy") + " с "+ Формат(ВыборкаНомерТоварногоЧека.ВремяПрибытияС,"ДФ=ЧЧ:мм") + ?(ЗначениеЗаполнено(ВыборкаНомерТоварногоЧека.ВремяПрибытияПо)," до "+Формат(ВыборкаНомерТоварногоЧека.ВремяПрибытияПо,"ДФ=ЧЧ:мм"),"");
		//ОбластьШапка.Параметры.НомерТоварногоЧека = "д"+СокрЛП(ВыборкаНомерТоварногоЧека.Номер)+?(ЗначениеЗаполнено(ВыборкаНомерТоварногоЧека.НомерВнешнегоЗаказа),"/"+СокрЛП(ВыборкаНомерТоварногоЧека.НомерВнешнегоЗаказа),"");
		
		//Если ЗначениеЗаполнено(ВыборкаНомерТоварногоЧека.ДополнительныйНомерЗаказа) Тогда		
		//	ОбластьШапка.Параметры.НомерТоварногоЧека = СокрЛП(ВыборкаНомерТоварногоЧека.Номер)+?(ЗначениеЗаполнено(ВыборкаНомерТоварногоЧека.НомерВнешнегоЗаказа),"/"+СокрЛП(ВыборкаНомерТоварногоЧека.ДополнительныйНомерЗаказа),"");
		//Иначе	
			ОбластьШапка.Параметры.НомерТоварногоЧека = СокрЛП(ВыборкаНомерТоварногоЧека.Номер)+?(ЗначениеЗаполнено(ВыборкаНомерТоварногоЧека.НомерВнешнегоЗаказа),"/"+СокрЛП(ВыборкаНомерТоварногоЧека.НомерВнешнегоЗаказа),"");		
		//КонецЕсли;
		
		//ОбластьШапка.Параметры.НомерТоварногоЧека = СокрЛП(ВыборкаНомерТоварногоЧека.Номер)+?(ЗначениеЗаполнено(ВыборкаНомерТоварногоЧека.НомерВнешнегоЗаказа),"/"+СокрЛП(ВыборкаНомерТоварногоЧека.НомерВнешнегоЗаказа),"");
        
        //ОбластьШапка.Параметры.Покупатель = СокрЛП(ВыборкаНомерТоварногоЧека.Покупатель);
		
		Если НЕ БланкАкси Тогда
			ОбластьШапка.Параметры.СтрокаПродавецАгент = СтрокаПродавецАгент(ВыборкаНомерТоварногоЧека);	
		КонецЕсли;
		
        
        //Логотипы,название и штрихкод
        Логотипы = ПолучитьЛоготипыКомпании(ВыборкаНомерТоварногоЧека.Контрагент);
		
		//+++ БАО 15.08.2017 №1678 
		//Если рэИнтеграцияРэдЭкспресс.ЭтоРЭД(ВыборкаНомерТоварногоЧека.Контрагент) Тогда
		//	ОбластьШапка.Параметры.Стриж = "РЕД";
		//Иначе
		//	ОбластьШапка.Параметры.Стриж = "Стриж";
		//КонецЕсли;	
		//--- БАО 15.08.2017 №1678 

		
		Если БланкАкси Тогда
			Если ЗначениеЗаполнено(Логотипы) Тогда
				// Якурнов 23.10.2018 10:14:02 Неявное присвоение картинки выдает ошибку 
				//ОбластьШапка.Рисунки.ЛоготипЛевыйЗаборАкси.Картинка = Логотипы.Левый.Получить();
				
				// Якурнов 23.10.2018 10:09:56 Проверка на заполненое значение и присвоение картинки 
				ЛеваяКартинка = Логотипы.Левый.Получить();
				Если ЗначениеЗаполнено(ЛеваяКартинка) Тогда
					Попытка
						ОбластьШапка.Рисунки.ЛоготипЛевыйЗаборАкси.Картинка = ЛеваяКартинка;	
					Исключение
						Сообщить("в бланке по заказу " + СокрЛП(ВыборкаНомерТоварногоЧека.Номер) + " произошла ошибка при выводе логотипа.");
					КонецПопытки;
				КонецЕсли;
				
				//ОбластьШапка.Рисунки.ЛоготипПравыйЗаборАкси.Картинка = Логотипы.Правый.Получить();
				ПраваяКартинка = Логотипы.Правый.Получить();
				Если ЗначениеЗаполнено(ПраваяКартинка) Тогда
					Попытка	
						ОбластьШапка.Рисунки.ЛоготипПравыйЗаборАкси.Картинка = ПраваяКартинка;	
					Исключение
						Сообщить("в бланке по заказу " + СокрЛП(ВыборкаНомерТоварногоЧека.Номер) + " произошла ошибка при выводе логотипа.");
					КонецПопытки;
				КонецЕсли;
			КонецЕсли;
			
	        Если Не ЗначениеЗаполнено(ОбластьШапка.Рисунки.ЛоготипЛевыйЗаборАкси.Картинка) Тогда
	            ОбластьШапка.Рисунки.ЛоготипЛевыйЗаборАкси.ВыводитьНаПечать = Ложь;
	            ОбластьШапка.Параметры.Назв = ВыборкаНомерТоварногоЧека.Контрагент;
	        КонецЕСли;	
	        
	        Если Не ЗначениеЗаполнено(ОбластьШапка.Рисунки.ЛоготипПравыйЗаборАкси.Картинка) Тогда
	            ОбластьШапка.Рисунки.ЛоготипПравыйЗаборАкси.ВыводитьНаПечать = Ложь;
	            ОбластьШапка.Параметры.Телефон = ВыборкаНомерТоварногоЧека.ТелефонИнтернетМагазина;
	        КонецЕСли;
		    
		Иначе
			Если ЗначениеЗаполнено(Логотипы) Тогда
				
				//ОбластьШапка.Рисунки.ЛоготипЛевыйЗабор.Картинка = Логотипы.Левый.Получить();
				
				// Якурнов 23.10.2018 10:09:56 Проверка на заполненое значение и присвоение картинки 
				ЛеваяКартинка = Логотипы.Левый.Получить();
				Если ЗначениеЗаполнено(ЛеваяКартинка) Тогда
					ОбластьШапка.Рисунки.ЛоготипЛевыйЗабор.Картинка = ЛеваяКартинка;	
				КонецЕсли;
				
				//ОбластьШапка.Рисунки.ЛоготипПравыйЗабор.Картинка = Логотипы.Правый.Получить();
				ПраваяКартинка = Логотипы.Правый.Получить();
				Если ЗначениеЗаполнено(ПраваяКартинка) Тогда
					ОбластьШапка.Рисунки.ЛоготипПравыйЗабор.Картинка = ПраваяКартинка;	
				КонецЕсли;
			КонецЕсли;
			
	        Если Не ЗначениеЗаполнено(ОбластьШапка.Рисунки.ЛоготипЛевыйЗабор.Картинка) Тогда
	            ОбластьШапка.Рисунки.ЛоготипЛевыйЗабор.ВыводитьНаПечать = Ложь;
	            ОбластьШапка.Параметры.Назв = ВыборкаНомерТоварногоЧека.Контрагент;
	        КонецЕСли;	
	        
	        Если Не ЗначениеЗаполнено(ОбластьШапка.Рисунки.ЛоготипПравыйЗабор.Картинка) Тогда
	            ОбластьШапка.Рисунки.ЛоготипПравыйЗабор.ВыводитьНаПечать = Ложь;
	            ОбластьШапка.Параметры.Телефон = ВыборкаНомерТоварногоЧека.ТелефонИнтернетМагазина;
	        КонецЕСли;
		КонецЕсли;
	
		
        
        //+++++Серегин М.В. 20.01.2016 17:49:13 даже тут без костылей никак
        Если ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_248") Или ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_601") Или ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_752") Тогда
            ОбластьШапка.Параметры.Назв = "YD";
        КонецЕсли;
        //-----Серегин М.В. 20.01.2016 17:49:27
		
		//ОбластьШапка.Рисунки.ШК_Забор.Текст = lem.глСформироватьБарКодEAN13("37" + Формат((Число(ВыборкаНомерТоварногоЧека.Номер)), "ЧЦ=10; ЧВН=; ЧГ=") + "0");
		Если Реж = 1 Тогда
			Если БланкАкси Тогда
				//-> Дробница Р. 01.08.2018	
				попытка
					ОбластьШапка.Параметры.ШтрихкодЗаборАкси = may.ПолучитьШКCode_39(СокрЛП(ВыборкаНомерТоварногоЧека.Номер));				
					//	ОбластьШапка.Рисунки.ШтрихкодЗаборАкси.Объект.barcode = "37" + Формат((Число(ВыборкаНомерТоварногоЧека.Номер)), "ЧЦ=10; ЧВН=; ЧГ=");
				исключение
				конецПопытки;
			Иначе
				попытка
					ОбластьШапка.Параметры.ШтрихкодЗабор = may.ПолучитьШКCode_39(СокрЛП(ВыборкаНомерТоварногоЧека.Номер));
					//	ОбластьШапка.Рисунки.ШтрихкодЗабор.Объект.barcode = "37" + Формат((Число(ВыборкаНомерТоварногоЧека.Номер)), "ЧЦ=10; ЧВН=; ЧГ=");	
				исключение
				конецПопытки;
				//<- Дробница Р. 01.08.2018	
			КонецЕсли;
		Иначе
			ОбластьШапка.Рисунки.ШК_Забор.Текст = lem.глСформироватьБарКодEAN13("37" + Формат((Число(ВыборкаНомерТоварногоЧека.Номер)), "ЧЦ=10; ЧВН=; ЧГ=") + "0");
		КонецеСли;	
        Для каждого Стр Из ВыборкаНомерТоварногоЧека.Доставка.АПП Цикл
            Если ЗначениеЗаполнено(ОбластьШапка.Параметры.Комментарий) И Стр.НомерСтроки = 1 Тогда
                ОбластьШапка.Параметры.Комментарий = ОбластьШапка.Параметры.Комментарий + Символы.ПС+"На складе необходимо забрать возвратные заказы ";
            ИначеЕсли Стр.НомерСтроки = 1 Тогда
                ОбластьШапка.Параметры.Комментарий = ОбластьШапка.Параметры.Комментарий + "На складе необходимо забрать возвратные заказы ";
            КонецЕсли;
             ОбластьШапка.Параметры.Комментарий =  ОбластьШапка.Параметры.Комментарий+"по АПП №"+Стр.НомерАПП+"; ";
		 КонецЦикла;
		 
		 // МАС - 25.12.2017 - № --->> 
		 Попытка			 
			 ОбъемЗ = ВыборкаНомерТоварногоЧека.Доставка.ОбъемЗабора;
			 ОбластьШапка.Параметры.Объем = ОбъемЗ;
			 Если ОбъемЗ = 0 Тогда		
				ОбластьШапка.Параметры.Брэйк = "-";
			 Иначе	
			 	ОбластьШапка.Параметры.Брэйк = ПолучитьБрейкСогласноОбъемуПартнера(ВыборкаНомерТоварногоЧека.Доставка, ОбъемЗ);		 
			 КонецЕсли;	 
		 Исключение		 
		 КонецПопытки;	 
		 // <<--- МАС 	 
                       
        ТабличныйДокумент.Вывести(ОбластьШапка);   
		МассивОбластей.Добавить(ОбластьШапка);
        #КонецОбласти 
		
		
		
        #Область Строки
		Если БланкАкси Тогда
			ОбластьИтоги = Макет.ПолучитьОбласть("ВозвратныеЗаказыАксиШапка");
		КонецЕсли;
		
		
		Если БланкАкси Тогда   //Аксиомус			
			ЗапросТЧВозвраты = Новый Запрос("ВЫБРАТЬ
		                                |	ЗаборТовараВозвраты.Ссылка,
		                                |	ЗаборТовараВозвраты.НомерСтроки,
		                                |	ЗаборТовараВозвраты.НомерЗаказа,
		                                |	ЗаборТовараВозвраты.КоличествоМест
		                                |ИЗ
		                                |	Документ.ЗаборТовара.Возвраты КАК ЗаборТовараВозвраты
		                                |ГДЕ
		                                |	ЗаборТовараВозвраты.Ссылка = &Ссылка");
			ЗапросТЧВозвраты.УстановитьПараметр("Ссылка", ВыборкаНомерТоварногоЧека.Доставка.Ссылка);
			Выборка = ЗапросТЧВозвраты.Выполнить();
			Если НЕ Выборка.Пустой() Тогда
				ОбластьВозвратныеЗаказыАксиШапка = Макет.ПолучитьОбласть("ВозвратныеЗаказыАксиШапка");
				ТабличныйДокумент.Вывести(ОбластьВозвратныеЗаказыАксиШапка);	
				МассивОбластей.Добавить(ОбластьВозвратныеЗаказыАксиШапка);
			КонецЕсли;
			
			Рез = Выборка.Выбрать();
			НомерСтроки = 0; КоличествоМестАкси = 0;
			
			Пока Рез.Следующий() Цикл				
				ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаЗаборАкси");	
				НомерСтроки = НомерСтроки + 1;
				КоличествоМестАкси = КоличествоМестАкси + Рез.КоличествоМест;
	            ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
				ОбластьСтрока.Параметры.НомерЗаказа	= Рез.НомерЗаказа;
				ОбластьСтрока.Параметры.КоличествоМест	= Рез.КоличествоМест;
	            ТабличныйДокумент.Вывести(ОбластьСтрока);
				МассивОбластей.Добавить(ОбластьСтрока);
			КонецЦикла;			
		Иначе 
			
			ВыборкаДетальныеЗаписи = ВыборкаНомерТоварногоЧека.Выбрать();
	        НомерСтроки = 0;  
			
	        Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	            Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Номенклатура) Тогда	            		   
				    ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаЗабор");     
		            НомерСтроки = НомерСтроки + 1;
		            ОбластьСтрока.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		            ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
					//+++ БАО 10.10.2017 №
					//---ОбластьСтрока.Параметры.ID_Код = СокрЛП(ВыборкаДетальныеЗаписи.НоменклатураКод)+"/"+ВыборкаДетальныеЗаписи.НоменклатураАртикул;
					ОбластьСтрока.Параметры.ID_Код = ВыборкаДетальныеЗаписи.НоменклатураАртикул;
					//--- БАО 10.10.2017 №

					
		            ТабличныйДокумент.Вывести(ОбластьСтрока);
					МассивОбластей.Добавить(ОбластьСтрока);
	            КонецЕсли;
			КонецЦикла;			
		КонецЕсли;											       
        #КонецОбласти 
		
        
        #Область Итоги
		Если БланкАкси Тогда   //Аксиомус
			Если КоличествоМестАкси > 0 Тогда		
				ОбластьИтоги = Макет.ПолучитьОбласть("ИтогиЗаборАкси");
				ОбластьИтоги.Параметры.КоличествоМестАкси = КоличествоМестАкси;	
				ОбластьИтоги.Параметры.Заполнить(ВыборкаНомерТоварногоЧека);
        		ТабличныйДокумент.Вывести(ОбластьИтоги);
				МассивОбластей.Добавить(ОбластьИтоги);
			КонецЕсли;
        Иначе    
	        ОбластьИтоги = Макет.ПолучитьОбласть("ИтогиЗабор");
			ОбластьИтоги.Параметры.Заполнить(ВыборкаНомерТоварногоЧека);
        	ТабличныйДокумент.Вывести(ОбластьИтоги);
			МассивОбластей.Добавить(ОбластьИтоги);
		КонецЕсли;  
        #КонецОбласти
        
        #Область Подвал
        Если ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_438") Тогда   //Аксиомус
	        ОбластьПодвалПодпись = Макет.ПолучитьОбласть("ПодвалПодписьЗаборAxiomus");
	        ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифыЗаборAxiomus");
        Иначе    
	        ОбластьПодвалПодпись = Макет.ПолучитьОбласть("ПодвалПодписьЗабор");
	        ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифыЗабор");
    	КонецЕсли;
    
        ТабличныйДокумент.Вывести(ОбластьПодвалПодпись);
		МассивОбластей.Добавить(ОбластьПодвалПодпись);
        ОбластьПодвалТарифы.Параметры.ДатаВремяПечати = ТекущаяДата();
        ТабличныйДокумент.Вывести(ОбластьПодвалТарифы);
		МассивОбластей.Добавить(ОбластьПодвалТарифы);
        #КонецОбласти 
		
		//Если НЕ ТабличныйДокумент.ПроверитьВывод(МассивОбластей) Тогда		
		//	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();	
		//	МассивОбластей = Новый Массив;
		//КонецЕсли;
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
        Возврат ТабличныйДокумент;
    
КонецФункции

Функция ВыводОтрывнойЧастиНаСледующейСтранице(ВыборкаНомерТоварногоЧека,ТабличныйДокумент,ОбластьШапкаОтрыв,Макет,ОбластьИтогиОтрыв,ОбластьПодвалПодписьОтрыв,ОбластьКредитОтрыв)
	
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
    //Выводим отрывную часть
    ТабличныйДокумент.Вывести(ОбластьШапкаОтрыв);
    //Строка
    ВыборкаДетальныеЗаписи2 = ВыборкаНомерТоварногоЧека.Выбрать();
    НомерСтроки = 0;
    Пока ВыборкаДетальныеЗаписи2.Следующий() Цикл
        ОбластьСтрокаОтрыв = Макет.ПолучитьОбласть("СтрокаОтрыв");
        НомерСтроки = НомерСтроки+1;
        ОбластьСтрокаОтрыв.Параметры.Заполнить(ВыборкаДетальныеЗаписи2);
        ОбластьСтрокаОтрыв.Параметры.НомерСтроки = НомерСтроки;
    
		//+++ БАО 10.10.2017 №
		//---   ОбластьСтрокаОтрыв.Параметры.ID_Код = СокрЛП(ВыборкаДетальныеЗаписи2.НоменклатураКод)+"/"+ВыборкаДетальныеЗаписи2.НоменклатураАртикул;
		ОбластьСтрокаОтрыв.Параметры.ID_Код = ВыборкаДетальныеЗаписи2.НоменклатураАртикул;
		//--- БАО 10.10.2017 №

        ТабличныйДокумент.Вывести(ОбластьСтрокаОтрыв);
    КонецЦикла;
    
    ТабличныйДокумент.Вывести(ОбластьИтогиОтрыв);
    
    Если ОбластьКредитОтрыв<>Неопределено Тогда
        ТабличныйДокумент.Вывести(ОбластьКредитОтрыв);
    КонецЕсли;
    
    ОбластьПодвалПодписьОтрыв.Параметры.ДатаВремяПечати = ТекущаяДата();
    ТабличныйДокумент.Вывести(ОбластьПодвалПодписьОтрыв);
    
    //Следующая страница
    ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
    Возврат ТабличныйДокумент;
КонецФункции // ВыводОтрывнойЧастиНаСледующейСтранице()

Функция ВыводОтрывнойЧастиВнизу(МассивОбластей,ВыборкаНомерТоварногоЧека,ТабличныйДокумент,ОбластьШапкаОтрыв,Макет,ОбластьИтогиОтрыв,ОбластьПодвалПодписьОтрыв,Пропуск,ОбластьКредитОтрыв)
    
    Пока ТабличныйДокумент.ПроверитьВывод(МассивОбластей) Цикл   
        ТабличныйДокумент.Вывести(Пропуск);    
    КонецЦикла; 
    
    //Выводим отрывную часть
	ТабличныйДокумент.Вывести(ОбластьШапкаОтрыв);
    //Строка
    ВыборкаДетальныеЗаписи2 = ВыборкаНомерТоварногоЧека.Выбрать();
    НомерСтроки = 0;
    Пока ВыборкаДетальныеЗаписи2.Следующий() Цикл
        ОбластьСтрокаОтрыв = Макет.ПолучитьОбласть("СтрокаОтрыв");
        НомерСтроки = НомерСтроки+1;
        ОбластьСтрокаОтрыв.Параметры.Заполнить(ВыборкаДетальныеЗаписи2);
        ОбластьСтрокаОтрыв.Параметры.НомерСтроки = НомерСтроки;
        
		//+++ БАО 10.10.2017 №
		//---ОбластьСтрокаОтрыв.Параметры.ID_Код = СокрЛП(ВыборкаДетальныеЗаписи2.НоменклатураКод)+"/"+ВыборкаДетальныеЗаписи2.НоменклатураАртикул;
		ОбластьСтрокаОтрыв.Параметры.ID_Код = ВыборкаДетальныеЗаписи2.НоменклатураАртикул;
		//--- БАО 10.10.2017 №
        ТабличныйДокумент.Вывести(ОбластьСтрокаОтрыв);
    КонецЦикла;
    
    ТабличныйДокумент.Вывести(ОбластьИтогиОтрыв);
    Если ОбластьКредитОтрыв <> Неопределено Тогда
        ТабличныйДокумент.Вывести(ОбластьКредитОтрыв);
    КонецЕсли;
    
    ОбластьПодвалПодписьОтрыв.Параметры.ДатаВремяПечати = ТекущаяДата();
    ТабличныйДокумент.Вывести(ОбластьПодвалПодписьОтрыв);
    
    //Следующая страница
    ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
    Возврат ТабличныйДокумент;
КонецФункции // ВыводОтрывнойЧастиНаСледующейСтранице()

Функция ТекстЗапросаПоРейсам()
		//Возврат "ВЫБРАТЬ
		//        |	новаМестнаяДоставка.Ссылка КАК Доставка,
		//        |	РейсЗаказы.Заказ КАК Заказ,
		//        |	МАКСИМУМ(ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)) КАК ТипЗаказа
		//        |ПОМЕСТИТЬ ВТ_Доставки
		//        |ИЗ
		//        |	Документ.Рейс.Заказы КАК РейсЗаказы
		//        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БизнесПроцесс.новаМестнаяДоставка КАК новаМестнаяДоставка
		//        |		ПО (ВЫРАЗИТЬ(РейсЗаказы.Заказ КАК Документ.РеализацияТоваровУслуг).Номер = новаМестнаяДоставка.Номер)
		//        |ГДЕ
		//        |	РейсЗаказы.Ссылка = &Рейс
		//        |	И НЕ РейсЗаказы.УдаленИзРейса
		//        |
		//        |СГРУППИРОВАТЬ ПО
		//        |	новаМестнаяДоставка.Ссылка,
		//        |	РейсЗаказы.Заказ
		//        |
		//        |ОБЪЕДИНИТЬ ВСЕ
		//        |
		//        |ВЫБРАТЬ
		//        |	РейсЗаказы.Заказ,
		//        |	РейсЗаказы.Заказ,
		//        |	МАКСИМУМ(ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор))
		//        |ИЗ
		//        |	Документ.Рейс.Заказы КАК РейсЗаказы
		//        |ГДЕ
		//        |	РейсЗаказы.Ссылка = &Рейс
		//        |	И РейсЗаказы.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаборТовара.ПустаяСсылка)
		//        |	И РейсЗаказы.Заказ ССЫЛКА Документ.ЗаборТовара
		//        |	И НЕ РейсЗаказы.УдаленИзРейса
		//        |
		//        |СГРУППИРОВАТЬ ПО
		//        |	РейсЗаказы.Заказ,
		//        |	РейсЗаказы.Заказ
		//        |;
		//        |
		//        |////////////////////////////////////////////////////////////////////////////////
		//        |ВЫБРАТЬ
		//        |	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
		//        |	РеализацияТоваровУслугТовары.Номенклатура.Код КАК НоменклатураКод,
		//        |	РеализацияТоваровУслугТовары.Номенклатура.Артикул КАК НоменклатураАртикул,
		//        |	РеализацияТоваровУслугТовары.Количество КАК Количество,
		//        |	РеализацияТоваровУслугТовары.Цена КАК Цена,
		//        |	РеализацияТоваровУслугТовары.Сумма КАК Сумма,
		//        |	РеализацияТоваровУслугТовары.Вес * РеализацияТоваровУслугТовары.Количество КАК Вес,
		//        |	ВТ_Доставки.Доставка КАК Доставка,
		//        |	РеализацияТоваровУслугТовары.НомерСтроки КАК НомерСтроки,
		//        |	ВТ_Доставки.ТипЗаказа КАК ТипЗаказа,
		//        |	РеализацияТоваровУслугТовары.ШтрихкодНоменклатуры КАК ШК
		//        |ПОМЕСТИТЬ ВТ_Товары
		//        |ИЗ
		//        |	ВТ_Доставки КАК ВТ_Доставки
		//        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		//        |		ПО (ВЫРАЗИТЬ(ВТ_Доставки.Доставка КАК БизнесПроцесс.новаМестнаяДоставка).Номер = РеализацияТоваровУслугТовары.Ссылка.Номер)
		//        |
		//        |ОБЪЕДИНИТЬ ВСЕ
		//        |
		//        |ВЫБРАТЬ
		//        |	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура,
		//        |	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура.Код,
		//        |	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура.Артикул,
		//        |	РеализацияТоваровУслугПодарочныеПозиции.Количество,
		//        |	РеализацияТоваровУслугПодарочныеПозиции.Цена,
		//        |	РеализацияТоваровУслугПодарочныеПозиции.Сумма,
		//        |	РеализацияТоваровУслугПодарочныеПозиции.Вес * РеализацияТоваровУслугПодарочныеПозиции.Количество,
		//        |	ВТ_Доставки.Доставка,
		//        |	РеализацияТоваровУслугПодарочныеПозиции.НомерСтроки,
		//        |	ВТ_Доставки.ТипЗаказа,
		//        |	РеализацияТоваровУслугПодарочныеПозиции.ШтрихкодНоменклатуры
		//        |ИЗ
		//        |	ВТ_Доставки КАК ВТ_Доставки
		//        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.ПодарочныеПозиции КАК РеализацияТоваровУслугПодарочныеПозиции
		//        |		ПО (ВЫРАЗИТЬ(ВТ_Доставки.Доставка КАК БизнесПроцесс.новаМестнаяДоставка).Номер = РеализацияТоваровУслугПодарочныеПозиции.Ссылка.Номер)
		//        |
		//        |ОБЪЕДИНИТЬ ВСЕ
		//        |
		//        |ВЫБРАТЬ
		//        |	ВозвратТоваровОтПокупателяТовары.Номенклатура,
		//        |	ВозвратТоваровОтПокупателяТовары.Номенклатура.Код,
		//        |	ВозвратТоваровОтПокупателяТовары.Номенклатура.Артикул,
		//        |	-ВозвратТоваровОтПокупателяТовары.Количество,
		//        |	ВозвратТоваровОтПокупателяТовары.Цена,
		//        |	-ВозвратТоваровОтПокупателяТовары.Сумма,
		//        |	NULL,
		//        |	ВТ_Доставки.Доставка,
		//        |	ВозвратТоваровОтПокупателяТовары.НомерСтроки,
		//        |	ВТ_Доставки.ТипЗаказа,
		//        |	ВозвратТоваровОтПокупателяТовары.ШтрихкодНоменклатуры
		//        |ИЗ
		//        |	ВТ_Доставки КАК ВТ_Доставки
		//        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
		//        |		ПО (ВЫРАЗИТЬ(ВТ_Доставки.Доставка КАК БизнесПроцесс.новаМестнаяДоставка).Номер = ВозвратТоваровОтПокупателяТовары.Ссылка.Номер)
		//        |
		//        |ОБЪЕДИНИТЬ ВСЕ
		//        |
		//        |ВЫБРАТЬ
		//        |	""Доставка"",
		//        |	NULL,
		//        |	NULL,
		//        |	МАКСИМУМ(1),
		//        |	NULL,
		//        |	МАКСИМУМ(ВТ_Доставки.Доставка.СтоимостьДоставкиДоМКАД),
		//        |	NULL,
		//        |	ВТ_Доставки.Доставка,
		//        |	998,
		//        |	МАКСИМУМ(ВТ_Доставки.ТипЗаказа),
		//        |	NULL
		//        |ИЗ
		//        |	ВТ_Доставки КАК ВТ_Доставки
		//        |ГДЕ
		//        |	ВТ_Доставки.Доставка.СтоимостьДоставкиДоМКАД <> 0
		//        |	И ВТ_Доставки.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
		//        |
		//        |СГРУППИРОВАТЬ ПО
		//        |	ВТ_Доставки.Доставка
		//        |
		//        |ОБЪЕДИНИТЬ ВСЕ
		//        |
		//        |ВЫБРАТЬ
		//        |	""Доставка"",
		//        |	NULL,
		//        |	NULL,
		//        |	МАКСИМУМ(1),
		//        |	NULL,
		//        |	МАКСИМУМ(ВТ_Доставки.Доставка.СтоимостьДоставкиЗаМКАД),
		//        |	NULL,
		//        |	ВТ_Доставки.Доставка,
		//        |	999,
		//        |	МАКСИМУМ(ВТ_Доставки.ТипЗаказа),
		//        |	NULL
		//        |ИЗ
		//        |	ВТ_Доставки КАК ВТ_Доставки
		//        |ГДЕ
		//        |	ВТ_Доставки.Доставка.СтоимостьДоставкиЗаМКАД <> 0
		//        |	И ВТ_Доставки.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
		//        |
		//        |СГРУППИРОВАТЬ ПО
		//        |	ВТ_Доставки.Доставка
		//        |
		//        |ОБЪЕДИНИТЬ ВСЕ
		//        |
		//        |ВЫБРАТЬ
		//        |	ЗаборТовараТовары.Номенклатура,
		//        |	ЗаборТовараТовары.Номенклатура.Код,
		//        |	ЗаборТовараТовары.Номенклатура.Артикул,
		//        |	СУММА(ЗаборТовараТовары.Количество),
		//        |	МАКСИМУМ(ЗаборТовараТовары.Цена),
		//        |	СУММА(ЗаборТовараТовары.Сумма),
		//        |	СУММА(ЗаборТовараТовары.Вес * ЗаборТовараТовары.Количество),
		//        |	ВТ_Доставки.Доставка,
		//        |	ЗаборТовараТовары.НомерСтроки,
		//        |	ВТ_Доставки.ТипЗаказа,
		//        |	NULL
		//        |ИЗ
		//        |	ВТ_Доставки КАК ВТ_Доставки
		//        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаборТовара КАК ЗаборТовара
		//        |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаборТовара.Товары КАК ЗаборТовараТовары
		//        |			ПО ЗаборТовара.Ссылка = ЗаборТовараТовары.Ссылка
		//        |		ПО (ВЫРАЗИТЬ(ВТ_Доставки.Доставка КАК Документ.ЗаборТовара).Номер = ЗаборТовара.Номер)
		//        |
		//        |СГРУППИРОВАТЬ ПО
		//        |	ЗаборТовараТовары.Номенклатура,
		//        |	ЗаборТовараТовары.Номенклатура.Код,
		//        |	ЗаборТовараТовары.Номенклатура.Артикул,
		//        |	ВТ_Доставки.Доставка,
		//        |	ЗаборТовараТовары.НомерСтроки,
		//        |	ВТ_Доставки.ТипЗаказа
		//        |;
		//        |
		//        |////////////////////////////////////////////////////////////////////////////////
		//        |ВЫБРАТЬ
		//        |	ВТ_Товары.Номенклатура КАК Номенклатура,
		//        |	ВТ_Товары.НоменклатураКод КАК НоменклатураКод,
		//        |	ВТ_Товары.НоменклатураАртикул КАК НоменклатураАртикул,
		//        |	ВТ_Товары.Количество КАК Количество,
		//        |	ВТ_Товары.Цена КАК Цена,
		//        |	ВТ_Товары.Сумма КАК Сумма,
		//        |	ВТ_Товары.Вес КАК Вес,
		//        |	ВТ_Товары.Доставка.Номер КАК Номер,
		//        |	ВТ_Товары.Доставка.Адрес КАК АдресДоставки,
		//        |	ВТ_Товары.Доставка.Телефон КАК ТелефонПокупателя,
		//        |	РеализацияТоваровУслуг.ВладелецТовара КАК Контрагент,
		//        |	ВЫРАЗИТЬ(ВТ_Товары.Доставка.КомментарийКАдресуДоставки КАК СТРОКА(500)) КАК КоммАдрес,
		//        |	ВЫРАЗИТЬ(ВТ_Товары.Доставка.Комментарий КАК СТРОКА(1000)) КАК Комментарий,
		//        |	ВТ_Товары.Доставка.Дата КАК ДатаДоставки,
		//        |	ВТ_Товары.Доставка.ВремяПрибытияС КАК ВремяПрибытияС,
		//        |	ВТ_Товары.Доставка.ВремяПрибытияПо КАК ВремяПрибытияПо,
		//        |	ТипыОплат.Наименование КАК ТипОплаты,
		//        |	ДокументРейс.НомерПалетты КАК НомерЛог,
		//        |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
		//        |	РеализацияТоваровУслуг.ВладелецТовара.ТелефонИнтернетМагазина КАК ТелефонИнтернетМагазина,
		//        |	ВЫБОР
		//        |		КОГДА РеализацияТоваровУслуг.ТарифнаяСетка.Код = 2
		//        |			ТОГДА ""СРОЧНАЯ ДОСТАВКА""
		//        |		ИНАЧЕ """"
		//        |	КОНЕЦ КАК СрочнаяДоставка,
		//        |	ВЫБОР
		//        |		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа ЕСТЬ NULL
		//        |			ТОГДА """"
		//        |		ИНАЧЕ ВЫБОР
		//        |				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа
		//        |					ТОГДА ""запрещен""
		//        |				ИНАЧЕ """"
		//        |			КОНЕЦ
		//        |	КОНЕЦ КАК ЗапретЧастичногоВыкупаСтарый,
		//        |	ВЫБОР
		//        |		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретСменыОплаты ЕСТЬ NULL
		//        |			ТОГДА """"
		//        |		ИНАЧЕ ВЫБОР
		//        |				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретСменыОплаты
		//        |					ТОГДА ""запрещена""
		//        |				ИНАЧЕ """"
		//        |			КОНЕЦ
		//        |	КОНЕЦ КАК ЗапретСменыОплаты,
		//        |	ВЫБОР
		//        |		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа ЕСТЬ NULL
		//        |			ТОГДА """"
		//        |		ИНАЧЕ ВЫБОР
		//        |				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа
		//        |					ТОГДА ""Частичный выкуп""
		//        |				ИНАЧЕ """"
		//        |			КОНЕЦ
		//        |	КОНЕЦ КАК ЧастичныйВыкупСтарый,
		//        |	РеализацияТоваровУслуг.Контрагент КАК Покупатель,
		//        |	ВТ_Товары.НомерСтроки КАК НомерСтроки,
		//        |	ВТ_Товары.Доставка КАК Доставка,
		//        |	РеализацияТоваровУслуг.ИнтернетМагазинЯндекса КАК ИнтернетМагазинЯндекса,
		//        |	ТипыОплат.Ссылка КАК ТипОплатыСсылка,
		//        |	РеализацияТоваровУслуг.ВладелецТовара.Приоритет КАК ВладелецТовараПриоритет,
		//        |	РеализацияТоваровУслуг.ПредоплатаПоКредиту КАК ПредоплатаПоКредиту,
		//        |	ВЫБОР
		//        |		КОГДА РеализацияТоваровУслуг.ЗапретЧастичногоВыкупа
		//        |			ТОГДА ""запрещен""
		//        |		ИНАЧЕ """"
		//        |	КОНЕЦ КАК ЗапретЧастичногоВыкупа,
		//        |	ВЫБОР
		//        |		КОГДА РеализацияТоваровУслуг.ЗапретЧастичногоВыкупа
		//        |			ТОГДА ""Частичный выкуп""
		//        |		ИНАЧЕ """"
		//        |	КОНЕЦ КАК ЧастичныйВыкуп,
		//        |	КатегорииДоставки2014.Родитель КАК КатегорияДоставки,
		//        |	ПараметрыКонтрагентовСрезПоследних.МетодОплатыПодъёма КАК МетодОплатыПодъёма,
		//        |	ВЫБОР
		//        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.СОжиданием, ЛОЖЬ)
		//        |			ТОГДА ""С вскрытием""
		//        |		ИНАЧЕ ""Без вскрытия""
		//        |	КОНЕЦ КАК СОжиданием,
		//        |	ВТ_Товары.ТипЗаказа КАК ТипЗаказа,
		//        |	NULL КАК ДатаЗабора,
		//        |	NULL КАК МенеджерЗабора,
		//        |	ДополнительныеПараметрыЗаказа.КОплатеКлиентом КАК КОплатеКлиентом,
		//        |	РеализацияТоваровУслуг.УчитыватьИтогоКОплате КАК УчитыватьИтогоКОплате,
		//        |	ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ПодъемОплачен, ЛОЖЬ) КАК ПодъемОплачен,
		//        |	ДополнительныеПараметрыЗаказа.КатегорияДляРасчетаЗП КАК КатегорияДляРасчетаЗП,
		//        |	ДополнительныеПараметрыЗаказа.ДополнительныйНомерЗаказа КАК ДополнительныйНомерЗаказа,
		//        |	ВТ_Товары.ШК КАК ШК
		//        |ПОМЕСТИТЬ ВТ_Объединение
		//        |ИЗ
		//        |	ВТ_Товары КАК ВТ_Товары
		//        |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		//        |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыОплат КАК ТипыОплат
		//        |			ПО РеализацияТоваровУслуг.ТипОплаты = ТипыОплат.Код
		//        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыКонтрагентов.СрезПоследних КАК ПараметрыКонтрагентовСрезПоследних
		//        |			ПО РеализацияТоваровУслуг.ВладелецТовара = ПараметрыКонтрагентовСрезПоследних.Контрагент
		//        |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КатегорииДоставки2014 КАК КатегорииДоставки2014
		//        |			ПО РеализацияТоваровУслуг.КатегорияДоставки = КатегорииДоставки2014.Категория
		//        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
		//        |			ПО РеализацияТоваровУслуг.Ссылка = ДополнительныеПараметрыЗаказа.Заказ
		//        |		ПО ВТ_Товары.Доставка.Номер = РеализацияТоваровУслуг.Номер
		//        |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Рейс КАК ДокументРейс
		//        |		ПО (ДокументРейс.Ссылка = &Рейс)
		//        |ГДЕ
		//        |	ВТ_Товары.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
		//        |
		//        |ОБЪЕДИНИТЬ ВСЕ
		//        |
		//        |ВЫБРАТЬ
		//        |	ВТ_Товары.Номенклатура,
		//        |	ВТ_Товары.НоменклатураКод,
		//        |	ВТ_Товары.НоменклатураАртикул,
		//        |	ВТ_Товары.Количество,
		//        |	ВТ_Товары.Цена,
		//        |	ВТ_Товары.Сумма,
		//        |	ВТ_Товары.Вес,
		//        |	ВТ_Товары.Доставка.Номер,
		//        |	ВТ_Товары.Доставка.АдресДоставки,
		//        |	ВТ_Товары.Доставка.Телефон,
		//        |	ВТ_Товары.Доставка.Контрагент,
		//        |	NULL,
		//        |	ВТ_Товары.Доставка.Комментарий,
		//        |	ВТ_Товары.Доставка.ДатаДоставки,
		//        |	ВТ_Товары.Доставка.ВремяДоставкиС,
		//        |	ВТ_Товары.Доставка.ВремяДоставкиПо,
		//        |	ТипыОплат.Наименование,
		//        |	ДокументРейс.НомерПалетты,
		//        |	ВТ_Товары.Доставка.НомерВнешнегоЗаказа,
		//        |	ВТ_Товары.Доставка.Контрагент.ТелефонИнтернетМагазина,
		//        |	NULL,
		//        |	NULL,
		//        |	NULL,
		//        |	NULL,
		//        |	ВТ_Товары.Доставка.Грузополучатель,
		//        |	ВТ_Товары.НомерСтроки,
		//        |	ВТ_Товары.Доставка,
		//        |	ВТ_Товары.Доставка.Контрагент,
		//        |	ТипыОплат.Ссылка,
		//        |	ВТ_Товары.Доставка.Контрагент.Приоритет,
		//        |	NULL,
		//        |	NULL,
		//        |	NULL,
		//        |	NULL,
		//        |	NULL,
		//        |	NULL,
		//        |	ВТ_Товары.ТипЗаказа,
		//        |	ВТ_Товары.Доставка.Дата,
		//        |	ВЫБОР
		//        |		КОГДА ВТ_Товары.Доставка.Автор = """"
		//        |			ТОГДА ""Не указан""
		//        |		ИНАЧЕ ВТ_Товары.Доставка.Автор
		//        |	КОНЕЦ,
		//        |	NULL,
		//        |	NULL,
		//        |	NULL,
		//        |	NULL,
		//        |	NULL,
		//        |	ВТ_Товары.ШК
		//        |ИЗ
		//        |	ВТ_Товары КАК ВТ_Товары
		//        |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Рейс КАК ДокументРейс
		//        |		ПО (ДокументРейс.РейсМестнойДоставки = &Рейс)
		//        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыОплат КАК ТипыОплат
		//        |		ПО ВТ_Товары.Доставка.ТипОплаты = ТипыОплат.Код
		//        |ГДЕ
		//        |	ВТ_Товары.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор)
		//        |;
		//        |
		//        |////////////////////////////////////////////////////////////////////////////////
		//        |ВЫБРАТЬ
		//        |	ВТ_Объединение.Номенклатура КАК Номенклатура,
		//        |	ВТ_Объединение.НоменклатураКод КАК НоменклатураКод,
		//        |	ВТ_Объединение.НоменклатураАртикул КАК НоменклатураАртикул,
		//        |	ВТ_Объединение.Количество КАК Количество,
		//        |	ВТ_Объединение.Цена КАК Цена,
		//        |	ВТ_Объединение.Сумма КАК Сумма,
		//        |	ВТ_Объединение.Вес КАК Вес,
		//        |	ВТ_Объединение.Номер КАК Номер,
		//        |	ВТ_Объединение.АдресДоставки КАК АдресДоставки,
		//        |	ВТ_Объединение.ТелефонПокупателя КАК ТелефонПокупателя,
		//        |	ВТ_Объединение.Контрагент КАК Контрагент,
		//        |	ВТ_Объединение.КоммАдрес КАК КоммАдрес,
		//        |	ВТ_Объединение.Комментарий КАК Комментарий,
		//        |	ВТ_Объединение.ДатаДоставки КАК ДатаДоставки,
		//        |	ВТ_Объединение.ВремяПрибытияС КАК ВремяПрибытияС,
		//        |	ВТ_Объединение.ВремяПрибытияПо КАК ВремяПрибытияПо,
		//        |	ВТ_Объединение.ТипОплаты КАК ТипОплаты,
		//        |	ВТ_Объединение.НомерЛог КАК НомерЛог,
		//        |	ВТ_Объединение.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
		//        |	ВТ_Объединение.ТелефонИнтернетМагазина КАК ТелефонИнтернетМагазина,
		//        |	ВТ_Объединение.СрочнаяДоставка КАК СрочнаяДоставка,
		//        |	ВТ_Объединение.ЗапретЧастичногоВыкупаСтарый КАК ЗапретЧастичногоВыкупаСтарый,
		//        |	ВТ_Объединение.ЗапретСменыОплаты КАК ЗапретСменыОплаты,
		//        |	ВТ_Объединение.ЧастичныйВыкупСтарый КАК ЧастичныйВыкупСтарый,
		//        |	ВТ_Объединение.Покупатель КАК Покупатель,
		//        |	ВТ_Объединение.НомерСтроки КАК НомерСтроки,
		//        |	ВТ_Объединение.Доставка КАК Доставка,
		//        |	ВТ_Объединение.ИнтернетМагазинЯндекса КАК ИнтернетМагазинЯндекса,
		//        |	ВТ_Объединение.ТипОплатыСсылка КАК ТипОплатыСсылка,
		//        |	ВТ_Объединение.ВладелецТовараПриоритет КАК ВладелецТовараПриоритет,
		//        |	ВТ_Объединение.ПредоплатаПоКредиту КАК ПредоплатаПоКредиту,
		//        |	ВТ_Объединение.ЗапретЧастичногоВыкупа КАК ЗапретЧастичногоВыкупа,
		//        |	ВТ_Объединение.ЧастичныйВыкуп КАК ЧастичныйВыкуп,
		//        |	ВТ_Объединение.КатегорияДоставки КАК КатегорияДоставки,
		//        |	ВТ_Объединение.МетодОплатыПодъёма КАК МетодОплатыПодъёма,
		//        |	ВТ_Объединение.СОжиданием КАК СОжиданием,
		//        |	ВТ_Объединение.ТипЗаказа КАК ТипЗаказа,
		//        |	ВТ_Объединение.ДатаЗабора КАК ДатаЗабора,
		//        |	ВТ_Объединение.МенеджерЗабора КАК МенеджерЗабора,
		//        |	ВТ_Объединение.КОплатеКлиентом КАК КОплатеКлиентом,
		//        |	ВТ_Объединение.УчитыватьИтогоКОплате КАК УчитыватьИтогоКОплате,
		//        |	ВТ_Объединение.ПодъемОплачен КАК ПодъемОплачен,
		//        |	ВЫБОР
		//        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ШтрихкодOZON, """") <> """"
		//        |			ТОГДА ИСТИНА
		//        |		ИНАЧЕ ЛОЖЬ
		//        |	КОНЕЦ КАК Озон,
		//        |	ВТ_Объединение.КатегорияДляРасчетаЗП КАК КатегорияДляРасчетаЗП,
		//        |	ВТ_Объединение.ДополнительныйНомерЗаказа КАК ДополнительныйНомерЗаказа,
		//        |	ДополнительныеПараметрыЗаказа.Заказ КАК Заказ,
		//        |	ВТ_Объединение.ШК КАК ШК,
		//        |	ЕСТЬNULL(ВТ_Объединение.Доставка.ОбъемЗабора, 0) КАК ОбъемЗабора
		//        |ИЗ
		//        |	ВТ_Объединение КАК ВТ_Объединение
		//        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
		//        |		ПО ВТ_Объединение.Доставка.Номер = ДополнительныеПараметрыЗаказа.Заказ.Номер
		//		|@СтрокаУсловия@
		//        |
		//        |УПОРЯДОЧИТЬ ПО
		//        |	ТипЗаказа,
		//        |	ВладелецТовараПриоритет,
		//        |	Номер,
		//        |	НомерСтроки,
		//        |	Номенклатура
		//        |ИТОГИ
		//        |	СУММА(Количество),
		//        |	СУММА(Сумма),
		//        |	СУММА(Вес),
		//        |	МАКСИМУМ(АдресДоставки),
		//        |	МАКСИМУМ(ТелефонПокупателя),
		//        |	МАКСИМУМ(Контрагент),
		//        |	МАКСИМУМ(КоммАдрес),
		//        |	МАКСИМУМ(Комментарий),
		//        |	МАКСИМУМ(ДатаДоставки),
		//        |	МАКСИМУМ(ВремяПрибытияС),
		//        |	МАКСИМУМ(ВремяПрибытияПо),
		//        |	МАКСИМУМ(ТипОплаты),
		//        |	МАКСИМУМ(НомерЛог),
		//        |	МАКСИМУМ(НомерВнешнегоЗаказа),
		//        |	МАКСИМУМ(ТелефонИнтернетМагазина),
		//        |	МАКСИМУМ(СрочнаяДоставка),
		//        |	МАКСИМУМ(ЗапретЧастичногоВыкупаСтарый),
		//        |	МАКСИМУМ(ЗапретСменыОплаты),
		//        |	МАКСИМУМ(ЧастичныйВыкупСтарый),
		//        |	МАКСИМУМ(Покупатель),
		//        |	МАКСИМУМ(Доставка),
		//        |	МАКСИМУМ(ИнтернетМагазинЯндекса),
		//        |	МАКСИМУМ(ТипОплатыСсылка),
		//        |	МАКСИМУМ(ВладелецТовараПриоритет),
		//        |	МАКСИМУМ(ПредоплатаПоКредиту),
		//        |	МАКСИМУМ(ЗапретЧастичногоВыкупа),
		//        |	МАКСИМУМ(ЧастичныйВыкуп),
		//        |	МАКСИМУМ(КатегорияДоставки),
		//        |	МАКСИМУМ(МетодОплатыПодъёма),
		//        |	МАКСИМУМ(СОжиданием),
		//        |	МАКСИМУМ(ДатаЗабора),
		//        |	МАКСИМУМ(МенеджерЗабора),
		//        |	МАКСИМУМ(КОплатеКлиентом),
		//        |	МАКСИМУМ(УчитыватьИтогоКОплате),
		//        |	МАКСИМУМ(ПодъемОплачен),
		//        |	МАКСИМУМ(Озон),
		//        |	МАКСИМУМ(КатегорияДляРасчетаЗП),
		//        |	МАКСИМУМ(ДополнительныйНомерЗаказа),
		//        |	МАКСИМУМ(Заказ)
		//        |ПО
		//        |	ТипЗаказа,
		//        |	Номер
		//        |АВТОУПОРЯДОЧИВАНИЕ";
		
		        // Якурнов 31.08.2018 11:27:47 Был этот запрос
				
				//Возврат "ВЫБРАТЬ
				//        |	новаМестнаяДоставка.Ссылка КАК Доставка,
				//        |	РейсЗаказы.Заказ КАК Заказ,
				//        |	МАКСИМУМ(ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)) КАК ТипЗаказа,
				//        |	РейсЗаказы.Ссылка.НомерПалетты КАК НомерПалетты
				//        |ПОМЕСТИТЬ ВТ_Доставки
				//        |ИЗ
				//        |	Документ.Рейс.Заказы КАК РейсЗаказы
				//        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БизнесПроцесс.новаМестнаяДоставка КАК новаМестнаяДоставка
				//        |		ПО (ВЫРАЗИТЬ(РейсЗаказы.Заказ КАК Документ.РеализацияТоваровУслуг).Номер = новаМестнаяДоставка.Номер)
				//        |ГДЕ
				//        |	РейсЗаказы.Ссылка = &Рейс
				//        |	И НЕ РейсЗаказы.УдаленИзРейса
				//        |
				//        |СГРУППИРОВАТЬ ПО
				//        |	новаМестнаяДоставка.Ссылка,
				//        |	РейсЗаказы.Заказ,
				//        |	РейсЗаказы.Ссылка.НомерПалетты
				//        |
				//        |ОБЪЕДИНИТЬ ВСЕ
				//        |
				//        |ВЫБРАТЬ
				//        |	РейсЗаказы.Заказ,
				//        |	РейсЗаказы.Заказ,
				//        |	МАКСИМУМ(ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор)),
				//        |	РейсЗаказы.Ссылка.НомерПалетты
				//        |ИЗ
				//        |	Документ.Рейс.Заказы КАК РейсЗаказы
				//        |ГДЕ
				//        |	РейсЗаказы.Ссылка = &Рейс
				//        |	И РейсЗаказы.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаборТовара.ПустаяСсылка)
				//        |	И РейсЗаказы.Заказ ССЫЛКА Документ.ЗаборТовара
				//        |	И НЕ РейсЗаказы.УдаленИзРейса
				//        |
				//        |СГРУППИРОВАТЬ ПО
				//        |	РейсЗаказы.Заказ,
				//        |	РейсЗаказы.Ссылка.НомерПалетты,
				//        |	РейсЗаказы.Заказ
				//        |;
				//        |
				//        |////////////////////////////////////////////////////////////////////////////////
				//        |ВЫБРАТЬ
				//        |	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
				//        |	РеализацияТоваровУслугТовары.Номенклатура.Код КАК НоменклатураКод,
				//        |	РеализацияТоваровУслугТовары.Номенклатура.Артикул КАК НоменклатураАртикул,
				//        |	РеализацияТоваровУслугТовары.Количество КАК Количество,
				//        |	РеализацияТоваровУслугТовары.Цена КАК Цена,
				//        |	РеализацияТоваровУслугТовары.Сумма КАК Сумма,
				//        |	РеализацияТоваровУслугТовары.Вес * РеализацияТоваровУслугТовары.Количество КАК Вес,
				//        |	ВТ_Доставки.Доставка КАК Доставка,
				//        |	РеализацияТоваровУслугТовары.НомерСтроки КАК НомерСтроки,
				//        |	ВТ_Доставки.ТипЗаказа КАК ТипЗаказа,
				//        |	РеализацияТоваровУслугТовары.ШтрихкодНоменклатуры КАК ШК,
				//        |	ВТ_Доставки.НомерПалетты КАК НомерПалетты
				//        |ПОМЕСТИТЬ ВТ_Товары
				//        |ИЗ
				//        |	ВТ_Доставки КАК ВТ_Доставки
				//        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
				//        |		ПО (ВЫРАЗИТЬ(ВТ_Доставки.Доставка КАК БизнесПроцесс.новаМестнаяДоставка).Номер = РеализацияТоваровУслугТовары.Ссылка.Номер)
				//        |
				//        |ОБЪЕДИНИТЬ ВСЕ
				//        |
				//        |ВЫБРАТЬ
				//        |	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура,
				//        |	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура.Код,
				//        |	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура.Артикул,
				//        |	РеализацияТоваровУслугПодарочныеПозиции.Количество,
				//        |	РеализацияТоваровУслугПодарочныеПозиции.Цена,
				//        |	РеализацияТоваровУслугПодарочныеПозиции.Сумма,
				//        |	РеализацияТоваровУслугПодарочныеПозиции.Вес * РеализацияТоваровУслугПодарочныеПозиции.Количество,
				//        |	ВТ_Доставки.Доставка,
				//        |	РеализацияТоваровУслугПодарочныеПозиции.НомерСтроки,
				//        |	ВТ_Доставки.ТипЗаказа,
				//        |	РеализацияТоваровУслугПодарочныеПозиции.ШтрихкодНоменклатуры,
				//        |	ВТ_Доставки.НомерПалетты
				//        |ИЗ
				//        |	ВТ_Доставки КАК ВТ_Доставки
				//        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.ПодарочныеПозиции КАК РеализацияТоваровУслугПодарочныеПозиции
				//        |		ПО (ВЫРАЗИТЬ(ВТ_Доставки.Доставка КАК БизнесПроцесс.новаМестнаяДоставка).Номер = РеализацияТоваровУслугПодарочныеПозиции.Ссылка.Номер)
				//        |
				//        |ОБЪЕДИНИТЬ ВСЕ
				//        |
				//        |ВЫБРАТЬ
				//        |	ВозвратТоваровОтПокупателяТовары.Номенклатура,
				//        |	ВозвратТоваровОтПокупателяТовары.Номенклатура.Код,
				//        |	ВозвратТоваровОтПокупателяТовары.Номенклатура.Артикул,
				//        |	-ВозвратТоваровОтПокупателяТовары.Количество,
				//        |	ВозвратТоваровОтПокупателяТовары.Цена,
				//        |	-ВозвратТоваровОтПокупателяТовары.Сумма,
				//        |	NULL,
				//        |	ВТ_Доставки.Доставка,
				//        |	ВозвратТоваровОтПокупателяТовары.НомерСтроки,
				//        |	ВТ_Доставки.ТипЗаказа,
				//        |	ВозвратТоваровОтПокупателяТовары.ШтрихкодНоменклатуры,
				//        |	ВТ_Доставки.НомерПалетты
				//        |ИЗ
				//        |	ВТ_Доставки КАК ВТ_Доставки
				//        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
				//        |		ПО (ВЫРАЗИТЬ(ВТ_Доставки.Доставка КАК БизнесПроцесс.новаМестнаяДоставка).Номер = ВозвратТоваровОтПокупателяТовары.Ссылка.Номер)
				//        |
				//        |ОБЪЕДИНИТЬ ВСЕ
				//        |
				//        |ВЫБРАТЬ
				//        |	""Доставка"",
				//        |	NULL,
				//        |	NULL,
				//        |	МАКСИМУМ(1),
				//        |	NULL,
				//        |	МАКСИМУМ(ВТ_Доставки.Доставка.СтоимостьДоставкиДоМКАД),
				//        |	NULL,
				//        |	ВТ_Доставки.Доставка,
				//        |	998,
				//        |	МАКСИМУМ(ВТ_Доставки.ТипЗаказа),
				//        |	NULL,
				//        |	ВТ_Доставки.НомерПалетты
				//        |ИЗ
				//        |	ВТ_Доставки КАК ВТ_Доставки
				//        |ГДЕ
				//        |	ВТ_Доставки.Доставка.СтоимостьДоставкиДоМКАД <> 0
				//        |	И ВТ_Доставки.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
				//        |
				//        |СГРУППИРОВАТЬ ПО
				//        |	ВТ_Доставки.Доставка,
				//        |	ВТ_Доставки.НомерПалетты
				//        |
				//        |ОБЪЕДИНИТЬ ВСЕ
				//        |
				//        |ВЫБРАТЬ
				//        |	""Доставка"",
				//        |	NULL,
				//        |	NULL,
				//        |	МАКСИМУМ(1),
				//        |	NULL,
				//        |	МАКСИМУМ(ВТ_Доставки.Доставка.СтоимостьДоставкиЗаМКАД),
				//        |	NULL,
				//        |	ВТ_Доставки.Доставка,
				//        |	999,
				//        |	МАКСИМУМ(ВТ_Доставки.ТипЗаказа),
				//        |	NULL,
				//        |	ВТ_Доставки.НомерПалетты
				//        |ИЗ
				//        |	ВТ_Доставки КАК ВТ_Доставки
				//        |ГДЕ
				//        |	ВТ_Доставки.Доставка.СтоимостьДоставкиЗаМКАД <> 0
				//        |	И ВТ_Доставки.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
				//        |
				//        |СГРУППИРОВАТЬ ПО
				//        |	ВТ_Доставки.Доставка,
				//        |	ВТ_Доставки.НомерПалетты
				//        |
				//        |ОБЪЕДИНИТЬ ВСЕ
				//        |
				//        |ВЫБРАТЬ
				//        |	ЗаборТовараТовары.Номенклатура,
				//        |	ЗаборТовараТовары.Номенклатура.Код,
				//        |	ЗаборТовараТовары.Номенклатура.Артикул,
				//        |	СУММА(ЗаборТовараТовары.Количество),
				//        |	МАКСИМУМ(ЗаборТовараТовары.Цена),
				//        |	СУММА(ЗаборТовараТовары.Сумма),
				//        |	СУММА(ЗаборТовараТовары.Вес * ЗаборТовараТовары.Количество),
				//        |	ВТ_Доставки.Доставка,
				//        |	ЗаборТовараТовары.НомерСтроки,
				//        |	ВТ_Доставки.ТипЗаказа,
				//        |	NULL,
				//        |	ВТ_Доставки.НомерПалетты
				//        |ИЗ
				//        |	ВТ_Доставки КАК ВТ_Доставки
				//        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаборТовара КАК ЗаборТовара
				//        |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаборТовара.Товары КАК ЗаборТовараТовары
				//        |			ПО ЗаборТовара.Ссылка = ЗаборТовараТовары.Ссылка
				//        |		ПО (ВЫРАЗИТЬ(ВТ_Доставки.Доставка КАК Документ.ЗаборТовара).Номер = ЗаборТовара.Номер)
				//        |
				//        |СГРУППИРОВАТЬ ПО
				//        |	ЗаборТовараТовары.Номенклатура,
				//        |	ЗаборТовараТовары.Номенклатура.Код,
				//        |	ЗаборТовараТовары.Номенклатура.Артикул,
				//        |	ВТ_Доставки.Доставка,
				//        |	ЗаборТовараТовары.НомерСтроки,
				//        |	ВТ_Доставки.ТипЗаказа,
				//        |	ВТ_Доставки.НомерПалетты
				//        |;
				//        |
				//        |////////////////////////////////////////////////////////////////////////////////
				//        |ВЫБРАТЬ
				//        |	ВТ_Товары.Номенклатура КАК Номенклатура,
				//        |	ВТ_Товары.НоменклатураКод КАК НоменклатураКод,
				//        |	ВТ_Товары.НоменклатураАртикул КАК НоменклатураАртикул,
				//        |	ВТ_Товары.Количество КАК Количество,
				//        |	ВТ_Товары.Цена КАК Цена,
				//        |	ВТ_Товары.Сумма КАК Сумма,
				//        |	ВТ_Товары.Вес КАК Вес,
				//        |	ВТ_Товары.Доставка.Номер КАК Номер,
				//        |	ВЫРАЗИТЬ(ВТ_Товары.Доставка.Адрес КАК СТРОКА(1000)) КАК АдресДоставки,
				//        |	ВТ_Товары.Доставка.Телефон КАК ТелефонПокупателя,
				//        |	РеализацияТоваровУслуг.ВладелецТовара КАК Контрагент,
				//        |	ВЫРАЗИТЬ(ВТ_Товары.Доставка.КомментарийКАдресуДоставки КАК СТРОКА(500)) КАК КоммАдрес,
				//        |	ВЫРАЗИТЬ(ВТ_Товары.Доставка.Комментарий КАК СТРОКА(1000)) КАК Комментарий,
				//        |	ВТ_Товары.Доставка.Дата КАК ДатаДоставки,
				//        |	ВТ_Товары.Доставка.ВремяПрибытияС КАК ВремяПрибытияС,
				//        |	ВТ_Товары.Доставка.ВремяПрибытияПо КАК ВремяПрибытияПо,
				//        |	ТипыОплат.Наименование КАК ТипОплаты,
				//        |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
				//        |	РеализацияТоваровУслуг.ВладелецТовара.ТелефонИнтернетМагазина КАК ТелефонИнтернетМагазина,
				//        |	ВЫБОР
				//        |		КОГДА РеализацияТоваровУслуг.ТарифнаяСетка.Код = 2
				//        |			ТОГДА ""СРОЧНАЯ ДОСТАВКА""
				//        |		ИНАЧЕ """"
				//        |	КОНЕЦ КАК СрочнаяДоставка,
				//        |	ВЫБОР
				//        |		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа ЕСТЬ NULL
				//        |			ТОГДА """"
				//        |		ИНАЧЕ ВЫБОР
				//        |				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа
				//        |					ТОГДА ""запрещен""
				//        |				ИНАЧЕ """"
				//        |			КОНЕЦ
				//        |	КОНЕЦ КАК ЗапретЧастичногоВыкупаСтарый,
				//        |	ВЫБОР
				//        |		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретСменыОплаты ЕСТЬ NULL
				//        |			ТОГДА """"
				//        |		ИНАЧЕ ВЫБОР
				//        |				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретСменыОплаты
				//        |					ТОГДА ""запрещена""
				//        |				ИНАЧЕ """"
				//        |			КОНЕЦ
				//        |	КОНЕЦ КАК ЗапретСменыОплаты,
				//        |	ВЫБОР
				//        |		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа ЕСТЬ NULL
				//        |			ТОГДА """"
				//        |		ИНАЧЕ ВЫБОР
				//        |				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа
				//        |					ТОГДА ""Частичный выкуп""
				//        |				ИНАЧЕ """"
				//        |			КОНЕЦ
				//        |	КОНЕЦ КАК ЧастичныйВыкупСтарый,
				//        |	РеализацияТоваровУслуг.Контрагент КАК Покупатель,
				//        |	ВТ_Товары.НомерСтроки КАК НомерСтроки,
				//        |	ВТ_Товары.Доставка КАК Доставка,
				//        |	РеализацияТоваровУслуг.ИнтернетМагазинЯндекса КАК ИнтернетМагазинЯндекса,
				//        |	ТипыОплат.Ссылка КАК ТипОплатыСсылка,
				//        |	РеализацияТоваровУслуг.ВладелецТовара.Приоритет КАК ВладелецТовараПриоритет,
				//        |	РеализацияТоваровУслуг.ПредоплатаПоКредиту КАК ПредоплатаПоКредиту,
				//        |	ВЫБОР
				//        |		КОГДА РеализацияТоваровУслуг.ЗапретЧастичногоВыкупа
				//        |			ТОГДА ""запрещен""
				//        |		ИНАЧЕ """"
				//        |	КОНЕЦ КАК ЗапретЧастичногоВыкупа,
				//        |	ВЫБОР
				//        |		КОГДА РеализацияТоваровУслуг.ЗапретЧастичногоВыкупа
				//        |			ТОГДА ""Частичный выкуп""
				//        |		ИНАЧЕ """"
				//        |	КОНЕЦ КАК ЧастичныйВыкуп,
				//        |	КатегорииДоставки2014.Родитель КАК КатегорияДоставки,
				//        |	ПараметрыКонтрагентовСрезПоследних.МетодОплатыПодъёма КАК МетодОплатыПодъёма,
				//        |	ВЫБОР
				//        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.СОжиданием, ЛОЖЬ)
				//        |			ТОГДА ""С вскрытием""
				//        |		ИНАЧЕ ""Без вскрытия""
				//        |	КОНЕЦ КАК СОжиданием,
				//        |	ВТ_Товары.ТипЗаказа КАК ТипЗаказа,
				//        |	NULL КАК ДатаЗабора,
				//        |	NULL КАК МенеджерЗабора,
				//        |	ДополнительныеПараметрыЗаказа.КОплатеКлиентом КАК КОплатеКлиентом,
				//        |	РеализацияТоваровУслуг.УчитыватьИтогоКОплате КАК УчитыватьИтогоКОплате,
				//        |	ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ПодъемОплачен, ЛОЖЬ) КАК ПодъемОплачен,
				//        |	ДополнительныеПараметрыЗаказа.КатегорияДляРасчетаЗП КАК КатегорияДляРасчетаЗП,
				//        |	ДополнительныеПараметрыЗаказа.ДополнительныйНомерЗаказа КАК ДополнительныйНомерЗаказа,
				//        |	ВТ_Товары.ШК КАК ШК,
				//        |	ВТ_Товары.НомерПалетты КАК НомерЛог
				//        |ПОМЕСТИТЬ ВТ_Объединение
				//        |ИЗ
				//        |	ВТ_Товары КАК ВТ_Товары
				//        |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
				//        |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыОплат КАК ТипыОплат
				//        |			ПО РеализацияТоваровУслуг.ТипОплаты = ТипыОплат.Код
				//        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыКонтрагентов.СрезПоследних КАК ПараметрыКонтрагентовСрезПоследних
				//        |			ПО РеализацияТоваровУслуг.ВладелецТовара = ПараметрыКонтрагентовСрезПоследних.Контрагент
				//        |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КатегорииДоставки2014 КАК КатегорииДоставки2014
				//        |			ПО РеализацияТоваровУслуг.КатегорияДоставки = КатегорииДоставки2014.Категория
				//        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
				//        |			ПО РеализацияТоваровУслуг.Ссылка = ДополнительныеПараметрыЗаказа.Заказ
				//        |		ПО ВТ_Товары.Доставка.Номер = РеализацияТоваровУслуг.Номер
				//        |ГДЕ
				//        |	ВТ_Товары.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
				//        |
				//        |СГРУППИРОВАТЬ ПО
				//        |	ВТ_Товары.Номенклатура,
				//        |	ВТ_Товары.НоменклатураКод,
				//        |	ВТ_Товары.НоменклатураАртикул,
				//        |	ВТ_Товары.Количество,
				//        |	ВТ_Товары.Цена,
				//        |	ВТ_Товары.Сумма,
				//        |	ВТ_Товары.Вес,
				//        |	ВТ_Товары.Доставка.Номер,
				//        |	ВЫРАЗИТЬ(ВТ_Товары.Доставка.Адрес КАК СТРОКА(1000)),
				//        |	ВТ_Товары.Доставка.Телефон,
				//        |	РеализацияТоваровУслуг.ВладелецТовара,
				//        |	ВЫРАЗИТЬ(ВТ_Товары.Доставка.КомментарийКАдресуДоставки КАК СТРОКА(500)),
				//        |	ВЫРАЗИТЬ(ВТ_Товары.Доставка.Комментарий КАК СТРОКА(1000)),
				//        |	ВТ_Товары.Доставка.Дата,
				//        |	ВТ_Товары.Доставка.ВремяПрибытияС,
				//        |	ВТ_Товары.Доставка.ВремяПрибытияПо,
				//        |	ТипыОплат.Наименование,
				//        |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа,
				//        |	РеализацияТоваровУслуг.ВладелецТовара.ТелефонИнтернетМагазина,
				//        |	ВЫБОР
				//        |		КОГДА РеализацияТоваровУслуг.ТарифнаяСетка.Код = 2
				//        |			ТОГДА ""СРОЧНАЯ ДОСТАВКА""
				//        |		ИНАЧЕ """"
				//        |	КОНЕЦ,
				//        |	ВЫБОР
				//        |		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа ЕСТЬ NULL
				//        |			ТОГДА """"
				//        |		ИНАЧЕ ВЫБОР
				//        |				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа
				//        |					ТОГДА ""запрещен""
				//        |				ИНАЧЕ """"
				//        |			КОНЕЦ
				//        |	КОНЕЦ,
				//        |	ВЫБОР
				//        |		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретСменыОплаты ЕСТЬ NULL
				//        |			ТОГДА """"
				//        |		ИНАЧЕ ВЫБОР
				//        |				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретСменыОплаты
				//        |					ТОГДА ""запрещена""
				//        |				ИНАЧЕ """"
				//        |			КОНЕЦ
				//        |	КОНЕЦ,
				//        |	ВЫБОР
				//        |		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа ЕСТЬ NULL
				//        |			ТОГДА """"
				//        |		ИНАЧЕ ВЫБОР
				//        |				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа
				//        |					ТОГДА ""Частичный выкуп""
				//        |				ИНАЧЕ """"
				//        |			КОНЕЦ
				//        |	КОНЕЦ,
				//        |	ТипыОплат.Ссылка,
				//        |	ВЫБОР
				//        |		КОГДА РеализацияТоваровУслуг.ЗапретЧастичногоВыкупа
				//        |			ТОГДА ""запрещен""
				//        |		ИНАЧЕ """"
				//        |	КОНЕЦ,
				//        |	КатегорииДоставки2014.Родитель,
				//        |	ВТ_Товары.Доставка,
				//        |	ДополнительныеПараметрыЗаказа.КатегорияДляРасчетаЗП,
				//        |	РеализацияТоваровУслуг.ИнтернетМагазинЯндекса,
				//        |	ВЫБОР
				//        |		КОГДА РеализацияТоваровУслуг.ЗапретЧастичногоВыкупа
				//        |			ТОГДА ""Частичный выкуп""
				//        |		ИНАЧЕ """"
				//        |	КОНЕЦ,
				//        |	ВТ_Товары.ТипЗаказа,
				//        |	РеализацияТоваровУслуг.УчитыватьИтогоКОплате,
				//        |	ДополнительныеПараметрыЗаказа.ДополнительныйНомерЗаказа,
				//        |	РеализацияТоваровУслуг.Контрагент,
				//        |	ВЫБОР
				//        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.СОжиданием, ЛОЖЬ)
				//        |			ТОГДА ""С вскрытием""
				//        |		ИНАЧЕ ""Без вскрытия""
				//        |	КОНЕЦ,
				//        |	ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ПодъемОплачен, ЛОЖЬ),
				//        |	ПараметрыКонтрагентовСрезПоследних.МетодОплатыПодъёма,
				//        |	ВТ_Товары.ШК,
				//        |	ВТ_Товары.НомерСтроки,
				//        |	РеализацияТоваровУслуг.ВладелецТовара.Приоритет,
				//        |	РеализацияТоваровУслуг.ПредоплатаПоКредиту,
				//        |	ДополнительныеПараметрыЗаказа.КОплатеКлиентом,
				//        |	ВТ_Товары.НомерПалетты
				//        |
				//        |ОБЪЕДИНИТЬ ВСЕ
				//        |
				//        |ВЫБРАТЬ
				//        |	ВТ_Товары.Номенклатура,
				//        |	ВТ_Товары.НоменклатураКод,
				//        |	ВТ_Товары.НоменклатураАртикул,
				//        |	ВТ_Товары.Количество,
				//        |	ВТ_Товары.Цена,
				//        |	ВТ_Товары.Сумма,
				//        |	ВТ_Товары.Вес,
				//        |	ВТ_Товары.Доставка.Номер,
				//        |	ВЫРАЗИТЬ(ВТ_Товары.Доставка.АдресДоставки КАК СТРОКА(1000)),
				//        |	ВТ_Товары.Доставка.Телефон,
				//        |	ВТ_Товары.Доставка.Контрагент,
				//        |	NULL,
				//        |	ВЫРАЗИТЬ(ВТ_Товары.Доставка.Комментарий КАК СТРОКА(1000)),
				//        |	ВТ_Товары.Доставка.ДатаДоставки,
				//        |	ВТ_Товары.Доставка.ВремяДоставкиС,
				//        |	ВТ_Товары.Доставка.ВремяДоставкиПо,
				//        |	ТипыОплат.Наименование,
				//        |	ВТ_Товары.Доставка.НомерВнешнегоЗаказа,
				//        |	ВТ_Товары.Доставка.Контрагент.ТелефонИнтернетМагазина,
				//        |	NULL,
				//        |	NULL,
				//        |	NULL,
				//        |	NULL,
				//        |	ВТ_Товары.Доставка.Грузополучатель,
				//        |	ВТ_Товары.НомерСтроки,
				//        |	ВТ_Товары.Доставка,
				//        |	ВТ_Товары.Доставка.Контрагент,
				//        |	ТипыОплат.Ссылка,
				//        |	ВТ_Товары.Доставка.Контрагент.Приоритет,
				//        |	NULL,
				//        |	NULL,
				//        |	NULL,
				//        |	NULL,
				//        |	NULL,
				//        |	NULL,
				//        |	ВТ_Товары.ТипЗаказа,
				//        |	ВТ_Товары.Доставка.Дата,
				//        |	ВЫБОР
				//        |		КОГДА ВТ_Товары.Доставка.Автор = """"
				//        |			ТОГДА ""Не указан""
				//        |		ИНАЧЕ ВТ_Товары.Доставка.Автор
				//        |	КОНЕЦ,
				//        |	NULL,
				//        |	NULL,
				//        |	NULL,
				//        |	NULL,
				//        |	NULL,
				//        |	ВТ_Товары.ШК,
				//        |	ВТ_Товары.НомерПалетты
				//        |ИЗ
				//        |	ВТ_Товары КАК ВТ_Товары
				//        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыОплат КАК ТипыОплат
				//        |		ПО ВТ_Товары.Доставка.ТипОплаты = ТипыОплат.Код
				//        |ГДЕ
				//        |	ВТ_Товары.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор)
				//        |
				//        |СГРУППИРОВАТЬ ПО
				//        |	ВТ_Товары.Номенклатура,
				//        |	ВТ_Товары.НоменклатураКод,
				//        |	ВТ_Товары.НоменклатураАртикул,
				//        |	ВТ_Товары.Количество,
				//        |	ВТ_Товары.Цена,
				//        |	ВТ_Товары.Сумма,
				//        |	ВТ_Товары.Вес,
				//        |	ВТ_Товары.Доставка.Номер,
				//        |	ВЫРАЗИТЬ(ВТ_Товары.Доставка.АдресДоставки КАК СТРОКА(1000)),
				//        |	ВТ_Товары.Доставка.Телефон,
				//        |	ВТ_Товары.Доставка.Контрагент,
				//        |	ВЫРАЗИТЬ(ВТ_Товары.Доставка.Комментарий КАК СТРОКА(1000)),
				//        |	ВТ_Товары.Доставка.ДатаДоставки,
				//        |	ВТ_Товары.Доставка.ВремяДоставкиС,
				//        |	ВТ_Товары.Доставка.ВремяДоставкиПо,
				//        |	ТипыОплат.Наименование,
				//        |	ВТ_Товары.Доставка.НомерВнешнегоЗаказа,
				//        |	ВТ_Товары.Доставка.Контрагент.ТелефонИнтернетМагазина,
				//        |	ВТ_Товары.Доставка.Грузополучатель,
				//        |	ВТ_Товары.НомерСтроки,
				//        |	ВТ_Товары.Доставка,
				//        |	ТипыОплат.Ссылка,
				//        |	ВТ_Товары.Доставка.Контрагент.Приоритет,
				//        |	ВТ_Товары.ТипЗаказа,
				//        |	ВТ_Товары.Доставка.Дата,
				//        |	ВЫБОР
				//        |		КОГДА ВТ_Товары.Доставка.Автор = """"
				//        |			ТОГДА ""Не указан""
				//        |		ИНАЧЕ ВТ_Товары.Доставка.Автор
				//        |	КОНЕЦ,
				//        |	ВТ_Товары.ШК,
				//        |	ВТ_Товары.НомерПалетты,
				//        |	ВТ_Товары.Доставка.Контрагент
				//        |;
				//        |
				//        |////////////////////////////////////////////////////////////////////////////////
				//        |ВЫБРАТЬ
				//        |	ВТ_Объединение.Номенклатура КАК Номенклатура,
				//        |	ВТ_Объединение.НоменклатураКод КАК НоменклатураКод,
				//        |	ВТ_Объединение.НоменклатураАртикул КАК НоменклатураАртикул,
				//        |	ВТ_Объединение.Количество КАК Количество,
				//        |	ВТ_Объединение.Цена КАК Цена,
				//        |	ВТ_Объединение.Сумма КАК Сумма,
				//        |	ВТ_Объединение.Вес КАК Вес,
				//        |	ВТ_Объединение.Номер КАК Номер,
				//        |	ВТ_Объединение.АдресДоставки КАК АдресДоставки,
				//        |	ВТ_Объединение.ТелефонПокупателя КАК ТелефонПокупателя,
				//        |	ВТ_Объединение.Контрагент КАК Контрагент,
				//        |	ВТ_Объединение.КоммАдрес КАК КоммАдрес,
				//        |	ВТ_Объединение.Комментарий КАК Комментарий,
				//        |	ВТ_Объединение.ДатаДоставки КАК ДатаДоставки,
				//        |	ВТ_Объединение.ВремяПрибытияС КАК ВремяПрибытияС,
				//        |	ВТ_Объединение.ВремяПрибытияПо КАК ВремяПрибытияПо,
				//        |	ВТ_Объединение.ТипОплаты КАК ТипОплаты,
				//        |	ВТ_Объединение.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
				//        |	ВТ_Объединение.ТелефонИнтернетМагазина КАК ТелефонИнтернетМагазина,
				//        |	ВТ_Объединение.СрочнаяДоставка КАК СрочнаяДоставка,
				//        |	ВТ_Объединение.ЗапретЧастичногоВыкупаСтарый КАК ЗапретЧастичногоВыкупаСтарый,
				//        |	ВТ_Объединение.ЗапретСменыОплаты КАК ЗапретСменыОплаты,
				//        |	ВТ_Объединение.ЧастичныйВыкупСтарый КАК ЧастичныйВыкупСтарый,
				//        |	ВТ_Объединение.Покупатель КАК Покупатель,
				//        |	ВТ_Объединение.НомерСтроки КАК НомерСтроки,
				//        |	ВТ_Объединение.Доставка КАК Доставка,
				//        |	ВТ_Объединение.ИнтернетМагазинЯндекса КАК ИнтернетМагазинЯндекса,
				//        |	ВТ_Объединение.ТипОплатыСсылка КАК ТипОплатыСсылка,
				//        |	ВТ_Объединение.ВладелецТовараПриоритет КАК ВладелецТовараПриоритет,
				//        |	ВТ_Объединение.ПредоплатаПоКредиту КАК ПредоплатаПоКредиту,
				//        |	ВТ_Объединение.ЗапретЧастичногоВыкупа КАК ЗапретЧастичногоВыкупа,
				//        |	ВТ_Объединение.ЧастичныйВыкуп КАК ЧастичныйВыкуп,
				//        |	ВТ_Объединение.КатегорияДоставки КАК КатегорияДоставки,
				//        |	ВТ_Объединение.МетодОплатыПодъёма КАК МетодОплатыПодъёма,
				//        |	ВТ_Объединение.СОжиданием КАК СОжиданием,
				//        |	ВТ_Объединение.ТипЗаказа КАК ТипЗаказа,
				//        |	ВТ_Объединение.ДатаЗабора КАК ДатаЗабора,
				//        |	ВТ_Объединение.МенеджерЗабора КАК МенеджерЗабора,
				//        |	ВТ_Объединение.КОплатеКлиентом КАК КОплатеКлиентом,
				//        |	ВТ_Объединение.УчитыватьИтогоКОплате КАК УчитыватьИтогоКОплате,
				//        |	ВТ_Объединение.ПодъемОплачен КАК ПодъемОплачен,
				//        |	ВЫБОР
				//        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ШтрихкодOZON, """") <> """"
				//        |			ТОГДА ИСТИНА
				//        |		ИНАЧЕ ЛОЖЬ
				//        |	КОНЕЦ КАК Озон,
				//        |	ВТ_Объединение.КатегорияДляРасчетаЗП КАК КатегорияДляРасчетаЗП,
				//        |	ВТ_Объединение.ДополнительныйНомерЗаказа КАК ДополнительныйНомерЗаказа,
				//        |	ДополнительныеПараметрыЗаказа.Заказ КАК Заказ,
				//        |	ВТ_Объединение.ШК КАК ШК,
				//        |	ЕСТЬNULL(ВТ_Объединение.Доставка.ОбъемЗабора, 0) КАК ОбъемЗабора,
				//        |	ВТ_Объединение.НомерЛог КАК НомерЛог
				//        |ИЗ
				//        |	ВТ_Объединение КАК ВТ_Объединение
				//        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
				//        |		ПО ВТ_Объединение.Доставка.Номер = ДополнительныеПараметрыЗаказа.Заказ.Номер
				//        |@СтрокаУсловия@
				//        |СГРУППИРОВАТЬ ПО
				//        |	ВТ_Объединение.Номенклатура,
				//        |	ВТ_Объединение.НоменклатураКод,
				//        |	ВТ_Объединение.НоменклатураАртикул,
				//        |	ВТ_Объединение.Количество,
				//        |	ВТ_Объединение.Цена,
				//        |	ВТ_Объединение.Сумма,
				//        |	ВТ_Объединение.Вес,
				//        |	ВТ_Объединение.Номер,
				//        |	ВТ_Объединение.ТелефонПокупателя,
				//        |	ВТ_Объединение.Контрагент,
				//        |	ВТ_Объединение.КоммАдрес,
				//        |	ВТ_Объединение.ДатаДоставки,
				//        |	ВТ_Объединение.ВремяПрибытияС,
				//        |	ВТ_Объединение.ВремяПрибытияПо,
				//        |	ВТ_Объединение.ТипОплаты,
				//        |	ВТ_Объединение.НомерВнешнегоЗаказа,
				//        |	ВТ_Объединение.ТелефонИнтернетМагазина,
				//        |	ВТ_Объединение.СрочнаяДоставка,
				//        |	ВТ_Объединение.ЗапретЧастичногоВыкупаСтарый,
				//        |	ВТ_Объединение.ЗапретСменыОплаты,
				//        |	ВТ_Объединение.ЧастичныйВыкупСтарый,
				//        |	ВТ_Объединение.Покупатель,
				//        |	ВТ_Объединение.НомерСтроки,
				//        |	ВТ_Объединение.Доставка,
				//        |	ВТ_Объединение.ИнтернетМагазинЯндекса,
				//        |	ВТ_Объединение.ТипОплатыСсылка,
				//        |	ВТ_Объединение.ВладелецТовараПриоритет,
				//        |	ВТ_Объединение.ПредоплатаПоКредиту,
				//        |	ВТ_Объединение.ЗапретЧастичногоВыкупа,
				//        |	ВТ_Объединение.ЧастичныйВыкуп,
				//        |	ВТ_Объединение.КатегорияДоставки,
				//        |	ВТ_Объединение.МетодОплатыПодъёма,
				//        |	ВТ_Объединение.СОжиданием,
				//        |	ВТ_Объединение.ТипЗаказа,
				//        |	ВТ_Объединение.ДатаЗабора,
				//        |	ВТ_Объединение.МенеджерЗабора,
				//        |	ВТ_Объединение.КОплатеКлиентом,
				//        |	ВТ_Объединение.УчитыватьИтогоКОплате,
				//        |	ВТ_Объединение.ПодъемОплачен,
				//        |	ВЫБОР
				//        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ШтрихкодOZON, """") <> """"
				//        |			ТОГДА ИСТИНА
				//        |		ИНАЧЕ ЛОЖЬ
				//        |	КОНЕЦ,
				//        |	ВТ_Объединение.КатегорияДляРасчетаЗП,
				//        |	ВТ_Объединение.ДополнительныйНомерЗаказа,
				//        |	ДополнительныеПараметрыЗаказа.Заказ,
				//        |	ВТ_Объединение.ШК,
				//        |	ЕСТЬNULL(ВТ_Объединение.Доставка.ОбъемЗабора, 0),
				//        |	ВТ_Объединение.АдресДоставки,
				//        |	ВТ_Объединение.Комментарий,
				//        |	ВТ_Объединение.НомерЛог
				//        |
				//        |УПОРЯДОЧИТЬ ПО
				//        |	ТипЗаказа, @ПОРЯДОК@
				//        |	ВладелецТовараПриоритет,
				//        |	Номер,
				//        |	НомерСтроки,
				//        |	Номенклатура
				//        |ИТОГИ
				//        |	СУММА(Количество),
				//        |	СУММА(Сумма),
				//        |	СУММА(Вес),
				//        |	МАКСИМУМ(АдресДоставки),
				//        |	МАКСИМУМ(ТелефонПокупателя),
				//        |	МАКСИМУМ(Контрагент),
				//        |	МАКСИМУМ(КоммАдрес),
				//        |	МАКСИМУМ(Комментарий),
				//		|	МАКСИМУМ(НомерЛог),
				//        |	МАКСИМУМ(ДатаДоставки),
				//        |	МАКСИМУМ(ВремяПрибытияС),
				//        |	МАКСИМУМ(ВремяПрибытияПо),
				//        |	МАКСИМУМ(ТипОплаты),
				//        |	МАКСИМУМ(НомерВнешнегоЗаказа),
				//        |	МАКСИМУМ(ТелефонИнтернетМагазина),
				//        |	МАКСИМУМ(СрочнаяДоставка),
				//        |	МАКСИМУМ(ЗапретЧастичногоВыкупаСтарый),
				//        |	МАКСИМУМ(ЗапретСменыОплаты),
				//        |	МАКСИМУМ(ЧастичныйВыкупСтарый),
				//        |	МАКСИМУМ(Покупатель),
				//        |	МАКСИМУМ(Доставка),
				//        |	МАКСИМУМ(ИнтернетМагазинЯндекса),
				//        |	МАКСИМУМ(ТипОплатыСсылка),
				//        |	МАКСИМУМ(ВладелецТовараПриоритет),
				//        |	МАКСИМУМ(ПредоплатаПоКредиту),
				//        |	МАКСИМУМ(ЗапретЧастичногоВыкупа),
				//        |	МАКСИМУМ(ЧастичныйВыкуп),
				//        |	МАКСИМУМ(КатегорияДоставки),
				//        |	МАКСИМУМ(МетодОплатыПодъёма),
				//        |	МАКСИМУМ(СОжиданием),
				//        |	МАКСИМУМ(ДатаЗабора),
				//        |	МАКСИМУМ(МенеджерЗабора),
				//        |	МАКСИМУМ(КОплатеКлиентом),
				//        |	МАКСИМУМ(УчитыватьИтогоКОплате),
				//        |	МАКСИМУМ(ПодъемОплачен),
				//        |	МАКСИМУМ(Озон),
				//        |	МАКСИМУМ(КатегорияДляРасчетаЗП),
				//        |	МАКСИМУМ(ДополнительныйНомерЗаказа),
				//        |	МАКСИМУМ(Заказ)
				//        |ПО
				//        |	ТипЗаказа, 
				//        |	Номер
				//        |АВТОУПОРЯДОЧИВАНИЕ";
				
				// Якурнов 31.08.2018 11:29:42
				//Запрос переделан с учетом терминала
				
			//Асеев 17.02.2021 (Задача № 3837)>>>
			//Возврат "ВЫБРАТЬ
			//        |	новаМестнаяДоставка.Ссылка КАК Доставка,
			//        |	РейсЗаказы.Заказ КАК Заказ,
			//        |	МАКСИМУМ(ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)) КАК ТипЗаказа,
			//        |	РейсЗаказы.Ссылка.НомерПалетты КАК НомерПалетты
			//        |ПОМЕСТИТЬ ВТ_Доставки
			//        |ИЗ
			//        |	Документ.Рейс.Заказы КАК РейсЗаказы
			//        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БизнесПроцесс.новаМестнаяДоставка КАК новаМестнаяДоставка
			//        |		ПО (ВЫРАЗИТЬ(РейсЗаказы.Заказ КАК Документ.РеализацияТоваровУслуг).Номер = новаМестнаяДоставка.Номер)
			//        |ГДЕ
			//        |	РейсЗаказы.Ссылка = &Рейс
			//        |	И НЕ РейсЗаказы.УдаленИзРейса
			//        |	И РейсЗаказы.Ссылка.ТерминалДоставки = &ТерминалДоставки
			//        |
			//        |СГРУППИРОВАТЬ ПО
			//        |	новаМестнаяДоставка.Ссылка,
			//        |	РейсЗаказы.Заказ,
			//        |	РейсЗаказы.Ссылка.НомерПалетты
			//        |
			//        |ОБЪЕДИНИТЬ ВСЕ
			//        |
			//        |ВЫБРАТЬ
			//        |	РейсЗаказы.Заказ,
			//        |	РейсЗаказы.Заказ,
			//        |	МАКСИМУМ(ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор)),
			//        |	РейсЗаказы.Ссылка.НомерПалетты
			//        |ИЗ
			//        |	Документ.Рейс.Заказы КАК РейсЗаказы
			//        |ГДЕ
			//        |	РейсЗаказы.Ссылка = &Рейс
			//        |	И РейсЗаказы.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаборТовара.ПустаяСсылка)
			//        |	И РейсЗаказы.Заказ ССЫЛКА Документ.ЗаборТовара
			//        |	И НЕ РейсЗаказы.УдаленИзРейса
			//        |	И РейсЗаказы.Ссылка.ТерминалДоставки = &ТерминалДоставки
			//        |
			//        |СГРУППИРОВАТЬ ПО
			//        |	РейсЗаказы.Заказ,
			//        |	РейсЗаказы.Ссылка.НомерПалетты,
			//        |	РейсЗаказы.Заказ
			//        |;
			//        |
			//        |////////////////////////////////////////////////////////////////////////////////
			//        |ВЫБРАТЬ
			//        |	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
			//        |	РеализацияТоваровУслугТовары.Номенклатура.Код КАК НоменклатураКод,
			//        |	РеализацияТоваровУслугТовары.Номенклатура.Артикул КАК НоменклатураАртикул,
			//        |	РеализацияТоваровУслугТовары.Количество КАК Количество,
			//        |	РеализацияТоваровУслугТовары.Цена КАК Цена,
			//        |	РеализацияТоваровУслугТовары.Сумма КАК Сумма,
			//        |	РеализацияТоваровУслугТовары.Вес * РеализацияТоваровУслугТовары.Количество КАК Вес,
			//        |	ВТ_Доставки.Доставка КАК Доставка,
			//        |	РеализацияТоваровУслугТовары.НомерСтроки КАК НомерСтроки,
			//        |	ВТ_Доставки.ТипЗаказа КАК ТипЗаказа,
			//        |	РеализацияТоваровУслугТовары.ШтрихкодНоменклатуры КАК ШК,
			//        |	ВТ_Доставки.НомерПалетты КАК НомерПалетты
			//        |ПОМЕСТИТЬ ВТ_Товары
			//        |ИЗ
			//        |	ВТ_Доставки КАК ВТ_Доставки
			//        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
			//        |		ПО (ВЫРАЗИТЬ(ВТ_Доставки.Доставка КАК БизнесПроцесс.новаМестнаяДоставка).Номер = РеализацияТоваровУслугТовары.Ссылка.Номер)
			//        |
			//        |ОБЪЕДИНИТЬ ВСЕ
			//        |
			//        |ВЫБРАТЬ
			//        |	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура,
			//        |	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура.Код,
			//        |	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура.Артикул,
			//        |	РеализацияТоваровУслугПодарочныеПозиции.Количество,
			//        |	РеализацияТоваровУслугПодарочныеПозиции.Цена,
			//        |	РеализацияТоваровУслугПодарочныеПозиции.Сумма,
			//        |	РеализацияТоваровУслугПодарочныеПозиции.Вес * РеализацияТоваровУслугПодарочныеПозиции.Количество,
			//        |	ВТ_Доставки.Доставка,
			//        |	РеализацияТоваровУслугПодарочныеПозиции.НомерСтроки,
			//        |	ВТ_Доставки.ТипЗаказа,
			//        |	РеализацияТоваровУслугПодарочныеПозиции.ШтрихкодНоменклатуры,
			//        |	ВТ_Доставки.НомерПалетты
			//        |ИЗ
			//        |	ВТ_Доставки КАК ВТ_Доставки
			//        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.ПодарочныеПозиции КАК РеализацияТоваровУслугПодарочныеПозиции
			//        |		ПО (ВЫРАЗИТЬ(ВТ_Доставки.Доставка КАК БизнесПроцесс.новаМестнаяДоставка).Номер = РеализацияТоваровУслугПодарочныеПозиции.Ссылка.Номер)
			//        |
			//        |ОБЪЕДИНИТЬ ВСЕ
			//        |
			//        |ВЫБРАТЬ
			//        |	ВозвратТоваровОтПокупателяТовары.Номенклатура,
			//        |	ВозвратТоваровОтПокупателяТовары.Номенклатура.Код,
			//        |	ВозвратТоваровОтПокупателяТовары.Номенклатура.Артикул,
			//        |	-ВозвратТоваровОтПокупателяТовары.Количество,
			//        |	ВозвратТоваровОтПокупателяТовары.Цена,
			//        |	-ВозвратТоваровОтПокупателяТовары.Сумма,
			//        |	NULL,
			//        |	ВТ_Доставки.Доставка,
			//        |	ВозвратТоваровОтПокупателяТовары.НомерСтроки,
			//        |	ВТ_Доставки.ТипЗаказа,
			//        |	ВозвратТоваровОтПокупателяТовары.ШтрихкодНоменклатуры,
			//        |	ВТ_Доставки.НомерПалетты
			//        |ИЗ
			//        |	ВТ_Доставки КАК ВТ_Доставки
			//        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
			//        |		ПО (ВЫРАЗИТЬ(ВТ_Доставки.Доставка КАК БизнесПроцесс.новаМестнаяДоставка).Номер = ВозвратТоваровОтПокупателяТовары.Ссылка.Номер)
			//        |
			//        |ОБЪЕДИНИТЬ ВСЕ
			//        |
			//        |ВЫБРАТЬ
			//        |	""Доставка"",
			//        |	NULL,
			//        |	NULL,
			//        |	МАКСИМУМ(1),
			//        |	NULL,
			//        |	МАКСИМУМ(ВТ_Доставки.Доставка.СтоимостьДоставкиДоМКАД),
			//        |	NULL,
			//        |	ВТ_Доставки.Доставка,
			//        |	998,
			//        |	МАКСИМУМ(ВТ_Доставки.ТипЗаказа),
			//        |	NULL,
			//        |	ВТ_Доставки.НомерПалетты
			//        |ИЗ
			//        |	ВТ_Доставки КАК ВТ_Доставки
			//        |ГДЕ
			//        |	ВТ_Доставки.Доставка.СтоимостьДоставкиДоМКАД <> 0
			//        |	И ВТ_Доставки.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
			//        |
			//        |СГРУППИРОВАТЬ ПО
			//        |	ВТ_Доставки.Доставка,
			//        |	ВТ_Доставки.НомерПалетты
			//        |
			//        |ОБЪЕДИНИТЬ ВСЕ
			//        |
			//        |ВЫБРАТЬ
			//        |	""Доставка"",
			//        |	NULL,
			//        |	NULL,
			//        |	МАКСИМУМ(1),
			//        |	NULL,
			//        |	МАКСИМУМ(ВТ_Доставки.Доставка.СтоимостьДоставкиЗаМКАД),
			//        |	NULL,
			//        |	ВТ_Доставки.Доставка,
			//        |	999,
			//        |	МАКСИМУМ(ВТ_Доставки.ТипЗаказа),
			//        |	NULL,
			//        |	ВТ_Доставки.НомерПалетты
			//        |ИЗ
			//        |	ВТ_Доставки КАК ВТ_Доставки
			//        |ГДЕ
			//        |	ВТ_Доставки.Доставка.СтоимостьДоставкиЗаМКАД <> 0
			//        |	И ВТ_Доставки.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
			//        |
			//        |СГРУППИРОВАТЬ ПО
			//        |	ВТ_Доставки.Доставка,
			//        |	ВТ_Доставки.НомерПалетты
			//        |
			//        |ОБЪЕДИНИТЬ ВСЕ
			//        |
			//        |ВЫБРАТЬ
			//        |	ЗаборТовараТовары.Номенклатура,
			//        |	ЗаборТовараТовары.Номенклатура.Код,
			//        |	ЗаборТовараТовары.Номенклатура.Артикул,
			//        |	СУММА(ЗаборТовараТовары.Количество),
			//        |	МАКСИМУМ(ЗаборТовараТовары.Цена),
			//        |	СУММА(ЗаборТовараТовары.Сумма),
			//        |	СУММА(ЗаборТовараТовары.Вес * ЗаборТовараТовары.Количество),
			//        |	ВТ_Доставки.Доставка,
			//        |	ЗаборТовараТовары.НомерСтроки,
			//        |	ВТ_Доставки.ТипЗаказа,
			//        |	NULL,
			//        |	ВТ_Доставки.НомерПалетты
			//        |ИЗ
			//        |	ВТ_Доставки КАК ВТ_Доставки
			//        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаборТовара КАК ЗаборТовара
			//        |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаборТовара.Товары КАК ЗаборТовараТовары
			//        |			ПО ЗаборТовара.Ссылка = ЗаборТовараТовары.Ссылка
			//        |		ПО (ВЫРАЗИТЬ(ВТ_Доставки.Доставка КАК Документ.ЗаборТовара).Номер = ЗаборТовара.Номер)
			//        |
			//        |СГРУППИРОВАТЬ ПО
			//        |	ЗаборТовараТовары.Номенклатура,
			//        |	ЗаборТовараТовары.Номенклатура.Код,
			//        |	ЗаборТовараТовары.Номенклатура.Артикул,
			//        |	ВТ_Доставки.Доставка,
			//        |	ЗаборТовараТовары.НомерСтроки,
			//        |	ВТ_Доставки.ТипЗаказа,
			//        |	ВТ_Доставки.НомерПалетты
			//        |;
			//        |
			//        |////////////////////////////////////////////////////////////////////////////////
			//        |ВЫБРАТЬ
			//        |	ВТ_Товары.Номенклатура КАК Номенклатура,
			//        |	ВТ_Товары.НоменклатураКод КАК НоменклатураКод,
			//        |	ВТ_Товары.НоменклатураАртикул КАК НоменклатураАртикул,
			//        |	ВТ_Товары.Количество КАК Количество,
			//        |	ВТ_Товары.Цена КАК Цена,
			//        |	ВТ_Товары.Сумма КАК Сумма,
			//        |	ВТ_Товары.Вес КАК Вес,
			//        |	ВТ_Товары.Доставка.Номер КАК Номер,
			//        |	ВЫРАЗИТЬ(ВТ_Товары.Доставка.Адрес КАК СТРОКА(1000)) КАК АдресДоставки,
			//        |	ВТ_Товары.Доставка.Телефон КАК ТелефонПокупателя,
			//        |	РеализацияТоваровУслуг.ВладелецТовара КАК Контрагент,
			//        |	ВЫРАЗИТЬ(ВТ_Товары.Доставка.КомментарийКАдресуДоставки КАК СТРОКА(500)) КАК КоммАдрес,
			//        |	ВЫРАЗИТЬ(ВТ_Товары.Доставка.Комментарий КАК СТРОКА(1000)) КАК Комментарий,
			//        |	ВТ_Товары.Доставка.Дата КАК ДатаДоставки,
			//        |	ВТ_Товары.Доставка.ВремяПрибытияС КАК ВремяПрибытияС,
			//        |	ВТ_Товары.Доставка.ВремяПрибытияПо КАК ВремяПрибытияПо,
			//        |	ТипыОплат.Наименование КАК ТипОплаты,
			//        |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
			//        |	РеализацияТоваровУслуг.ВладелецТовара.ТелефонИнтернетМагазина КАК ТелефонИнтернетМагазина,
			//        |	ВЫБОР
			//        |		КОГДА РеализацияТоваровУслуг.ТарифнаяСетка.Код = 2
			//        |			ТОГДА ""СРОЧНАЯ ДОСТАВКА""
			//        |		ИНАЧЕ """"
			//        |	КОНЕЦ КАК СрочнаяДоставка,
			//        |	ВЫБОР
			//        |		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа ЕСТЬ NULL
			//        |			ТОГДА """"
			//        |		ИНАЧЕ ВЫБОР
			//        |				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа
			//        |					ТОГДА ""запрещен""
			//        |				ИНАЧЕ """"
			//        |			КОНЕЦ
			//        |	КОНЕЦ КАК ЗапретЧастичногоВыкупаСтарый,
			//        |	ВЫБОР
			//        |		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретСменыОплаты ЕСТЬ NULL
			//        |			ТОГДА """"
			//        |		ИНАЧЕ ВЫБОР
			//        |				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретСменыОплаты
			//        |					ТОГДА ""запрещена""
			//        |				ИНАЧЕ """"
			//        |			КОНЕЦ
			//        |	КОНЕЦ КАК ЗапретСменыОплаты,
			//        |	ВЫБОР
			//        |		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа ЕСТЬ NULL
			//        |			ТОГДА """"
			//        |		ИНАЧЕ ВЫБОР
			//        |				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа
			//        |					ТОГДА ""Частичный выкуп""
			//        |				ИНАЧЕ """"
			//        |			КОНЕЦ
			//        |	КОНЕЦ КАК ЧастичныйВыкупСтарый,
			//        |	РеализацияТоваровУслуг.Контрагент КАК Покупатель,
			//        |	ВТ_Товары.НомерСтроки КАК НомерСтроки,
			//        |	ВТ_Товары.Доставка КАК Доставка,
			//        |	РеализацияТоваровУслуг.ИнтернетМагазинЯндекса КАК ИнтернетМагазинЯндекса,
			//        |	ТипыОплат.Ссылка КАК ТипОплатыСсылка,
			//        |	РеализацияТоваровУслуг.ВладелецТовара.Приоритет КАК ВладелецТовараПриоритет,
			//        |	РеализацияТоваровУслуг.ПредоплатаПоКредиту КАК ПредоплатаПоКредиту,
			//        |	ВЫБОР
			//        |		КОГДА РеализацияТоваровУслуг.ЗапретЧастичногоВыкупа
			//        |			ТОГДА ""запрещен""
			//        |		ИНАЧЕ """"
			//        |	КОНЕЦ КАК ЗапретЧастичногоВыкупа,
			//        |	ВЫБОР
			//        |		КОГДА РеализацияТоваровУслуг.ЗапретЧастичногоВыкупа
			//        |			ТОГДА ""Частичный выкуп""
			//        |		ИНАЧЕ """"
			//        |	КОНЕЦ КАК ЧастичныйВыкуп,
			//        |	КатегорииДоставки2014.Родитель КАК КатегорияДоставки,
			//        |	ПараметрыКонтрагентовСрезПоследних.МетодОплатыПодъёма КАК МетодОплатыПодъёма,
			//        |	ВЫБОР
			//        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.СОжиданием, ЛОЖЬ)
			//        |			ТОГДА ""С вскрытием""
			//        |		ИНАЧЕ ""Без вскрытия""
			//        |	КОНЕЦ КАК СОжиданием,
			//        |	ВТ_Товары.ТипЗаказа КАК ТипЗаказа,
			//        |	NULL КАК ДатаЗабора,
			//        |	NULL КАК МенеджерЗабора,
			//        |	ДополнительныеПараметрыЗаказа.КОплатеКлиентом КАК КОплатеКлиентом,
			//        |	РеализацияТоваровУслуг.УчитыватьИтогоКОплате КАК УчитыватьИтогоКОплате,
			//        |	ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ПодъемОплачен, ЛОЖЬ) КАК ПодъемОплачен,
			//        |	ДополнительныеПараметрыЗаказа.КатегорияДляРасчетаЗП КАК КатегорияДляРасчетаЗП,
			//        |	ДополнительныеПараметрыЗаказа.ДополнительныйНомерЗаказа КАК ДополнительныйНомерЗаказа,
			//        |	ВТ_Товары.ШК КАК ШК,
			//        |	ВТ_Товары.НомерПалетты КАК НомерЛог
			//        |ПОМЕСТИТЬ ВТ_Объединение
			//        |ИЗ
			//        |	ВТ_Товары КАК ВТ_Товары
			//        |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
			//        |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыОплат КАК ТипыОплат
			//        |			ПО РеализацияТоваровУслуг.ТипОплаты = ТипыОплат.Код
			//        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыКонтрагентов.СрезПоследних КАК ПараметрыКонтрагентовСрезПоследних
			//        |			ПО РеализацияТоваровУслуг.ВладелецТовара = ПараметрыКонтрагентовСрезПоследних.Контрагент
			//        |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КатегорииДоставки2014 КАК КатегорииДоставки2014
			//        |			ПО РеализацияТоваровУслуг.КатегорияДоставки = КатегорииДоставки2014.Категория
			//        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
			//        |			ПО РеализацияТоваровУслуг.Ссылка = ДополнительныеПараметрыЗаказа.Заказ
			//        |		ПО ВТ_Товары.Доставка.Номер = РеализацияТоваровУслуг.Номер
			//        |ГДЕ
			//        |	ВТ_Товары.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
			//        |
			//        |СГРУППИРОВАТЬ ПО
			//        |	ВТ_Товары.Номенклатура,
			//        |	ВТ_Товары.НоменклатураКод,
			//        |	ВТ_Товары.НоменклатураАртикул,
			//        |	ВТ_Товары.Количество,
			//        |	ВТ_Товары.Цена,
			//        |	ВТ_Товары.Сумма,
			//        |	ВТ_Товары.Вес,
			//        |	ВТ_Товары.Доставка.Номер,
			//        |	ВЫРАЗИТЬ(ВТ_Товары.Доставка.Адрес КАК СТРОКА(1000)),
			//        |	ВТ_Товары.Доставка.Телефон,
			//        |	РеализацияТоваровУслуг.ВладелецТовара,
			//        |	ВЫРАЗИТЬ(ВТ_Товары.Доставка.КомментарийКАдресуДоставки КАК СТРОКА(500)),
			//        |	ВЫРАЗИТЬ(ВТ_Товары.Доставка.Комментарий КАК СТРОКА(1000)),
			//        |	ВТ_Товары.Доставка.Дата,
			//        |	ВТ_Товары.Доставка.ВремяПрибытияС,
			//        |	ВТ_Товары.Доставка.ВремяПрибытияПо,
			//        |	ТипыОплат.Наименование,
			//        |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа,
			//        |	РеализацияТоваровУслуг.ВладелецТовара.ТелефонИнтернетМагазина,
			//        |	ВЫБОР
			//        |		КОГДА РеализацияТоваровУслуг.ТарифнаяСетка.Код = 2
			//        |			ТОГДА ""СРОЧНАЯ ДОСТАВКА""
			//        |		ИНАЧЕ """"
			//        |	КОНЕЦ,
			//        |	ВЫБОР
			//        |		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа ЕСТЬ NULL
			//        |			ТОГДА """"
			//        |		ИНАЧЕ ВЫБОР
			//        |				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа
			//        |					ТОГДА ""запрещен""
			//        |				ИНАЧЕ """"
			//        |			КОНЕЦ
			//        |	КОНЕЦ,
			//        |	ВЫБОР
			//        |		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретСменыОплаты ЕСТЬ NULL
			//        |			ТОГДА """"
			//        |		ИНАЧЕ ВЫБОР
			//        |				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретСменыОплаты
			//        |					ТОГДА ""запрещена""
			//        |				ИНАЧЕ """"
			//        |			КОНЕЦ
			//        |	КОНЕЦ,
			//        |	ВЫБОР
			//        |		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа ЕСТЬ NULL
			//        |			ТОГДА """"
			//        |		ИНАЧЕ ВЫБОР
			//        |				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа
			//        |					ТОГДА ""Частичный выкуп""
			//        |				ИНАЧЕ """"
			//        |			КОНЕЦ
			//        |	КОНЕЦ,
			//        |	ТипыОплат.Ссылка,
			//        |	ВЫБОР
			//        |		КОГДА РеализацияТоваровУслуг.ЗапретЧастичногоВыкупа
			//        |			ТОГДА ""запрещен""
			//        |		ИНАЧЕ """"
			//        |	КОНЕЦ,
			//        |	КатегорииДоставки2014.Родитель,
			//        |	ВТ_Товары.Доставка,
			//        |	ДополнительныеПараметрыЗаказа.КатегорияДляРасчетаЗП,
			//        |	РеализацияТоваровУслуг.ИнтернетМагазинЯндекса,
			//        |	ВЫБОР
			//        |		КОГДА РеализацияТоваровУслуг.ЗапретЧастичногоВыкупа
			//        |			ТОГДА ""Частичный выкуп""
			//        |		ИНАЧЕ """"
			//        |	КОНЕЦ,
			//        |	ВТ_Товары.ТипЗаказа,
			//        |	РеализацияТоваровУслуг.УчитыватьИтогоКОплате,
			//        |	ДополнительныеПараметрыЗаказа.ДополнительныйНомерЗаказа,
			//        |	РеализацияТоваровУслуг.Контрагент,
			//        |	ВЫБОР
			//        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.СОжиданием, ЛОЖЬ)
			//        |			ТОГДА ""С вскрытием""
			//        |		ИНАЧЕ ""Без вскрытия""
			//        |	КОНЕЦ,
			//        |	ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ПодъемОплачен, ЛОЖЬ),
			//        |	ПараметрыКонтрагентовСрезПоследних.МетодОплатыПодъёма,
			//        |	ВТ_Товары.ШК,
			//        |	ВТ_Товары.НомерСтроки,
			//        |	РеализацияТоваровУслуг.ВладелецТовара.Приоритет,
			//        |	РеализацияТоваровУслуг.ПредоплатаПоКредиту,
			//        |	ДополнительныеПараметрыЗаказа.КОплатеКлиентом,
			//        |	ВТ_Товары.НомерПалетты
			//        |
			//        |ОБЪЕДИНИТЬ ВСЕ
			//        |
			//        |ВЫБРАТЬ
			//        |	ВТ_Товары.Номенклатура,
			//        |	ВТ_Товары.НоменклатураКод,
			//        |	ВТ_Товары.НоменклатураАртикул,
			//        |	ВТ_Товары.Количество,
			//        |	ВТ_Товары.Цена,
			//        |	ВТ_Товары.Сумма,
			//        |	ВТ_Товары.Вес,
			//        |	ВТ_Товары.Доставка.Номер,
			//        |	ВЫРАЗИТЬ(ВТ_Товары.Доставка.АдресДоставки КАК СТРОКА(1000)),
			//        |	ВТ_Товары.Доставка.Телефон,
			//        |	ВТ_Товары.Доставка.Контрагент,
			//        |	NULL,
			//        |	ВЫРАЗИТЬ(ВТ_Товары.Доставка.Комментарий КАК СТРОКА(1000)),
			//        |	ВТ_Товары.Доставка.ДатаДоставки,
			//        |	ВТ_Товары.Доставка.ВремяДоставкиС,
			//        |	ВТ_Товары.Доставка.ВремяДоставкиПо,
			//        |	ТипыОплат.Наименование,
			//        |	ВТ_Товары.Доставка.НомерВнешнегоЗаказа,
			//        |	ВТ_Товары.Доставка.Контрагент.ТелефонИнтернетМагазина,
			//        |	NULL,
			//        |	NULL,
			//        |	NULL,
			//        |	NULL,
			//        |	ВТ_Товары.Доставка.Грузополучатель,
			//        |	ВТ_Товары.НомерСтроки,
			//        |	ВТ_Товары.Доставка,
			//        |	ВТ_Товары.Доставка.Контрагент,
			//        |	ТипыОплат.Ссылка,
			//        |	ВТ_Товары.Доставка.Контрагент.Приоритет,
			//        |	NULL,
			//        |	NULL,
			//        |	NULL,
			//        |	NULL,
			//        |	NULL,
			//        |	NULL,
			//        |	ВТ_Товары.ТипЗаказа,
			//        |	ВТ_Товары.Доставка.Дата,
			//        |	ВЫБОР
			//        |		КОГДА ВТ_Товары.Доставка.Автор = """"
			//        |			ТОГДА ""Не указан""
			//        |		ИНАЧЕ ВТ_Товары.Доставка.Автор
			//        |	КОНЕЦ,
			//        |	NULL,
			//        |	NULL,
			//        |	NULL,
			//        |	NULL,
			//        |	NULL,
			//        |	ВТ_Товары.ШК,
			//        |	ВТ_Товары.НомерПалетты
			//        |ИЗ
			//        |	ВТ_Товары КАК ВТ_Товары
			//        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыОплат КАК ТипыОплат
			//        |		ПО ВТ_Товары.Доставка.ТипОплаты = ТипыОплат.Код
			//        |ГДЕ
			//        |	ВТ_Товары.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор)
			//        |
			//        |СГРУППИРОВАТЬ ПО
			//        |	ВТ_Товары.Номенклатура,
			//        |	ВТ_Товары.НоменклатураКод,
			//        |	ВТ_Товары.НоменклатураАртикул,
			//        |	ВТ_Товары.Количество,
			//        |	ВТ_Товары.Цена,
			//        |	ВТ_Товары.Сумма,
			//        |	ВТ_Товары.Вес,
			//        |	ВТ_Товары.Доставка.Номер,
			//        |	ВЫРАЗИТЬ(ВТ_Товары.Доставка.АдресДоставки КАК СТРОКА(1000)),
			//        |	ВТ_Товары.Доставка.Телефон,
			//        |	ВТ_Товары.Доставка.Контрагент,
			//        |	ВЫРАЗИТЬ(ВТ_Товары.Доставка.Комментарий КАК СТРОКА(1000)),
			//        |	ВТ_Товары.Доставка.ДатаДоставки,
			//        |	ВТ_Товары.Доставка.ВремяДоставкиС,
			//        |	ВТ_Товары.Доставка.ВремяДоставкиПо,
			//        |	ТипыОплат.Наименование,
			//        |	ВТ_Товары.Доставка.НомерВнешнегоЗаказа,
			//        |	ВТ_Товары.Доставка.Контрагент.ТелефонИнтернетМагазина,
			//        |	ВТ_Товары.Доставка.Грузополучатель,
			//        |	ВТ_Товары.НомерСтроки,
			//        |	ВТ_Товары.Доставка,
			//        |	ТипыОплат.Ссылка,
			//        |	ВТ_Товары.Доставка.Контрагент.Приоритет,
			//        |	ВТ_Товары.ТипЗаказа,
			//        |	ВТ_Товары.Доставка.Дата,
			//        |	ВЫБОР
			//        |		КОГДА ВТ_Товары.Доставка.Автор = """"
			//        |			ТОГДА ""Не указан""
			//        |		ИНАЧЕ ВТ_Товары.Доставка.Автор
			//        |	КОНЕЦ,
			//        |	ВТ_Товары.ШК,
			//        |	ВТ_Товары.НомерПалетты,
			//        |	ВТ_Товары.Доставка.Контрагент
			//        |;
			//        |
			//        |////////////////////////////////////////////////////////////////////////////////
			//        |ВЫБРАТЬ
			//        |	ВТ_Объединение.Номенклатура КАК Номенклатура,
			//        |	ВТ_Объединение.НоменклатураКод КАК НоменклатураКод,
			//        |	ВТ_Объединение.НоменклатураАртикул КАК НоменклатураАртикул,
			//        |	ВТ_Объединение.Количество КАК Количество,
			//        |	ВТ_Объединение.Цена КАК Цена,
			//        |	ВТ_Объединение.Сумма КАК Сумма,
			//        |	ВТ_Объединение.Вес КАК Вес,
			//        |	ВТ_Объединение.Номер КАК Номер,
			//        |	ВТ_Объединение.АдресДоставки КАК АдресДоставки,
			//        |	ВТ_Объединение.ТелефонПокупателя КАК ТелефонПокупателя,
			//        |	ВТ_Объединение.Контрагент КАК Контрагент,
			//        |	ВТ_Объединение.КоммАдрес КАК КоммАдрес,
			//        |	ВТ_Объединение.Комментарий КАК Комментарий,
			//        |	ВТ_Объединение.ДатаДоставки КАК ДатаДоставки,
			//        |	ВТ_Объединение.ВремяПрибытияС КАК ВремяПрибытияС,
			//        |	ВТ_Объединение.ВремяПрибытияПо КАК ВремяПрибытияПо,
			//        |	ВТ_Объединение.ТипОплаты КАК ТипОплаты,
			//        |	ВТ_Объединение.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
			//        |	ВТ_Объединение.ТелефонИнтернетМагазина КАК ТелефонИнтернетМагазина,
			//        |	ВТ_Объединение.СрочнаяДоставка КАК СрочнаяДоставка,
			//        |	ВТ_Объединение.ЗапретЧастичногоВыкупаСтарый КАК ЗапретЧастичногоВыкупаСтарый,
			//        |	ВТ_Объединение.ЗапретСменыОплаты КАК ЗапретСменыОплаты,
			//        |	ВТ_Объединение.ЧастичныйВыкупСтарый КАК ЧастичныйВыкупСтарый,
			//        |	ВТ_Объединение.Покупатель КАК Покупатель,
			//        |	ВТ_Объединение.НомерСтроки КАК НомерСтроки,
			//        |	ВТ_Объединение.Доставка КАК Доставка,
			//        |	ВТ_Объединение.ИнтернетМагазинЯндекса КАК ИнтернетМагазинЯндекса,
			//        |	ВТ_Объединение.ТипОплатыСсылка КАК ТипОплатыСсылка,
			//        |	ВТ_Объединение.ВладелецТовараПриоритет КАК ВладелецТовараПриоритет,
			//        |	ВТ_Объединение.ПредоплатаПоКредиту КАК ПредоплатаПоКредиту,
			//        |	ВТ_Объединение.ЗапретЧастичногоВыкупа КАК ЗапретЧастичногоВыкупа,
			//        |	ВТ_Объединение.ЧастичныйВыкуп КАК ЧастичныйВыкуп,
			//        |	ВТ_Объединение.КатегорияДоставки КАК КатегорияДоставки,
			//        |	ВТ_Объединение.МетодОплатыПодъёма КАК МетодОплатыПодъёма,
			//        |	ВТ_Объединение.СОжиданием КАК СОжиданием,
			//        |	ВТ_Объединение.ТипЗаказа КАК ТипЗаказа,
			//        |	ВТ_Объединение.ДатаЗабора КАК ДатаЗабора,
			//        |	ВТ_Объединение.МенеджерЗабора КАК МенеджерЗабора,
			//        |	ВТ_Объединение.КОплатеКлиентом КАК КОплатеКлиентом,
			//        |	ВТ_Объединение.УчитыватьИтогоКОплате КАК УчитыватьИтогоКОплате,
			//        |	ВТ_Объединение.ПодъемОплачен КАК ПодъемОплачен,
			//        |	ВЫБОР
			//        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ШтрихкодOZON, """") <> """"
			//        |			ТОГДА ИСТИНА
			//        |		ИНАЧЕ ЛОЖЬ
			//        |	КОНЕЦ КАК Озон,
			//        |	ВТ_Объединение.КатегорияДляРасчетаЗП КАК КатегорияДляРасчетаЗП,
			//        |	ВТ_Объединение.ДополнительныйНомерЗаказа КАК ДополнительныйНомерЗаказа,
			//        |	ДополнительныеПараметрыЗаказа.Заказ КАК Заказ,
			//        |	ВТ_Объединение.ШК КАК ШК,
			//        |	ЕСТЬNULL(ВТ_Объединение.Доставка.ОбъемЗабора, 0) КАК ОбъемЗабора,
			//        |	ВТ_Объединение.НомерЛог КАК НомерЛог
			//        |ИЗ
			//        |	ВТ_Объединение КАК ВТ_Объединение
			//        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
			//        |		ПО ВТ_Объединение.Доставка.Номер = ДополнительныеПараметрыЗаказа.Заказ.Номер
			//        
			//        |СГРУППИРОВАТЬ ПО
			//        |	ВТ_Объединение.Номенклатура,
			//        |	ВТ_Объединение.НоменклатураКод,
			//        |	ВТ_Объединение.НоменклатураАртикул,
			//        |	ВТ_Объединение.Количество,
			//        |	ВТ_Объединение.Цена,
			//        |	ВТ_Объединение.Сумма,
			//        |	ВТ_Объединение.Вес,
			//        |	ВТ_Объединение.Номер,
			//        |	ВТ_Объединение.ТелефонПокупателя,
			//        |	ВТ_Объединение.Контрагент,
			//        |	ВТ_Объединение.КоммАдрес,
			//        |	ВТ_Объединение.ДатаДоставки,
			//        |	ВТ_Объединение.ВремяПрибытияС,
			//        |	ВТ_Объединение.ВремяПрибытияПо,
			//        |	ВТ_Объединение.ТипОплаты,
			//        |	ВТ_Объединение.НомерВнешнегоЗаказа,
			//        |	ВТ_Объединение.ТелефонИнтернетМагазина,
			//        |	ВТ_Объединение.СрочнаяДоставка,
			//        |	ВТ_Объединение.ЗапретЧастичногоВыкупаСтарый,
			//        |	ВТ_Объединение.ЗапретСменыОплаты,
			//        |	ВТ_Объединение.ЧастичныйВыкупСтарый,
			//        |	ВТ_Объединение.Покупатель,
			//        |	ВТ_Объединение.НомерСтроки,
			//        |	ВТ_Объединение.Доставка,
			//        |	ВТ_Объединение.ИнтернетМагазинЯндекса,
			//        |	ВТ_Объединение.ТипОплатыСсылка,
			//        |	ВТ_Объединение.ВладелецТовараПриоритет,
			//        |	ВТ_Объединение.ПредоплатаПоКредиту,
			//        |	ВТ_Объединение.ЗапретЧастичногоВыкупа,
			//        |	ВТ_Объединение.ЧастичныйВыкуп,
			//        |	ВТ_Объединение.КатегорияДоставки,
			//        |	ВТ_Объединение.МетодОплатыПодъёма,
			//        |	ВТ_Объединение.СОжиданием,
			//        |	ВТ_Объединение.ТипЗаказа,
			//        |	ВТ_Объединение.ДатаЗабора,
			//        |	ВТ_Объединение.МенеджерЗабора,
			//        |	ВТ_Объединение.КОплатеКлиентом,
			//        |	ВТ_Объединение.УчитыватьИтогоКОплате,
			//        |	ВТ_Объединение.ПодъемОплачен,
			//        |	ВЫБОР
			//        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ШтрихкодOZON, """") <> """"
			//        |			ТОГДА ИСТИНА
			//        |		ИНАЧЕ ЛОЖЬ
			//        |	КОНЕЦ,
			//        |	ВТ_Объединение.КатегорияДляРасчетаЗП,
			//        |	ВТ_Объединение.ДополнительныйНомерЗаказа,
			//        |	ДополнительныеПараметрыЗаказа.Заказ,
			//        |	ВТ_Объединение.ШК,
			//        |	ЕСТЬNULL(ВТ_Объединение.Доставка.ОбъемЗабора, 0),
			//        |	ВТ_Объединение.АдресДоставки,
			//        |	ВТ_Объединение.Комментарий,
			//        |	ВТ_Объединение.НомерЛог
			//        |
			//        |УПОРЯДОЧИТЬ ПО
			//        |	ТипЗаказа, 
			//        |	ВладелецТовараПриоритет,
			//        |	Номер,
			//        |	НомерСтроки,
			//        |	Номенклатура
			//        |ИТОГИ
			//        |	СУММА(Количество),
			//        |	СУММА(Сумма),
			//        |	СУММА(Вес),
			//        |	МАКСИМУМ(АдресДоставки),
			//        |	МАКСИМУМ(ТелефонПокупателя),
			//        |	МАКСИМУМ(Контрагент),
			//        |	МАКСИМУМ(КоммАдрес),
			//        |	МАКСИМУМ(Комментарий),
			//        |	МАКСИМУМ(ДатаДоставки),
			//        |	МАКСИМУМ(ВремяПрибытияС),
			//        |	МАКСИМУМ(ВремяПрибытияПо),
			//        |	МАКСИМУМ(ТипОплаты),
			//        |	МАКСИМУМ(НомерВнешнегоЗаказа),
			//        |	МАКСИМУМ(ТелефонИнтернетМагазина),
			//        |	МАКСИМУМ(СрочнаяДоставка),
			//        |	МАКСИМУМ(ЗапретЧастичногоВыкупаСтарый),
			//        |	МАКСИМУМ(ЗапретСменыОплаты),
			//        |	МАКСИМУМ(ЧастичныйВыкупСтарый),
			//        |	МАКСИМУМ(Покупатель),
			//        |	МАКСИМУМ(Доставка),
			//        |	МАКСИМУМ(ИнтернетМагазинЯндекса),
			//        |	МАКСИМУМ(ТипОплатыСсылка),
			//        |	МАКСИМУМ(ВладелецТовараПриоритет),
			//        |	МАКСИМУМ(ПредоплатаПоКредиту),
			//        |	МАКСИМУМ(ЗапретЧастичногоВыкупа),
			//        |	МАКСИМУМ(ЧастичныйВыкуп),
			//        |	МАКСИМУМ(КатегорияДоставки),
			//        |	МАКСИМУМ(МетодОплатыПодъёма),
			//        |	МАКСИМУМ(СОжиданием),
			//        |	МАКСИМУМ(ДатаЗабора),
			//        |	МАКСИМУМ(МенеджерЗабора),
			//        |	МАКСИМУМ(КОплатеКлиентом),
			//        |	МАКСИМУМ(УчитыватьИтогоКОплате),
			//        |	МАКСИМУМ(ПодъемОплачен),
			//        |	МАКСИМУМ(Озон),
			//        |	МАКСИМУМ(КатегорияДляРасчетаЗП),
			//        |	МАКСИМУМ(ДополнительныйНомерЗаказа),
			//        |	МАКСИМУМ(Заказ),
			//        |	МАКСИМУМ(НомерЛог)
			//        |ПО
			//        |	ТипЗаказа,
			//        |	Номер
			//        |АВТОУПОРЯДОЧИВАНИЕ";
	
	Возврат
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Заказ
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	Документ.Рейс.Заказы КАК РейсЗаказы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО (РейсЗаказы.Ссылка = &Рейс)
	|			И (НЕ РейсЗаказы.УдаленИзРейса)
	|			И (РейсЗаказы.Ссылка.ТерминалДоставки = &ТерминалДоставки)
	|			И РейсЗаказы.Заказ = РеализацияТоваровУслуг.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПараметрыТарифаЗаказаСрезПоследних.Заказ КАК Заказ,
	|	ПараметрыТарифаЗаказаСрезПоследних.КатегорияДоставки КАК КатегорияДоставки
	|ПОМЕСТИТЬ ВТ_ПараметрыТарифаЗаказа
	|ИЗ
	|	РегистрСведений.ПараметрыТарифаЗаказа.СрезПоследних(
	|			,
	|			Заказ В
	|				(ВЫБРАТЬ
	|					ВТ_Заказы.Заказ КАК Заказ
	|				ИЗ
	|					ВТ_Заказы КАК ВТ_Заказы)) КАК ПараметрыТарифаЗаказаСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	новаМестнаяДоставка.Ссылка КАК Доставка,
	|	РейсЗаказы.Заказ КАК Заказ,
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)) КАК ТипЗаказа,
	|	РейсЗаказы.Ссылка.НомерПалетты КАК НомерПалетты
	|ПОМЕСТИТЬ ВТ_Доставки
	|ИЗ
	|	Документ.Рейс.Заказы КАК РейсЗаказы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БизнесПроцесс.новаМестнаяДоставка КАК новаМестнаяДоставка
	|		ПО (ВЫРАЗИТЬ(РейсЗаказы.Заказ КАК Документ.РеализацияТоваровУслуг).Номер = новаМестнаяДоставка.Номер)
	|ГДЕ
	|	РейсЗаказы.Ссылка = &Рейс
	|	И НЕ РейсЗаказы.УдаленИзРейса
	|	И РейсЗаказы.Ссылка.ТерминалДоставки = &ТерминалДоставки
	|
	|СГРУППИРОВАТЬ ПО
	|	новаМестнаяДоставка.Ссылка,
	|	РейсЗаказы.Заказ,
	|	РейсЗаказы.Ссылка.НомерПалетты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РейсЗаказы.Заказ,
	|	РейсЗаказы.Заказ,
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор)),
	|	РейсЗаказы.Ссылка.НомерПалетты
	|ИЗ
	|	Документ.Рейс.Заказы КАК РейсЗаказы
	|ГДЕ
	|	РейсЗаказы.Ссылка = &Рейс
	|	И РейсЗаказы.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаборТовара.ПустаяСсылка)
	|	И РейсЗаказы.Заказ ССЫЛКА Документ.ЗаборТовара
	|	И НЕ РейсЗаказы.УдаленИзРейса
	|	И РейсЗаказы.Ссылка.ТерминалДоставки = &ТерминалДоставки
	|
	|СГРУППИРОВАТЬ ПО
	|	РейсЗаказы.Заказ,
	|	РейсЗаказы.Ссылка.НомерПалетты,
	|	РейсЗаказы.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	РеализацияТоваровУслугТовары.Номенклатура.Код КАК НоменклатураКод,
	|	РеализацияТоваровУслугТовары.Номенклатура.Артикул КАК НоменклатураАртикул,
	|	РеализацияТоваровУслугТовары.Количество КАК Количество,
	|	РеализацияТоваровУслугТовары.Цена КАК Цена,
	|	РеализацияТоваровУслугТовары.Сумма КАК Сумма,
	|	РеализацияТоваровУслугТовары.Вес * РеализацияТоваровУслугТовары.Количество КАК Вес,
	|	ВТ_Доставки.Доставка КАК Доставка,
	|	РеализацияТоваровУслугТовары.НомерСтроки КАК НомерСтроки,
	|	ВТ_Доставки.ТипЗаказа КАК ТипЗаказа,
	|	РеализацияТоваровУслугТовары.ШтрихкодНоменклатуры КАК ШК,
	|	ВТ_Доставки.НомерПалетты КАК НомерПалетты
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	ВТ_Доставки КАК ВТ_Доставки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ПО (ВЫРАЗИТЬ(ВТ_Доставки.Доставка КАК БизнесПроцесс.новаМестнаяДоставка).Номер = РеализацияТоваровУслугТовары.Ссылка.Номер)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура,
	|	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура.Код,
	|	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура.Артикул,
	|	РеализацияТоваровУслугПодарочныеПозиции.Количество,
	|	РеализацияТоваровУслугПодарочныеПозиции.Цена,
	|	РеализацияТоваровУслугПодарочныеПозиции.Сумма,
	|	РеализацияТоваровУслугПодарочныеПозиции.Вес * РеализацияТоваровУслугПодарочныеПозиции.Количество,
	|	ВТ_Доставки.Доставка,
	|	РеализацияТоваровУслугПодарочныеПозиции.НомерСтроки,
	|	ВТ_Доставки.ТипЗаказа,
	|	РеализацияТоваровУслугПодарочныеПозиции.ШтрихкодНоменклатуры,
	|	ВТ_Доставки.НомерПалетты
	|ИЗ
	|	ВТ_Доставки КАК ВТ_Доставки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.ПодарочныеПозиции КАК РеализацияТоваровУслугПодарочныеПозиции
	|		ПО (ВЫРАЗИТЬ(ВТ_Доставки.Доставка КАК БизнесПроцесс.новаМестнаяДоставка).Номер = РеализацияТоваровУслугПодарочныеПозиции.Ссылка.Номер)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратТоваровОтПокупателяТовары.Номенклатура,
	|	ВозвратТоваровОтПокупателяТовары.Номенклатура.Код,
	|	ВозвратТоваровОтПокупателяТовары.Номенклатура.Артикул,
	|	-ВозвратТоваровОтПокупателяТовары.Количество,
	|	ВозвратТоваровОтПокупателяТовары.Цена,
	|	-ВозвратТоваровОтПокупателяТовары.Сумма,
	|	NULL,
	|	ВТ_Доставки.Доставка,
	|	ВозвратТоваровОтПокупателяТовары.НомерСтроки,
	|	ВТ_Доставки.ТипЗаказа,
	|	ВозвратТоваровОтПокупателяТовары.ШтрихкодНоменклатуры,
	|	ВТ_Доставки.НомерПалетты
	|ИЗ
	|	ВТ_Доставки КАК ВТ_Доставки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
	|		ПО (ВЫРАЗИТЬ(ВТ_Доставки.Доставка КАК БизнесПроцесс.новаМестнаяДоставка).Номер = ВозвратТоваровОтПокупателяТовары.Ссылка.Номер)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Доставка"",
	|	NULL,
	|	NULL,
	|	МАКСИМУМ(1),
	|	NULL,
	|	МАКСИМУМ(ВТ_Доставки.Доставка.СтоимостьДоставкиДоМКАД),
	|	NULL,
	|	ВТ_Доставки.Доставка,
	|	998,
	|	МАКСИМУМ(ВТ_Доставки.ТипЗаказа),
	|	NULL,
	|	ВТ_Доставки.НомерПалетты
	|ИЗ
	|	ВТ_Доставки КАК ВТ_Доставки
	|ГДЕ
	|	ВТ_Доставки.Доставка.СтоимостьДоставкиДоМКАД <> 0
	|	И ВТ_Доставки.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Доставки.Доставка,
	|	ВТ_Доставки.НомерПалетты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Доставка"",
	|	NULL,
	|	NULL,
	|	МАКСИМУМ(1),
	|	NULL,
	|	МАКСИМУМ(ВТ_Доставки.Доставка.СтоимостьДоставкиЗаМКАД),
	|	NULL,
	|	ВТ_Доставки.Доставка,
	|	999,
	|	МАКСИМУМ(ВТ_Доставки.ТипЗаказа),
	|	NULL,
	|	ВТ_Доставки.НомерПалетты
	|ИЗ
	|	ВТ_Доставки КАК ВТ_Доставки
	|ГДЕ
	|	ВТ_Доставки.Доставка.СтоимостьДоставкиЗаМКАД <> 0
	|	И ВТ_Доставки.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Доставки.Доставка,
	|	ВТ_Доставки.НомерПалетты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаборТовараТовары.Номенклатура,
	|	ЗаборТовараТовары.Номенклатура.Код,
	|	ЗаборТовараТовары.Номенклатура.Артикул,
	|	СУММА(ЗаборТовараТовары.Количество),
	|	МАКСИМУМ(ЗаборТовараТовары.Цена),
	|	СУММА(ЗаборТовараТовары.Сумма),
	|	СУММА(ЗаборТовараТовары.Вес * ЗаборТовараТовары.Количество),
	|	ВТ_Доставки.Доставка,
	|	ЗаборТовараТовары.НомерСтроки,
	|	ВТ_Доставки.ТипЗаказа,
	|	NULL,
	|	ВТ_Доставки.НомерПалетты
	|ИЗ
	|	ВТ_Доставки КАК ВТ_Доставки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаборТовара КАК ЗаборТовара
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаборТовара.Товары КАК ЗаборТовараТовары
	|			ПО ЗаборТовара.Ссылка = ЗаборТовараТовары.Ссылка
	|		ПО (ВЫРАЗИТЬ(ВТ_Доставки.Доставка КАК Документ.ЗаборТовара).Номер = ЗаборТовара.Номер)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаборТовараТовары.Номенклатура,
	|	ЗаборТовараТовары.Номенклатура.Код,
	|	ЗаборТовараТовары.Номенклатура.Артикул,
	|	ВТ_Доставки.Доставка,
	|	ЗаборТовараТовары.НомерСтроки,
	|	ВТ_Доставки.ТипЗаказа,
	|	ВТ_Доставки.НомерПалетты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Товары.Номенклатура КАК Номенклатура,
	|	ВТ_Товары.НоменклатураКод КАК НоменклатураКод,
	|	ВТ_Товары.НоменклатураАртикул КАК НоменклатураАртикул,
	|	ВТ_Товары.Количество КАК Количество,
	|	ВТ_Товары.Цена КАК Цена,
	|	ВТ_Товары.Сумма КАК Сумма,
	|	ВТ_Товары.Вес КАК Вес,
	|	ВТ_Товары.Доставка.Номер КАК Номер,
	|	ВЫРАЗИТЬ(ВТ_Товары.Доставка.Адрес КАК СТРОКА(1000)) КАК АдресДоставки,
	|	ВТ_Товары.Доставка.Телефон КАК ТелефонПокупателя,
	|	РеализацияТоваровУслуг.ВладелецТовара КАК Контрагент,
	|	ВЫРАЗИТЬ(ВТ_Товары.Доставка.КомментарийКАдресуДоставки КАК СТРОКА(500)) КАК КоммАдрес,
	|	ВЫРАЗИТЬ(ВТ_Товары.Доставка.Комментарий КАК СТРОКА(1000)) КАК Комментарий,
	|	ВТ_Товары.Доставка.Дата КАК ДатаДоставки,
	|	ВТ_Товары.Доставка.ВремяПрибытияС КАК ВремяПрибытияС,
	|	ВТ_Товары.Доставка.ВремяПрибытияПо КАК ВремяПрибытияПо,
	|	ТипыОплат.Наименование КАК ТипОплаты,
	|	РеализацияТоваровУслуг.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
	|	РеализацияТоваровУслуг.ВладелецТовара.ТелефонИнтернетМагазина КАК ТелефонИнтернетМагазина,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.ТарифнаяСетка.Код = 2
	|			ТОГДА ""СРОЧНАЯ ДОСТАВКА""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК СрочнаяДоставка,
	|	ВЫБОР
	|		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа ЕСТЬ NULL
	|			ТОГДА """"
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа
	|					ТОГДА ""запрещен""
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ЗапретЧастичногоВыкупаСтарый,
	|	ВЫБОР
	|		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретСменыОплаты ЕСТЬ NULL
	|			ТОГДА """"
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретСменыОплаты
	|					ТОГДА ""запрещена""
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ЗапретСменыОплаты,
	|	ВЫБОР
	|		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа ЕСТЬ NULL
	|			ТОГДА """"
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа
	|					ТОГДА ""Частичный выкуп""
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ЧастичныйВыкупСтарый,
	|	РеализацияТоваровУслуг.Контрагент КАК Покупатель,
	|	ВТ_Товары.НомерСтроки КАК НомерСтроки,
	|	ВТ_Товары.Доставка КАК Доставка,
	|	РеализацияТоваровУслуг.ИнтернетМагазинЯндекса КАК ИнтернетМагазинЯндекса,
	|	ТипыОплат.Ссылка КАК ТипОплатыСсылка,
	|	РеализацияТоваровУслуг.ВладелецТовара.Приоритет КАК ВладелецТовараПриоритет,
	|	РеализацияТоваровУслуг.ПредоплатаПоКредиту КАК ПредоплатаПоКредиту,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.ЗапретЧастичногоВыкупа
	|			ТОГДА ""запрещен""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ЗапретЧастичногоВыкупа,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.ЗапретЧастичногоВыкупа
	|			ТОГДА ""Частичный выкуп""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ЧастичныйВыкуп,
	|	ЕСТЬNULL(ВТ_ПараметрыТарифаЗаказа.КатегорияДоставки.Родитель, ЗНАЧЕНИЕ(Справочник.КатегорииДоставки2014.ПустаяСсылка)) КАК КатегорияДоставки,
	|	ПараметрыКонтрагентовСрезПоследних.МетодОплатыПодъёма КАК МетодОплатыПодъёма,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.СОжиданием, ЛОЖЬ)
	|			ТОГДА ""С вскрытием""
	|		ИНАЧЕ ""Без вскрытия""
	|	КОНЕЦ КАК СОжиданием,
	|	ВТ_Товары.ТипЗаказа КАК ТипЗаказа,
	|	NULL КАК ДатаЗабора,
	|	NULL КАК МенеджерЗабора,
	|	ДополнительныеПараметрыЗаказа.КОплатеКлиентом КАК КОплатеКлиентом,
	|	РеализацияТоваровУслуг.УчитыватьИтогоКОплате КАК УчитыватьИтогоКОплате,
	|	ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ПодъемОплачен, ЛОЖЬ) КАК ПодъемОплачен,
	|	ДополнительныеПараметрыЗаказа.КатегорияДляРасчетаЗП КАК КатегорияДляРасчетаЗП,
	|	ДополнительныеПараметрыЗаказа.ДополнительныйНомерЗаказа КАК ДополнительныйНомерЗаказа,
	|	ВТ_Товары.ШК КАК ШК,
	|	ВТ_Товары.НомерПалетты КАК НомерЛог
	|ПОМЕСТИТЬ ВТ_Объединение
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыОплат КАК ТипыОплат
	|			ПО РеализацияТоваровУслуг.ТипОплаты = ТипыОплат.Код
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыКонтрагентов.СрезПоследних КАК ПараметрыКонтрагентовСрезПоследних
	|			ПО РеализацияТоваровУслуг.ВладелецТовара = ПараметрыКонтрагентовСрезПоследних.Контрагент
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
	|			ПО РеализацияТоваровУслуг.Ссылка = ДополнительныеПараметрыЗаказа.Заказ
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыТарифаЗаказа КАК ВТ_ПараметрыТарифаЗаказа
	|			ПО РеализацияТоваровУслуг.Ссылка = ВТ_ПараметрыТарифаЗаказа.Заказ
	|		ПО ВТ_Товары.Доставка.Номер = РеализацияТоваровУслуг.Номер
	|ГДЕ
	|	ВТ_Товары.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Товары.Номенклатура,
	|	ВТ_Товары.НоменклатураКод,
	|	ВТ_Товары.НоменклатураАртикул,
	|	ВТ_Товары.Количество,
	|	ВТ_Товары.Цена,
	|	ВТ_Товары.Сумма,
	|	ВТ_Товары.Вес,
	|	ВТ_Товары.Доставка.Номер,
	|	ВЫРАЗИТЬ(ВТ_Товары.Доставка.Адрес КАК СТРОКА(1000)),
	|	ВТ_Товары.Доставка.Телефон,
	|	РеализацияТоваровУслуг.ВладелецТовара,
	|	ВЫРАЗИТЬ(ВТ_Товары.Доставка.КомментарийКАдресуДоставки КАК СТРОКА(500)),
	|	ВЫРАЗИТЬ(ВТ_Товары.Доставка.Комментарий КАК СТРОКА(1000)),
	|	ВТ_Товары.Доставка.Дата,
	|	ВТ_Товары.Доставка.ВремяПрибытияС,
	|	ВТ_Товары.Доставка.ВремяПрибытияПо,
	|	ТипыОплат.Наименование,
	|	РеализацияТоваровУслуг.НомерВнешнегоЗаказа,
	|	РеализацияТоваровУслуг.ВладелецТовара.ТелефонИнтернетМагазина,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.ТарифнаяСетка.Код = 2
	|			ТОГДА ""СРОЧНАЯ ДОСТАВКА""
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа ЕСТЬ NULL
	|			ТОГДА """"
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа
	|					ТОГДА ""запрещен""
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретСменыОплаты ЕСТЬ NULL
	|			ТОГДА """"
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретСменыОплаты
	|					ТОГДА ""запрещена""
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа ЕСТЬ NULL
	|			ТОГДА """"
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа
	|					ТОГДА ""Частичный выкуп""
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ТипыОплат.Ссылка,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.ЗапретЧастичногоВыкупа
	|			ТОГДА ""запрещен""
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВТ_Товары.Доставка,
	|	ДополнительныеПараметрыЗаказа.КатегорияДляРасчетаЗП,
	|	РеализацияТоваровУслуг.ИнтернетМагазинЯндекса,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.ЗапретЧастичногоВыкупа
	|			ТОГДА ""Частичный выкуп""
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВТ_Товары.ТипЗаказа,
	|	РеализацияТоваровУслуг.УчитыватьИтогоКОплате,
	|	ДополнительныеПараметрыЗаказа.ДополнительныйНомерЗаказа,
	|	РеализацияТоваровУслуг.Контрагент,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.СОжиданием, ЛОЖЬ)
	|			ТОГДА ""С вскрытием""
	|		ИНАЧЕ ""Без вскрытия""
	|	КОНЕЦ,
	|	ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ПодъемОплачен, ЛОЖЬ),
	|	ПараметрыКонтрагентовСрезПоследних.МетодОплатыПодъёма,
	|	ВТ_Товары.ШК,
	|	ВТ_Товары.НомерСтроки,
	|	РеализацияТоваровУслуг.ВладелецТовара.Приоритет,
	|	РеализацияТоваровУслуг.ПредоплатаПоКредиту,
	|	ДополнительныеПараметрыЗаказа.КОплатеКлиентом,
	|	ВТ_Товары.НомерПалетты,
	|	ЕСТЬNULL(ВТ_ПараметрыТарифаЗаказа.КатегорияДоставки.Родитель, ЗНАЧЕНИЕ(Справочник.КатегорииДоставки2014.ПустаяСсылка))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Товары.Номенклатура,
	|	ВТ_Товары.НоменклатураКод,
	|	ВТ_Товары.НоменклатураАртикул,
	|	ВТ_Товары.Количество,
	|	ВТ_Товары.Цена,
	|	ВТ_Товары.Сумма,
	|	ВТ_Товары.Вес,
	|	ВТ_Товары.Доставка.Номер,
	|	ВЫРАЗИТЬ(ВТ_Товары.Доставка.АдресДоставки КАК СТРОКА(1000)),
	|	ВТ_Товары.Доставка.Телефон,
	|	ВТ_Товары.Доставка.Контрагент,
	|	NULL,
	|	ВЫРАЗИТЬ(ВТ_Товары.Доставка.Комментарий КАК СТРОКА(1000)),
	|	ВТ_Товары.Доставка.ДатаДоставки,
	|	ВТ_Товары.Доставка.ВремяДоставкиС,
	|	ВТ_Товары.Доставка.ВремяДоставкиПо,
	|	ТипыОплат.Наименование,
	|	ВТ_Товары.Доставка.НомерВнешнегоЗаказа,
	|	ВТ_Товары.Доставка.Контрагент.ТелефонИнтернетМагазина,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВТ_Товары.Доставка.Грузополучатель,
	|	ВТ_Товары.НомерСтроки,
	|	ВТ_Товары.Доставка,
	|	ВТ_Товары.Доставка.Контрагент,
	|	ТипыОплат.Ссылка,
	|	ВТ_Товары.Доставка.Контрагент.Приоритет,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВТ_Товары.ТипЗаказа,
	|	ВТ_Товары.Доставка.Дата,
	|	ВЫБОР
	|		КОГДА ВТ_Товары.Доставка.Автор = """"
	|			ТОГДА ""Не указан""
	|		ИНАЧЕ ВТ_Товары.Доставка.Автор
	|	КОНЕЦ,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВТ_Товары.ШК,
	|	ВТ_Товары.НомерПалетты
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыОплат КАК ТипыОплат
	|		ПО ВТ_Товары.Доставка.ТипОплаты = ТипыОплат.Код
	|ГДЕ
	|	ВТ_Товары.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Товары.Номенклатура,
	|	ВТ_Товары.НоменклатураКод,
	|	ВТ_Товары.НоменклатураАртикул,
	|	ВТ_Товары.Количество,
	|	ВТ_Товары.Цена,
	|	ВТ_Товары.Сумма,
	|	ВТ_Товары.Вес,
	|	ВТ_Товары.Доставка.Номер,
	|	ВЫРАЗИТЬ(ВТ_Товары.Доставка.АдресДоставки КАК СТРОКА(1000)),
	|	ВТ_Товары.Доставка.Телефон,
	|	ВТ_Товары.Доставка.Контрагент,
	|	ВЫРАЗИТЬ(ВТ_Товары.Доставка.Комментарий КАК СТРОКА(1000)),
	|	ВТ_Товары.Доставка.ДатаДоставки,
	|	ВТ_Товары.Доставка.ВремяДоставкиС,
	|	ВТ_Товары.Доставка.ВремяДоставкиПо,
	|	ТипыОплат.Наименование,
	|	ВТ_Товары.Доставка.НомерВнешнегоЗаказа,
	|	ВТ_Товары.Доставка.Контрагент.ТелефонИнтернетМагазина,
	|	ВТ_Товары.Доставка.Грузополучатель,
	|	ВТ_Товары.НомерСтроки,
	|	ВТ_Товары.Доставка,
	|	ТипыОплат.Ссылка,
	|	ВТ_Товары.Доставка.Контрагент.Приоритет,
	|	ВТ_Товары.ТипЗаказа,
	|	ВТ_Товары.Доставка.Дата,
	|	ВЫБОР
	|		КОГДА ВТ_Товары.Доставка.Автор = """"
	|			ТОГДА ""Не указан""
	|		ИНАЧЕ ВТ_Товары.Доставка.Автор
	|	КОНЕЦ,
	|	ВТ_Товары.ШК,
	|	ВТ_Товары.НомерПалетты,
	|	ВТ_Товары.Доставка.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Объединение.Номенклатура КАК Номенклатура,
	|	ВТ_Объединение.НоменклатураКод КАК НоменклатураКод,
	|	ВТ_Объединение.НоменклатураАртикул КАК НоменклатураАртикул,
	|	ВТ_Объединение.Количество КАК Количество,
	|	ВТ_Объединение.Цена КАК Цена,
	|	ВТ_Объединение.Сумма КАК Сумма,
	|	ВТ_Объединение.Вес КАК Вес,
	|	ВТ_Объединение.Номер КАК Номер,
	|	ВТ_Объединение.АдресДоставки КАК АдресДоставки,
	|	ВТ_Объединение.ТелефонПокупателя КАК ТелефонПокупателя,
	|	ВТ_Объединение.Контрагент КАК Контрагент,
	|	ВТ_Объединение.КоммАдрес КАК КоммАдрес,
	|	ВТ_Объединение.Комментарий КАК Комментарий,
	|	ВТ_Объединение.ДатаДоставки КАК ДатаДоставки,
	|	ВТ_Объединение.ВремяПрибытияС КАК ВремяПрибытияС,
	|	ВТ_Объединение.ВремяПрибытияПо КАК ВремяПрибытияПо,
	|	ВТ_Объединение.ТипОплаты КАК ТипОплаты,
	|	ВТ_Объединение.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
	|	ВТ_Объединение.ТелефонИнтернетМагазина КАК ТелефонИнтернетМагазина,
	|	ВТ_Объединение.СрочнаяДоставка КАК СрочнаяДоставка,
	|	ВТ_Объединение.ЗапретЧастичногоВыкупаСтарый КАК ЗапретЧастичногоВыкупаСтарый,
	|	ВТ_Объединение.ЗапретСменыОплаты КАК ЗапретСменыОплаты,
	|	ВТ_Объединение.ЧастичныйВыкупСтарый КАК ЧастичныйВыкупСтарый,
	|	ВТ_Объединение.Покупатель КАК Покупатель,
	|	ВТ_Объединение.НомерСтроки КАК НомерСтроки,
	|	ВТ_Объединение.Доставка КАК Доставка,
	|	ВТ_Объединение.ИнтернетМагазинЯндекса КАК ИнтернетМагазинЯндекса,
	|	ВТ_Объединение.ТипОплатыСсылка КАК ТипОплатыСсылка,
	|	ВТ_Объединение.ВладелецТовараПриоритет КАК ВладелецТовараПриоритет,
	|	ВТ_Объединение.ПредоплатаПоКредиту КАК ПредоплатаПоКредиту,
	|	ВТ_Объединение.ЗапретЧастичногоВыкупа КАК ЗапретЧастичногоВыкупа,
	|	ВТ_Объединение.ЧастичныйВыкуп КАК ЧастичныйВыкуп,
	|	ВТ_Объединение.КатегорияДоставки КАК КатегорияДоставки,
	|	ВТ_Объединение.МетодОплатыПодъёма КАК МетодОплатыПодъёма,
	|	ВТ_Объединение.СОжиданием КАК СОжиданием,
	|	ВТ_Объединение.ТипЗаказа КАК ТипЗаказа,
	|	ВТ_Объединение.ДатаЗабора КАК ДатаЗабора,
	|	ВТ_Объединение.МенеджерЗабора КАК МенеджерЗабора,
	|	ВТ_Объединение.КОплатеКлиентом КАК КОплатеКлиентом,
	|	ВТ_Объединение.УчитыватьИтогоКОплате КАК УчитыватьИтогоКОплате,
	|	ВТ_Объединение.ПодъемОплачен КАК ПодъемОплачен,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ШтрихкодOZON, """") <> """"
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Озон,
	|	ВТ_Объединение.КатегорияДляРасчетаЗП КАК КатегорияДляРасчетаЗП,
	|	ВТ_Объединение.ДополнительныйНомерЗаказа КАК ДополнительныйНомерЗаказа,
	|	ДополнительныеПараметрыЗаказа.Заказ КАК Заказ,
	|	ВТ_Объединение.ШК КАК ШК,
	|	ЕСТЬNULL(ВТ_Объединение.Доставка.ОбъемЗабора, 0) КАК ОбъемЗабора,
	|	ВТ_Объединение.НомерЛог КАК НомерЛог
	|ИЗ
	|	ВТ_Объединение КАК ВТ_Объединение
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
	|		ПО ВТ_Объединение.Доставка.Номер = ДополнительныеПараметрыЗаказа.Заказ.Номер
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Объединение.Номенклатура,
	|	ВТ_Объединение.НоменклатураКод,
	|	ВТ_Объединение.НоменклатураАртикул,
	|	ВТ_Объединение.Количество,
	|	ВТ_Объединение.Цена,
	|	ВТ_Объединение.Сумма,
	|	ВТ_Объединение.Вес,
	|	ВТ_Объединение.Номер,
	|	ВТ_Объединение.ТелефонПокупателя,
	|	ВТ_Объединение.Контрагент,
	|	ВТ_Объединение.КоммАдрес,
	|	ВТ_Объединение.ДатаДоставки,
	|	ВТ_Объединение.ВремяПрибытияС,
	|	ВТ_Объединение.ВремяПрибытияПо,
	|	ВТ_Объединение.ТипОплаты,
	|	ВТ_Объединение.НомерВнешнегоЗаказа,
	|	ВТ_Объединение.ТелефонИнтернетМагазина,
	|	ВТ_Объединение.СрочнаяДоставка,
	|	ВТ_Объединение.ЗапретЧастичногоВыкупаСтарый,
	|	ВТ_Объединение.ЗапретСменыОплаты,
	|	ВТ_Объединение.ЧастичныйВыкупСтарый,
	|	ВТ_Объединение.Покупатель,
	|	ВТ_Объединение.НомерСтроки,
	|	ВТ_Объединение.Доставка,
	|	ВТ_Объединение.ИнтернетМагазинЯндекса,
	|	ВТ_Объединение.ТипОплатыСсылка,
	|	ВТ_Объединение.ВладелецТовараПриоритет,
	|	ВТ_Объединение.ПредоплатаПоКредиту,
	|	ВТ_Объединение.ЗапретЧастичногоВыкупа,
	|	ВТ_Объединение.ЧастичныйВыкуп,
	|	ВТ_Объединение.КатегорияДоставки,
	|	ВТ_Объединение.МетодОплатыПодъёма,
	|	ВТ_Объединение.СОжиданием,
	|	ВТ_Объединение.ТипЗаказа,
	|	ВТ_Объединение.ДатаЗабора,
	|	ВТ_Объединение.МенеджерЗабора,
	|	ВТ_Объединение.КОплатеКлиентом,
	|	ВТ_Объединение.УчитыватьИтогоКОплате,
	|	ВТ_Объединение.ПодъемОплачен,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ШтрихкодOZON, """") <> """"
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВТ_Объединение.КатегорияДляРасчетаЗП,
	|	ВТ_Объединение.ДополнительныйНомерЗаказа,
	|	ДополнительныеПараметрыЗаказа.Заказ,
	|	ВТ_Объединение.ШК,
	|	ЕСТЬNULL(ВТ_Объединение.Доставка.ОбъемЗабора, 0),
	|	ВТ_Объединение.АдресДоставки,
	|	ВТ_Объединение.Комментарий,
	|	ВТ_Объединение.НомерЛог
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипЗаказа,
	|	ВладелецТовараПриоритет,
	|	Номер,
	|	НомерСтроки,
	|	Номенклатура
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Сумма),
	|	СУММА(Вес),
	|	МАКСИМУМ(АдресДоставки),
	|	МАКСИМУМ(ТелефонПокупателя),
	|	МАКСИМУМ(Контрагент),
	|	МАКСИМУМ(КоммАдрес),
	|	МАКСИМУМ(Комментарий),
	|	МАКСИМУМ(ДатаДоставки),
	|	МАКСИМУМ(ВремяПрибытияС),
	|	МАКСИМУМ(ВремяПрибытияПо),
	|	МАКСИМУМ(ТипОплаты),
	|	МАКСИМУМ(НомерВнешнегоЗаказа),
	|	МАКСИМУМ(ТелефонИнтернетМагазина),
	|	МАКСИМУМ(СрочнаяДоставка),
	|	МАКСИМУМ(ЗапретЧастичногоВыкупаСтарый),
	|	МАКСИМУМ(ЗапретСменыОплаты),
	|	МАКСИМУМ(ЧастичныйВыкупСтарый),
	|	МАКСИМУМ(Покупатель),
	|	МАКСИМУМ(Доставка),
	|	МАКСИМУМ(ИнтернетМагазинЯндекса),
	|	МАКСИМУМ(ТипОплатыСсылка),
	|	МАКСИМУМ(ВладелецТовараПриоритет),
	|	МАКСИМУМ(ПредоплатаПоКредиту),
	|	МАКСИМУМ(ЗапретЧастичногоВыкупа),
	|	МАКСИМУМ(ЧастичныйВыкуп),
	|	МАКСИМУМ(КатегорияДоставки),
	|	МАКСИМУМ(МетодОплатыПодъёма),
	|	МАКСИМУМ(СОжиданием),
	|	МАКСИМУМ(ДатаЗабора),
	|	МАКСИМУМ(МенеджерЗабора),
	|	МАКСИМУМ(КОплатеКлиентом),
	|	МАКСИМУМ(УчитыватьИтогоКОплате),
	|	МАКСИМУМ(ПодъемОплачен),
	|	МАКСИМУМ(Озон),
	|	МАКСИМУМ(КатегорияДляРасчетаЗП),
	|	МАКСИМУМ(ДополнительныйНомерЗаказа),
	|	МАКСИМУМ(Заказ),
	|	МАКСИМУМ(НомерЛог)
	|ПО
	|	ТипЗаказа,
	|	Номер
	|АВТОУПОРЯДОЧИВАНИЕ";
	//Асеев 17.02.2021 (Задача № 3837)<<<
			
			
КонецФункции // ()

Функция ПечатьПоДоставке_старая(Доставка, ТабличныйДокумент, Самовывоз = Ложь) Экспорт

    // Михушкин --->> 
	//Макет = ПолучитьМакет("Макет");
	Макет = ПолучитьМакет("МакетНовый");
	//Макет = ПолучитьМакет("МакетУрезанный");
	// <<--- Михушкин    
	
	БПДоставка = БизнесПроцессы.новаМестнаяДоставка.НайтиПоНомеру(СокрЛП(Доставка.Номер));	
	
	//Если Самовывоз И Доставка.СуммаДокумента = 0 И НЕ ЗначениеЗаполнено(БПДоставка) Тогда
	//	//Самовывоз = Ложь;		
	//КонецЕсли;
	
    Запрос = Новый Запрос;
	// Михушкин --->> 
	Если Самовывоз И НЕ ЗначениеЗаполнено(БПДоставка) Тогда	
		Запрос.Текст = ТекстЗапросаПоСамовывозу();	
		//Реализ = Документы.РеализацияТоваровУслуг.НайтиПоНомеру(СокрЛП(Доставка.Номер));
		Запрос.УстановитьПараметр("Реализ", Доставка);
		Запрос.УстановитьПараметр("РеализНомер", Доставка.Номер);
	Иначе			
		Запрос.Текст = ТекстЗапросаПоДоставке();
		Если Самовывоз И ЗначениеЗаполнено(БПДоставка) Тогда		
			Запрос.УстановитьПараметр("Доставка", БПДоставка);		
		Иначе
		    Запрос.УстановитьПараметр("Доставка", Доставка); 
			
		КонецЕсли;		
	КонецЕсли;
	// <<--- Михушкин 
	//Запрос.Текст = ТекстЗапросаПоДоставке();
	
	
	//Запрос.УстановитьПараметр("Доставка", Доставка);
    РезультатЗапроса = Запрос.Выполнить();
    ВыборкаНомерТоварногоЧека = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
    
    Пока ВыборкаНомерТоварногоЧека.Следующий() Цикл
        
        ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
        ОбластьШапкаОтрыв = Макет.ПолучитьОбласть("ШапкаОтрыв");
        
        ОбластьШапка.Параметры.Заполнить(ВыборкаНомерТоварногоЧека);
		
		Если ВыборкаНомерТоварногоЧека.Контрагент.Код = "Shop_234 " И ЗначениеЗаполнено(ВыборкаНомерТоварногоЧека.Заказ) Тогда
			ОбластьШапка.Параметры.ПодарочнаяПозиция = ?(ВыборкаНомерТоварногоЧека.Заказ.ПодарочныеПозиции.Количество(), ВыборкаНомерТоварногоЧека.Заказ.ПодарочныеПозиции[0].Номенклатура, "");			
		КонецЕсли;
		
		Если Самовывоз Тогда
			ОбластьШапка.Параметры.ДатаИнтервалДоставкиЗаказа = Формат(ВыборкаНомерТоварногоЧека.ДатаДоставки,"ДФ=dd.MM.yyyy");
		Иначе
			ОбластьШапка.Параметры.ДатаИнтервалДоставкиЗаказа = Формат(ВыборкаНомерТоварногоЧека.ДатаДоставки,"ДФ=dd.MM.yyyy") + " с "+ Формат(ВыборкаНомерТоварногоЧека.ВремяПрибытияС,"ДФ=ЧЧ:мм") + " до "+Формат(ВыборкаНомерТоварногоЧека.ВремяПрибытияПо,"ДФ=ЧЧ:мм")+СтрокаПЕРЕНОС(ВыборкаНомерТоварногоЧека.Доставка);
		КонецЕсли;	
		//ОбластьШапка.Параметры.ДатаИнтервалДоставкиЗаказа = Формат(ВыборкаНомерТоварногоЧека.ДатаДоставки,"ДФ=dd.MM.yyyy") + " с "+ Формат(ВыборкаНомерТоварногоЧека.ВремяПрибытияС,"ДФ=ЧЧ:мм") + " до "+Формат(ВыборкаНомерТоварногоЧека.ВремяПрибытияПо,"ДФ=ЧЧ:мм")+СтрокаПЕРЕНОС(ВыборкаНомерТоварногоЧека.Доставка);
        //ОбластьШапка.Параметры.Покупатель = СокрЛП(ВыборкаНомерТоварногоЧека.Покупатель)+"/"+ВыборкаНомерТоварногоЧека.ТелефонДоставки;
		//ОбластьШапка.Параметры.НомерТоварногоЧека = "д"+СокрЛП(ВыборкаНомерТоварногоЧека.Номер)+"/"+СокрЛП(ВыборкаНомерТоварногоЧека.НомерВнешнегоЗаказа);
			
		//Если ЗначениеЗаполнено(ВыборкаНомерТоварногоЧека.ДополнительныйНомерЗаказа) Тогда		
		//	ОбластьШапка.Параметры.НомерТоварногоЧека = СокрЛП(ВыборкаНомерТоварногоЧека.Номер)+"/"+СокрЛП(ВыборкаНомерТоварногоЧека.ДополнительныйНомерЗаказа);
		//Иначе	
			ОбластьШапка.Параметры.НомерТоварногоЧека = СокрЛП(ВыборкаНомерТоварногоЧека.Номер)+"/"+СокрЛП(ВыборкаНомерТоварногоЧека.НомерВнешнегоЗаказа);		
		//КонецЕсли;
		
		//ОбластьШапка.Параметры.НомерТоварногоЧека = СокрЛП(ВыборкаНомерТоварногоЧека.Номер)+"/"+СокрЛП(ВыборкаНомерТоварногоЧека.НомерВнешнегоЗаказа);
        ОбластьШапка.Параметры.СтрокаПродавецАгент = СтрокаПродавецАгент(ВыборкаНомерТоварногоЧека);
        //Логотипы,название и штрихкод
        Логотипы = ПолучитьЛоготипыКомпании(ВыборкаНомерТоварногоЧека.Контрагент);
        Если ЗначениеЗаполнено(Логотипы) Тогда
			// Якурнов 23.10.2018 10:14:02 Неявное присвоение картинки выдает ошибку 
			//ОбластьШапка.Рисунки.ЛоготипЛевый.Картинка = Логотипы.Левый.Получить();
			
			// Якурнов 23.10.2018 10:09:56 Проверка на заполненое значение и присвоение картинки 
			ЛеваяКартинка = Логотипы.Левый.Получить();
			Если ЗначениеЗаполнено(ЛеваяКартинка) Тогда
				Попытка
					ОбластьШапка.Рисунки.ЛоготипЛевый.Картинка = ЛеваяКартинка;	
				Исключение
					Сообщить("в бланке по заказу " + СокрЛП(ВыборкаНомерТоварногоЧека.Номер) + " произошла ошибка при выводе логотипа.");
				КонецПопытки;
			КонецЕсли;
			
			ПраваяКартинка = Логотипы.Правый.Получить();
			Если ЗначениеЗаполнено(ПраваяКартинка) Тогда
				Попытка
					ОбластьШапка.Рисунки.ЛоготипПравый.Картинка = ПраваяКартинка;	
				Исключение
					Сообщить("в бланке по заказу " + СокрЛП(ВыборкаНомерТоварногоЧека.Номер) + " произошла ошибка при выводе логотипа.");
				КонецПопытки;
			КонецЕсли;
            
        КонецЕсли;
        
        Если Не ЗначениеЗаполнено(ОбластьШапка.Рисунки.ЛоготипЛевый.Картинка) Тогда
            ОбластьШапка.Рисунки.ЛоготипЛевый.ВыводитьНаПечать = Ложь;
            ОбластьШапка.Параметры.Назв = ВыборкаНомерТоварногоЧека.Контрагент;
        КонецЕСли;	
        
        Если Не ЗначениеЗаполнено(ОбластьШапка.Рисунки.ЛоготипПравый.Картинка) Тогда
            ОбластьШапка.Рисунки.ЛоготипПравый.ВыводитьНаПечать = Ложь;
            ОбластьШапка.Параметры.Телефон = ВыборкаНомерТоварногоЧека.ТелефонИнтернетМагазина;
        КонецЕСли;
        
        //+++++Серегин М.В. 20.01.2016 17:49:13 даже тут без костылей никак
        Если ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_248") Или ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_601") Или ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_752") Тогда
            ОбластьШапка.Параметры.Назв = "YD";
        КонецЕсли;
        //-----Серегин М.В. 20.01.2016 17:49:27
		//ОбластьШапка.Рисунки.ШК.Текст = lem.глСформироватьБарКодEAN13("37" + Формат((Число(ВыборкаНомерТоварногоЧека.Номер)), "ЧЦ=10; ЧВН=; ЧГ=") + "0"); 
		попытка
		ОбластьШапка.Рисунки.Штрихкод.Объект.barcode = "37" + Формат((Число(ВыборкаНомерТоварногоЧека.Номер)), "ЧЦ=10; ЧВН=; ЧГ=");
	исключение
		
		конецПопытки;
        ТабличныйДокумент.Вывести(ОбластьШапка);
        
        //Заполняем Шапку отрыва, выводим потом
        ОбластьШапкаОтрыв.Параметры.Заполнить(ВыборкаНомерТоварногоЧека);
		
		Если Самовывоз Тогда
        	ОбластьШапкаОтрыв.Параметры.ДатаИнтервалДоставкиЗаказа = Формат(ВыборкаНомерТоварногоЧека.ДатаДоставки,"ДФ=dd.MM.yyyy");
		Иначе
        	ОбластьШапкаОтрыв.Параметры.ДатаИнтервалДоставкиЗаказа = Формат(ВыборкаНомерТоварногоЧека.ДатаДоставки,"ДФ=dd.MM.yyyy") + " с "+ Формат(ВыборкаНомерТоварногоЧека.ВремяПрибытияС,"ДФ=ЧЧ:мм") + " до "+Формат(ВыборкаНомерТоварногоЧека.ВремяПрибытияПо,"ДФ=ЧЧ:мм")+СтрокаПЕРЕНОС(ВыборкаНомерТоварногоЧека.Доставка);
		КонецЕсли;
		
		//ОбластьШапкаОтрыв.Параметры.ДатаИнтервалДоставкиЗаказа = Формат(ВыборкаНомерТоварногоЧека.ДатаДоставки,"ДФ=dd.MM.yyyy") + " с "+ Формат(ВыборкаНомерТоварногоЧека.ВремяПрибытияС,"ДФ=ЧЧ:мм") + " до "+Формат(ВыборкаНомерТоварногоЧека.ВремяПрибытияПо,"ДФ=ЧЧ:мм")+СтрокаПЕРЕНОС(ВыборкаНомерТоварногоЧека.Доставка);
		//ОбластьШапкаОтрыв.Параметры.НомерТоварногоЧека = "д"+СокрЛП(ВыборкаНомерТоварногоЧека.Номер)+"/"+СокрЛП(ВыборкаНомерТоварногоЧека.НомерВнешнегоЗаказа);	
		
		//Если ЗначениеЗаполнено(ВыборкаНомерТоварногоЧека.ДополнительныйНомерЗаказа) Тогда		
		//	ОбластьШапкаОтрыв.Параметры.НомерТоварногоЧека = СокрЛП(ВыборкаНомерТоварногоЧека.Номер)+"/"+СокрЛП(ВыборкаНомерТоварногоЧека.ДополнительныйНомерЗаказа);
		//Иначе	
			ОбластьШапкаОтрыв.Параметры.НомерТоварногоЧека = СокрЛП(ВыборкаНомерТоварногоЧека.Номер)+"/"+СокрЛП(ВыборкаНомерТоварногоЧека.НомерВнешнегоЗаказа);		
		//КонецЕсли;
		
		//ОбластьШапкаОтрыв.Параметры.НомерТоварногоЧека = СокрЛП(ВыборкаНомерТоварногоЧека.Номер)+"/"+СокрЛП(ВыборкаНомерТоварногоЧека.НомерВнешнегоЗаказа);
        ОбластьШапкаОтрыв.Параметры.СтрокаПродавецАгент = СтрокаПродавецАгент(ВыборкаНомерТоварногоЧека);
        
        Если ЗначениеЗаполнено(Логотипы) Тогда
            //ОбластьШапкаОтрыв.Рисунки.ЛоготипЛевыйОтрыв.Картинка = Логотипы.Левый.Получить();
			ПраваяКартинка = Логотипы.Правый.Получить();
			Если ЗначениеЗаполнено(ПраваяКартинка) Тогда			
				ОбластьШапкаОтрыв.Рисунки.ЛоготипПравыйОтрыв.Картинка = ПраваяКартинка;			
			КонецЕсли;
            
        КонецЕсли;
        
        //Если Не ЗначениеЗаполнено(ОбластьШапкаОтрыв.Рисунки.ЛоготипЛевыйОтрыв.Картинка) Тогда
        //    ОбластьШапкаОтрыв.Рисунки.ЛоготипЛевыйОтрыв.ВыводитьНаПечать = Ложь;
        //    ОбластьШапкаОтрыв.Параметры.Назв = ВыборкаНомерТоварногоЧека.Контрагент;
        //КонецЕСли;	
        
        Если Не ЗначениеЗаполнено(ОбластьШапкаОтрыв.Рисунки.ЛоготипПравыйОтрыв.Картинка) Тогда
            ОбластьШапкаОтрыв.Рисунки.ЛоготипПравыйОтрыв.ВыводитьНаПечать = Ложь;
            ОбластьШапкаОтрыв.Параметры.Телефон = ВыборкаНомерТоварногоЧека.ТелефонИнтернетМагазина;
        КонецЕСли;
    
        ВыборкаДетальныеЗаписи = ВыборкаНомерТоварногоЧека.Выбрать();
        НомерСтроки = 0;
        Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
            ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
            
            НомерСтроки = НомерСтроки+1;
            ОбластьСтрока.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
            ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
            ОбластьСтрока.Параметры.ID_Код = СокрЛП(ВыборкаДетальныеЗаписи.НоменклатураКод)+"/"+ВыборкаДетальныеЗаписи.НоменклатураАртикул;
            ТабличныйДокумент.Вывести(ОбластьСтрока);
            
        КонецЦикла;
        
        #Область Итоги
        Если ВыборкаНомерТоварногоЧека.УчитыватьИтогоКОплате Тогда//+++++Серегин М.В. 01.03.2016 10:01:30 было ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_248") Тогда
            ОбластьИтоги = Макет.ПолучитьОбласть("ИтогиЯндекс");
            Если ВыборкаНомерТоварногоЧека.ТипОплатыСсылка = Справочники.ТипыОплат.ОплаченоВМагазине ИЛИ ВыборкаНомерТоварногоЧека.ТипОплатыСсылка = Справочники.ТипыОплат.БезРасчетов Тогда // Задача № 2901
                ОбластьИтоги.Параметры.СуммаКОплате = 0;
            Иначе
                ОбластьИтоги.Параметры.СуммаКОплате = ВыборкаНомерТоварногоЧека.КОплатеКлиентом;//+++++Серегин М.В. 01.03.2016 10:01:54 было ВыборкаНомерТоварногоЧека.Сумма;
            КонецЕсли;
        Иначе 
            ОбластьИтоги = Макет.ПолучитьОбласть("Итоги");
        КонецЕсли;
        ОбластьИтоги.Параметры.Заполнить(ВыборкаНомерТоварногоЧека);
		
        
        Вес003 = ПолучитьВесНакладная003ПоДоставке(ВыборкаНомерТоварногоЧека.Номер);
        Если ЗначениеЗаполнено(Вес003) Тогда 
            ОбластьИтоги.Параметры.Вес = Вес003;
		КонецЕсли;
		
		
		Если ОбластьИтоги.Параметры.Вес = 0 И ЗначениеЗаполнено(ВыборкаНомерТоварногоЧека.Заказ) Тогда
			ОбластьИтоги.Параметры.Вес = ВыборкаНомерТоварногоЧека.Заказ.ОбщийВес;		
			ПараметрыВес = ВыборкаНомерТоварногоЧека.Заказ.ОбщийВес;
		КонецЕсли;
		
		
		ОбластьИтоги.Параметры.Вес = Формат(ОбластьИтоги.Параметры.Вес,"ЧЦ=14; ЧДЦ=1; ЧГ=0")+" ("+?(ЗначениеЗаполнено(ВыборкаНомерТоварногоЧека.КатегорияДляРасчетаЗП), ВыборкаНомерТоварногоЧека.КатегорияДляРасчетаЗП.Родитель, ВыборкаНомерТоварногоЧека.КатегорияДоставки)+")";
		//ОбластьИтоги.Параметры.Вес = Формат(ОбластьИтоги.Параметры.Вес,"ЧЦ=14; ЧДЦ=1; ЧГ=0")+" ("+ВыборкаНомерТоварногоЧека.КатегорияДоставки+")";
        ТабличныйДокумент.Вывести(ОбластьИтоги);
		
		//// Михушкин - 30.06.2016 - Яндекс.Такси --->>
		//Если ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_181") 
		//	ИЛИ ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_227") 
		//	ИЛИ ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_428") Тогда
		//Иначе	
		//	ЯндексПромо = Макет.ПолучитьОбласть("ЯндексПромо");
		//	ТабличныйДокумент.Вывести(ЯндексПромо);
		//КонецЕсли;
		//// <<--- Михушкин
        
        //+++++Серегин М.В. 25.01.2016 10:23:35 
        Если ВыборкаНомерТоварногоЧека.ТипОплатыСсылка = Справочники.ТипыОплат.ВКредит Тогда
			ОбластьКредит = Макет.ПолучитьОбласть("Кредит");
			ОбластьКредит.Параметры.СуммаКредита = ВыборкаНомерТоварногоЧека.ПредоплатаПоКредиту;
			ОбластьКредит.Параметры.СуммаКОплате = ВыборкаНомерТоварногоЧека.Сумма - ВыборкаНомерТоварногоЧека.ПредоплатаПоКредиту;
            ТабличныйДокумент.Вывести(ОбластьКредит);
        КонецЕсли;
        //-----Серегин М.В. 25.01.2016 10:23:38 
        
        //Заполняем Итоги отрыв, выводим потом
        Если ВыборкаНомерТоварногоЧека.УчитыватьИтогоКОплате Тогда//+++++Серегин М.В. 01.03.2016 10:02:07 было ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_248") Тогда
            ОбластьИтогиОтрыв = Макет.ПолучитьОбласть("ИтогиЯндексОтрыв");
            Если ВыборкаНомерТоварногоЧека.ТипОплатыСсылка = Справочники.ТипыОплат.ОплаченоВМагазине ИЛИ  ВыборкаНомерТоварногоЧека.ТипОплатыСсылка = Справочники.ТипыОплат.БезРасчетов Тогда // Задача № 2901
                ОбластьИтогиОтрыв.Параметры.СуммаКОплате = 0;
            Иначе
                ОбластьИтогиОтрыв.Параметры.СуммаКОплате = ВыборкаНомерТоварногоЧека.КОплатеКлиентом;//+++++Серегин М.В. 01.03.2016 10:02:24 было ВыборкаНомерТоварногоЧека.Сумма;
            КонецЕсли;
        Иначе 
            ОбластьИтогиОтрыв = Макет.ПолучитьОбласть("ИтогиОтрыв");
        КонецЕсли;
        ОбластьИтогиОтрыв.Параметры.Заполнить(ВыборкаНомерТоварногоЧека);
        Вес003 = ПолучитьВесНакладная003ПоДоставке(ВыборкаНомерТоварногоЧека.Номер);
        Если ЗначениеЗаполнено(Вес003) Тогда 
            ОбластьИтогиОтрыв.Параметры.Вес = Вес003;
		КонецЕсли;
		
		
		ОбластьИтогиОтрыв.Параметры.Вес = Формат(ПараметрыВес, "ЧЦ=14; ЧДЦ=1; ЧГ=0")+" ("+ ?(ЗначениеЗаполнено(ВыборкаНомерТоварногоЧека.КатегорияДляРасчетаЗП), ВыборкаНомерТоварногоЧека.КатегорияДляРасчетаЗП.Родитель, ВыборкаНомерТоварногоЧека.КатегорияДоставки) +")";
		//ОбластьИтогиОтрыв.Параметры.Вес = Формат(ОбластьИтогиОтрыв.Параметры.Вес,"ЧЦ=14; ЧДЦ=1; ЧГ=0")+" ("+ВыборкаНомерТоварногоЧека.КатегорияДоставки+")";
        
        //+++++Серегин М.В. 25.01.2016 10:23:35
        ОбластьКредитОтрыв = Неопределено;
        Если ВыборкаНомерТоварногоЧека.ТипОплатыСсылка = Справочники.ТипыОплат.ВКредит Тогда
			ОбластьКредитОтрыв = Макет.ПолучитьОбласть("КредитОтрыв");
			ОбластьКредитОтрыв.Параметры.СуммаКредита = ВыборкаНомерТоварногоЧека.ПредоплатаПоКредиту;
			ОбластьКредитОтрыв.Параметры.СуммаКОплате = ВыборкаНомерТоварногоЧека.Сумма - ВыборкаНомерТоварногоЧека.ПредоплатаПоКредиту;          
        КонецЕсли;
        //-----Серегин М.В. 25.01.2016 10:23:38 
        #КонецОбласти         
        
        
        ОбластьПодвалПодпись = Макет.ПолучитьОбласть("ПодвалПодпись");
		ОбластьПодвалПодписьОтрыв = Макет.ПолучитьОбласть("ПодвалПодписьОтрыв");
		
		//// Михушкин - 30.06.2016 - Яндекс.Такси --->>
		//Если ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_181") 
		//	ИЛИ ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_227") 
		//	ИЛИ ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_428") Тогда
		//	ОбластьПодвалПодписьОтрыв = Макет.ПолучитьОбласть("ПодвалПодписьОтрыв");				
		//Иначе			
		//	ОбластьПодвалПодписьОтрыв = Макет.ПолучитьОбласть("ПодвалПодписьОтрыв_ЯндексПромо");
		//КонецЕсли;
		//// <<--- Михушкин
		
		
		// Михушкин - Программное заполнение тарифов подъемов --->>
		ПодъемыПрограммно = Ложь;
		ЧетыреКолонкиНаЛифте = Ложь;
		Запрос_ОбластьПодвалТарифы = Новый Запрос("ВЫБРАТЬ
		                                          |	ВариантыТаблицыПодъемовТаблица2016.ТипПодъемаНаЭтаж,
		                                          |	ВариантыТаблицыПодъемовТаблица2016.ВесОт КАК ВесОт,
		                                          |	ВариантыТаблицыПодъемовТаблица2016.ВесДо,
		                                          |	ВариантыТаблицыПодъемовТаблица2016.СтоимостьПодъема
		                                          |ИЗ
		                                          |	РегистрСведений.ВариантыТаблицыПодъемовВБланкахЗаказов.СрезПоследних(, Контрагент = &Контрагент) КАК ВариантыТаблицыПодъемовВБланкахЗаказовСрезПоследних
		                                          |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыТаблицыПодъемов.Таблица2016 КАК ВариантыТаблицыПодъемовТаблица2016
		                                          |		ПО ВариантыТаблицыПодъемовВБланкахЗаказовСрезПоследних.ВариантТаблицыПодъемов.Ссылка = ВариантыТаблицыПодъемовТаблица2016.Ссылка
		                                          |ГДЕ
		                                          |	ВариантыТаблицыПодъемовТаблица2016.ТипПодъемаНаЭтаж <> ЗНАЧЕНИЕ(Перечисление.ТипПодъемаНаЭтаж.ПустаяСсылка)
		                                          |
		                                          |УПОРЯДОЧИТЬ ПО
		                                          |	ВесОт");
		Запрос_ОбластьПодвалТарифы.УстановитьПараметр("Контрагент", ВыборкаНомерТоварногоЧека.Контрагент);
		РезультатОбластьПодвалТарифы = Запрос_ОбластьПодвалТарифы.Выполнить();
		ПредварительноПодвалТарифы = Запрос_ОбластьПодвалТарифы.Выполнить().Выгрузить();
		
		Если ПредварительноПодвалТарифы.Количество() Тогда			
			ПодъемыПрограммно = Истина;
			НайКолПод = ПредварительноПодвалТарифы.НайтиСтроки(Новый Структура("ТипПодъемаНаЭтаж", Перечисления.ТипПодъемаНаЭтаж.ПодъемЗаказаНаЛифте));
			Если НайКолПод.Количество() > 2 Тогда
				ЧетыреКолонкиНаЛифте = Истина;	
			Иначе	
	            ЧетыреКолонкиНаЛифте = Ложь;
			КонецЕсли;		
		КонецЕсли;
				
		
        Если ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_248") Или ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_601") Или ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_752") Тогда
            Если ВыборкаНомерТоварногоЧека.МетодОплатыПодъёма = Перечисления.МетодыОплатыПодъёмаЗаказа.ОплачиваетПартнер Тогда
                ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифыЯндексБезТаблицы");
            Иначе
				//ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифыЯндекс");
				Если ПодъемыПрограммно Тогда
					
					ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифыЯндексПрограммно_5Колонок");
					//Если ЧетыреКолонкиНаЛифте Тогда					
					//	ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифыЯндексПрограммно_4Колонки");					
					//Иначе					
					//	ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифыЯндексПрограммно");						
					//КонецЕсли;
							
				Иначе			
					ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифыЯндекс");					
				КонецЕсли;
				
            КонецЕсли;
        Иначе
            Если ВыборкаНомерТоварногоЧека.МетодОплатыПодъёма = Перечисления.МетодыОплатыПодъёмаЗаказа.ОплачиваетПартнер Тогда
                ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифыБезТаблицы");
            Иначе
				//ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифы");
				Если ПодъемыПрограммно Тогда
					
					ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифыПрограммно_5Колонок");
					//Если ЧетыреКолонкиНаЛифте Тогда	
					//	ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифыПрограммно_4Колонки");
					//Иначе					
					//	ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифыПрограммно");						
					//КонецЕсли;
				
				Иначе			
					ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифы");					
				КонецЕсли;
				
            КонецЕсли;
        КонецЕсли;
        ОбластьПодвалПодпись.Параметры.Заполнить(ВыборкаНомерТоварногоЧека);
        //+++++Серегин М.В. 20.02.2016 16:26:53 
        Если ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_248") Или ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_601") Или ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_752") Тогда
            ОбластьПодвалПодпись.Параметры.НадписьОжидание = ВыборкаНомерТоварногоЧека.СОжиданием;
        КонецЕсли;
        //-----Серегин М.В. 20.02.2016 16:26:55 
        ТабличныйДокумент.Вывести(ОбластьПодвалПодпись);
		
		
		Если ПодъемыПрограммно Тогда
			
			Рез_ОбластьПодвалТарифы = РезультатОбластьПодвалТарифы.Выбрать();
			НомерСтрБезЛифта = 1;
			НомерСтрНаЛифте = 1;
			
			Пока Рез_ОбластьПодвалТарифы.Следующий() Цикл
				Если Рез_ОбластьПодвалТарифы.ТипПодъемаНаЭтаж = Перечисления.ТипПодъемаНаЭтаж.ПодъемЗаказаБезЛифта Тогда		
					Если НомерСтрБезЛифта < 6 Тогда
						ОбластьПодвалТарифы.Параметры["Диапазон"+НомерСтрБезЛифта] = "от "+Рез_ОбластьПодвалТарифы.ВесОт + " - до " + Рез_ОбластьПодвалТарифы.ВесДо;
						ОбластьПодвалТарифы.Параметры["Значение"+НомерСтрБезЛифта] = Рез_ОбластьПодвалТарифы.СтоимостьПодъема;
						НомерСтрБезЛифта = НомерСтрБезЛифта + 1;
					КонецЕсли;
				ИначеЕсли Рез_ОбластьПодвалТарифы.ТипПодъемаНаЭтаж = Перечисления.ТипПодъемаНаЭтаж.ПодъемЗаказаНаЛифте Тогда	
					Если НомерСтрНаЛифте < 6 Тогда
						ОбластьПодвалТарифы.Параметры["ДиапазонНаЛифте"+НомерСтрНаЛифте] = "от "+Рез_ОбластьПодвалТарифы.ВесОт + " - до " + Рез_ОбластьПодвалТарифы.ВесДо;
						ОбластьПодвалТарифы.Параметры["ЗначениеНаЛифте"+НомерСтрНаЛифте] = Рез_ОбластьПодвалТарифы.СтоимостьПодъема;				
					    НомерСтрНаЛифте = НомерСтрНаЛифте + 1;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;		
		// <<--- Михушкин		
		ОбластьПодвалТарифы.Параметры.ДатаВремяПечати = ТекущаяДата();
		
		
		
		// Михушкин --->> 	
		Если ВыборкаНомерТоварногоЧека.МетодОплатыПодъёма = Перечисления.МетодыОплатыПодъёмаЗаказа.ОплачиваетПартнер 
			ИЛИ ВыборкаНомерТоварногоЧека.МетодОплатыПодъёма = Перечисления.МетодыОплатыПодъёмаЗаказа.ОпределяетсяНастройкамиЗаказа И ВыборкаНомерТоварногоЧека.ПодъемОплачен = Истина Тогда
		    ОбластьПодвалТарифы.Параметры.ПодъемОплачен = "ДА";		
	
			ОбластьПодвалТарифы.Параметры.СуммаПолученаСКлиентом = "ДЕНЕГ ЗА ПОДЪЕМ НЕ БЕРЕМ";
		ИначеЕсли ВыборкаНомерТоварногоЧека.МетодОплатыПодъёма = Перечисления.МетодыОплатыПодъёмаЗаказа.ОплачиваетКлиент 
			ИЛИ ВыборкаНомерТоварногоЧека.МетодОплатыПодъёма = Перечисления.МетодыОплатыПодъёмаЗаказа.ОпределяетсяНастройкамиЗаказа И ВыборкаНомерТоварногоЧека.ПодъемОплачен = Ложь Тогда
		    ОбластьПодвалТарифы.Параметры.ПодъемОплачен = "НЕТ";
		ИначеЕсли ВыборкаНомерТоварногоЧека.МетодОплатыПодъёма = Перечисления.МетодыОплатыПодъёмаЗаказа.ОпределяетсяПоКомментарию Тогда 	
			ОбластьПодвалТарифы.Параметры.ПодъемОплачен = "ПО КОММЕНТАРИЮ";
		КонецЕсли;		
		// <<--- Михушкин
		
        ТабличныйДокумент.Вывести(ОбластьПодвалТарифы);
        
        #Область ПроверкаВыводОтрывнойЧасти
        Пропуск = Макет.ПолучитьОбласть("Пропуск");
        МассивОбластей = Новый Массив;
        МассивОбластей.Добавить(ОбластьШапкаОтрыв);
        ВыборкаДетальныеЗаписиПроверка = ВыборкаНомерТоварногоЧека.Выбрать();
        НомерСтроки = 0;
        Пока ВыборкаДетальныеЗаписиПроверка.Следующий() Цикл
            ОбластьСтрокаОтрыв = Макет.ПолучитьОбласть("СтрокаОтрыв");
            НомерСтроки = НомерСтроки+1;
            ОбластьСтрокаОтрыв.Параметры.Заполнить(ВыборкаДетальныеЗаписиПроверка);
            ОбластьСтрокаОтрыв.Параметры.НомерСтроки = НомерСтроки;
            ОбластьСтрокаОтрыв.Параметры.ID_Код = СокрЛП(ВыборкаДетальныеЗаписиПроверка.НоменклатураКод)+"/"+ВыборкаДетальныеЗаписиПроверка.НоменклатураАртикул;
            МассивОбластей.Добавить(ОбластьСтрокаОтрыв);
        КонецЦикла;
        МассивОбластей.Добавить(ОбластьИтогиОтрыв);
        
        Если ВыборкаНомерТоварногоЧека.ТипОплатыСсылка = Справочники.ТипыОплат.ВКредит Тогда
            МассивОбластей.Добавить(ОбластьКредитОтрыв);
        КонецЕсли;
        
        МассивОбластей.Добавить(ОбластьПодвалПодписьОтрыв);
        Если НЕ ТабличныйДокумент.ПроверитьВывод(МассивОбластей) Тогда
            ВыводОтрывнойЧастиНаСледующейСтранице(ВыборкаНомерТоварногоЧека,ТабличныйДокумент,ОбластьШапкаОтрыв,Макет,ОбластьИтогиОтрыв,ОбластьПодвалПодписьОтрыв,ОбластьКредитОтрыв);
        Иначе
            МассивОбластей.Добавить(Пропуск);
            ВыводОтрывнойЧастиВнизу(МассивОбластей,ВыборкаНомерТоварногоЧека,ТабличныйДокумент,ОбластьШапкаОтрыв,Макет,ОбластьИтогиОтрыв,ОбластьПодвалПодписьОтрыв,Пропуск,ОбластьКредитОтрыв);
        КонецЕсли;	
        #КонецОбласти 
        
        
        ////Выводим отрывную часть
        //ТабличныйДокумент.Вывести(ОбластьШапкаОтрыв);
        ////Строка
        //ВыборкаДетальныеЗаписи2 = ВыборкаНомерТоварногоЧека.Выбрать();
        //НомерСтроки = 0;
        //Пока ВыборкаДетальныеЗаписи2.Следующий() Цикл
        //    ОбластьСтрокаОтрыв = Макет.ПолучитьОбласть("СтрокаОтрыв");
        //    НомерСтроки = НомерСтроки+1;
        //    ОбластьСтрокаОтрыв.Параметры.Заполнить(ВыборкаДетальныеЗаписи2);
        //    ОбластьСтрокаОтрыв.Параметры.НомерСтроки = НомерСтроки;
        //    ОбластьСтрокаОтрыв.Параметры.ID_Код = СокрЛП(ВыборкаДетальныеЗаписи2.НоменклатураКод)+"/"+ВыборкаДетальныеЗаписи2.НоменклатураАртикул;
        //    ТабличныйДокумент.Вывести(ОбластьСтрокаОтрыв);
        //КонецЦикла;
        //
        //ТабличныйДокумент.Вывести(ОбластьИтогиОтрыв);
        //ОбластьПодвалПодписьОтрыв = Макет.ПолучитьОбласть("ПодвалПодписьОтрыв");
        //ТабличныйДокумент.Вывести(ОбластьПодвалПодписьОтрыв);
        //
        ////Следующая страница
        //ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
        
        
    КонецЦикла;
    
    ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
    ТабличныйДокумент.АвтоМасштаб = Истина;

КонецФункции // ПечатьПоДоставке()

Функция ТекстЗапросаПоДоставке_Старый()
        Возврат "ВЫБРАТЬ
                |	новаМестнаяДоставка.Ссылка КАК Доставка,
                |	МАКСИМУМ(новаЗаданияРейсов.Рейс) КАК Рейс
                |ПОМЕСТИТЬ ВТ_Доставки
                |ИЗ
                |	БизнесПроцесс.новаМестнаяДоставка КАК новаМестнаяДоставка
                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.новаЗаданияРейсов КАК новаЗаданияРейсов
                |		ПО (новаЗаданияРейсов.Доставка = новаМестнаяДоставка.Ссылка)
                |ГДЕ
                |	новаМестнаяДоставка.Ссылка = &Доставка
                |
                |СГРУППИРОВАТЬ ПО
                |	новаМестнаяДоставка.Ссылка
                |;
                |
                |////////////////////////////////////////////////////////////////////////////////
                |ВЫБРАТЬ
                |	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
                |	РеализацияТоваровУслугТовары.Номенклатура.Код КАК НоменклатураКод,
                |	РеализацияТоваровУслугТовары.Номенклатура.Артикул КАК НоменклатураАртикул,
                |	РеализацияТоваровУслугТовары.Количество КАК Количество,
                |	РеализацияТоваровУслугТовары.Цена КАК Цена,
                |	РеализацияТоваровУслугТовары.Сумма КАК Сумма,
                |	РеализацияТоваровУслугТовары.Вес * РеализацияТоваровУслугТовары.Количество КАК Вес,
                |	ВТ_Доставки.Доставка КАК Доставка,
                |	ВТ_Доставки.Рейс КАК Рейс,
                |	РеализацияТоваровУслугТовары.НомерСтроки КАК НомерСтроки,
                |	РеализацияТоваровУслугТовары.ШтрихкодНоменклатуры.Код КАК ШК
                |ПОМЕСТИТЬ ВТ_Товары
                |ИЗ
                |	ВТ_Доставки КАК ВТ_Доставки
                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
                |		ПО ВТ_Доставки.Доставка.Номер = РеализацияТоваровУслугТовары.Ссылка.Номер
                |
                |ОБЪЕДИНИТЬ ВСЕ
                |
                |ВЫБРАТЬ
                |	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура,
                |	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура.Код,
                |	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура.Артикул,
                |	РеализацияТоваровУслугПодарочныеПозиции.Количество,
                |	РеализацияТоваровУслугПодарочныеПозиции.Цена,
                |	РеализацияТоваровУслугПодарочныеПозиции.Сумма,
                |	РеализацияТоваровУслугПодарочныеПозиции.Вес * РеализацияТоваровУслугПодарочныеПозиции.Количество,
                |	ВТ_Доставки.Доставка,
                |	ВТ_Доставки.Рейс,
                |	РеализацияТоваровУслугПодарочныеПозиции.НомерСтроки,
                |	РеализацияТоваровУслугПодарочныеПозиции.ШтрихкодНоменклатуры.Код
                |ИЗ
                |	ВТ_Доставки КАК ВТ_Доставки
                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.ПодарочныеПозиции КАК РеализацияТоваровУслугПодарочныеПозиции
                |		ПО ВТ_Доставки.Доставка.Номер = РеализацияТоваровУслугПодарочныеПозиции.Ссылка.Номер
                |
                |ОБЪЕДИНИТЬ ВСЕ
                |
                |ВЫБРАТЬ
                |	ВозвратТоваровОтПокупателяТовары.Номенклатура,
                |	ВозвратТоваровОтПокупателяТовары.Номенклатура.Код,
                |	ВозвратТоваровОтПокупателяТовары.Номенклатура.Артикул,
                |	-ВозвратТоваровОтПокупателяТовары.Количество,
                |	ВозвратТоваровОтПокупателяТовары.Цена,
                |	-ВозвратТоваровОтПокупателяТовары.Сумма,
                |	NULL,
                |	ВТ_Доставки.Доставка,
                |	ВТ_Доставки.Рейс,
                |	ВозвратТоваровОтПокупателяТовары.НомерСтроки,
                |	ВозвратТоваровОтПокупателяТовары.ШтрихкодНоменклатуры.Код
                |ИЗ
                |	ВТ_Доставки КАК ВТ_Доставки
                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
                |		ПО ВТ_Доставки.Доставка.Номер = ВозвратТоваровОтПокупателяТовары.Ссылка.Номер
                |
                |ОБЪЕДИНИТЬ ВСЕ
                |
                |ВЫБРАТЬ
                |	""Доставка"",
                |	NULL,
                |	NULL,
                |	МАКСИМУМ(1),
                |	NULL,
                |	МАКСИМУМ(ВТ_Доставки.Доставка.СтоимостьДоставкиДоМКАД),
                |	NULL,
                |	ВТ_Доставки.Доставка,
                |	NULL,
                |	998,
                |	""""
                |ИЗ
                |	ВТ_Доставки КАК ВТ_Доставки
                |ГДЕ
                |	ВТ_Доставки.Доставка.СтоимостьДоставкиДоМКАД <> 0
                |
                |СГРУППИРОВАТЬ ПО
                |	ВТ_Доставки.Доставка
                |
                |ОБЪЕДИНИТЬ ВСЕ
                |
                |ВЫБРАТЬ
                |	""Доставка"",
                |	NULL,
                |	NULL,
                |	МАКСИМУМ(1),
                |	NULL,
                |	МАКСИМУМ(ВТ_Доставки.Доставка.СтоимостьДоставкиЗаМКАД),
                |	NULL,
                |	ВТ_Доставки.Доставка,
                |	NULL,
                |	999,
                |	""""
                |ИЗ
                |	ВТ_Доставки КАК ВТ_Доставки
                |ГДЕ
                |	ВТ_Доставки.Доставка.СтоимостьДоставкиЗаМКАД <> 0
                |
                |СГРУППИРОВАТЬ ПО
                |	ВТ_Доставки.Доставка
                |;
                |
                |////////////////////////////////////////////////////////////////////////////////
                |ВЫБРАТЬ
                |	ВТ_Товары.Номенклатура КАК Номенклатура,
                |	ВТ_Товары.НоменклатураКод КАК НоменклатураКод,
                |	ВТ_Товары.НоменклатураАртикул КАК НоменклатураАртикул,
                |	ВТ_Товары.Количество КАК Количество,
                |	ВТ_Товары.Цена КАК Цена,
                |	ВТ_Товары.Сумма КАК Сумма,
                |	ВТ_Товары.Вес КАК Вес,
                |	ВТ_Товары.Доставка.Номер КАК Номер,
                |	ВТ_Товары.Доставка.ТочкаПрибытия.Адрес КАК АдресДоставки,
                |	ВТ_Товары.Доставка.Телефон КАК ТелефонПокупателя,
                |	ВТ_Товары.Доставка.Грузополучатель КАК Покупатель,
                |	ВЫРАЗИТЬ(ВТ_Товары.Доставка.КомментарийКАдресуДоставки КАК СТРОКА(500)) КАК КоммАдрес,
                |	ВЫРАЗИТЬ(ВТ_Товары.Доставка.Комментарий КАК СТРОКА(1000)) КАК Комментарий,
                |	ВТ_Товары.Доставка.Дата КАК ДатаДоставки,
                |	ВТ_Товары.Доставка.ВремяПрибытияС КАК ВремяПрибытияС,
                |	ВТ_Товары.Доставка.ВремяПрибытияПо КАК ВремяПрибытияПо,
                |	ТипыОплат.Наименование КАК ТипОплаты,
                |	ДокументРейс.НомерПалетты КАК НомерЛог,
                |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
                |	РеализацияТоваровУслуг.ВладелецТовара.ТелефонИнтернетМагазина КАК ТелефонИнтернетМагазина,
                |	РеализацияТоваровУслуг.ВладелецТовара КАК Контрагент,
                |	ВЫБОР
                |		КОГДА РеализацияТоваровУслуг.ТарифнаяСетка.Код = 2
                |			ТОГДА ""СРОЧНАЯ ДОСТАВКА""
                |		ИНАЧЕ """"
                |	КОНЕЦ КАК СрочнаяДоставка,
                |	ВЫБОР
                |		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа ЕСТЬ NULL
                |			ТОГДА """"
                |		ИНАЧЕ ВЫБОР
                |				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа
                |					ТОГДА ""запрещен""
                |				ИНАЧЕ """"
                |			КОНЕЦ
                |	КОНЕЦ КАК ЗапретЧастичногоВыкупаСтарый,
                |	ВЫБОР
                |		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретСменыОплаты ЕСТЬ NULL
                |			ТОГДА """"
                |		ИНАЧЕ ВЫБОР
                |				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретСменыОплаты
                |					ТОГДА ""запрещена""
                |				ИНАЧЕ """"
                |			КОНЕЦ
                |	КОНЕЦ КАК ЗапретСменыОплаты,
                |	ВЫБОР
                |		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа ЕСТЬ NULL
                |			ТОГДА """"
                |		ИНАЧЕ ВЫБОР
                |				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа
                |					ТОГДА ""Частичный выкуп""
                |				ИНАЧЕ """"
                |			КОНЕЦ
                |	КОНЕЦ КАК ЧастичныйВыкупСтарый,
                |	ВТ_Товары.НомерСтроки КАК НомерСтроки,
                |	ВТ_Товары.Доставка КАК Доставка,
                |	РеализацияТоваровУслуг.ИнтернетМагазинЯндекса КАК ИнтернетМагазинЯндекса,
                |	ТипыОплат.Ссылка КАК ТипОплатыСсылка,
                |	РеализацияТоваровУслуг.ПредоплатаПоКредиту КАК ПредоплатаПоКредиту,
                |	КатегорииДоставки2014.Родитель КАК КатегорияДоставки,
                |	ПараметрыКонтрагентовСрезПоследних.МетодОплатыПодъёма КАК МетодОплатыПодъёма,
                |	ВЫБОР
                |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.СОжиданием, ЛОЖЬ)
                |			ТОГДА ""С вскрытием""
                |		ИНАЧЕ ""Без вскрытия""
                |	КОНЕЦ КАК СОжиданием,
                |	ВЫБОР
                |		КОГДА РеализацияТоваровУслуг.ЗапретЧастичногоВыкупа
                |			ТОГДА ""запрещен""
                |		ИНАЧЕ """"
                |	КОНЕЦ КАК ЗапретЧастичногоВыкупа,
                |	ВЫБОР
                |		КОГДА РеализацияТоваровУслуг.ЗапретЧастичногоВыкупа
                |			ТОГДА ""Частичный выкуп""
                |		ИНАЧЕ """"
                |	КОНЕЦ КАК ЧастичныйВыкуп,
                |	ДополнительныеПараметрыЗаказа.КОплатеКлиентом КАК КОплатеКлиентом,
                |	РеализацияТоваровУслуг.УчитыватьИтогоКОплате КАК УчитыватьИтогоКОплате,
                |	ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ПодъемОплачен, ЛОЖЬ) КАК ПодъемОплачен,
                |	ДополнительныеПараметрыЗаказа.КатегорияДляРасчетаЗП КАК КатегорияДляРасчетаЗП,
                |	ДополнительныеПараметрыЗаказа.ДополнительныйНомерЗаказа КАК ДополнительныйНомерЗаказа,
                |	ДополнительныеПараметрыЗаказа.Заказ КАК Заказ,
                |	ВТ_Товары.ШК КАК ШК
                |ИЗ
                |	ВТ_Товары КАК ВТ_Товары
                |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
                |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыОплат КАК ТипыОплат
                |			ПО РеализацияТоваровУслуг.ТипОплаты = ТипыОплат.Код
                |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыКонтрагентов.СрезПоследних КАК ПараметрыКонтрагентовСрезПоследних
                |			ПО РеализацияТоваровУслуг.ВладелецТовара = ПараметрыКонтрагентовСрезПоследних.Контрагент
                |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КатегорииДоставки2014 КАК КатегорииДоставки2014
                |			ПО РеализацияТоваровУслуг.КатегорияДоставки = КатегорииДоставки2014.Категория
                |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
                |			ПО РеализацияТоваровУслуг.Ссылка = ДополнительныеПараметрыЗаказа.Заказ
                |		ПО ВТ_Товары.Доставка.Номер = РеализацияТоваровУслуг.Номер
                |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Рейс КАК ДокументРейс
                |		ПО (ДокументРейс.РейсМестнойДоставки = ВТ_Товары.Рейс)
                |
                |СГРУППИРОВАТЬ ПО
                |	ВТ_Товары.Номенклатура,
                |	ВТ_Товары.НоменклатураКод,
                |	ВТ_Товары.НоменклатураАртикул,
                |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа,
                |	РеализацияТоваровУслуг.ВладелецТовара,
                |	ВЫБОР
                |		КОГДА РеализацияТоваровУслуг.ТарифнаяСетка.Код = 2
                |			ТОГДА ""СРОЧНАЯ ДОСТАВКА""
                |		ИНАЧЕ """"
                |	КОНЕЦ,
                |	ВЫБОР
                |		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа ЕСТЬ NULL
                |			ТОГДА """"
                |		ИНАЧЕ ВЫБОР
                |				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа
                |					ТОГДА ""запрещен""
                |				ИНАЧЕ """"
                |			КОНЕЦ
                |	КОНЕЦ,
                |	ВЫБОР
                |		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретСменыОплаты ЕСТЬ NULL
                |			ТОГДА """"
                |		ИНАЧЕ ВЫБОР
                |				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретСменыОплаты
                |					ТОГДА ""запрещена""
                |				ИНАЧЕ """"
                |			КОНЕЦ
                |	КОНЕЦ,
                |	ВЫБОР
                |		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа ЕСТЬ NULL
                |			ТОГДА """"
                |		ИНАЧЕ ВЫБОР
                |				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа
                |					ТОГДА ""Частичный выкуп""
                |				ИНАЧЕ """"
                |			КОНЕЦ
                |	КОНЕЦ,
                |	ВТ_Товары.Доставка,
                |	РеализацияТоваровУслуг.ИнтернетМагазинЯндекса,
                |	ТипыОплат.Ссылка,
                |	КатегорииДоставки2014.Родитель,
                |	ПараметрыКонтрагентовСрезПоследних.МетодОплатыПодъёма,
                |	ВЫБОР
                |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.СОжиданием, ЛОЖЬ)
                |			ТОГДА ""С вскрытием""
                |		ИНАЧЕ ""Без вскрытия""
                |	КОНЕЦ,
                |	ВЫБОР
                |		КОГДА РеализацияТоваровУслуг.ЗапретЧастичногоВыкупа
                |			ТОГДА ""запрещен""
                |		ИНАЧЕ """"
                |	КОНЕЦ,
                |	ВЫБОР
                |		КОГДА РеализацияТоваровУслуг.ЗапретЧастичногоВыкупа
                |			ТОГДА ""Частичный выкуп""
                |		ИНАЧЕ """"
                |	КОНЕЦ,
                |	РеализацияТоваровУслуг.УчитыватьИтогоКОплате,
                |	ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ПодъемОплачен, ЛОЖЬ),
                |	ДополнительныеПараметрыЗаказа.КатегорияДляРасчетаЗП,
                |	ДополнительныеПараметрыЗаказа.ДополнительныйНомерЗаказа,
                |	ДополнительныеПараметрыЗаказа.Заказ,
                |	ВТ_Товары.Количество,
                |	ВТ_Товары.Цена,
                |	ВТ_Товары.Сумма,
                |	ВТ_Товары.Вес,
                |	ВТ_Товары.Доставка.Номер,
                |	ВТ_Товары.Доставка.Телефон,
                |	ВТ_Товары.Доставка.Грузополучатель,
                |	ВЫРАЗИТЬ(ВТ_Товары.Доставка.КомментарийКАдресуДоставки КАК СТРОКА(500)),
                |	ВТ_Товары.Доставка.Дата,
                |	ВТ_Товары.Доставка.ВремяПрибытияС,
                |	ВТ_Товары.Доставка.ВремяПрибытияПо,
                |	ТипыОплат.Наименование,
                |	ДокументРейс.НомерПалетты,
                |	РеализацияТоваровУслуг.ВладелецТовара.ТелефонИнтернетМагазина,
                |	ВТ_Товары.НомерСтроки,
                |	РеализацияТоваровУслуг.ПредоплатаПоКредиту,
                |	ДополнительныеПараметрыЗаказа.КОплатеКлиентом,
                |	ВЫРАЗИТЬ(ВТ_Товары.Доставка.Комментарий КАК СТРОКА(1000)),
                |	ВТ_Товары.ШК,
                |	ВТ_Товары.Доставка.ТочкаПрибытия.Адрес
                |
                |УПОРЯДОЧИТЬ ПО
                |	РеализацияТоваровУслуг.ВладелецТовара.Приоритет,
                |	Номер,
                |	НомерСтроки,
                |	Номенклатура
                |ИТОГИ
                |	СУММА(Количество),
                |	СУММА(Сумма),
                |	СУММА(Вес),
                |	МАКСИМУМ(АдресДоставки),
                |	МАКСИМУМ(ТелефонПокупателя),
                |	МАКСИМУМ(Покупатель),
                |	МАКСИМУМ(КоммАдрес),
                |	МАКСИМУМ(Комментарий),
                |	МАКСИМУМ(ДатаДоставки),
                |	МАКСИМУМ(ВремяПрибытияС),
                |	МАКСИМУМ(ВремяПрибытияПо),
                |	МАКСИМУМ(ТипОплаты),
                |	МАКСИМУМ(НомерЛог),
                |	МАКСИМУМ(НомерВнешнегоЗаказа),
                |	МАКСИМУМ(ТелефонИнтернетМагазина),
                |	МАКСИМУМ(Контрагент),
                |	МАКСИМУМ(СрочнаяДоставка),
                |	МАКСИМУМ(ЗапретЧастичногоВыкупаСтарый),
                |	МАКСИМУМ(ЗапретСменыОплаты),
                |	МАКСИМУМ(ЧастичныйВыкупСтарый),
                |	МАКСИМУМ(Доставка),
                |	МАКСИМУМ(ИнтернетМагазинЯндекса),
                |	МАКСИМУМ(ТипОплатыСсылка),
                |	МАКСИМУМ(ПредоплатаПоКредиту),
                |	МАКСИМУМ(КатегорияДоставки),
                |	МАКСИМУМ(МетодОплатыПодъёма),
                |	МАКСИМУМ(СОжиданием),
                |	МАКСИМУМ(ЗапретЧастичногоВыкупа),
                |	МАКСИМУМ(ЧастичныйВыкуп),
                |	МАКСИМУМ(КОплатеКлиентом),
                |	МАКСИМУМ(УчитыватьИтогоКОплате),
                |	МАКСИМУМ(ПодъемОплачен),
                |	МАКСИМУМ(КатегорияДляРасчетаЗП),
                |	МАКСИМУМ(ДополнительныйНомерЗаказа),
                |	МАКСИМУМ(Заказ)
                |ПО
                |	Номер
                |АВТОУПОРЯДОЧИВАНИЕ";
 	

КонецФункции // ()

Функция ПолучитьВесНакладная003ПоДоставке(Номер)

	ЗапВес003 = Новый Запрос;
	ЗапВес003.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	                  |	Накладная003Заказы.Вес
	                  |ИЗ
	                  |	Документ.Накладная003.Заказы КАК Накладная003Заказы
	                  |ГДЕ
	                  |	Выразить(Накладная003Заказы.Заказ Как Документ.РеализацияТоваровУслуг).Номер = &Номер
	                  |
	                  |УПОРЯДОЧИТЬ ПО
	                  |Накладная003Заказы.Ссылка.Дата УБЫВ";
	ЗапВес003.УстановитьПараметр("Номер", СокрЛП(Номер));
    Выборка = ЗапВес003.Выполнить().Выбрать(); 
    Если Выборка.Следующий() Тогда
        Возврат Выборка.Вес;
    Иначе
        Возврат Неопределено;
    КонецЕсли;

КонецФункции // ПолучитьВесНакладная003ПоДоставке()

Функция ПолучитьЛоготипыКомпании(Контрагент)
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |   ЛоготипыКонтрагентов.ЛоготипЛевый,
        |   ЛоготипыКонтрагентов.ЛоготипПравый
        |ИЗ
        |   РегистрСведений.ЛоготипыКонтрагентов КАК ЛоготипыКонтрагентов
        |ГДЕ
        |   ЛоготипыКонтрагентов.Контрагент = &Контрагент";
    
    Запрос.УстановитьПараметр("Контрагент", Контрагент);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
    
    Логотипы = Новый Структура;
    
    
    Если ВыборкаДетальныеЗаписи.Следующий() Тогда
        Логотипы.Вставить("Левый", ВыборкаДетальныеЗаписи.ЛоготипЛевый);
        Логотипы.Вставить("Правый", ВыборкаДетальныеЗаписи.ЛоготипПравый);
        Возврат Логотипы;
    Иначе
        Возврат Неопределено;
    КонецЕсли;
    
	

КонецФункции // ПолучитьЛоготипыКомпании()

Функция СтрокаПЕРЕНОС(Доставка)

	Струк = Новый Структура;
	Струк.Вставить("Доставка", Доставка);
	
	Най = РегистрыСведений.СостоянияЗаказов.ПолучитьПоследнее(ТекущаяДата(), Струк);
	
	Если ЗначениеЗаполнено(Най) Тогда
		если Най.ПричинаНевыполнения = Справочники.ПричиныНеВыполненияДоставки.ПереносДоставки Тогда
			
			// МАС - 23.08.2017 - №1710 --->> 
			 
			
			//ЗапД = Новый Запрос;
			//ЗапД.Текст = "ВЫБРАТЬ
			//             |	ДатыДоставок.Период КАК Период,
			//             |	ДатыДоставок.ДатаДоставки
			//             |ИЗ
			//             |	РегистрСведений.ДатыДоставок КАК ДатыДоставок
			//             |ГДЕ
			//             |	ДатыДоставок.Доставка = &Доставка
			//             |
			//             |УПОРЯДОЧИТЬ ПО
			//             |	Период УБЫВ";
			//ЗапД.УстановитьПараметр("Доставка", Доставка);
			//РезД = ЗапД.Выполнить().Выгрузить();
			//
			//Д_Д = Неопределено;
			//Если РезД.Количество() >= 2 Тогда
			//	Д_Д = РезД[1].ДатаДоставки;
			//ИначеЕСли РезД.Количество() = 1 Тогда
			//	Д_Д = РезД[0].Период;
			//КонецЕсли;	
			//
			//Если Д_Д <> Неопределено Тогда
			//	Возврат Символы.ПС+"(ПЕРЕНОС С " + Формат(Д_Д, "ДЛФ=DD") + ")";
			//Иначе	
			//	Возврат Символы.ПС+"(ПЕРЕНОС)";
			//КонецЕСли;	
			
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	ИзменениеДатыДоставки.Ссылка КАК Ссылка,
			                      |	ИзменениеДатыДоставки.ДатаДоставки КАК ДатаДоставки
			                      |ИЗ
			                      |	Документ.ИзменениеДатыДоставки КАК ИзменениеДатыДоставки
			                      |ГДЕ
			                      |	ИзменениеДатыДоставки.Доставка = &Доставка
			                      |
			                      |УПОРЯДОЧИТЬ ПО
			                      |	ДатаДоставки УБЫВ");
			Запрос.УстановитьПараметр("Доставка", Доставка);
			РезТЗ = Запрос.Выполнить().Выгрузить();
			
			Д_Д = Неопределено;		
			
			Если РезТЗ.Количество() > 1 Тогда
				Если Формат(РезТЗ[0].ДатаДоставки, "ДФ=dd.MM.yyyy") <> Формат(Доставка.Дата, "ДФ=dd.MM.yyyy") Тогда
					Д_Д = РезТЗ[0].ДатаДоставки;
				Иначе			
					Д_Д = РезТЗ[1].ДатаДоставки;			
				КонецЕсли;		
			КонецЕсли;	
			
			
			Если Д_Д <> Неопределено Тогда
				Возврат Символы.ПС+"(ПЕРЕНОС С " + Формат(Д_Д, "ДЛФ=DD") + ")";
			//Иначе	
			//	Возврат Символы.ПС+"(ПЕРЕНОС)";
			КонецЕСли;	
			// <<--- МАС
			
        КонецЕСли;
    Иначе
        Возврат "";
	КонецЕсли;	

КонецФункции // СтрокаПЕРЕНОС()

Функция СтрокаПродавецАгент(ВыборкаНомерТоварногоЧека)
    СтрокаПродавецАгент = "";
    СтрукРБЗ = Новый Структура;
    Если Не ЗначениеЗаполнено(ВыборкаНомерТоварногоЧека.Контрагент.Родитель.ОсновнойМагазин) Тогда
        СтрукРБЗ.Вставить("Контрагент", ВыборкаНомерТоварногоЧека.Контрагент);
    Иначе
        СтрукРБЗ.Вставить("Контрагент", ВыборкаНомерТоварногоЧека.Контрагент.Родитель.ОсновнойМагазин);
    КонецеСли;	
    СтрукРБЗ.Вставить("ТипОплаты", ВыборкаНомерТоварногоЧека.ТипОплатыСсылка);
    

    Если ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_248") Или ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_601") Или ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_752") Тогда
        СтрокаПродавецАгент = "Продавец: "+ВыборкаНомерТоварногоЧека.ИнтернетМагазинЯндекса.Наименование; 
    ИначеЕсли ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_338") Тогда
        СтрокаПродавецАгент = "Продавец: "+ВыборкаНомерТоварногоЧека.Контрагент.ЗаголовокИнтернетМагазина+", Агент: АО ""СТРИЖ-Логистик""";
    Иначе    
        найСтрБЗ = РегистрыСведений.АгентыБланкаЗаказа.ПолучитьПоследнее(ТекущаяДата(), СтрукРБЗ);
        Если ЗначениеЗаполнено(НайСтрБЗ.СтрокаВБланк) Тогда
            СтрокаПродавецАгент = НайСтрБЗ.СтрокаВБланк;
        Иначе	
            Если Не ЗначениеЗаполнено(ВыборкаНомерТоварногоЧека.Контрагент.Родитель.ОсновнойМагазин) Тогда
                СтрокаПродавецАгент = ВыборкаНомерТоварногоЧека.Контрагент.РеквизитыНаБЗ;
            Иначе
                СтрокаПродавецАгент = ВыборкаНомерТоварногоЧека.Контрагент.Родитель.ОсновнойМагазин.РеквизитыНаБЗ;
            КонецеСли;	
        КонецЕСли;	
        
	КонецЕсли;
	
    Возврат СтрокаПродавецАгент;
КонецФункции // Срока()

Функция ПечатьПоТЧ(ТабличныйДокумент) Экспорт
    //ТабличныйДокумент = Новый ТабличныйДокумент;
    Макет = ПолучитьМакет("Макет_ШК");
    
    //ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
    //ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
    //ОбластьИтоги = Макет.ПолучитьОбласть("Итоги");
    //ОбластьПодвалПодпись = Макет.ПолучитьОбласть("ПодвалПодпись");
    //ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифы");
    
    //ОбластьШапкаОтрыв = Макет.ПолучитьОбласть("ШапкаОтрыв");
    //ОбластьСтрокаОтрыв = Макет.ПолучитьОбласть("СтрокаОтрыв");
    //ОбластьИтогиОтрыв = Макет.ПолучитьОбласть("ИтогиОтрыв");
    //ОбластьПодвалПодписьОтрыв = Макет.ПолучитьОбласть("ПодвалПодписьОтрыв");
    //ОбластьПодвалТарифыОтрыв = Макет.ПолучитьОбласть("ПодвалТарифыОтрыв");
    
    Запрос = Новый Запрос;
    Запрос.Текст = ТекстЗапросаПоТЧ();
    Запрос.УстановитьПараметр("Мас", Заказы.ВыгрузитьКолонку("Заказ"));
    РезультатЗапроса = Запрос.Выполнить();
    
    ВыборкаТипЗаказа = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
    
    Пока ВыборкаТипЗаказа.Следующий() Цикл
        // Вставить обработку выборки ВыборкаТипЗаказа
    
        ВыборкаНомер = ВыборкаТипЗаказа.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
    
        Пока ВыборкаНомер.Следующий() Цикл
            Если ВыборкаНомер.ТипЗаказа = Перечисления.ТипыЗаказов.Доставка Тогда
                ПечатьПоРейсуДоставка(ТабличныйДокумент,Макет,ВыборкаНомер, 2);
            ИначеЕсли ВыборкаНомер.ТипЗаказа = Перечисления.ТипыЗаказов.Забор Тогда 
                ПечатьПоРейсуЗабор(ТабличныйДокумент,Макет,ВыборкаНомер, 2);
            КонецЕсли;
            
            
            
            ////Выводим отрывную часть
            
            
            
            //ТабличныйДокумент.Вывести(ОбластьШапкаОтрыв);
            ////Строка
            //ВыборкаДетальныеЗаписи2 = ВыборкаНомерТоварногоЧека.Выбрать();
            //НомерСтроки = 0;
            //Пока ВыборкаДетальныеЗаписи2.Следующий() Цикл
            //    ОбластьСтрокаОтрыв = Макет.ПолучитьОбласть("СтрокаОтрыв");
            //    НомерСтроки = НомерСтроки+1;
            //    ОбластьСтрокаОтрыв.Параметры.Заполнить(ВыборкаДетальныеЗаписи2);
            //    ОбластьСтрокаОтрыв.Параметры.НомерСтроки = НомерСтроки;
            //    ОбластьСтрокаОтрыв.Параметры.ID_Код = СокрЛП(ВыборкаДетальныеЗаписи2.НоменклатураКод)+"/"+ВыборкаДетальныеЗаписи2.НоменклатураАртикул;
            //    ТабличныйДокумент.Вывести(ОбластьСтрокаОтрыв);
            //КонецЦикла;
            //
            //ТабличныйДокумент.Вывести(ОбластьИтогиОтрыв);
            //ТабличныйДокумент.Вывести(ОбластьПодвалПодписьОтрыв);
            //
            //Следующая страница
            //ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
            
            
        КонецЦикла;
    КонецЦикла;
    
    ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
    ТабличныйДокумент.АвтоМасштаб = Истина;

КонецФункции // ПечатьПоРейсу()


Функция ТекстЗапросаПоТЧ()
	
	//Асеев 17.02.2021 (Задача № 3837)>>>
		//Возврат "ВЫБРАТЬ
		//        |	новаМестнаяДоставка.Ссылка КАК Доставка,
		//        |	РеализацияТоваровУслуг.Ссылка КАК Заказ,
		//        |	МАКСИМУМ(ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)) КАК ТипЗаказа
		//        |ПОМЕСТИТЬ ВТ_Доставки
		//        |ИЗ
		//        |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		//        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БизнесПроцесс.новаМестнаяДоставка КАК новаМестнаяДоставка
		//        |		ПО РеализацияТоваровУслуг.Номер = новаМестнаяДоставка.Номер
		//        |ГДЕ
		//        |	РеализацияТоваровУслуг.Ссылка В(&Мас)
		//        |
		//        |СГРУППИРОВАТЬ ПО
		//        |	новаМестнаяДоставка.Ссылка,
		//        |	РеализацияТоваровУслуг.Ссылка
		//        |
		//        |ОБЪЕДИНИТЬ ВСЕ
		//        |
		//        |ВЫБРАТЬ
		//        |	ЗаборТовара.Ссылка,
		//        |	ЗаборТовара.Ссылка,
		//        |	МАКСИМУМ(ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор))
		//        |ИЗ
		//        |	Документ.ЗаборТовара КАК ЗаборТовара
		//        |ГДЕ
		//        |	ЗаборТовара.Ссылка В(&Мас)
		//        |
		//        |СГРУППИРОВАТЬ ПО
		//        |	ЗаборТовара.Ссылка,
		//        |	ЗаборТовара.Ссылка
		//        |;
		//        |
		//        |////////////////////////////////////////////////////////////////////////////////
		//        |ВЫБРАТЬ
		//        |	РеализацияТоваровУслугТовары.Номенклатура,
		//        |	РеализацияТоваровУслугТовары.Номенклатура.Код,
		//        |	РеализацияТоваровУслугТовары.Номенклатура.Артикул,
		//        |	РеализацияТоваровУслугТовары.Количество,
		//        |	РеализацияТоваровУслугТовары.Цена,
		//        |	РеализацияТоваровУслугТовары.Сумма,
		//        |	РеализацияТоваровУслугТовары.Вес * РеализацияТоваровУслугТовары.Количество КАК Вес,
		//        |	ВТ_Доставки.Доставка,
		//        |	РеализацияТоваровУслугТовары.НомерСтроки,
		//        |	ВТ_Доставки.ТипЗаказа
		//        |ПОМЕСТИТЬ ВТ_Товары
		//        |ИЗ
		//        |	ВТ_Доставки КАК ВТ_Доставки
		//        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		//        |		ПО (ВЫРАЗИТЬ(ВТ_Доставки.Доставка КАК БизнесПроцесс.новаМестнаяДоставка).Номер = РеализацияТоваровУслугТовары.Ссылка.Номер)
		//        |
		//        |ОБЪЕДИНИТЬ ВСЕ
		//        |
		//        |ВЫБРАТЬ
		//        |	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура,
		//        |	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура.Код,
		//        |	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура.Артикул,
		//        |	РеализацияТоваровУслугПодарочныеПозиции.Количество,
		//        |	РеализацияТоваровУслугПодарочныеПозиции.Цена,
		//        |	РеализацияТоваровУслугПодарочныеПозиции.Сумма,
		//        |	РеализацияТоваровУслугПодарочныеПозиции.Вес * РеализацияТоваровУслугПодарочныеПозиции.Количество,
		//        |	ВТ_Доставки.Доставка,
		//        |	РеализацияТоваровУслугПодарочныеПозиции.НомерСтроки,
		//        |	ВТ_Доставки.ТипЗаказа
		//        |ИЗ
		//        |	ВТ_Доставки КАК ВТ_Доставки
		//        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.ПодарочныеПозиции КАК РеализацияТоваровУслугПодарочныеПозиции
		//        |		ПО (ВЫРАЗИТЬ(ВТ_Доставки.Доставка КАК БизнесПроцесс.новаМестнаяДоставка).Номер = РеализацияТоваровУслугПодарочныеПозиции.Ссылка.Номер)
		//        |
		//        |ОБЪЕДИНИТЬ ВСЕ
		//        |
		//        |ВЫБРАТЬ
		//        |	ВозвратТоваровОтПокупателяТовары.Номенклатура,
		//        |	ВозвратТоваровОтПокупателяТовары.Номенклатура.Код,
		//        |	ВозвратТоваровОтПокупателяТовары.Номенклатура.Артикул,
		//        |	-ВозвратТоваровОтПокупателяТовары.Количество,
		//        |	ВозвратТоваровОтПокупателяТовары.Цена,
		//        |	-ВозвратТоваровОтПокупателяТовары.Сумма,
		//        |	NULL,
		//        |	ВТ_Доставки.Доставка,
		//        |	ВозвратТоваровОтПокупателяТовары.НомерСтроки,
		//        |	ВТ_Доставки.ТипЗаказа
		//        |ИЗ
		//        |	ВТ_Доставки КАК ВТ_Доставки
		//        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
		//        |		ПО (ВЫРАЗИТЬ(ВТ_Доставки.Доставка КАК БизнесПроцесс.новаМестнаяДоставка).Номер = ВозвратТоваровОтПокупателяТовары.Ссылка.Номер)
		//        |
		//        |ОБЪЕДИНИТЬ ВСЕ
		//        |
		//        |ВЫБРАТЬ
		//        |	""Доставка"",
		//        |	NULL,
		//        |	NULL,
		//        |	МАКСИМУМ(1),
		//        |	NULL,
		//        |	МАКСИМУМ(ВТ_Доставки.Доставка.СтоимостьДоставкиДоМКАД),
		//        |	NULL,
		//        |	ВТ_Доставки.Доставка,
		//        |	998,
		//        |	МАКСИМУМ(ВТ_Доставки.ТипЗаказа)
		//        |ИЗ
		//        |	ВТ_Доставки КАК ВТ_Доставки
		//        |ГДЕ
		//        |	ВТ_Доставки.Доставка.СтоимостьДоставкиДоМКАД <> 0
		//        |	И ВТ_Доставки.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
		//        |
		//        |СГРУППИРОВАТЬ ПО
		//        |	ВТ_Доставки.Доставка
		//        |
		//        |ОБЪЕДИНИТЬ ВСЕ
		//        |
		//        |ВЫБРАТЬ
		//        |	""Доставка"",
		//        |	NULL,
		//        |	NULL,
		//        |	МАКСИМУМ(1),
		//        |	NULL,
		//        |	МАКСИМУМ(ВТ_Доставки.Доставка.СтоимостьДоставкиЗаМКАД),
		//        |	NULL,
		//        |	ВТ_Доставки.Доставка,
		//        |	999,
		//        |	МАКСИМУМ(ВТ_Доставки.ТипЗаказа)
		//        |ИЗ
		//        |	ВТ_Доставки КАК ВТ_Доставки
		//        |ГДЕ
		//        |	ВТ_Доставки.Доставка.СтоимостьДоставкиЗаМКАД <> 0
		//        |	И ВТ_Доставки.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
		//        |
		//        |СГРУППИРОВАТЬ ПО
		//        |	ВТ_Доставки.Доставка
		//        |
		//        |ОБЪЕДИНИТЬ ВСЕ
		//        |
		//        |ВЫБРАТЬ
		//        |	ЗаборТовараТовары.Номенклатура,
		//        |	ЗаборТовараТовары.Номенклатура.Код,
		//        |	ЗаборТовараТовары.Номенклатура.Артикул,
		//        |	СУММА(ЗаборТовараТовары.Количество),
		//        |	МАКСИМУМ(ЗаборТовараТовары.Цена),
		//        |	СУММА(ЗаборТовараТовары.Сумма),
		//        |	СУММА(ЗаборТовараТовары.Вес * ЗаборТовараТовары.Количество),
		//        |	ВТ_Доставки.Доставка,
		//        |	ЗаборТовараТовары.НомерСтроки,
		//        |	ВТ_Доставки.ТипЗаказа
		//        |ИЗ
		//        |	ВТ_Доставки КАК ВТ_Доставки
		//        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаборТовара КАК ЗаборТовара
		//        |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаборТовара.Товары КАК ЗаборТовараТовары
		//        |			ПО ЗаборТовара.Ссылка = ЗаборТовараТовары.Ссылка
		//        |		ПО (ВЫРАЗИТЬ(ВТ_Доставки.Доставка КАК Документ.ЗаборТовара).Номер = ЗаборТовара.Номер)
		//        |
		//        |СГРУППИРОВАТЬ ПО
		//        |	ЗаборТовараТовары.Номенклатура,
		//        |	ЗаборТовараТовары.Номенклатура.Код,
		//        |	ЗаборТовараТовары.Номенклатура.Артикул,
		//        |	ВТ_Доставки.Доставка,
		//        |	ЗаборТовараТовары.НомерСтроки,
		//        |	ВТ_Доставки.ТипЗаказа
		//        |;
		//        |
		//        |////////////////////////////////////////////////////////////////////////////////
		//        |ВЫБРАТЬ
		//        |	ВТ_Товары.Номенклатура КАК Номенклатура,
		//        |	ВТ_Товары.НоменклатураКод,
		//        |	ВТ_Товары.НоменклатураАртикул,
		//        |	ВТ_Товары.Количество КАК Количество,
		//        |	ВТ_Товары.Цена,
		//        |	ВТ_Товары.Сумма КАК Сумма,
		//        |	ВТ_Товары.Вес КАК Вес,
		//        |	ВТ_Товары.Доставка.Номер КАК Номер,
		//        |	ВТ_Товары.Доставка.Адрес КАК АдресДоставки,
		//        |	ВТ_Товары.Доставка.Телефон КАК ТелефонПокупателя,
		//        |	РеализацияТоваровУслуг.ВладелецТовара КАК Контрагент,
		//        |	ВЫРАЗИТЬ(ВТ_Товары.Доставка.КомментарийКАдресуДоставки КАК СТРОКА(500)) КАК КоммАдрес,
		//        |	ВЫРАЗИТЬ(ВТ_Товары.Доставка.Комментарий КАК СТРОКА(1000)) КАК Комментарий,
		//        |	ВТ_Товары.Доставка.Дата КАК ДатаДоставки,
		//        |	ВТ_Товары.Доставка.ВремяПрибытияС КАК ВремяПрибытияС,
		//        |	ВТ_Товары.Доставка.ВремяПрибытияПо КАК ВремяПрибытияПо,
		//        |	ТипыОплат.Наименование КАК ТипОплаты,
		//        |	0 КАК НомерЛог,
		//        |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
		//        |	РеализацияТоваровУслуг.ВладелецТовара.ТелефонИнтернетМагазина КАК ТелефонИнтернетМагазина,
		//        |	ВЫБОР
		//        |		КОГДА РеализацияТоваровУслуг.ТарифнаяСетка.Код = 2
		//        |			ТОГДА ""СРОЧНАЯ ДОСТАВКА""
		//        |		ИНАЧЕ """"
		//        |	КОНЕЦ КАК СрочнаяДоставка,
		//        |	ВЫБОР
		//        |		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа ЕСТЬ NULL
		//        |			ТОГДА """"
		//        |		ИНАЧЕ ВЫБОР
		//        |				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа
		//        |					ТОГДА ""запрещен""
		//        |				ИНАЧЕ """"
		//        |			КОНЕЦ
		//        |	КОНЕЦ КАК ЗапретЧастичногоВыкупаСтарый,
		//        |	ВЫБОР
		//        |		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретСменыОплаты ЕСТЬ NULL
		//        |			ТОГДА """"
		//        |		ИНАЧЕ ВЫБОР
		//        |				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретСменыОплаты
		//        |					ТОГДА ""запрещена""
		//        |				ИНАЧЕ """"
		//        |			КОНЕЦ
		//        |	КОНЕЦ КАК ЗапретСменыОплаты,
		//        |	ВЫБОР
		//        |		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа ЕСТЬ NULL
		//        |			ТОГДА """"
		//        |		ИНАЧЕ ВЫБОР
		//        |				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа
		//        |					ТОГДА ""Частичный выкуп""
		//        |				ИНАЧЕ """"
		//        |			КОНЕЦ
		//        |	КОНЕЦ КАК ЧастичныйВыкупСтарый,
		//        |	ВТ_Товары.Доставка.Грузополучатель КАК Покупатель,
		//        |	ВТ_Товары.НомерСтроки КАК НомерСтроки,
		//        |	ВТ_Товары.Доставка КАК Доставка,
		//        |	РеализацияТоваровУслуг.ИнтернетМагазинЯндекса КАК ИнтернетМагазинЯндекса,
		//        |	ТипыОплат.Ссылка КАК ТипОплатыСсылка,
		//        |	РеализацияТоваровУслуг.ВладелецТовара.Приоритет КАК ВладелецТовараПриоритет,
		//        |	РеализацияТоваровУслуг.ПредоплатаПоКредиту КАК ПредоплатаПоКредиту,
		//        |	ВЫБОР
		//        |		КОГДА РеализацияТоваровУслуг.ЗапретЧастичногоВыкупа
		//        |			ТОГДА ""запрещен""
		//        |		ИНАЧЕ """"
		//        |	КОНЕЦ КАК ЗапретЧастичногоВыкупа,
		//        |	ВЫБОР
		//        |		КОГДА РеализацияТоваровУслуг.ЗапретЧастичногоВыкупа
		//        |			ТОГДА ""Частичный выкуп""
		//        |		ИНАЧЕ """"
		//        |	КОНЕЦ КАК ЧастичныйВыкуп,
		//        |	КатегорииДоставки2014.Родитель КАК КатегорияДоставки,
		//        |	ПараметрыКонтрагентовСрезПоследних.МетодОплатыПодъёма КАК МетодОплатыПодъёма,
		//        |	ВЫБОР
		//        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.СОжиданием, ЛОЖЬ)
		//        |			ТОГДА ""С вскрытием""
		//        |		ИНАЧЕ ""Без вскрытия""
		//        |	КОНЕЦ КАК СОжиданием,
		//        |	ВТ_Товары.ТипЗаказа КАК ТипЗаказа,
		//        |	NULL КАК ДатаЗабора,
		//        |	NULL КАК МенеджерЗабора,
		//        |	ДополнительныеПараметрыЗаказа.КОплатеКлиентом,
		//        |	РеализацияТоваровУслуг.УчитыватьИтогоКОплате,
		//        |	ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ПодъемОплачен, ЛОЖЬ) КАК ПодъемОплачен,
		//        |	ДополнительныеПараметрыЗаказа.КатегорияДляРасчетаЗП,
		//        |	ДополнительныеПараметрыЗаказа.ДополнительныйНомерЗаказа,
		//        |	ДополнительныеПараметрыЗаказа.Заказ
		//        |ПОМЕСТИТЬ ВТ_Объединение
		//        |ИЗ
		//        |	ВТ_Товары КАК ВТ_Товары
		//        |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		//        |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыОплат КАК ТипыОплат
		//        |			ПО РеализацияТоваровУслуг.ТипОплаты = ТипыОплат.Код
		//        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыКонтрагентов.СрезПоследних КАК ПараметрыКонтрагентовСрезПоследних
		//        |			ПО РеализацияТоваровУслуг.ВладелецТовара = ПараметрыКонтрагентовСрезПоследних.Контрагент
		//        |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КатегорииДоставки2014 КАК КатегорииДоставки2014
		//        |			ПО РеализацияТоваровУслуг.КатегорияДоставки = КатегорииДоставки2014.Категория
		//        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
		//        |			ПО РеализацияТоваровУслуг.Ссылка = ДополнительныеПараметрыЗаказа.Заказ
		//        |		ПО ВТ_Товары.Доставка.Номер = РеализацияТоваровУслуг.Номер
		//        |ГДЕ
		//        |	ВТ_Товары.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
		//        |
		//        |ОБЪЕДИНИТЬ ВСЕ
		//        |
		//        |ВЫБРАТЬ
		//        |	ВТ_Товары.Номенклатура,
		//        |	ВТ_Товары.НоменклатураКод,
		//        |	ВТ_Товары.НоменклатураАртикул,
		//        |	ВТ_Товары.Количество,
		//        |	ВТ_Товары.Цена,
		//        |	ВТ_Товары.Сумма,
		//        |	ВТ_Товары.Вес,
		//        |	ВТ_Товары.Доставка.Номер,
		//        |	ВТ_Товары.Доставка.АдресДоставки,
		//        |	ВТ_Товары.Доставка.Телефон,
		//        |	ВТ_Товары.Доставка.Контрагент,
		//        |	NULL,
		//        |	ВТ_Товары.Доставка.Комментарий,
		//        |	ВТ_Товары.Доставка.ДатаДоставки,
		//        |	ВТ_Товары.Доставка.ВремяДоставкиС,
		//        |	ВТ_Товары.Доставка.ВремяДоставкиПо,
		//        |	ТипыОплат.Наименование,
		//        |	0,
		//        |	ВТ_Товары.Доставка.НомерВнешнегоЗаказа,
		//        |	ВТ_Товары.Доставка.Контрагент.ТелефонИнтернетМагазина,
		//        |	NULL,
		//        |	NULL,
		//        |	NULL,
		//        |	NULL,
		//        |	ВТ_Товары.Доставка.Грузополучатель,
		//        |	ВТ_Товары.НомерСтроки,
		//        |	ВТ_Товары.Доставка,
		//        |	ВТ_Товары.Доставка.Контрагент,
		//        |	ТипыОплат.Ссылка,
		//        |	ВТ_Товары.Доставка.Контрагент.Приоритет,
		//        |	NULL,
		//        |	NULL,
		//        |	NULL,
		//        |	NULL,
		//        |	NULL,
		//        |	NULL,
		//        |	ВТ_Товары.ТипЗаказа,
		//        |	ВТ_Товары.Доставка.Дата,
		//        |	ВЫБОР
		//        |		КОГДА ВТ_Товары.Доставка.Автор = """"
		//        |			ТОГДА ""Не указан""
		//        |		ИНАЧЕ ВТ_Товары.Доставка.Автор
		//        |	КОНЕЦ,
		//        |	NULL,
		//        |	NULL,
		//        |	NULL,
		//        |	NULL,
		//        |	NULL,
		//        |	NULL
		//        |ИЗ
		//        |	ВТ_Товары КАК ВТ_Товары
		//        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыОплат КАК ТипыОплат
		//        |		ПО ВТ_Товары.Доставка.ТипОплаты = ТипыОплат.Код
		//        |ГДЕ
		//        |	ВТ_Товары.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор)
		//        |;
		//        |
		//        |////////////////////////////////////////////////////////////////////////////////
		//        |ВЫБРАТЬ
		//        |	ВТ_Объединение.Номенклатура КАК Номенклатура,
		//        |	ВТ_Объединение.НоменклатураКод,
		//        |	ВТ_Объединение.НоменклатураАртикул,
		//        |	ВТ_Объединение.Количество КАК Количество,
		//        |	ВТ_Объединение.Цена,
		//        |	ВТ_Объединение.Сумма КАК Сумма,
		//        |	ВТ_Объединение.Вес КАК Вес,
		//        |	ВТ_Объединение.Номер КАК Номер,
		//        |	ВТ_Объединение.АдресДоставки КАК АдресДоставки,
		//        |	ВТ_Объединение.ТелефонПокупателя КАК ТелефонПокупателя,
		//        |	ВТ_Объединение.Контрагент КАК Контрагент,
		//        |	ВТ_Объединение.КоммАдрес КАК КоммАдрес,
		//        |	ВТ_Объединение.Комментарий КАК Комментарий,
		//        |	ВТ_Объединение.ДатаДоставки КАК ДатаДоставки,
		//        |	ВТ_Объединение.ВремяПрибытияС КАК ВремяПрибытияС,
		//        |	ВТ_Объединение.ВремяПрибытияПо КАК ВремяПрибытияПо,
		//        |	ВТ_Объединение.ТипОплаты КАК ТипОплаты,
		//        |	ВТ_Объединение.НомерЛог КАК НомерЛог,
		//        |	ВТ_Объединение.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
		//        |	ВТ_Объединение.ТелефонИнтернетМагазина КАК ТелефонИнтернетМагазина,
		//        |	ВТ_Объединение.СрочнаяДоставка КАК СрочнаяДоставка,
		//        |	ВТ_Объединение.ЗапретЧастичногоВыкупаСтарый КАК ЗапретЧастичногоВыкупаСтарый,
		//        |	ВТ_Объединение.ЗапретСменыОплаты КАК ЗапретСменыОплаты,
		//        |	ВТ_Объединение.ЧастичныйВыкупСтарый КАК ЧастичныйВыкупСтарый,
		//        |	ВТ_Объединение.Покупатель КАК Покупатель,
		//        |	ВТ_Объединение.НомерСтроки КАК НомерСтроки,
		//        |	ВТ_Объединение.Доставка КАК Доставка,
		//        |	ВТ_Объединение.ИнтернетМагазинЯндекса КАК ИнтернетМагазинЯндекса,
		//        |	ВТ_Объединение.ТипОплатыСсылка КАК ТипОплатыСсылка,
		//        |	ВТ_Объединение.ВладелецТовараПриоритет КАК ВладелецТовараПриоритет,
		//        |	ВТ_Объединение.ПредоплатаПоКредиту КАК ПредоплатаПоКредиту,
		//        |	ВТ_Объединение.ЗапретЧастичногоВыкупа КАК ЗапретЧастичногоВыкупа,
		//        |	ВТ_Объединение.ЧастичныйВыкуп КАК ЧастичныйВыкуп,
		//        |	ВТ_Объединение.КатегорияДоставки КАК КатегорияДоставки,
		//        |	ВТ_Объединение.МетодОплатыПодъёма КАК МетодОплатыПодъёма,
		//        |	ВТ_Объединение.СОжиданием КАК СОжиданием,
		//        |	ВТ_Объединение.ТипЗаказа КАК ТипЗаказа,
		//        |	ВТ_Объединение.ДатаЗабора КАК ДатаЗабора,
		//        |	ВТ_Объединение.МенеджерЗабора КАК МенеджерЗабора,
		//        |	ВТ_Объединение.КОплатеКлиентом КАК КОплатеКлиентом,
		//        |	ВТ_Объединение.УчитыватьИтогоКОплате КАК УчитыватьИтогоКОплате,
		//        |	ВТ_Объединение.ПодъемОплачен КАК ПодъемОплачен,
		//        |	ВТ_Объединение.КатегорияДляРасчетаЗП КАК КатегорияДляРасчетаЗП,
		//        |	ВТ_Объединение.ДополнительныйНомерЗаказа КАК ДополнительныйНомерЗаказа,
		//        |	ВТ_Объединение.Заказ КАК Заказ
		//        |ИЗ
		//        |	ВТ_Объединение КАК ВТ_Объединение
		//        |
		//        |УПОРЯДОЧИТЬ ПО
		//        |	ТипЗаказа,
		//        |	ВладелецТовараПриоритет,
		//        |	Номер,
		//        |	НомерСтроки,
		//        |	Номенклатура
		//        |ИТОГИ
		//        |	СУММА(Количество),
		//        |	СУММА(Сумма),
		//        |	СУММА(Вес),
		//        |	МАКСИМУМ(АдресДоставки),
		//        |	МАКСИМУМ(ТелефонПокупателя),
		//        |	МАКСИМУМ(Контрагент),
		//        |	МАКСИМУМ(КоммАдрес),
		//        |	МАКСИМУМ(Комментарий),
		//        |	МАКСИМУМ(ДатаДоставки),
		//        |	МАКСИМУМ(ВремяПрибытияС),
		//        |	МАКСИМУМ(ВремяПрибытияПо),
		//        |	МАКСИМУМ(ТипОплаты),
		//        |	МАКСИМУМ(НомерЛог),
		//        |	МАКСИМУМ(НомерВнешнегоЗаказа),
		//        |	МАКСИМУМ(ТелефонИнтернетМагазина),
		//        |	МАКСИМУМ(СрочнаяДоставка),
		//        |	МАКСИМУМ(ЗапретЧастичногоВыкупаСтарый),
		//        |	МАКСИМУМ(ЗапретСменыОплаты),
		//        |	МАКСИМУМ(ЧастичныйВыкупСтарый),
		//        |	МАКСИМУМ(Покупатель),
		//        |	МАКСИМУМ(Доставка),
		//        |	МАКСИМУМ(ИнтернетМагазинЯндекса),
		//        |	МАКСИМУМ(ТипОплатыСсылка),
		//        |	МАКСИМУМ(ВладелецТовараПриоритет),
		//        |	МАКСИМУМ(ПредоплатаПоКредиту),
		//        |	МАКСИМУМ(ЗапретЧастичногоВыкупа),
		//        |	МАКСИМУМ(ЧастичныйВыкуп),
		//        |	МАКСИМУМ(КатегорияДоставки),
		//        |	МАКСИМУМ(МетодОплатыПодъёма),
		//        |	МАКСИМУМ(СОжиданием),
		//        |	МАКСИМУМ(ДатаЗабора),
		//        |	МАКСИМУМ(МенеджерЗабора),
		//        |	МАКСИМУМ(КОплатеКлиентом),
		//        |	МАКСИМУМ(УчитыватьИтогоКОплате),
		//        |	МАКСИМУМ(ПодъемОплачен),
		//        |	МАКСИМУМ(КатегорияДляРасчетаЗП),
		//        |	МАКСИМУМ(ДополнительныйНомерЗаказа),
		//        |	МАКСИМУМ(Заказ)
		//        |ПО
		//        |	ТипЗаказа,
		//        |	Номер
		//        |АВТОУПОРЯДОЧИВАНИЕ";
                
	Возврат
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Заказ
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В(&Мас)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПараметрыТарифаЗаказаСрезПоследних.Заказ КАК Заказ,
	|	ПараметрыТарифаЗаказаСрезПоследних.КатегорияДоставки КАК КатегорияДоставки
	|ПОМЕСТИТЬ ВТ_ПараметрыТарифаЗаказа
	|ИЗ
	|	РегистрСведений.ПараметрыТарифаЗаказа.СрезПоследних(
	|			,
	|			Заказ В
	|				(ВЫБРАТЬ
	|					ВТ_Заказы.Заказ КАК Заказ
	|				ИЗ
	|					ВТ_Заказы КАК ВТ_Заказы)) КАК ПараметрыТарифаЗаказаСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	новаМестнаяДоставка.Ссылка КАК Доставка,
	|	РеализацияТоваровУслуг.Ссылка КАК Заказ,
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)) КАК ТипЗаказа
	|ПОМЕСТИТЬ ВТ_Доставки
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БизнесПроцесс.новаМестнаяДоставка КАК новаМестнаяДоставка
	|		ПО РеализацияТоваровУслуг.Номер = новаМестнаяДоставка.Номер
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В(&Мас)
	|
	|СГРУППИРОВАТЬ ПО
	|	новаМестнаяДоставка.Ссылка,
	|	РеализацияТоваровУслуг.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаборТовара.Ссылка,
	|	ЗаборТовара.Ссылка,
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор))
	|ИЗ
	|	Документ.ЗаборТовара КАК ЗаборТовара
	|ГДЕ
	|	ЗаборТовара.Ссылка В(&Мас)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаборТовара.Ссылка,
	|	ЗаборТовара.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	РеализацияТоваровУслугТовары.Номенклатура.Код КАК НоменклатураКод,
	|	РеализацияТоваровУслугТовары.Номенклатура.Артикул КАК НоменклатураАртикул,
	|	РеализацияТоваровУслугТовары.Количество КАК Количество,
	|	РеализацияТоваровУслугТовары.Цена КАК Цена,
	|	РеализацияТоваровУслугТовары.Сумма КАК Сумма,
	|	РеализацияТоваровУслугТовары.Вес * РеализацияТоваровУслугТовары.Количество КАК Вес,
	|	ВТ_Доставки.Доставка КАК Доставка,
	|	РеализацияТоваровУслугТовары.НомерСтроки КАК НомерСтроки,
	|	ВТ_Доставки.ТипЗаказа КАК ТипЗаказа
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	ВТ_Доставки КАК ВТ_Доставки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ПО (ВЫРАЗИТЬ(ВТ_Доставки.Доставка КАК БизнесПроцесс.новаМестнаяДоставка).Номер = РеализацияТоваровУслугТовары.Ссылка.Номер)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура,
	|	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура.Код,
	|	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура.Артикул,
	|	РеализацияТоваровУслугПодарочныеПозиции.Количество,
	|	РеализацияТоваровУслугПодарочныеПозиции.Цена,
	|	РеализацияТоваровУслугПодарочныеПозиции.Сумма,
	|	РеализацияТоваровУслугПодарочныеПозиции.Вес * РеализацияТоваровУслугПодарочныеПозиции.Количество,
	|	ВТ_Доставки.Доставка,
	|	РеализацияТоваровУслугПодарочныеПозиции.НомерСтроки,
	|	ВТ_Доставки.ТипЗаказа
	|ИЗ
	|	ВТ_Доставки КАК ВТ_Доставки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.ПодарочныеПозиции КАК РеализацияТоваровУслугПодарочныеПозиции
	|		ПО (ВЫРАЗИТЬ(ВТ_Доставки.Доставка КАК БизнесПроцесс.новаМестнаяДоставка).Номер = РеализацияТоваровУслугПодарочныеПозиции.Ссылка.Номер)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратТоваровОтПокупателяТовары.Номенклатура,
	|	ВозвратТоваровОтПокупателяТовары.Номенклатура.Код,
	|	ВозвратТоваровОтПокупателяТовары.Номенклатура.Артикул,
	|	-ВозвратТоваровОтПокупателяТовары.Количество,
	|	ВозвратТоваровОтПокупателяТовары.Цена,
	|	-ВозвратТоваровОтПокупателяТовары.Сумма,
	|	NULL,
	|	ВТ_Доставки.Доставка,
	|	ВозвратТоваровОтПокупателяТовары.НомерСтроки,
	|	ВТ_Доставки.ТипЗаказа
	|ИЗ
	|	ВТ_Доставки КАК ВТ_Доставки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
	|		ПО (ВЫРАЗИТЬ(ВТ_Доставки.Доставка КАК БизнесПроцесс.новаМестнаяДоставка).Номер = ВозвратТоваровОтПокупателяТовары.Ссылка.Номер)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Доставка"",
	|	NULL,
	|	NULL,
	|	МАКСИМУМ(1),
	|	NULL,
	|	МАКСИМУМ(ВТ_Доставки.Доставка.СтоимостьДоставкиДоМКАД),
	|	NULL,
	|	ВТ_Доставки.Доставка,
	|	998,
	|	МАКСИМУМ(ВТ_Доставки.ТипЗаказа)
	|ИЗ
	|	ВТ_Доставки КАК ВТ_Доставки
	|ГДЕ
	|	ВТ_Доставки.Доставка.СтоимостьДоставкиДоМКАД <> 0
	|	И ВТ_Доставки.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Доставки.Доставка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Доставка"",
	|	NULL,
	|	NULL,
	|	МАКСИМУМ(1),
	|	NULL,
	|	МАКСИМУМ(ВТ_Доставки.Доставка.СтоимостьДоставкиЗаМКАД),
	|	NULL,
	|	ВТ_Доставки.Доставка,
	|	999,
	|	МАКСИМУМ(ВТ_Доставки.ТипЗаказа)
	|ИЗ
	|	ВТ_Доставки КАК ВТ_Доставки
	|ГДЕ
	|	ВТ_Доставки.Доставка.СтоимостьДоставкиЗаМКАД <> 0
	|	И ВТ_Доставки.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Доставки.Доставка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаборТовараТовары.Номенклатура,
	|	ЗаборТовараТовары.Номенклатура.Код,
	|	ЗаборТовараТовары.Номенклатура.Артикул,
	|	СУММА(ЗаборТовараТовары.Количество),
	|	МАКСИМУМ(ЗаборТовараТовары.Цена),
	|	СУММА(ЗаборТовараТовары.Сумма),
	|	СУММА(ЗаборТовараТовары.Вес * ЗаборТовараТовары.Количество),
	|	ВТ_Доставки.Доставка,
	|	ЗаборТовараТовары.НомерСтроки,
	|	ВТ_Доставки.ТипЗаказа
	|ИЗ
	|	ВТ_Доставки КАК ВТ_Доставки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаборТовара КАК ЗаборТовара
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаборТовара.Товары КАК ЗаборТовараТовары
	|			ПО ЗаборТовара.Ссылка = ЗаборТовараТовары.Ссылка
	|		ПО (ВЫРАЗИТЬ(ВТ_Доставки.Доставка КАК Документ.ЗаборТовара).Номер = ЗаборТовара.Номер)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаборТовараТовары.Номенклатура,
	|	ЗаборТовараТовары.Номенклатура.Код,
	|	ЗаборТовараТовары.Номенклатура.Артикул,
	|	ВТ_Доставки.Доставка,
	|	ЗаборТовараТовары.НомерСтроки,
	|	ВТ_Доставки.ТипЗаказа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Товары.Номенклатура КАК Номенклатура,
	|	ВТ_Товары.НоменклатураКод КАК НоменклатураКод,
	|	ВТ_Товары.НоменклатураАртикул КАК НоменклатураАртикул,
	|	ВТ_Товары.Количество КАК Количество,
	|	ВТ_Товары.Цена КАК Цена,
	|	ВТ_Товары.Сумма КАК Сумма,
	|	ВТ_Товары.Вес КАК Вес,
	|	ВТ_Товары.Доставка.Номер КАК Номер,
	|	ВТ_Товары.Доставка.Адрес КАК АдресДоставки,
	|	ВТ_Товары.Доставка.Телефон КАК ТелефонПокупателя,
	|	РеализацияТоваровУслуг.ВладелецТовара КАК Контрагент,
	|	ВЫРАЗИТЬ(ВТ_Товары.Доставка.КомментарийКАдресуДоставки КАК СТРОКА(500)) КАК КоммАдрес,
	|	ВЫРАЗИТЬ(ВТ_Товары.Доставка.Комментарий КАК СТРОКА(1000)) КАК Комментарий,
	|	ВТ_Товары.Доставка.Дата КАК ДатаДоставки,
	|	ВТ_Товары.Доставка.ВремяПрибытияС КАК ВремяПрибытияС,
	|	ВТ_Товары.Доставка.ВремяПрибытияПо КАК ВремяПрибытияПо,
	|	ТипыОплат.Наименование КАК ТипОплаты,
	|	0 КАК НомерЛог,
	|	РеализацияТоваровУслуг.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
	|	РеализацияТоваровУслуг.ВладелецТовара.ТелефонИнтернетМагазина КАК ТелефонИнтернетМагазина,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.ТарифнаяСетка.Код = 2
	|			ТОГДА ""СРОЧНАЯ ДОСТАВКА""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК СрочнаяДоставка,
	|	ВЫБОР
	|		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа ЕСТЬ NULL
	|			ТОГДА """"
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа
	|					ТОГДА ""запрещен""
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ЗапретЧастичногоВыкупаСтарый,
	|	ВЫБОР
	|		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретСменыОплаты ЕСТЬ NULL
	|			ТОГДА """"
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретСменыОплаты
	|					ТОГДА ""запрещена""
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ЗапретСменыОплаты,
	|	ВЫБОР
	|		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа ЕСТЬ NULL
	|			ТОГДА """"
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа
	|					ТОГДА ""Частичный выкуп""
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ЧастичныйВыкупСтарый,
	|	ВТ_Товары.Доставка.Грузополучатель КАК Покупатель,
	|	ВТ_Товары.НомерСтроки КАК НомерСтроки,
	|	ВТ_Товары.Доставка КАК Доставка,
	|	РеализацияТоваровУслуг.ИнтернетМагазинЯндекса КАК ИнтернетМагазинЯндекса,
	|	ТипыОплат.Ссылка КАК ТипОплатыСсылка,
	|	РеализацияТоваровУслуг.ВладелецТовара.Приоритет КАК ВладелецТовараПриоритет,
	|	РеализацияТоваровУслуг.ПредоплатаПоКредиту КАК ПредоплатаПоКредиту,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.ЗапретЧастичногоВыкупа
	|			ТОГДА ""запрещен""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ЗапретЧастичногоВыкупа,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.ЗапретЧастичногоВыкупа
	|			ТОГДА ""Частичный выкуп""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ЧастичныйВыкуп,
	|	ЕСТЬNULL(ВТ_ПараметрыТарифаЗаказа.КатегорияДоставки.Родитель, ЗНАЧЕНИЕ(Справочник.КатегорииДоставки2014.ПустаяСсылка)) КАК КатегорияДоставки,
	|	ПараметрыКонтрагентовСрезПоследних.МетодОплатыПодъёма КАК МетодОплатыПодъёма,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.СОжиданием, ЛОЖЬ)
	|			ТОГДА ""С вскрытием""
	|		ИНАЧЕ ""Без вскрытия""
	|	КОНЕЦ КАК СОжиданием,
	|	ВТ_Товары.ТипЗаказа КАК ТипЗаказа,
	|	NULL КАК ДатаЗабора,
	|	NULL КАК МенеджерЗабора,
	|	ДополнительныеПараметрыЗаказа.КОплатеКлиентом КАК КОплатеКлиентом,
	|	РеализацияТоваровУслуг.УчитыватьИтогоКОплате КАК УчитыватьИтогоКОплате,
	|	ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ПодъемОплачен, ЛОЖЬ) КАК ПодъемОплачен,
	|	ДополнительныеПараметрыЗаказа.КатегорияДляРасчетаЗП КАК КатегорияДляРасчетаЗП,
	|	ДополнительныеПараметрыЗаказа.ДополнительныйНомерЗаказа КАК ДополнительныйНомерЗаказа,
	|	ДополнительныеПараметрыЗаказа.Заказ КАК Заказ
	|ПОМЕСТИТЬ ВТ_Объединение
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыОплат КАК ТипыОплат
	|			ПО РеализацияТоваровУслуг.ТипОплаты = ТипыОплат.Код
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыКонтрагентов.СрезПоследних КАК ПараметрыКонтрагентовСрезПоследних
	|			ПО РеализацияТоваровУслуг.ВладелецТовара = ПараметрыКонтрагентовСрезПоследних.Контрагент
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
	|			ПО РеализацияТоваровУслуг.Ссылка = ДополнительныеПараметрыЗаказа.Заказ
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыТарифаЗаказа КАК ВТ_ПараметрыТарифаЗаказа
	|			ПО РеализацияТоваровУслуг.Ссылка = ВТ_ПараметрыТарифаЗаказа.Заказ
	|		ПО ВТ_Товары.Доставка.Номер = РеализацияТоваровУслуг.Номер
	|ГДЕ
	|	ВТ_Товары.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Товары.Номенклатура,
	|	ВТ_Товары.НоменклатураКод,
	|	ВТ_Товары.НоменклатураАртикул,
	|	ВТ_Товары.Количество,
	|	ВТ_Товары.Цена,
	|	ВТ_Товары.Сумма,
	|	ВТ_Товары.Вес,
	|	ВТ_Товары.Доставка.Номер,
	|	ВТ_Товары.Доставка.АдресДоставки,
	|	ВТ_Товары.Доставка.Телефон,
	|	ВТ_Товары.Доставка.Контрагент,
	|	NULL,
	|	ВТ_Товары.Доставка.Комментарий,
	|	ВТ_Товары.Доставка.ДатаДоставки,
	|	ВТ_Товары.Доставка.ВремяДоставкиС,
	|	ВТ_Товары.Доставка.ВремяДоставкиПо,
	|	ТипыОплат.Наименование,
	|	0,
	|	ВТ_Товары.Доставка.НомерВнешнегоЗаказа,
	|	ВТ_Товары.Доставка.Контрагент.ТелефонИнтернетМагазина,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВТ_Товары.Доставка.Грузополучатель,
	|	ВТ_Товары.НомерСтроки,
	|	ВТ_Товары.Доставка,
	|	ВТ_Товары.Доставка.Контрагент,
	|	ТипыОплат.Ссылка,
	|	ВТ_Товары.Доставка.Контрагент.Приоритет,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВТ_Товары.ТипЗаказа,
	|	ВТ_Товары.Доставка.Дата,
	|	ВЫБОР
	|		КОГДА ВТ_Товары.Доставка.Автор = """"
	|			ТОГДА ""Не указан""
	|		ИНАЧЕ ВТ_Товары.Доставка.Автор
	|	КОНЕЦ,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыОплат КАК ТипыОплат
	|		ПО ВТ_Товары.Доставка.ТипОплаты = ТипыОплат.Код
	|ГДЕ
	|	ВТ_Товары.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Объединение.Номенклатура КАК Номенклатура,
	|	ВТ_Объединение.НоменклатураКод КАК НоменклатураКод,
	|	ВТ_Объединение.НоменклатураАртикул КАК НоменклатураАртикул,
	|	ВТ_Объединение.Количество КАК Количество,
	|	ВТ_Объединение.Цена КАК Цена,
	|	ВТ_Объединение.Сумма КАК Сумма,
	|	ВТ_Объединение.Вес КАК Вес,
	|	ВТ_Объединение.Номер КАК Номер,
	|	ВТ_Объединение.АдресДоставки КАК АдресДоставки,
	|	ВТ_Объединение.ТелефонПокупателя КАК ТелефонПокупателя,
	|	ВТ_Объединение.Контрагент КАК Контрагент,
	|	ВТ_Объединение.КоммАдрес КАК КоммАдрес,
	|	ВТ_Объединение.Комментарий КАК Комментарий,
	|	ВТ_Объединение.ДатаДоставки КАК ДатаДоставки,
	|	ВТ_Объединение.ВремяПрибытияС КАК ВремяПрибытияС,
	|	ВТ_Объединение.ВремяПрибытияПо КАК ВремяПрибытияПо,
	|	ВТ_Объединение.ТипОплаты КАК ТипОплаты,
	|	ВТ_Объединение.НомерЛог КАК НомерЛог,
	|	ВТ_Объединение.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
	|	ВТ_Объединение.ТелефонИнтернетМагазина КАК ТелефонИнтернетМагазина,
	|	ВТ_Объединение.СрочнаяДоставка КАК СрочнаяДоставка,
	|	ВТ_Объединение.ЗапретЧастичногоВыкупаСтарый КАК ЗапретЧастичногоВыкупаСтарый,
	|	ВТ_Объединение.ЗапретСменыОплаты КАК ЗапретСменыОплаты,
	|	ВТ_Объединение.ЧастичныйВыкупСтарый КАК ЧастичныйВыкупСтарый,
	|	ВТ_Объединение.Покупатель КАК Покупатель,
	|	ВТ_Объединение.НомерСтроки КАК НомерСтроки,
	|	ВТ_Объединение.Доставка КАК Доставка,
	|	ВТ_Объединение.ИнтернетМагазинЯндекса КАК ИнтернетМагазинЯндекса,
	|	ВТ_Объединение.ТипОплатыСсылка КАК ТипОплатыСсылка,
	|	ВТ_Объединение.ВладелецТовараПриоритет КАК ВладелецТовараПриоритет,
	|	ВТ_Объединение.ПредоплатаПоКредиту КАК ПредоплатаПоКредиту,
	|	ВТ_Объединение.ЗапретЧастичногоВыкупа КАК ЗапретЧастичногоВыкупа,
	|	ВТ_Объединение.ЧастичныйВыкуп КАК ЧастичныйВыкуп,
	|	ВТ_Объединение.КатегорияДоставки КАК КатегорияДоставки,
	|	ВТ_Объединение.МетодОплатыПодъёма КАК МетодОплатыПодъёма,
	|	ВТ_Объединение.СОжиданием КАК СОжиданием,
	|	ВТ_Объединение.ТипЗаказа КАК ТипЗаказа,
	|	ВТ_Объединение.ДатаЗабора КАК ДатаЗабора,
	|	ВТ_Объединение.МенеджерЗабора КАК МенеджерЗабора,
	|	ВТ_Объединение.КОплатеКлиентом КАК КОплатеКлиентом,
	|	ВТ_Объединение.УчитыватьИтогоКОплате КАК УчитыватьИтогоКОплате,
	|	ВТ_Объединение.ПодъемОплачен КАК ПодъемОплачен,
	|	ВТ_Объединение.КатегорияДляРасчетаЗП КАК КатегорияДляРасчетаЗП,
	|	ВТ_Объединение.ДополнительныйНомерЗаказа КАК ДополнительныйНомерЗаказа,
	|	ВТ_Объединение.Заказ КАК Заказ
	|ИЗ
	|	ВТ_Объединение КАК ВТ_Объединение
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипЗаказа,
	|	ВладелецТовараПриоритет,
	|	Номер,
	|	НомерСтроки,
	|	Номенклатура
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Сумма),
	|	СУММА(Вес),
	|	МАКСИМУМ(АдресДоставки),
	|	МАКСИМУМ(ТелефонПокупателя),
	|	МАКСИМУМ(Контрагент),
	|	МАКСИМУМ(КоммАдрес),
	|	МАКСИМУМ(Комментарий),
	|	МАКСИМУМ(ДатаДоставки),
	|	МАКСИМУМ(ВремяПрибытияС),
	|	МАКСИМУМ(ВремяПрибытияПо),
	|	МАКСИМУМ(ТипОплаты),
	|	МАКСИМУМ(НомерЛог),
	|	МАКСИМУМ(НомерВнешнегоЗаказа),
	|	МАКСИМУМ(ТелефонИнтернетМагазина),
	|	МАКСИМУМ(СрочнаяДоставка),
	|	МАКСИМУМ(ЗапретЧастичногоВыкупаСтарый),
	|	МАКСИМУМ(ЗапретСменыОплаты),
	|	МАКСИМУМ(ЧастичныйВыкупСтарый),
	|	МАКСИМУМ(Покупатель),
	|	МАКСИМУМ(Доставка),
	|	МАКСИМУМ(ИнтернетМагазинЯндекса),
	|	МАКСИМУМ(ТипОплатыСсылка),
	|	МАКСИМУМ(ВладелецТовараПриоритет),
	|	МАКСИМУМ(ПредоплатаПоКредиту),
	|	МАКСИМУМ(ЗапретЧастичногоВыкупа),
	|	МАКСИМУМ(ЧастичныйВыкуп),
	|	МАКСИМУМ(КатегорияДоставки),
	|	МАКСИМУМ(МетодОплатыПодъёма),
	|	МАКСИМУМ(СОжиданием),
	|	МАКСИМУМ(ДатаЗабора),
	|	МАКСИМУМ(МенеджерЗабора),
	|	МАКСИМУМ(КОплатеКлиентом),
	|	МАКСИМУМ(УчитыватьИтогоКОплате),
	|	МАКСИМУМ(ПодъемОплачен),
	|	МАКСИМУМ(КатегорияДляРасчетаЗП),
	|	МАКСИМУМ(ДополнительныйНомерЗаказа),
	|	МАКСИМУМ(Заказ)
	|ПО
	|	ТипЗаказа,
	|	Номер
	|АВТОУПОРЯДОЧИВАНИЕ";
	//Асеев 17.02.2021 (Задача № 3837)<<<

КонецФункции // ()
			
// Михушкин - 10.06.2016 --->> 
Функция ТекстЗапросаПоСамовывозу_Старый()
	
	Возврат "ВЫБРАТЬ
	        |	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	        |	РеализацияТоваровУслугТовары.Номенклатура.Код КАК НоменклатураКод,
	        |	РеализацияТоваровУслугТовары.Номенклатура.Артикул КАК НоменклатураАртикул,
	        |	РеализацияТоваровУслугТовары.Количество КАК Количество,
	        |	РеализацияТоваровУслугТовары.Цена КАК Цена,
	        |	РеализацияТоваровУслугТовары.Сумма КАК Сумма,
	        |	РеализацияТоваровУслугТовары.Вес * РеализацияТоваровУслугТовары.Количество КАК Вес,
	        |	РеализацияТоваровУслугТовары.НомерСтроки КАК НомерСтроки,
	        |	РеализацияТоваровУслугТовары.Ссылка.Ссылка КАК Ссылка,
	        |	NULL КАК Ссылка1,
	        |	РеализацияТоваровУслугТовары.ШтрихкодНоменклатуры.Код КАК ШК
	        |ПОМЕСТИТЬ ВТ_Товары
	        |ИЗ
	        |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	        |ГДЕ
	        |	РеализацияТоваровУслугТовары.Ссылка = &Реализ
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура,
	        |	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура.Код,
	        |	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура.Артикул,
	        |	РеализацияТоваровУслугПодарочныеПозиции.Количество,
	        |	РеализацияТоваровУслугПодарочныеПозиции.Цена,
	        |	РеализацияТоваровУслугПодарочныеПозиции.Сумма,
	        |	РеализацияТоваровУслугПодарочныеПозиции.Вес * РеализацияТоваровУслугПодарочныеПозиции.Количество,
	        |	РеализацияТоваровУслугПодарочныеПозиции.НомерСтроки,
	        |	NULL,
	        |	РеализацияТоваровУслугПодарочныеПозиции.Ссылка,
	        |	РеализацияТоваровУслугПодарочныеПозиции.ШтрихкодНоменклатуры.Код
	        |ИЗ
	        |	Документ.РеализацияТоваровУслуг.ПодарочныеПозиции КАК РеализацияТоваровУслугПодарочныеПозиции
	        |ГДЕ
	        |	РеализацияТоваровУслугПодарочныеПозиции.Ссылка = &Реализ
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ВозвратТоваровОтПокупателяТовары.Номенклатура,
	        |	ВозвратТоваровОтПокупателяТовары.Номенклатура.Код,
	        |	ВозвратТоваровОтПокупателяТовары.Номенклатура.Артикул,
	        |	-ВозвратТоваровОтПокупателяТовары.Количество,
	        |	ВозвратТоваровОтПокупателяТовары.Цена,
	        |	-ВозвратТоваровОтПокупателяТовары.Сумма,
	        |	NULL,
	        |	ВозвратТоваровОтПокупателяТовары.НомерСтроки,
	        |	NULL,
	        |	ВозвратТоваровОтПокупателяТовары.Ссылка,
	        |	ВозвратТоваровОтПокупателяТовары.ШтрихкодНоменклатуры.Код
	        |ИЗ
	        |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
	        |		ПО РеализацияТоваровУслуг.Номер = ВозвратТоваровОтПокупателяТовары.Ссылка.Номер
	        |ГДЕ
	        |	РеализацияТоваровУслуг.Ссылка = &Реализ
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	РеализацияТоваровУслугУслуги.Номенклатура,
	        |	РеализацияТоваровУслугУслуги.Номенклатура.Код,
	        |	РеализацияТоваровУслугУслуги.Номенклатура.Артикул,
	        |	РеализацияТоваровУслугУслуги.Количество,
	        |	РеализацияТоваровУслугУслуги.Цена,
	        |	РеализацияТоваровУслугУслуги.Сумма,
	        |	NULL,
	        |	РеализацияТоваровУслугУслуги.НомерСтроки,
	        |	РеализацияТоваровУслугУслуги.Ссылка.Ссылка,
	        |	NULL,
	        |	""""
	        |ИЗ
	        |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	        |ГДЕ
	        |	РеализацияТоваровУслугУслуги.Ссылка = &Реализ
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
            |	ВТ_Товары.НомерСтроки КАК НомерСтроки, //CeHbKA
	        |	ВТ_Товары.Номенклатура КАК Номенклатура,
	        |	ВТ_Товары.НоменклатураКод КАК НоменклатураКод,
	        |	ВТ_Товары.НоменклатураАртикул КАК НоменклатураАртикул,
	        |	ВТ_Товары.Количество КАК Количество,
	        |	ВТ_Товары.Цена КАК Цена,
	        |	ВТ_Товары.Сумма КАК Сумма,
	        |	ВТ_Товары.Вес КАК Вес,
	        |	ТипыОплат.Наименование КАК ТипОплаты,
	        |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
	        |	РеализацияТоваровУслуг.ВладелецТовара.ТелефонИнтернетМагазина КАК ТелефонИнтернетМагазина,
	        |	РеализацияТоваровУслуг.ВладелецТовара КАК Контрагент,
	        |	ВЫБОР
	        |		КОГДА РеализацияТоваровУслуг.ТарифнаяСетка.Код = 2
	        |			ТОГДА ""СРОЧНАЯ ДОСТАВКА""
	        |		ИНАЧЕ """"
	        |	КОНЕЦ КАК СрочнаяДоставка,
	        |	ВЫБОР
	        |		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа ЕСТЬ NULL
	        |			ТОГДА """"
	        |		ИНАЧЕ ВЫБОР
	        |				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа
	        |					ТОГДА ""запрещен""
	        |				ИНАЧЕ """"
	        |			КОНЕЦ
	        |	КОНЕЦ КАК ЗапретЧастичногоВыкупаСтарый,
	        |	ВЫБОР
	        |		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретСменыОплаты ЕСТЬ NULL
	        |			ТОГДА """"
	        |		ИНАЧЕ ВЫБОР
	        |				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретСменыОплаты
	        |					ТОГДА ""запрещена""
	        |				ИНАЧЕ """"
	        |			КОНЕЦ
	        |	КОНЕЦ КАК ЗапретСменыОплаты,
	        |	ВЫБОР
	        |		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа ЕСТЬ NULL
	        |			ТОГДА """"
	        |		ИНАЧЕ ВЫБОР
	        |				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа
	        |					ТОГДА ""Частичный выкуп""
	        |				ИНАЧЕ """"
	        |			КОНЕЦ
	        |	КОНЕЦ КАК ЧастичныйВыкупСтарый,
	        |	РеализацияТоваровУслуг.ИнтернетМагазинЯндекса КАК ИнтернетМагазинЯндекса,
	        |	ТипыОплат.Ссылка КАК ТипОплатыСсылка,
	        |	РеализацияТоваровУслуг.ПредоплатаПоКредиту КАК ПредоплатаПоКредиту,
	        |	КатегорииДоставки2014.Родитель КАК КатегорияДоставки,
	        |	ПараметрыКонтрагентовСрезПоследних.МетодОплатыПодъёма КАК МетодОплатыПодъёма,
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.СОжиданием, ЛОЖЬ)
	        |			ТОГДА ""С вскрытием""
	        |		ИНАЧЕ ""Без вскрытия""
	        |	КОНЕЦ КАК СОжиданием,
	        |	ВЫБОР
	        |		КОГДА РеализацияТоваровУслуг.ЗапретЧастичногоВыкупа
	        |			ТОГДА ""запрещен""
	        |		ИНАЧЕ """"
	        |	КОНЕЦ КАК ЗапретЧастичногоВыкупа,
	        |	ВЫБОР
	        |		КОГДА РеализацияТоваровУслуг.ЗапретЧастичногоВыкупа
	        |			ТОГДА ""Частичный выкуп""
	        |		ИНАЧЕ """"
	        |	КОНЕЦ КАК ЧастичныйВыкуп,
	        |	ДополнительныеПараметрыЗаказа.КОплатеКлиентом КАК КОплатеКлиентом,
	        |	РеализацияТоваровУслуг.УчитыватьИтогоКОплате КАК УчитыватьИтогоКОплате,
	        |	ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ПодъемОплачен, ЛОЖЬ) КАК ПодъемОплачен,
	        |	РеализацияТоваровУслуг.Номер КАК Номер,
	        |	РеализацияТоваровУслуг.АдресДоставки КАК АдресДоставки,
	        |	РеализацияТоваровУслуг.Телефон КАК ТелефонПокупателя,
	        |	РеализацияТоваровУслуг.Грузополучатель КАК Покупатель,
	        |	РеализацияТоваровУслуг.Комментарий КАК Комментарий,
	        |	РеализацияТоваровУслуг.Дата КАК ДатаДоставки,
	        |	""-"" КАК НомерЛог,
	        |	ДополнительныеПараметрыЗаказа.КатегорияДляРасчетаЗП КАК КатегорияДляРасчетаЗП,
	        |	ДополнительныеПараметрыЗаказа.ДополнительныйНомерЗаказа КАК ДополнительныйНомерЗаказа,
	        |	ДополнительныеПараметрыЗаказа.Заказ КАК Заказ
	        |ИЗ
	        |	ВТ_Товары КАК ВТ_Товары,
	        |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыОплат КАК ТипыОплат
	        |		ПО РеализацияТоваровУслуг.ТипОплаты = ТипыОплат.Код
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыКонтрагентов.СрезПоследних КАК ПараметрыКонтрагентовСрезПоследних
	        |		ПО РеализацияТоваровУслуг.ВладелецТовара = ПараметрыКонтрагентовСрезПоследних.Контрагент
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КатегорииДоставки2014 КАК КатегорииДоставки2014
	        |		ПО РеализацияТоваровУслуг.КатегорияДоставки = КатегорииДоставки2014.Категория
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
	        |		ПО РеализацияТоваровУслуг.Ссылка = ДополнительныеПараметрыЗаказа.Заказ
	        |ГДЕ
	        |	РеализацияТоваровУслуг.Ссылка = &Реализ
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	РеализацияТоваровУслуг.ВладелецТовара.Приоритет,
	        |	Номенклатура,
	        |	НомерСтроки
	        |ИТОГИ
	        |	МАКСИМУМ(Номенклатура),
	        |	МАКСИМУМ(НоменклатураКод),
	        |	МАКСИМУМ(НоменклатураАртикул),
	        |	СУММА(Количество),
	        |	МАКСИМУМ(Цена),
	        |	СУММА(Сумма),
	        |	СУММА(Вес),
	        |	МАКСИМУМ(ТипОплаты),
	        |	МАКСИМУМ(НомерВнешнегоЗаказа),
	        |	МАКСИМУМ(ТелефонИнтернетМагазина),
	        |	МАКСИМУМ(Контрагент),
	        |	МАКСИМУМ(СрочнаяДоставка),
	        |	МАКСИМУМ(ЗапретЧастичногоВыкупаСтарый),
	        |	МАКСИМУМ(ЗапретСменыОплаты),
	        |	МАКСИМУМ(ЧастичныйВыкупСтарый),
	        |	МАКСИМУМ(ИнтернетМагазинЯндекса),
	        |	МАКСИМУМ(ТипОплатыСсылка),
	        |	МАКСИМУМ(ПредоплатаПоКредиту),
	        |	МАКСИМУМ(КатегорияДоставки),
	        |	МАКСИМУМ(МетодОплатыПодъёма),
	        |	МАКСИМУМ(СОжиданием),
	        |	МАКСИМУМ(ЗапретЧастичногоВыкупа),
	        |	МАКСИМУМ(ЧастичныйВыкуп),
	        |	МАКСИМУМ(КОплатеКлиентом),
	        |	МАКСИМУМ(УчитыватьИтогоКОплате),
	        |	МАКСИМУМ(ПодъемОплачен),
	        |	МАКСИМУМ(ТелефонПокупателя),
	        |	МАКСИМУМ(Покупатель),
	        |	МАКСИМУМ(ДатаДоставки),
	        |	МАКСИМУМ(НомерЛог),
	        |	МАКСИМУМ(КатегорияДляРасчетаЗП),
	        |	МАКСИМУМ(ДополнительныйНомерЗаказа),
	        |	МАКСИМУМ(Заказ)
	        |ПО
	        |	Номер
	        |АВТОУПОРЯДОЧИВАНИЕ";
 	

КонецФункции // ()
// <<--- Михушкин 			

//CeHbKA 24.07.2019 #2835
Функция ТекстЗапросаПоСамовывозу()
	
	//Асеев 17.02.2021 (Задача № 3837)>>>
	//Возврат "ВЫБРАТЬ РАЗЛИЧНЫЕ
	//        |	РеализацияТоваровУслугМестаЗаказа.Ссылка КАК Ссылка,
	//        |	РеализацияТоваровУслугМестаЗаказа.ШтрихкодМеста КАК ШтрихкодМеста,
	//        |	РеализацияТоваровУслугМестаЗаказа.МестоЗаказа КАК МестоЗаказа,
	//        |	РеализацияТоваровУслугМестаЗаказа.КлючСвязиМеста КАК КлючСвязиМеста
	//        |ПОМЕСТИТЬ ВТ_ШКМест
	//        |ИЗ
	//        |	Документ.РеализацияТоваровУслуг.МестаЗаказа КАК РеализацияТоваровУслугМестаЗаказа
	//        |ГДЕ
	//        |	РеализацияТоваровУслугМестаЗаказа.Ссылка = &Реализ
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	//        |	РеализацияТоваровУслугТовары.Номенклатура.Код КАК НоменклатураКод,
	//        |	РеализацияТоваровУслугТовары.Номенклатура.Артикул КАК НоменклатураАртикул,
	//        |	РеализацияТоваровУслугТовары.Количество КАК Количество,
	//        |	РеализацияТоваровУслугТовары.Цена КАК Цена,
	//        |	РеализацияТоваровУслугТовары.Сумма КАК Сумма,
	//        |	РеализацияТоваровУслугТовары.Вес * РеализацияТоваровУслугТовары.Количество КАК Вес,
	//        |	РеализацияТоваровУслугТовары.НомерСтроки КАК НомерСтроки,
	//        |	РеализацияТоваровУслугТовары.Ссылка.Ссылка КАК Ссылка,
	//        |	NULL КАК Ссылка1,
	//        |	РеализацияТоваровУслугТовары.ШтрихкодНоменклатуры.Код КАК ШК,
	//        |	РеализацияТоваровУслугТовары.КлючСвязиМеста КАК КлючСвязиМеста
	//        |ПОМЕСТИТЬ ВТ_Товары
	//        |ИЗ
	//        |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	//        |ГДЕ
	//        |	РеализацияТоваровУслугТовары.Ссылка = &Реализ
	//        |
	//        |ОБЪЕДИНИТЬ ВСЕ
	//        |
	//        |ВЫБРАТЬ
	//        |	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура,
	//        |	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура.Код,
	//        |	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура.Артикул,
	//        |	РеализацияТоваровУслугПодарочныеПозиции.Количество,
	//        |	РеализацияТоваровУслугПодарочныеПозиции.Цена,
	//        |	РеализацияТоваровУслугПодарочныеПозиции.Сумма,
	//        |	РеализацияТоваровУслугПодарочныеПозиции.Вес * РеализацияТоваровУслугПодарочныеПозиции.Количество,
	//        |	РеализацияТоваровУслугПодарочныеПозиции.НомерСтроки,
	//        |	NULL,
	//        |	РеализацияТоваровУслугПодарочныеПозиции.Ссылка,
	//        |	РеализацияТоваровУслугПодарочныеПозиции.ШтрихкодНоменклатуры.Код,
	//        |	NULL
	//        |ИЗ
	//        |	Документ.РеализацияТоваровУслуг.ПодарочныеПозиции КАК РеализацияТоваровУслугПодарочныеПозиции
	//        |ГДЕ
	//        |	РеализацияТоваровУслугПодарочныеПозиции.Ссылка = &Реализ
	//        |
	//        |ОБЪЕДИНИТЬ ВСЕ
	//        |
	//        |ВЫБРАТЬ
	//        |	ВозвратТоваровОтПокупателяТовары.Номенклатура,
	//        |	ВозвратТоваровОтПокупателяТовары.Номенклатура.Код,
	//        |	ВозвратТоваровОтПокупателяТовары.Номенклатура.Артикул,
	//        |	-ВозвратТоваровОтПокупателяТовары.Количество,
	//        |	ВозвратТоваровОтПокупателяТовары.Цена,
	//        |	-ВозвратТоваровОтПокупателяТовары.Сумма,
	//        |	NULL,
	//        |	ВозвратТоваровОтПокупателяТовары.НомерСтроки,
	//        |	NULL,
	//        |	ВозвратТоваровОтПокупателяТовары.Ссылка,
	//        |	ВозвратТоваровОтПокупателяТовары.ШтрихкодНоменклатуры.Код,
	//        |	NULL
	//        |ИЗ
	//        |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	//        |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
	//        |		ПО РеализацияТоваровУслуг.Номер = ВозвратТоваровОтПокупателяТовары.Ссылка.Номер
	//        |ГДЕ
	//        |	РеализацияТоваровУслуг.Ссылка = &Реализ
	//        |
	//        |ОБЪЕДИНИТЬ ВСЕ
	//        |
	//        |ВЫБРАТЬ
	//        |	РеализацияТоваровУслугУслуги.Номенклатура,
	//        |	РеализацияТоваровУслугУслуги.Номенклатура.Код,
	//        |	РеализацияТоваровУслугУслуги.Номенклатура.Артикул,
	//        |	РеализацияТоваровУслугУслуги.Количество,
	//        |	РеализацияТоваровУслугУслуги.Цена,
	//        |	РеализацияТоваровУслугУслуги.Сумма,
	//        |	NULL,
	//        |	РеализацияТоваровУслугУслуги.НомерСтроки,
	//        |	РеализацияТоваровУслугУслуги.Ссылка.Ссылка,
	//        |	NULL,
	//        |	"""",
	//        |	NULL
	//        |ИЗ
	//        |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	//        |ГДЕ
	//        |	РеализацияТоваровУслугУслуги.Ссылка = &Реализ
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	ВТ_Товары.НомерСтроки КАК НомерСтроки,
	//        |	ВТ_Товары.КлючСвязиМеста КАК КлючСвязиМеста,
	//        |	ЕСТЬNULL(ВТ_ШКМест.ШтрихкодМеста, """") КАК ШтрихкодМеста,
	//        |	ВТ_Товары.Номенклатура КАК Номенклатура,
	//        |	ВТ_Товары.НоменклатураКод КАК НоменклатураКод,
	//        |	ВТ_Товары.НоменклатураАртикул КАК НоменклатураАртикул,
	//        |	ВТ_Товары.Количество КАК Количество,
	//        |	ВТ_Товары.Цена КАК Цена,
	//        |	ВТ_Товары.Сумма КАК Сумма,
	//        |	ВТ_Товары.Вес КАК Вес,
	//        |	ТипыОплат.Наименование КАК ТипОплаты,
	//        |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
	//        |	РеализацияТоваровУслуг.ВладелецТовара.ТелефонИнтернетМагазина КАК ТелефонИнтернетМагазина,
	//        |	РеализацияТоваровУслуг.ВладелецТовара КАК Контрагент,
	//        |	ВЫБОР
	//        |		КОГДА РеализацияТоваровУслуг.ТарифнаяСетка.Код = 2
	//        |			ТОГДА ""СРОЧНАЯ ДОСТАВКА""
	//        |		ИНАЧЕ """"
	//        |	КОНЕЦ КАК СрочнаяДоставка,
	//        |	ВЫБОР
	//        |		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа ЕСТЬ NULL
	//        |			ТОГДА """"
	//        |		ИНАЧЕ ВЫБОР
	//        |				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа
	//        |					ТОГДА ""запрещен""
	//        |				ИНАЧЕ """"
	//        |			КОНЕЦ
	//        |	КОНЕЦ КАК ЗапретЧастичногоВыкупаСтарый,
	//        |	ВЫБОР
	//        |		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретСменыОплаты ЕСТЬ NULL
	//        |			ТОГДА """"
	//        |		ИНАЧЕ ВЫБОР
	//        |				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретСменыОплаты
	//        |					ТОГДА ""запрещена""
	//        |				ИНАЧЕ """"
	//        |			КОНЕЦ
	//        |	КОНЕЦ КАК ЗапретСменыОплаты,
	//        |	ВЫБОР
	//        |		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа ЕСТЬ NULL
	//        |			ТОГДА """"
	//        |		ИНАЧЕ ВЫБОР
	//        |				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа
	//        |					ТОГДА ""Частичный выкуп""
	//        |				ИНАЧЕ """"
	//        |			КОНЕЦ
	//        |	КОНЕЦ КАК ЧастичныйВыкупСтарый,
	//        |	РеализацияТоваровУслуг.ИнтернетМагазинЯндекса КАК ИнтернетМагазинЯндекса,
	//        |	ТипыОплат.Ссылка КАК ТипОплатыСсылка,
	//        |	РеализацияТоваровУслуг.ПредоплатаПоКредиту КАК ПредоплатаПоКредиту,
	//        |	КатегорииДоставки2014.Родитель КАК КатегорияДоставки,
	//        |	ПараметрыКонтрагентовСрезПоследних.МетодОплатыПодъёма КАК МетодОплатыПодъёма,
	//        |	ВЫБОР
	//        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.СОжиданием, ЛОЖЬ)
	//        |			ТОГДА ""С вскрытием""
	//        |		ИНАЧЕ ""Без вскрытия""
	//        |	КОНЕЦ КАК СОжиданием,
	//        |	ВЫБОР
	//        |		КОГДА РеализацияТоваровУслуг.ЗапретЧастичногоВыкупа
	//        |			ТОГДА ""запрещен""
	//        |		ИНАЧЕ """"
	//        |	КОНЕЦ КАК ЗапретЧастичногоВыкупа,
	//        |	ВЫБОР
	//        |		КОГДА РеализацияТоваровУслуг.ЗапретЧастичногоВыкупа
	//        |			ТОГДА ""Частичный выкуп""
	//        |		ИНАЧЕ """"
	//        |	КОНЕЦ КАК ЧастичныйВыкуп,
	//        |	ДополнительныеПараметрыЗаказа.КОплатеКлиентом КАК КОплатеКлиентом,
	//        |	РеализацияТоваровУслуг.УчитыватьИтогоКОплате КАК УчитыватьИтогоКОплате,
	//        |	ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ПодъемОплачен, ЛОЖЬ) КАК ПодъемОплачен,
	//        |	РеализацияТоваровУслуг.Номер КАК Номер,
	//        |	РеализацияТоваровУслуг.АдресДоставки КАК АдресДоставки,
	//        |	РеализацияТоваровУслуг.Телефон КАК ТелефонПокупателя,
	//        |	РеализацияТоваровУслуг.Грузополучатель КАК Покупатель,
	//        |	РеализацияТоваровУслуг.Комментарий КАК Комментарий,
	//        |	РеализацияТоваровУслуг.Дата КАК ДатаДоставки,
	//        |	""-"" КАК НомерЛог,
	//        |	ДополнительныеПараметрыЗаказа.КатегорияДляРасчетаЗП КАК КатегорияДляРасчетаЗП,
	//        |	ДополнительныеПараметрыЗаказа.ДополнительныйНомерЗаказа КАК ДополнительныйНомерЗаказа,
	//        |	ДополнительныеПараметрыЗаказа.Заказ КАК Заказ
	//        |ИЗ
	//        |	ВТ_Товары КАК ВТ_Товары
	//        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ШКМест КАК ВТ_ШКМест
	//        |		ПО ВТ_Товары.КлючСвязиМеста = ВТ_ШКМест.КлючСвязиМеста,
	//        |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	//        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыОплат КАК ТипыОплат
	//        |		ПО РеализацияТоваровУслуг.ТипОплаты = ТипыОплат.Код
	//        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыКонтрагентов.СрезПоследних КАК ПараметрыКонтрагентовСрезПоследних
	//        |		ПО РеализацияТоваровУслуг.ВладелецТовара = ПараметрыКонтрагентовСрезПоследних.Контрагент
	//        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КатегорииДоставки2014 КАК КатегорииДоставки2014
	//        |		ПО РеализацияТоваровУслуг.КатегорияДоставки = КатегорииДоставки2014.Категория
	//        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
	//        |		ПО РеализацияТоваровУслуг.Ссылка = ДополнительныеПараметрыЗаказа.Заказ
	//        |ГДЕ
	//        |	РеализацияТоваровУслуг.Ссылка = &Реализ
	//        |
	//        |УПОРЯДОЧИТЬ ПО
	//        |	РеализацияТоваровУслуг.ВладелецТовара.Приоритет,
	//        |	Номенклатура,
	//        |	НомерСтроки
	//        |ИТОГИ
	//        |	МАКСИМУМ(Номенклатура),
	//        |	МАКСИМУМ(НоменклатураКод),
	//        |	МАКСИМУМ(НоменклатураАртикул),
	//        |	СУММА(Количество),
	//        |	МАКСИМУМ(Цена),
	//        |	СУММА(Сумма),
	//        |	СУММА(Вес),
	//        |	МАКСИМУМ(ТипОплаты),
	//        |	МАКСИМУМ(НомерВнешнегоЗаказа),
	//        |	МАКСИМУМ(ТелефонИнтернетМагазина),
	//        |	МАКСИМУМ(Контрагент),
	//        |	МАКСИМУМ(СрочнаяДоставка),
	//        |	МАКСИМУМ(ЗапретЧастичногоВыкупаСтарый),
	//        |	МАКСИМУМ(ЗапретСменыОплаты),
	//        |	МАКСИМУМ(ЧастичныйВыкупСтарый),
	//        |	МАКСИМУМ(ИнтернетМагазинЯндекса),
	//        |	МАКСИМУМ(ТипОплатыСсылка),
	//        |	МАКСИМУМ(ПредоплатаПоКредиту),
	//        |	МАКСИМУМ(КатегорияДоставки),
	//        |	МАКСИМУМ(МетодОплатыПодъёма),
	//        |	МАКСИМУМ(СОжиданием),
	//        |	МАКСИМУМ(ЗапретЧастичногоВыкупа),
	//        |	МАКСИМУМ(ЧастичныйВыкуп),
	//        |	МАКСИМУМ(КОплатеКлиентом),
	//        |	МАКСИМУМ(УчитыватьИтогоКОплате),
	//        |	МАКСИМУМ(ПодъемОплачен),
	//        |	МАКСИМУМ(ТелефонПокупателя),
	//        |	МАКСИМУМ(Покупатель),
	//        |	МАКСИМУМ(ДатаДоставки),
	//        |	МАКСИМУМ(НомерЛог),
	//        |	МАКСИМУМ(КатегорияДляРасчетаЗП),
	//        |	МАКСИМУМ(ДополнительныйНомерЗаказа),
	//        |	МАКСИМУМ(Заказ)
	//        |ПО
	//        |	Номер
	//        |АВТОУПОРЯДОЧИВАНИЕ";
	
	Возврат
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеализацияТоваровУслугМестаЗаказа.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслугМестаЗаказа.ШтрихкодМеста КАК ШтрихкодМеста,
	|	РеализацияТоваровУслугМестаЗаказа.МестоЗаказа КАК МестоЗаказа,
	|	РеализацияТоваровУслугМестаЗаказа.КлючСвязиМеста КАК КлючСвязиМеста
	|ПОМЕСТИТЬ ВТ_ШКМест
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.МестаЗаказа КАК РеализацияТоваровУслугМестаЗаказа
	|ГДЕ
	|	РеализацияТоваровУслугМестаЗаказа.Ссылка = &Реализ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПараметрыТарифаЗаказаСрезПоследних.Заказ КАК Заказ,
	|	ПараметрыТарифаЗаказаСрезПоследних.КатегорияДоставки КАК КатегорияДоставки
	|ПОМЕСТИТЬ ВТ_ПараметрыТарифаЗаказа
	|ИЗ
	|	РегистрСведений.ПараметрыТарифаЗаказа.СрезПоследних(, Заказ = &Реализ) КАК ПараметрыТарифаЗаказаСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	РеализацияТоваровУслугТовары.Номенклатура.Код КАК НоменклатураКод,
	|	РеализацияТоваровУслугТовары.Номенклатура.Артикул КАК НоменклатураАртикул,
	|	РеализацияТоваровУслугТовары.Количество КАК Количество,
	|	РеализацияТоваровУслугТовары.Цена КАК Цена,
	|	РеализацияТоваровУслугТовары.Сумма КАК Сумма,
	|	РеализацияТоваровУслугТовары.Вес * РеализацияТоваровУслугТовары.Количество КАК Вес,
	|	РеализацияТоваровУслугТовары.НомерСтроки КАК НомерСтроки,
	|	РеализацияТоваровУслугТовары.Ссылка.Ссылка КАК Ссылка,
	|	NULL КАК Ссылка1,
	|	РеализацияТоваровУслугТовары.ШтрихкодНоменклатуры.Код КАК ШК,
	|	РеализацияТоваровУслугТовары.КлючСвязиМеста КАК КлючСвязиМеста
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка = &Реализ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура,
	|	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура.Код,
	|	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура.Артикул,
	|	РеализацияТоваровУслугПодарочныеПозиции.Количество,
	|	РеализацияТоваровУслугПодарочныеПозиции.Цена,
	|	РеализацияТоваровУслугПодарочныеПозиции.Сумма,
	|	РеализацияТоваровУслугПодарочныеПозиции.Вес * РеализацияТоваровУслугПодарочныеПозиции.Количество,
	|	РеализацияТоваровУслугПодарочныеПозиции.НомерСтроки,
	|	NULL,
	|	РеализацияТоваровУслугПодарочныеПозиции.Ссылка,
	|	РеализацияТоваровУслугПодарочныеПозиции.ШтрихкодНоменклатуры.Код,
	|	NULL
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.ПодарочныеПозиции КАК РеализацияТоваровУслугПодарочныеПозиции
	|ГДЕ
	|	РеализацияТоваровУслугПодарочныеПозиции.Ссылка = &Реализ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратТоваровОтПокупателяТовары.Номенклатура,
	|	ВозвратТоваровОтПокупателяТовары.Номенклатура.Код,
	|	ВозвратТоваровОтПокупателяТовары.Номенклатура.Артикул,
	|	-ВозвратТоваровОтПокупателяТовары.Количество,
	|	ВозвратТоваровОтПокупателяТовары.Цена,
	|	-ВозвратТоваровОтПокупателяТовары.Сумма,
	|	NULL,
	|	ВозвратТоваровОтПокупателяТовары.НомерСтроки,
	|	NULL,
	|	ВозвратТоваровОтПокупателяТовары.Ссылка,
	|	ВозвратТоваровОтПокупателяТовары.ШтрихкодНоменклатуры.Код,
	|	NULL
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
	|		ПО РеализацияТоваровУслуг.Номер = ВозвратТоваровОтПокупателяТовары.Ссылка.Номер
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Реализ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугУслуги.Номенклатура,
	|	РеализацияТоваровУслугУслуги.Номенклатура.Код,
	|	РеализацияТоваровУслугУслуги.Номенклатура.Артикул,
	|	РеализацияТоваровУслугУслуги.Количество,
	|	РеализацияТоваровУслугУслуги.Цена,
	|	РеализацияТоваровУслугУслуги.Сумма,
	|	NULL,
	|	РеализацияТоваровУслугУслуги.НомерСтроки,
	|	РеализацияТоваровУслугУслуги.Ссылка.Ссылка,
	|	NULL,
	|	"""",
	|	NULL
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	|ГДЕ
	|	РеализацияТоваровУслугУслуги.Ссылка = &Реализ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Товары.НомерСтроки КАК НомерСтроки,
	|	ВТ_Товары.КлючСвязиМеста КАК КлючСвязиМеста,
	|	ЕСТЬNULL(ВТ_ШКМест.ШтрихкодМеста, """") КАК ШтрихкодМеста,
	|	ВТ_Товары.Номенклатура КАК Номенклатура,
	|	ВТ_Товары.НоменклатураКод КАК НоменклатураКод,
	|	ВТ_Товары.НоменклатураАртикул КАК НоменклатураАртикул,
	|	ВТ_Товары.Количество КАК Количество,
	|	ВТ_Товары.Цена КАК Цена,
	|	ВТ_Товары.Сумма КАК Сумма,
	|	ВТ_Товары.Вес КАК Вес,
	|	ТипыОплат.Наименование КАК ТипОплаты,
	|	РеализацияТоваровУслуг.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
	|	РеализацияТоваровУслуг.ВладелецТовара.ТелефонИнтернетМагазина КАК ТелефонИнтернетМагазина,
	|	РеализацияТоваровУслуг.ВладелецТовара КАК Контрагент,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.ТарифнаяСетка.Код = 2
	|			ТОГДА ""СРОЧНАЯ ДОСТАВКА""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК СрочнаяДоставка,
	|	ВЫБОР
	|		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа ЕСТЬ NULL
	|			ТОГДА """"
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа
	|					ТОГДА ""запрещен""
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ЗапретЧастичногоВыкупаСтарый,
	|	ВЫБОР
	|		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретСменыОплаты ЕСТЬ NULL
	|			ТОГДА """"
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретСменыОплаты
	|					ТОГДА ""запрещена""
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ЗапретСменыОплаты,
	|	ВЫБОР
	|		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа ЕСТЬ NULL
	|			ТОГДА """"
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа
	|					ТОГДА ""Частичный выкуп""
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ЧастичныйВыкупСтарый,
	|	РеализацияТоваровУслуг.ИнтернетМагазинЯндекса КАК ИнтернетМагазинЯндекса,
	|	ТипыОплат.Ссылка КАК ТипОплатыСсылка,
	|	РеализацияТоваровУслуг.ПредоплатаПоКредиту КАК ПредоплатаПоКредиту,
	|	ЕСТЬNULL(ВТ_ПараметрыТарифаЗаказа.КатегорияДоставки.Родитель, ЗНАЧЕНИЕ(Справочник.КатегорииДоставки2014.ПустаяСсылка)) КАК КатегорияДоставки,
	|	ПараметрыКонтрагентовСрезПоследних.МетодОплатыПодъёма КАК МетодОплатыПодъёма,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.СОжиданием, ЛОЖЬ)
	|			ТОГДА ""С вскрытием""
	|		ИНАЧЕ ""Без вскрытия""
	|	КОНЕЦ КАК СОжиданием,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.ЗапретЧастичногоВыкупа
	|			ТОГДА ""запрещен""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ЗапретЧастичногоВыкупа,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.ЗапретЧастичногоВыкупа
	|			ТОГДА ""Частичный выкуп""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ЧастичныйВыкуп,
	|	ДополнительныеПараметрыЗаказа.КОплатеКлиентом КАК КОплатеКлиентом,
	|	РеализацияТоваровУслуг.УчитыватьИтогоКОплате КАК УчитыватьИтогоКОплате,
	|	ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ПодъемОплачен, ЛОЖЬ) КАК ПодъемОплачен,
	|	РеализацияТоваровУслуг.Номер КАК Номер,
	|	РеализацияТоваровУслуг.АдресДоставки КАК АдресДоставки,
	|	РеализацияТоваровУслуг.Телефон КАК ТелефонПокупателя,
	|	РеализацияТоваровУслуг.Грузополучатель КАК Покупатель,
	|	РеализацияТоваровУслуг.Комментарий КАК Комментарий,
	|	РеализацияТоваровУслуг.Дата КАК ДатаДоставки,
	|	""-"" КАК НомерЛог,
	|	ДополнительныеПараметрыЗаказа.КатегорияДляРасчетаЗП КАК КатегорияДляРасчетаЗП,
	|	ДополнительныеПараметрыЗаказа.ДополнительныйНомерЗаказа КАК ДополнительныйНомерЗаказа,
	|	ДополнительныеПараметрыЗаказа.Заказ КАК Заказ
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ШКМест КАК ВТ_ШКМест
	|		ПО ВТ_Товары.КлючСвязиМеста = ВТ_ШКМест.КлючСвязиМеста,
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыОплат КАК ТипыОплат
	|		ПО РеализацияТоваровУслуг.ТипОплаты = ТипыОплат.Код
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыКонтрагентов.СрезПоследних КАК ПараметрыКонтрагентовСрезПоследних
	|		ПО РеализацияТоваровУслуг.ВладелецТовара = ПараметрыКонтрагентовСрезПоследних.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
	|		ПО РеализацияТоваровУслуг.Ссылка = ДополнительныеПараметрыЗаказа.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыТарифаЗаказа КАК ВТ_ПараметрыТарифаЗаказа
	|		ПО (ВТ_ПараметрыТарифаЗаказа.Заказ = РеализацияТоваровУслуг.Ссылка)
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Реализ
	|
	|УПОРЯДОЧИТЬ ПО
	|	РеализацияТоваровУслуг.ВладелецТовара.Приоритет,
	|	Номенклатура,
	|	НомерСтроки
	|ИТОГИ
	|	МАКСИМУМ(Номенклатура),
	|	МАКСИМУМ(НоменклатураКод),
	|	МАКСИМУМ(НоменклатураАртикул),
	|	СУММА(Количество),
	|	МАКСИМУМ(Цена),
	|	СУММА(Сумма),
	|	СУММА(Вес),
	|	МАКСИМУМ(ТипОплаты),
	|	МАКСИМУМ(НомерВнешнегоЗаказа),
	|	МАКСИМУМ(ТелефонИнтернетМагазина),
	|	МАКСИМУМ(Контрагент),
	|	МАКСИМУМ(СрочнаяДоставка),
	|	МАКСИМУМ(ЗапретЧастичногоВыкупаСтарый),
	|	МАКСИМУМ(ЗапретСменыОплаты),
	|	МАКСИМУМ(ЧастичныйВыкупСтарый),
	|	МАКСИМУМ(ИнтернетМагазинЯндекса),
	|	МАКСИМУМ(ТипОплатыСсылка),
	|	МАКСИМУМ(ПредоплатаПоКредиту),
	|	МАКСИМУМ(КатегорияДоставки),
	|	МАКСИМУМ(МетодОплатыПодъёма),
	|	МАКСИМУМ(СОжиданием),
	|	МАКСИМУМ(ЗапретЧастичногоВыкупа),
	|	МАКСИМУМ(ЧастичныйВыкуп),
	|	МАКСИМУМ(КОплатеКлиентом),
	|	МАКСИМУМ(УчитыватьИтогоКОплате),
	|	МАКСИМУМ(ПодъемОплачен),
	|	МАКСИМУМ(ТелефонПокупателя),
	|	МАКСИМУМ(Покупатель),
	|	МАКСИМУМ(ДатаДоставки),
	|	МАКСИМУМ(НомерЛог),
	|	МАКСИМУМ(КатегорияДляРасчетаЗП),
	|	МАКСИМУМ(ДополнительныйНомерЗаказа),
	|	МАКСИМУМ(Заказ)
	|ПО
	|	Номер
	|АВТОУПОРЯДОЧИВАНИЕ";
	//Асеев 17.02.2021 (Задача № 3837)<<<

КонецФункции // ()

Функция ТекстЗапросаПоДоставке()
	//Асеев 17.02.2021 (Задача № 3837)>>>
		//Возврат "ВЫБРАТЬ
		//        |	новаМестнаяДоставка.Ссылка КАК Доставка,
		//        |	МАКСИМУМ(новаЗаданияРейсов.Рейс) КАК Рейс
		//        |ПОМЕСТИТЬ ВТ_Доставки
		//        |ИЗ
		//        |	БизнесПроцесс.новаМестнаяДоставка КАК новаМестнаяДоставка
		//        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.новаЗаданияРейсов КАК новаЗаданияРейсов
		//        |		ПО (новаЗаданияРейсов.Доставка = новаМестнаяДоставка.Ссылка)
		//        |ГДЕ
		//        |	новаМестнаяДоставка.Ссылка = &Доставка
		//        |
		//        |СГРУППИРОВАТЬ ПО
		//        |	новаМестнаяДоставка.Ссылка
		//        |;
		//        |
		//        |////////////////////////////////////////////////////////////////////////////////
		//        |ВЫБРАТЬ
		//        |	РеализацияТоваровУслугТовары.КлючСвязиМеста КАК КлючСвязиМеста,
		//        |	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
		//        |	РеализацияТоваровУслугТовары.Номенклатура.Код КАК НоменклатураКод,
		//        |	РеализацияТоваровУслугТовары.Номенклатура.Артикул КАК НоменклатураАртикул,
		//        |	РеализацияТоваровУслугТовары.Количество КАК Количество,
		//        |	РеализацияТоваровУслугТовары.Цена КАК Цена,
		//        |	РеализацияТоваровУслугТовары.Сумма КАК Сумма,
		//        |	РеализацияТоваровУслугТовары.Вес * РеализацияТоваровУслугТовары.Количество КАК Вес,
		//        |	ВТ_Доставки.Доставка КАК Доставка,
		//        |	ВТ_Доставки.Рейс КАК Рейс,
		//        |	РеализацияТоваровУслугТовары.НомерСтроки КАК НомерСтроки,
		//        |	РеализацияТоваровУслугТовары.ШтрихкодНоменклатуры.Код КАК ШК
		//        |ПОМЕСТИТЬ ВТ_Товары
		//        |ИЗ
		//        |	ВТ_Доставки КАК ВТ_Доставки
		//        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		//        |		ПО ВТ_Доставки.Доставка.Номер = РеализацияТоваровУслугТовары.Ссылка.Номер
		//        |
		//        |ОБЪЕДИНИТЬ ВСЕ
		//        |
		//        |ВЫБРАТЬ
		//        |	NULL,
		//        |	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура,
		//        |	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура.Код,
		//        |	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура.Артикул,
		//        |	РеализацияТоваровУслугПодарочныеПозиции.Количество,
		//        |	РеализацияТоваровУслугПодарочныеПозиции.Цена,
		//        |	РеализацияТоваровУслугПодарочныеПозиции.Сумма,
		//        |	РеализацияТоваровУслугПодарочныеПозиции.Вес * РеализацияТоваровУслугПодарочныеПозиции.Количество,
		//        |	ВТ_Доставки.Доставка,
		//        |	ВТ_Доставки.Рейс,
		//        |	РеализацияТоваровУслугПодарочныеПозиции.НомерСтроки,
		//        |	РеализацияТоваровУслугПодарочныеПозиции.ШтрихкодНоменклатуры.Код
		//        |ИЗ
		//        |	ВТ_Доставки КАК ВТ_Доставки
		//        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.ПодарочныеПозиции КАК РеализацияТоваровУслугПодарочныеПозиции
		//        |		ПО ВТ_Доставки.Доставка.Номер = РеализацияТоваровУслугПодарочныеПозиции.Ссылка.Номер
		//        |
		//        |ОБЪЕДИНИТЬ ВСЕ
		//        |
		//        |ВЫБРАТЬ
		//        |	NULL,
		//        |	ВозвратТоваровОтПокупателяТовары.Номенклатура,
		//        |	ВозвратТоваровОтПокупателяТовары.Номенклатура.Код,
		//        |	ВозвратТоваровОтПокупателяТовары.Номенклатура.Артикул,
		//        |	-ВозвратТоваровОтПокупателяТовары.Количество,
		//        |	ВозвратТоваровОтПокупателяТовары.Цена,
		//        |	-ВозвратТоваровОтПокупателяТовары.Сумма,
		//        |	NULL,
		//        |	ВТ_Доставки.Доставка,
		//        |	ВТ_Доставки.Рейс,
		//        |	ВозвратТоваровОтПокупателяТовары.НомерСтроки,
		//        |	ВозвратТоваровОтПокупателяТовары.ШтрихкодНоменклатуры.Код
		//        |ИЗ
		//        |	ВТ_Доставки КАК ВТ_Доставки
		//        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
		//        |		ПО ВТ_Доставки.Доставка.Номер = ВозвратТоваровОтПокупателяТовары.Ссылка.Номер
		//        |
		//        |ОБЪЕДИНИТЬ ВСЕ
		//        |
		//        |ВЫБРАТЬ
		//        |	NULL,
		//        |	""Доставка"",
		//        |	NULL,
		//        |	NULL,
		//        |	МАКСИМУМ(1),
		//        |	NULL,
		//        |	МАКСИМУМ(ВТ_Доставки.Доставка.СтоимостьДоставкиДоМКАД),
		//        |	NULL,
		//        |	ВТ_Доставки.Доставка,
		//        |	NULL,
		//        |	998,
		//        |	""""
		//        |ИЗ
		//        |	ВТ_Доставки КАК ВТ_Доставки
		//        |ГДЕ
		//        |	ВТ_Доставки.Доставка.СтоимостьДоставкиДоМКАД <> 0
		//        |
		//        |СГРУППИРОВАТЬ ПО
		//        |	ВТ_Доставки.Доставка
		//        |
		//        |ОБЪЕДИНИТЬ ВСЕ
		//        |
		//        |ВЫБРАТЬ
		//        |	NULL,
		//        |	""Доставка"",
		//        |	NULL,
		//        |	NULL,
		//        |	МАКСИМУМ(1),
		//        |	NULL,
		//        |	МАКСИМУМ(ВТ_Доставки.Доставка.СтоимостьДоставкиЗаМКАД),
		//        |	NULL,
		//        |	ВТ_Доставки.Доставка,
		//        |	NULL,
		//        |	999,
		//        |	""""
		//        |ИЗ
		//        |	ВТ_Доставки КАК ВТ_Доставки
		//        |ГДЕ
		//        |	ВТ_Доставки.Доставка.СтоимостьДоставкиЗаМКАД <> 0
		//        |
		//        |СГРУППИРОВАТЬ ПО
		//        |	ВТ_Доставки.Доставка
		//        |;
		//        |
		//        |////////////////////////////////////////////////////////////////////////////////
		//        |ВЫБРАТЬ
		//        |	РеализацияТоваровУслугМестаЗаказа.КлючСвязиМеста КАК КлючСвязиМеста,
		//        |	РеализацияТоваровУслугМестаЗаказа.ШтрихкодМеста КАК ШтрихкодМеста
		//        |ПОМЕСТИТЬ ВТ_ШКМест
		//        |ИЗ
		//        |	ВТ_Доставки КАК ВТ_Доставки
		//        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.МестаЗаказа КАК РеализацияТоваровУслугМестаЗаказа
		//        |		ПО ВТ_Доставки.Доставка.Номер = РеализацияТоваровУслугМестаЗаказа.Ссылка.Номер
		//        |;
		//        |
		//        |////////////////////////////////////////////////////////////////////////////////
		//        |ВЫБРАТЬ
		//        |	ВТ_Товары.КлючСвязиМеста КАК КлючСвязиМеста,
		//        |	ЕСТЬNULL(ВТ_ШКМест.ШтрихкодМеста, """") КАК ШтрихкодМеста,
		//        |	ВТ_Товары.Номенклатура КАК Номенклатура,
		//        |	ВТ_Товары.НоменклатураКод КАК НоменклатураКод,
		//        |	ВТ_Товары.НоменклатураАртикул КАК НоменклатураАртикул,
		//        |	ВТ_Товары.Количество КАК Количество,
		//        |	ВТ_Товары.Цена КАК Цена,
		//        |	ВТ_Товары.Сумма КАК Сумма,
		//        |	ВТ_Товары.Вес КАК Вес,
		//        |	ВТ_Товары.Доставка.Номер КАК Номер,
		//        |	ВТ_Товары.Доставка.ТочкаПрибытия.Адрес КАК АдресДоставки,
		//        |	ВТ_Товары.Доставка.Телефон КАК ТелефонПокупателя,
		//        |	ВТ_Товары.Доставка.Грузополучатель КАК Покупатель,
		//        |	ВЫРАЗИТЬ(ВТ_Товары.Доставка.КомментарийКАдресуДоставки КАК СТРОКА(500)) КАК КоммАдрес,
		//        |	ВЫРАЗИТЬ(ВТ_Товары.Доставка.Комментарий КАК СТРОКА(1000)) КАК Комментарий,
		//        |	ВТ_Товары.Доставка.Дата КАК ДатаДоставки,
		//        |	ВТ_Товары.Доставка.ВремяПрибытияС КАК ВремяПрибытияС,
		//        |	ВТ_Товары.Доставка.ВремяПрибытияПо КАК ВремяПрибытияПо,
		//        |	ТипыОплат.Наименование КАК ТипОплаты,
		//        |	ДокументРейс.НомерПалетты КАК НомерЛог,
		//        |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
		//        |	РеализацияТоваровУслуг.ВладелецТовара.ТелефонИнтернетМагазина КАК ТелефонИнтернетМагазина,
		//        |	РеализацияТоваровУслуг.ВладелецТовара КАК Контрагент,
		//        |	ВЫБОР
		//        |		КОГДА РеализацияТоваровУслуг.ТарифнаяСетка.Код = 2
		//        |			ТОГДА ""СРОЧНАЯ ДОСТАВКА""
		//        |		ИНАЧЕ """"
		//        |	КОНЕЦ КАК СрочнаяДоставка,
		//        |	ВЫБОР
		//        |		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа ЕСТЬ NULL
		//        |			ТОГДА """"
		//        |		ИНАЧЕ ВЫБОР
		//        |				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа
		//        |					ТОГДА ""запрещен""
		//        |				ИНАЧЕ """"
		//        |			КОНЕЦ
		//        |	КОНЕЦ КАК ЗапретЧастичногоВыкупаСтарый,
		//        |	ВЫБОР
		//        |		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретСменыОплаты ЕСТЬ NULL
		//        |			ТОГДА """"
		//        |		ИНАЧЕ ВЫБОР
		//        |				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретСменыОплаты
		//        |					ТОГДА ""запрещена""
		//        |				ИНАЧЕ """"
		//        |			КОНЕЦ
		//        |	КОНЕЦ КАК ЗапретСменыОплаты,
		//        |	ВЫБОР
		//        |		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа ЕСТЬ NULL
		//        |			ТОГДА """"
		//        |		ИНАЧЕ ВЫБОР
		//        |				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа
		//        |					ТОГДА ""Частичный выкуп""
		//        |				ИНАЧЕ """"
		//        |			КОНЕЦ
		//        |	КОНЕЦ КАК ЧастичныйВыкупСтарый,
		//        |	ВТ_Товары.НомерСтроки КАК НомерСтроки,
		//        |	ВТ_Товары.Доставка КАК Доставка,
		//        |	РеализацияТоваровУслуг.ИнтернетМагазинЯндекса КАК ИнтернетМагазинЯндекса,
		//        |	ТипыОплат.Ссылка КАК ТипОплатыСсылка,
		//        |	РеализацияТоваровУслуг.ПредоплатаПоКредиту КАК ПредоплатаПоКредиту,
		//        |	КатегорииДоставки2014.Родитель КАК КатегорияДоставки,
		//        |	ПараметрыКонтрагентовСрезПоследних.МетодОплатыПодъёма КАК МетодОплатыПодъёма,
		//        |	ВЫБОР
		//        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.СОжиданием, ЛОЖЬ)
		//        |			ТОГДА ""С вскрытием""
		//        |		ИНАЧЕ ""Без вскрытия""
		//        |	КОНЕЦ КАК СОжиданием,
		//        |	ВЫБОР
		//        |		КОГДА РеализацияТоваровУслуг.ЗапретЧастичногоВыкупа
		//        |			ТОГДА ""запрещен""
		//        |		ИНАЧЕ """"
		//        |	КОНЕЦ КАК ЗапретЧастичногоВыкупа,
		//        |	ВЫБОР
		//        |		КОГДА РеализацияТоваровУслуг.ЗапретЧастичногоВыкупа
		//        |			ТОГДА ""Частичный выкуп""
		//        |		ИНАЧЕ """"
		//        |	КОНЕЦ КАК ЧастичныйВыкуп,
		//        |	ДополнительныеПараметрыЗаказа.КОплатеКлиентом КАК КОплатеКлиентом,
		//        |	РеализацияТоваровУслуг.УчитыватьИтогоКОплате КАК УчитыватьИтогоКОплате,
		//        |	ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ПодъемОплачен, ЛОЖЬ) КАК ПодъемОплачен,
		//        |	ДополнительныеПараметрыЗаказа.КатегорияДляРасчетаЗП КАК КатегорияДляРасчетаЗП,
		//        |	ДополнительныеПараметрыЗаказа.ДополнительныйНомерЗаказа КАК ДополнительныйНомерЗаказа,
		//        |	ДополнительныеПараметрыЗаказа.Заказ КАК Заказ,
		//        |	ВТ_Товары.ШК КАК ШК
		//        |ИЗ
		//        |	ВТ_Товары КАК ВТ_Товары
		//        |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		//        |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыОплат КАК ТипыОплат
		//        |			ПО РеализацияТоваровУслуг.ТипОплаты = ТипыОплат.Код
		//        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыКонтрагентов.СрезПоследних КАК ПараметрыКонтрагентовСрезПоследних
		//        |			ПО РеализацияТоваровУслуг.ВладелецТовара = ПараметрыКонтрагентовСрезПоследних.Контрагент
		//        |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КатегорииДоставки2014 КАК КатегорииДоставки2014
		//        |			ПО РеализацияТоваровУслуг.КатегорияДоставки = КатегорииДоставки2014.Категория
		//        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
		//        |			ПО РеализацияТоваровУслуг.Ссылка = ДополнительныеПараметрыЗаказа.Заказ
		//        |		ПО ВТ_Товары.Доставка.Номер = РеализацияТоваровУслуг.Номер
		//        |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Рейс КАК ДокументРейс
		//        |		ПО (ДокументРейс.РейсМестнойДоставки = ВТ_Товары.Рейс)
		//        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ШКМест КАК ВТ_ШКМест
		//        |		ПО ВТ_Товары.КлючСвязиМеста = ВТ_ШКМест.КлючСвязиМеста
		//        |
		//        |СГРУППИРОВАТЬ ПО
		//        |	ВТ_Товары.КлючСвязиМеста,
		//        |	ЕСТЬNULL(ВТ_ШКМест.ШтрихкодМеста, """"),
		//        |	ВТ_Товары.Номенклатура,
		//        |	ВТ_Товары.НоменклатураКод,
		//        |	ВТ_Товары.НоменклатураАртикул,
		//        |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа,
		//        |	РеализацияТоваровУслуг.ВладелецТовара,
		//        |	ВЫБОР
		//        |		КОГДА РеализацияТоваровУслуг.ТарифнаяСетка.Код = 2
		//        |			ТОГДА ""СРОЧНАЯ ДОСТАВКА""
		//        |		ИНАЧЕ """"
		//        |	КОНЕЦ,
		//        |	ВЫБОР
		//        |		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа ЕСТЬ NULL
		//        |			ТОГДА """"
		//        |		ИНАЧЕ ВЫБОР
		//        |				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа
		//        |					ТОГДА ""запрещен""
		//        |				ИНАЧЕ """"
		//        |			КОНЕЦ
		//        |	КОНЕЦ,
		//        |	ВЫБОР
		//        |		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретСменыОплаты ЕСТЬ NULL
		//        |			ТОГДА """"
		//        |		ИНАЧЕ ВЫБОР
		//        |				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретСменыОплаты
		//        |					ТОГДА ""запрещена""
		//        |				ИНАЧЕ """"
		//        |			КОНЕЦ
		//        |	КОНЕЦ,
		//        |	ВЫБОР
		//        |		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа ЕСТЬ NULL
		//        |			ТОГДА """"
		//        |		ИНАЧЕ ВЫБОР
		//        |				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа
		//        |					ТОГДА ""Частичный выкуп""
		//        |				ИНАЧЕ """"
		//        |			КОНЕЦ
		//        |	КОНЕЦ,
		//        |	ВТ_Товары.Доставка,
		//        |	РеализацияТоваровУслуг.ИнтернетМагазинЯндекса,
		//        |	ТипыОплат.Ссылка,
		//        |	КатегорииДоставки2014.Родитель,
		//        |	ПараметрыКонтрагентовСрезПоследних.МетодОплатыПодъёма,
		//        |	ВЫБОР
		//        |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.СОжиданием, ЛОЖЬ)
		//        |			ТОГДА ""С вскрытием""
		//        |		ИНАЧЕ ""Без вскрытия""
		//        |	КОНЕЦ,
		//        |	ВЫБОР
		//        |		КОГДА РеализацияТоваровУслуг.ЗапретЧастичногоВыкупа
		//        |			ТОГДА ""запрещен""
		//        |		ИНАЧЕ """"
		//        |	КОНЕЦ,
		//        |	ВЫБОР
		//        |		КОГДА РеализацияТоваровУслуг.ЗапретЧастичногоВыкупа
		//        |			ТОГДА ""Частичный выкуп""
		//        |		ИНАЧЕ """"
		//        |	КОНЕЦ,
		//        |	РеализацияТоваровУслуг.УчитыватьИтогоКОплате,
		//        |	ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ПодъемОплачен, ЛОЖЬ),
		//        |	ДополнительныеПараметрыЗаказа.КатегорияДляРасчетаЗП,
		//        |	ДополнительныеПараметрыЗаказа.ДополнительныйНомерЗаказа,
		//        |	ДополнительныеПараметрыЗаказа.Заказ,
		//        |	ВТ_Товары.Количество,
		//        |	ВТ_Товары.Цена,
		//        |	ВТ_Товары.Сумма,
		//        |	ВТ_Товары.Вес,
		//        |	ВТ_Товары.Доставка.Номер,
		//        |	ВТ_Товары.Доставка.Телефон,
		//        |	ВТ_Товары.Доставка.Грузополучатель,
		//        |	ВЫРАЗИТЬ(ВТ_Товары.Доставка.КомментарийКАдресуДоставки КАК СТРОКА(500)),
		//        |	ВТ_Товары.Доставка.Дата,
		//        |	ВТ_Товары.Доставка.ВремяПрибытияС,
		//        |	ВТ_Товары.Доставка.ВремяПрибытияПо,
		//        |	ТипыОплат.Наименование,
		//        |	ДокументРейс.НомерПалетты,
		//        |	РеализацияТоваровУслуг.ВладелецТовара.ТелефонИнтернетМагазина,
		//        |	ВТ_Товары.НомерСтроки,
		//        |	РеализацияТоваровУслуг.ПредоплатаПоКредиту,
		//        |	ДополнительныеПараметрыЗаказа.КОплатеКлиентом,
		//        |	ВЫРАЗИТЬ(ВТ_Товары.Доставка.Комментарий КАК СТРОКА(1000)),
		//        |	ВТ_Товары.ШК,
		//        |	ВТ_Товары.Доставка.ТочкаПрибытия.Адрес,
		//        |	ВТ_ШКМест.ШтрихкодМеста
		//        |
		//        |УПОРЯДОЧИТЬ ПО
		//        |	РеализацияТоваровУслуг.ВладелецТовара.Приоритет,
		//        |	Номер,
		//        |	НомерСтроки,
		//        |	Номенклатура
		//        |ИТОГИ
		//        |	СУММА(Количество),
		//        |	СУММА(Сумма),
		//        |	СУММА(Вес),
		//        |	МАКСИМУМ(АдресДоставки),
		//        |	МАКСИМУМ(ТелефонПокупателя),
		//        |	МАКСИМУМ(Покупатель),
		//        |	МАКСИМУМ(КоммАдрес),
		//        |	МАКСИМУМ(Комментарий),
		//        |	МАКСИМУМ(ДатаДоставки),
		//        |	МАКСИМУМ(ВремяПрибытияС),
		//        |	МАКСИМУМ(ВремяПрибытияПо),
		//        |	МАКСИМУМ(ТипОплаты),
		//        |	МАКСИМУМ(НомерЛог),
		//        |	МАКСИМУМ(НомерВнешнегоЗаказа),
		//        |	МАКСИМУМ(ТелефонИнтернетМагазина),
		//        |	МАКСИМУМ(Контрагент),
		//        |	МАКСИМУМ(СрочнаяДоставка),
		//        |	МАКСИМУМ(ЗапретЧастичногоВыкупаСтарый),
		//        |	МАКСИМУМ(ЗапретСменыОплаты),
		//        |	МАКСИМУМ(ЧастичныйВыкупСтарый),
		//        |	МАКСИМУМ(Доставка),
		//        |	МАКСИМУМ(ИнтернетМагазинЯндекса),
		//        |	МАКСИМУМ(ТипОплатыСсылка),
		//        |	МАКСИМУМ(ПредоплатаПоКредиту),
		//        |	МАКСИМУМ(КатегорияДоставки),
		//        |	МАКСИМУМ(МетодОплатыПодъёма),
		//        |	МАКСИМУМ(СОжиданием),
		//        |	МАКСИМУМ(ЗапретЧастичногоВыкупа),
		//        |	МАКСИМУМ(ЧастичныйВыкуп),
		//        |	МАКСИМУМ(КОплатеКлиентом),
		//        |	МАКСИМУМ(УчитыватьИтогоКОплате),
		//        |	МАКСИМУМ(ПодъемОплачен),
		//        |	МАКСИМУМ(КатегорияДляРасчетаЗП),
		//        |	МАКСИМУМ(ДополнительныйНомерЗаказа),
		//        |	МАКСИМУМ(Заказ)
		//        |ПО
		//        |	Номер
		//        |АВТОУПОРЯДОЧИВАНИЕ";
 	
	Возврат
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Заказ
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	БизнесПроцесс.новаМестнаяДоставка КАК новаМестнаяДоставка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО (новаМестнаяДоставка.Ссылка = &Доставка)
	|			И новаМестнаяДоставка.Номер = РеализацияТоваровУслуг.Номер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПараметрыТарифаЗаказаСрезПоследних.Заказ КАК Заказ,
	|	ПараметрыТарифаЗаказаСрезПоследних.КатегорияДоставки КАК КатегорияДоставки
	|ПОМЕСТИТЬ ВТ_ПараметрыТарифаЗаказа
	|ИЗ
	|	РегистрСведений.ПараметрыТарифаЗаказа.СрезПоследних(
	|			,
	|			Заказ В
	|				(ВЫБРАТЬ
	|					ВТ_Заказы.Заказ КАК Заказ
	|				ИЗ
	|					ВТ_Заказы КАК ВТ_Заказы)) КАК ПараметрыТарифаЗаказаСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	новаМестнаяДоставка.Ссылка КАК Доставка,
	|	МАКСИМУМ(новаЗаданияРейсов.Рейс) КАК Рейс
	|ПОМЕСТИТЬ ВТ_Доставки
	|ИЗ
	|	БизнесПроцесс.новаМестнаяДоставка КАК новаМестнаяДоставка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.новаЗаданияРейсов КАК новаЗаданияРейсов
	|		ПО (новаЗаданияРейсов.Доставка = новаМестнаяДоставка.Ссылка)
	|ГДЕ
	|	новаМестнаяДоставка.Ссылка = &Доставка
	|
	|СГРУППИРОВАТЬ ПО
	|	новаМестнаяДоставка.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.КлючСвязиМеста КАК КлючСвязиМеста,
	|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	РеализацияТоваровУслугТовары.Номенклатура.Код КАК НоменклатураКод,
	|	РеализацияТоваровУслугТовары.Номенклатура.Артикул КАК НоменклатураАртикул,
	|	РеализацияТоваровУслугТовары.Количество КАК Количество,
	|	РеализацияТоваровУслугТовары.Цена КАК Цена,
	|	РеализацияТоваровУслугТовары.Сумма КАК Сумма,
	|	РеализацияТоваровУслугТовары.Вес * РеализацияТоваровУслугТовары.Количество КАК Вес,
	|	ВТ_Доставки.Доставка КАК Доставка,
	|	ВТ_Доставки.Рейс КАК Рейс,
	|	РеализацияТоваровУслугТовары.НомерСтроки КАК НомерСтроки,
	|	РеализацияТоваровУслугТовары.ШтрихкодНоменклатуры.Код КАК ШК
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	ВТ_Доставки КАК ВТ_Доставки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ПО ВТ_Доставки.Доставка.Номер = РеализацияТоваровУслугТовары.Ссылка.Номер
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	NULL,
	|	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура,
	|	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура.Код,
	|	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура.Артикул,
	|	РеализацияТоваровУслугПодарочныеПозиции.Количество,
	|	РеализацияТоваровУслугПодарочныеПозиции.Цена,
	|	РеализацияТоваровУслугПодарочныеПозиции.Сумма,
	|	РеализацияТоваровУслугПодарочныеПозиции.Вес * РеализацияТоваровУслугПодарочныеПозиции.Количество,
	|	ВТ_Доставки.Доставка,
	|	ВТ_Доставки.Рейс,
	|	РеализацияТоваровУслугПодарочныеПозиции.НомерСтроки,
	|	РеализацияТоваровУслугПодарочныеПозиции.ШтрихкодНоменклатуры.Код
	|ИЗ
	|	ВТ_Доставки КАК ВТ_Доставки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.ПодарочныеПозиции КАК РеализацияТоваровУслугПодарочныеПозиции
	|		ПО ВТ_Доставки.Доставка.Номер = РеализацияТоваровУслугПодарочныеПозиции.Ссылка.Номер
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	NULL,
	|	ВозвратТоваровОтПокупателяТовары.Номенклатура,
	|	ВозвратТоваровОтПокупателяТовары.Номенклатура.Код,
	|	ВозвратТоваровОтПокупателяТовары.Номенклатура.Артикул,
	|	-ВозвратТоваровОтПокупателяТовары.Количество,
	|	ВозвратТоваровОтПокупателяТовары.Цена,
	|	-ВозвратТоваровОтПокупателяТовары.Сумма,
	|	NULL,
	|	ВТ_Доставки.Доставка,
	|	ВТ_Доставки.Рейс,
	|	ВозвратТоваровОтПокупателяТовары.НомерСтроки,
	|	ВозвратТоваровОтПокупателяТовары.ШтрихкодНоменклатуры.Код
	|ИЗ
	|	ВТ_Доставки КАК ВТ_Доставки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
	|		ПО ВТ_Доставки.Доставка.Номер = ВозвратТоваровОтПокупателяТовары.Ссылка.Номер
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	NULL,
	|	""Доставка"",
	|	NULL,
	|	NULL,
	|	МАКСИМУМ(1),
	|	NULL,
	|	МАКСИМУМ(ВТ_Доставки.Доставка.СтоимостьДоставкиДоМКАД),
	|	NULL,
	|	ВТ_Доставки.Доставка,
	|	NULL,
	|	998,
	|	""""
	|ИЗ
	|	ВТ_Доставки КАК ВТ_Доставки
	|ГДЕ
	|	ВТ_Доставки.Доставка.СтоимостьДоставкиДоМКАД <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Доставки.Доставка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	NULL,
	|	""Доставка"",
	|	NULL,
	|	NULL,
	|	МАКСИМУМ(1),
	|	NULL,
	|	МАКСИМУМ(ВТ_Доставки.Доставка.СтоимостьДоставкиЗаМКАД),
	|	NULL,
	|	ВТ_Доставки.Доставка,
	|	NULL,
	|	999,
	|	""""
	|ИЗ
	|	ВТ_Доставки КАК ВТ_Доставки
	|ГДЕ
	|	ВТ_Доставки.Доставка.СтоимостьДоставкиЗаМКАД <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Доставки.Доставка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугМестаЗаказа.КлючСвязиМеста КАК КлючСвязиМеста,
	|	РеализацияТоваровУслугМестаЗаказа.ШтрихкодМеста КАК ШтрихкодМеста
	|ПОМЕСТИТЬ ВТ_ШКМест
	|ИЗ
	|	ВТ_Доставки КАК ВТ_Доставки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.МестаЗаказа КАК РеализацияТоваровУслугМестаЗаказа
	|		ПО ВТ_Доставки.Доставка.Номер = РеализацияТоваровУслугМестаЗаказа.Ссылка.Номер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Товары.КлючСвязиМеста КАК КлючСвязиМеста,
	|	ЕСТЬNULL(ВТ_ШКМест.ШтрихкодМеста, """") КАК ШтрихкодМеста,
	|	ВТ_Товары.Номенклатура КАК Номенклатура,
	|	ВТ_Товары.НоменклатураКод КАК НоменклатураКод,
	|	ВТ_Товары.НоменклатураАртикул КАК НоменклатураАртикул,
	|	ВТ_Товары.Количество КАК Количество,
	|	ВТ_Товары.Цена КАК Цена,
	|	ВТ_Товары.Сумма КАК Сумма,
	|	ВТ_Товары.Вес КАК Вес,
	|	ВТ_Товары.Доставка.Номер КАК Номер,
	|	ВТ_Товары.Доставка.ТочкаПрибытия.Адрес КАК АдресДоставки,
	|	ВТ_Товары.Доставка.Телефон КАК ТелефонПокупателя,
	|	ВТ_Товары.Доставка.Грузополучатель КАК Покупатель,
	|	ВЫРАЗИТЬ(ВТ_Товары.Доставка.КомментарийКАдресуДоставки КАК СТРОКА(500)) КАК КоммАдрес,
	|	ВЫРАЗИТЬ(ВТ_Товары.Доставка.Комментарий КАК СТРОКА(1000)) КАК Комментарий,
	|	ВТ_Товары.Доставка.Дата КАК ДатаДоставки,
	|	ВТ_Товары.Доставка.ВремяПрибытияС КАК ВремяПрибытияС,
	|	ВТ_Товары.Доставка.ВремяПрибытияПо КАК ВремяПрибытияПо,
	|	ТипыОплат.Наименование КАК ТипОплаты,
	|	ДокументРейс.НомерПалетты КАК НомерЛог,
	|	РеализацияТоваровУслуг.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
	|	РеализацияТоваровУслуг.ВладелецТовара.ТелефонИнтернетМагазина КАК ТелефонИнтернетМагазина,
	|	РеализацияТоваровУслуг.ВладелецТовара КАК Контрагент,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.ТарифнаяСетка.Код = 2
	|			ТОГДА ""СРОЧНАЯ ДОСТАВКА""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК СрочнаяДоставка,
	|	ВЫБОР
	|		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа ЕСТЬ NULL
	|			ТОГДА """"
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа
	|					ТОГДА ""запрещен""
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ЗапретЧастичногоВыкупаСтарый,
	|	ВЫБОР
	|		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретСменыОплаты ЕСТЬ NULL
	|			ТОГДА """"
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретСменыОплаты
	|					ТОГДА ""запрещена""
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ЗапретСменыОплаты,
	|	ВЫБОР
	|		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа ЕСТЬ NULL
	|			ТОГДА """"
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа
	|					ТОГДА ""Частичный выкуп""
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ЧастичныйВыкупСтарый,
	|	ВТ_Товары.НомерСтроки КАК НомерСтроки,
	|	ВТ_Товары.Доставка КАК Доставка,
	|	РеализацияТоваровУслуг.ИнтернетМагазинЯндекса КАК ИнтернетМагазинЯндекса,
	|	ТипыОплат.Ссылка КАК ТипОплатыСсылка,
	|	РеализацияТоваровУслуг.ПредоплатаПоКредиту КАК ПредоплатаПоКредиту,
	|	ЕСТЬNULL(ВТ_ПараметрыТарифаЗаказа.КатегорияДоставки.Родитель, ЗНАЧЕНИЕ(Справочник.КатегорииДоставки2014.ПустаяСсылка)) КАК КатегорияДоставки,
	|	ПараметрыКонтрагентовСрезПоследних.МетодОплатыПодъёма КАК МетодОплатыПодъёма,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.СОжиданием, ЛОЖЬ)
	|			ТОГДА ""С вскрытием""
	|		ИНАЧЕ ""Без вскрытия""
	|	КОНЕЦ КАК СОжиданием,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.ЗапретЧастичногоВыкупа
	|			ТОГДА ""запрещен""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ЗапретЧастичногоВыкупа,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.ЗапретЧастичногоВыкупа
	|			ТОГДА ""Частичный выкуп""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ЧастичныйВыкуп,
	|	ДополнительныеПараметрыЗаказа.КОплатеКлиентом КАК КОплатеКлиентом,
	|	РеализацияТоваровУслуг.УчитыватьИтогоКОплате КАК УчитыватьИтогоКОплате,
	|	ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ПодъемОплачен, ЛОЖЬ) КАК ПодъемОплачен,
	|	ДополнительныеПараметрыЗаказа.КатегорияДляРасчетаЗП КАК КатегорияДляРасчетаЗП,
	|	ДополнительныеПараметрыЗаказа.ДополнительныйНомерЗаказа КАК ДополнительныйНомерЗаказа,
	|	ДополнительныеПараметрыЗаказа.Заказ КАК Заказ,
	|	ВТ_Товары.ШК КАК ШК
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыОплат КАК ТипыОплат
	|			ПО РеализацияТоваровУслуг.ТипОплаты = ТипыОплат.Код
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыКонтрагентов.СрезПоследних КАК ПараметрыКонтрагентовСрезПоследних
	|			ПО РеализацияТоваровУслуг.ВладелецТовара = ПараметрыКонтрагентовСрезПоследних.Контрагент
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
	|			ПО РеализацияТоваровУслуг.Ссылка = ДополнительныеПараметрыЗаказа.Заказ
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыТарифаЗаказа КАК ВТ_ПараметрыТарифаЗаказа
	|			ПО РеализацияТоваровУслуг.Ссылка = ВТ_ПараметрыТарифаЗаказа.Заказ
	|		ПО ВТ_Товары.Доставка.Номер = РеализацияТоваровУслуг.Номер
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Рейс КАК ДокументРейс
	|		ПО (ДокументРейс.РейсМестнойДоставки = ВТ_Товары.Рейс)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ШКМест КАК ВТ_ШКМест
	|		ПО ВТ_Товары.КлючСвязиМеста = ВТ_ШКМест.КлючСвязиМеста
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Товары.КлючСвязиМеста,
	|	ЕСТЬNULL(ВТ_ШКМест.ШтрихкодМеста, """"),
	|	ВТ_Товары.Номенклатура,
	|	ВТ_Товары.НоменклатураКод,
	|	ВТ_Товары.НоменклатураАртикул,
	|	РеализацияТоваровУслуг.НомерВнешнегоЗаказа,
	|	РеализацияТоваровУслуг.ВладелецТовара,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.ТарифнаяСетка.Код = 2
	|			ТОГДА ""СРОЧНАЯ ДОСТАВКА""
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа ЕСТЬ NULL
	|			ТОГДА """"
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа
	|					ТОГДА ""запрещен""
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретСменыОплаты ЕСТЬ NULL
	|			ТОГДА """"
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретСменыОплаты
	|					ТОГДА ""запрещена""
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа ЕСТЬ NULL
	|			ТОГДА """"
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа
	|					ТОГДА ""Частичный выкуп""
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВТ_Товары.Доставка,
	|	РеализацияТоваровУслуг.ИнтернетМагазинЯндекса,
	|	ТипыОплат.Ссылка,
	|	ПараметрыКонтрагентовСрезПоследних.МетодОплатыПодъёма,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.СОжиданием, ЛОЖЬ)
	|			ТОГДА ""С вскрытием""
	|		ИНАЧЕ ""Без вскрытия""
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.ЗапретЧастичногоВыкупа
	|			ТОГДА ""запрещен""
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.ЗапретЧастичногоВыкупа
	|			ТОГДА ""Частичный выкуп""
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	РеализацияТоваровУслуг.УчитыватьИтогоКОплате,
	|	ЕСТЬNULL(ДополнительныеПараметрыЗаказа.ПодъемОплачен, ЛОЖЬ),
	|	ДополнительныеПараметрыЗаказа.КатегорияДляРасчетаЗП,
	|	ДополнительныеПараметрыЗаказа.ДополнительныйНомерЗаказа,
	|	ДополнительныеПараметрыЗаказа.Заказ,
	|	ВТ_Товары.Количество,
	|	ВТ_Товары.Цена,
	|	ВТ_Товары.Сумма,
	|	ВТ_Товары.Вес,
	|	ВТ_Товары.Доставка.Номер,
	|	ВТ_Товары.Доставка.Телефон,
	|	ВТ_Товары.Доставка.Грузополучатель,
	|	ВЫРАЗИТЬ(ВТ_Товары.Доставка.КомментарийКАдресуДоставки КАК СТРОКА(500)),
	|	ВТ_Товары.Доставка.Дата,
	|	ВТ_Товары.Доставка.ВремяПрибытияС,
	|	ВТ_Товары.Доставка.ВремяПрибытияПо,
	|	ТипыОплат.Наименование,
	|	ДокументРейс.НомерПалетты,
	|	РеализацияТоваровУслуг.ВладелецТовара.ТелефонИнтернетМагазина,
	|	ВТ_Товары.НомерСтроки,
	|	РеализацияТоваровУслуг.ПредоплатаПоКредиту,
	|	ДополнительныеПараметрыЗаказа.КОплатеКлиентом,
	|	ВЫРАЗИТЬ(ВТ_Товары.Доставка.Комментарий КАК СТРОКА(1000)),
	|	ВТ_Товары.ШК,
	|	ВТ_Товары.Доставка.ТочкаПрибытия.Адрес,
	|	ВТ_ШКМест.ШтрихкодМеста,
	|	ЕСТЬNULL(ВТ_ПараметрыТарифаЗаказа.КатегорияДоставки.Родитель, ЗНАЧЕНИЕ(Справочник.КатегорииДоставки2014.ПустаяСсылка))
	|
	|УПОРЯДОЧИТЬ ПО
	|	РеализацияТоваровУслуг.ВладелецТовара.Приоритет,
	|	Номер,
	|	НомерСтроки,
	|	Номенклатура
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Сумма),
	|	СУММА(Вес),
	|	МАКСИМУМ(АдресДоставки),
	|	МАКСИМУМ(ТелефонПокупателя),
	|	МАКСИМУМ(Покупатель),
	|	МАКСИМУМ(КоммАдрес),
	|	МАКСИМУМ(Комментарий),
	|	МАКСИМУМ(ДатаДоставки),
	|	МАКСИМУМ(ВремяПрибытияС),
	|	МАКСИМУМ(ВремяПрибытияПо),
	|	МАКСИМУМ(ТипОплаты),
	|	МАКСИМУМ(НомерЛог),
	|	МАКСИМУМ(НомерВнешнегоЗаказа),
	|	МАКСИМУМ(ТелефонИнтернетМагазина),
	|	МАКСИМУМ(Контрагент),
	|	МАКСИМУМ(СрочнаяДоставка),
	|	МАКСИМУМ(ЗапретЧастичногоВыкупаСтарый),
	|	МАКСИМУМ(ЗапретСменыОплаты),
	|	МАКСИМУМ(ЧастичныйВыкупСтарый),
	|	МАКСИМУМ(Доставка),
	|	МАКСИМУМ(ИнтернетМагазинЯндекса),
	|	МАКСИМУМ(ТипОплатыСсылка),
	|	МАКСИМУМ(ПредоплатаПоКредиту),
	|	МАКСИМУМ(КатегорияДоставки),
	|	МАКСИМУМ(МетодОплатыПодъёма),
	|	МАКСИМУМ(СОжиданием),
	|	МАКСИМУМ(ЗапретЧастичногоВыкупа),
	|	МАКСИМУМ(ЧастичныйВыкуп),
	|	МАКСИМУМ(КОплатеКлиентом),
	|	МАКСИМУМ(УчитыватьИтогоКОплате),
	|	МАКСИМУМ(ПодъемОплачен),
	|	МАКСИМУМ(КатегорияДляРасчетаЗП),
	|	МАКСИМУМ(ДополнительныйНомерЗаказа),
	|	МАКСИМУМ(Заказ)
	|ПО
	|	Номер
	|АВТОУПОРЯДОЧИВАНИЕ";
	//Асеев 17.02.2021 (Задача № 3837)<<<
		
КонецФункции // ()
//CeHbKA 24.07.2019 #2835


Функция ПечатьПоДоставке(Доставка, ТабличныйДокумент, Самовывоз = Ложь) Экспорт
	
	Макет = ПолучитьМакет("МакетУрезанный");
	МассивОбластей = Новый Массив;
	
	БПДоставка = БизнесПроцессы.новаМестнаяДоставка.НайтиПоНомеру(СокрЛП(Доставка.Номер));	
	
	
    Запрос = Новый Запрос;
	Если Самовывоз И НЕ ЗначениеЗаполнено(БПДоставка) Тогда	
		Запрос.Текст = ТекстЗапросаПоСамовывозу();	
		Запрос.УстановитьПараметр("Реализ", Доставка);
		Запрос.УстановитьПараметр("РеализНомер", Доставка.Номер);
	Иначе			
		Запрос.Текст = ТекстЗапросаПоДоставке();
		Если Самовывоз И ЗначениеЗаполнено(БПДоставка) Тогда		
			Запрос.УстановитьПараметр("Доставка", БПДоставка);		
		Иначе
		    Запрос.УстановитьПараметр("Доставка", Доставка); 
			
		КонецЕсли;		
	КонецЕсли;
	
    РезультатЗапроса = Запрос.Выполнить();
    ВыборкаНомерТоварногоЧека = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
    
	Пока ВыборкаНомерТоварногоЧека.Следующий() Цикл
		
		
		
        
        ОбластьШапка = Макет.ПолучитьОбласть("Шапка");        
        ОбластьШапка.Параметры.Заполнить(ВыборкаНомерТоварногоЧека);
		
		//+++ БАО 15.08.2017 №1678 
		//Если рэИнтеграцияРэдЭкспресс.ЭтоРЭД(ВыборкаНомерТоварногоЧека.Контрагент) Тогда
		//	ОбластьШапка.Параметры.Стриж = "РЕД";
		//Иначе
		//	ОбластьШапка.Параметры.Стриж = "Стриж";
		//КонецЕсли;	
		//--- БАО 15.08.2017 №1678 
		
		Если ВыборкаНомерТоварногоЧека.Контрагент.Код = "Shop_234 " И ЗначениеЗаполнено(ВыборкаНомерТоварногоЧека.Заказ) Тогда
			ОбластьШапка.Параметры.ПодарочнаяПозиция = ?(ВыборкаНомерТоварногоЧека.Заказ.ПодарочныеПозиции.Количество(), ВыборкаНомерТоварногоЧека.Заказ.ПодарочныеПозиции[0].Номенклатура, "");			
		КонецЕсли;
		
		Если Самовывоз Тогда
			ОбластьШапка.Параметры.ДатаИнтервалДоставкиЗаказа = Формат(ВыборкаНомерТоварногоЧека.ДатаДоставки,"ДФ=dd.MM.yyyy");
		Иначе
			ОбластьШапка.Параметры.ДатаИнтервалДоставкиЗаказа = Формат(ВыборкаНомерТоварногоЧека.ДатаДоставки,"ДФ=dd.MM.yyyy") + " с "+ Формат(ВыборкаНомерТоварногоЧека.ВремяПрибытияС,"ДФ=ЧЧ:мм") + " до "+Формат(ВыборкаНомерТоварногоЧека.ВремяПрибытияПо,"ДФ=ЧЧ:мм")+СтрокаПЕРЕНОС(ВыборкаНомерТоварногоЧека.Доставка);
		КонецЕсли;				
		ОбластьШапка.Параметры.НомерТоварногоЧека = СокрЛП(ВыборкаНомерТоварногоЧека.Номер)+"/"+СокрЛП(ВыборкаНомерТоварногоЧека.НомерВнешнегоЗаказа);		
		
		//ОбластьШапка.Параметры.НомерТоварногоЧека = СокрЛП(ВыборкаНомерТоварногоЧека.Номер)+"/"+СокрЛП(ВыборкаНомерТоварногоЧека.НомерВнешнегоЗаказа);
        ОбластьШапка.Параметры.СтрокаПродавецАгент = СтрокаПродавецАгент(ВыборкаНомерТоварногоЧека);
		
		//Логотипы,название и штрихкод
        Логотипы = ПолучитьЛоготипыКомпании(ВыборкаНомерТоварногоЧека.Контрагент);
        Если ЗначениеЗаполнено(Логотипы) Тогда
			
			// Якурнов 23.10.2018 10:14:02 Неявное присвоение картинки выдает ошибку 
			//ОбластьШапка.Рисунки.ЛоготипЛевый.Картинка = Логотипы.Левый.Получить();
			
			// Якурнов 23.10.2018 10:09:56 Проверка на заполненое значение и присвоение картинки 
			ЛеваяКартинка = Логотипы.Левый.Получить();
			Если ЗначениеЗаполнено(ЛеваяКартинка) Тогда
				Попытка
					ОбластьШапка.Рисунки.ЛоготипЛевый.Картинка = ЛеваяКартинка;	
				Исключение
					Сообщить("в бланке по заказу " + СокрЛП(ВыборкаНомерТоварногоЧека.Номер) + " произошла ошибка при выводе логотипа.");
				КонецПопытки;
			КонецЕсли;

			ПраваяКартинка = Логотипы.Правый.Получить();
			Если ЗначениеЗаполнено(ПраваяКартинка) Тогда
				Попытка
					ОбластьШапка.Рисунки.ЛоготипПравый.Картинка = ПраваяКартинка;	
				Исключение
					Сообщить("в бланке по заказу " + СокрЛП(ВыборкаНомерТоварногоЧека.Номер) + " произошла ошибка при выводе логотипа.");
				КонецПопытки;
			КонецЕсли;
            
        КонецЕсли;
        
        Если Не ЗначениеЗаполнено(ОбластьШапка.Рисунки.ЛоготипЛевый.Картинка) Тогда
            ОбластьШапка.Рисунки.ЛоготипЛевый.ВыводитьНаПечать = Ложь;
            ОбластьШапка.Параметры.Назв = ВыборкаНомерТоварногоЧека.Контрагент;
        КонецЕСли;	
        
        Если Не ЗначениеЗаполнено(ОбластьШапка.Рисунки.ЛоготипПравый.Картинка) Тогда
            ОбластьШапка.Рисунки.ЛоготипПравый.ВыводитьНаПечать = Ложь;
            ОбластьШапка.Параметры.Телефон = ВыборкаНомерТоварногоЧека.ТелефонИнтернетМагазина;
        КонецЕСли;
        
        Если ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_248") Или ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_601") Или ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_752") Тогда
            ОбластьШапка.Параметры.Назв = "YD";
		КонецЕсли;
		попытка
		ОбластьШапка.Рисунки.Штрихкод.Объект.barcode = "37" + Формат((Число(ВыборкаНомерТоварногоЧека.Номер)), "ЧЦ=10; ЧВН=; ЧГ="); 
	исключение
		конецпопытки;
        ТабличныйДокумент.Вывести(ОбластьШапка);
		МассивОбластей.Добавить(ОбластьШапка);
        
          
        ВыборкаДетальныеЗаписи = ВыборкаНомерТоварногоЧека.Выбрать();
        НомерСтроки = 0;
        Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
            ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
            
            НомерСтроки = НомерСтроки+1;
            ОбластьСтрока.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
            ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
			//+++ БАО 10.10.2017 №
            //---ОбластьСтрока.Параметры.ID_Код = СокрЛП(ВыборкаДетальныеЗаписи.НоменклатураКод)+"/"+ВыборкаДетальныеЗаписи.НоменклатураАртикул;
			ОбластьСтрока.Параметры.ID_Код = ВыборкаДетальныеЗаписи.НоменклатураАртикул;
			//--- БАО 10.10.2017 №
            ТабличныйДокумент.Вывести(ОбластьСтрока);
			МассивОбластей.Добавить(ОбластьСтрока);
            
        КонецЦикла;
        
        #Область Итоги
        Если ВыборкаНомерТоварногоЧека.УчитыватьИтогоКОплате Тогда//+++++Серегин М.В. 01.03.2016 10:01:30 было ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_248") Тогда
            ОбластьИтоги = Макет.ПолучитьОбласть("ИтогиЯндекс");
            Если ВыборкаНомерТоварногоЧека.ТипОплатыСсылка = Справочники.ТипыОплат.ОплаченоВМагазине ИЛИ ВыборкаНомерТоварногоЧека.ТипОплатыСсылка = Справочники.ТипыОплат.БезРасчетов Тогда // Задача № 2901
                ОбластьИтоги.Параметры.СуммаКОплате = 0;
            Иначе
                ОбластьИтоги.Параметры.СуммаКОплате = ВыборкаНомерТоварногоЧека.КОплатеКлиентом;//+++++Серегин М.В. 01.03.2016 10:01:54 было ВыборкаНомерТоварногоЧека.Сумма;
            КонецЕсли;
        Иначе 
            ОбластьИтоги = Макет.ПолучитьОбласть("Итоги");
        КонецЕсли;
        ОбластьИтоги.Параметры.Заполнить(ВыборкаНомерТоварногоЧека);
		
		
		// МАС - 03.08.2017 - №1394 --->> 
		Попытка
			Если ВыборкаНомерТоварногоЧека.ТипОплатыСсылка = Справочники.ТипыОплат.ОплаченоВМагазине ИЛИ ВыборкаНомерТоварногоЧека.ТипОплатыСсылка = Справочники.ТипыОплат.БезРасчетов Тогда // Задача № 2901
				ОбластьИтоги.Параметры.СуммаКОплате = "ОПЛАЧЕНО";
			КонецЕсли;
		Исключение		
		КонецПопытки;		
		// <<--- МАС 
		
		
        Вес003 = ПолучитьВесНакладная003ПоДоставке(ВыборкаНомерТоварногоЧека.Номер);
        Если ЗначениеЗаполнено(Вес003) Тогда 
            ОбластьИтоги.Параметры.Вес = Вес003;
		КонецЕсли;
		
		
		Если ОбластьИтоги.Параметры.Вес = 0 И ЗначениеЗаполнено(ВыборкаНомерТоварногоЧека.Заказ) Тогда
			ОбластьИтоги.Параметры.Вес = ВыборкаНомерТоварногоЧека.Заказ.ОбщийВес;		
			ПараметрыВес = ВыборкаНомерТоварногоЧека.Заказ.ОбщийВес;
		КонецЕсли;
		
		
		ОбластьИтоги.Параметры.Вес = Формат(ОбластьИтоги.Параметры.Вес,"ЧЦ=14; ЧДЦ=1; ЧГ=0")+" ("+?(ЗначениеЗаполнено(ВыборкаНомерТоварногоЧека.КатегорияДляРасчетаЗП), ВыборкаНомерТоварногоЧека.КатегорияДляРасчетаЗП.Родитель, ВыборкаНомерТоварногоЧека.КатегорияДоставки)+")";
        ТабличныйДокумент.Вывести(ОбластьИтоги);
		МассивОбластей.Добавить(ОбластьИтоги);
		
		//// Михушкин - 30.06.2016 - Яндекс.Такси --->>
		//Если ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_181") 
		//	ИЛИ ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_227") 
		//	ИЛИ ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_428") Тогда
		//Иначе	
		//	ЯндексПромо = Макет.ПолучитьОбласть("ЯндексПромо");
		//	ТабличныйДокумент.Вывести(ЯндексПромо);
		//КонецЕсли;
		//// <<--- Михушкин
        
        Если ВыборкаНомерТоварногоЧека.ТипОплатыСсылка = Справочники.ТипыОплат.ВКредит Тогда
			ОбластьКредит = Макет.ПолучитьОбласть("Кредит");
			ОбластьКредит.Параметры.СуммаКредита = ВыборкаНомерТоварногоЧека.ПредоплатаПоКредиту;
			ОбластьКредит.Параметры.СуммаКОплате = ВыборкаНомерТоварногоЧека.Сумма - ВыборкаНомерТоварногоЧека.ПредоплатаПоКредиту;
            ТабличныйДокумент.Вывести(ОбластьКредит);
			МассивОбластей.Добавить(ОбластьКредит);
        КонецЕсли;
        
        Вес003 = ПолучитьВесНакладная003ПоДоставке(ВыборкаНомерТоварногоЧека.Номер);
			
        ОбластьКредитОтрыв = Неопределено;
        Если ВыборкаНомерТоварногоЧека.ТипОплатыСсылка = Справочники.ТипыОплат.ВКредит Тогда
			ОбластьКредитОтрыв = Макет.ПолучитьОбласть("КредитОтрыв");
			ОбластьКредитОтрыв.Параметры.СуммаКредита = ВыборкаНомерТоварногоЧека.ПредоплатаПоКредиту;
			ОбластьКредитОтрыв.Параметры.СуммаКОплате = ВыборкаНомерТоварногоЧека.Сумма - ВыборкаНомерТоварногоЧека.ПредоплатаПоКредиту;          
        КонецЕсли;
        #КонецОбласти         
        
        
        ОбластьПодвалПодпись = Макет.ПолучитьОбласть("ПодвалПодпись");
		
		//// Михушкин - 30.06.2016 - Яндекс.Такси --->>
		//Если ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_181") 
		//	ИЛИ ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_227") 
		//	ИЛИ ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_428") Тогда
		//	ОбластьПодвалПодписьОтрыв = Макет.ПолучитьОбласть("ПодвалПодписьОтрыв");				
		//Иначе			
		//	ОбластьПодвалПодписьОтрыв = Макет.ПолучитьОбласть("ПодвалПодписьОтрыв_ЯндексПромо");
		//КонецЕсли;
		//// <<--- Михушкин
		
		
		// Михушкин - Программное заполнение тарифов подъемов --->>
		ПодъемыПрограммно = Ложь;
		ЧетыреКолонкиНаЛифте = Ложь;
		Запрос_ОбластьПодвалТарифы = Новый Запрос("ВЫБРАТЬ
		                                          |	ВариантыТаблицыПодъемовТаблица2016.ТипПодъемаНаЭтаж,
		                                          |	ВариантыТаблицыПодъемовТаблица2016.ВесОт КАК ВесОт,
		                                          |	ВариантыТаблицыПодъемовТаблица2016.ВесДо,
		                                          |	ВариантыТаблицыПодъемовТаблица2016.СтоимостьПодъема
		                                          |ИЗ
		                                          |	РегистрСведений.ВариантыТаблицыПодъемовВБланкахЗаказов.СрезПоследних(, Контрагент = &Контрагент) КАК ВариантыТаблицыПодъемовВБланкахЗаказовСрезПоследних
		                                          |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыТаблицыПодъемов.Таблица2016 КАК ВариантыТаблицыПодъемовТаблица2016
		                                          |		ПО ВариантыТаблицыПодъемовВБланкахЗаказовСрезПоследних.ВариантТаблицыПодъемов.Ссылка = ВариантыТаблицыПодъемовТаблица2016.Ссылка
		                                          |ГДЕ
		                                          |	ВариантыТаблицыПодъемовТаблица2016.ТипПодъемаНаЭтаж <> ЗНАЧЕНИЕ(Перечисление.ТипПодъемаНаЭтаж.ПустаяСсылка)
		                                          |
		                                          |УПОРЯДОЧИТЬ ПО
		                                          |	ВесОт");
		Запрос_ОбластьПодвалТарифы.УстановитьПараметр("Контрагент", ВыборкаНомерТоварногоЧека.Контрагент);
		РезультатОбластьПодвалТарифы = Запрос_ОбластьПодвалТарифы.Выполнить();
		ПредварительноПодвалТарифы = Запрос_ОбластьПодвалТарифы.Выполнить().Выгрузить();
		
		Если ПредварительноПодвалТарифы.Количество() Тогда			
			ПодъемыПрограммно = Истина;
			НайКолПод = ПредварительноПодвалТарифы.НайтиСтроки(Новый Структура("ТипПодъемаНаЭтаж", Перечисления.ТипПодъемаНаЭтаж.ПодъемЗаказаНаЛифте));
			Если НайКолПод.Количество() > 2 Тогда
				ЧетыреКолонкиНаЛифте = Истина;	
			Иначе	
	            ЧетыреКолонкиНаЛифте = Ложь;
			КонецЕсли;		
		КонецЕсли;
				
		
        Если ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_248") Или ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_601") Или ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_752") Тогда
            Если ВыборкаНомерТоварногоЧека.МетодОплатыПодъёма = Перечисления.МетодыОплатыПодъёмаЗаказа.ОплачиваетПартнер Тогда
                ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифыЯндексБезТаблицы");
            Иначе
				//ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифыЯндекс");
				Если ПодъемыПрограммно Тогда
					
					
					ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифыЯндексПрограммно_5Колонок");
					
					//Если ЧетыреКолонкиНаЛифте Тогда					
					//	ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифыЯндексПрограммно_4Колонки");					
					//Иначе					
					//	ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифыЯндексПрограммно");						
					//КонецЕсли;
							
				Иначе			
					ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифыЯндекс");					
				КонецЕсли;
				
            КонецЕсли;
        Иначе
            Если ВыборкаНомерТоварногоЧека.МетодОплатыПодъёма = Перечисления.МетодыОплатыПодъёмаЗаказа.ОплачиваетПартнер Тогда
                ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифыБезТаблицы");
				ПодъемыПрограммно = Ложь;
            Иначе
				//ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифы");
				Если ПодъемыПрограммно Тогда
					
					ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифыПрограммно_5Колонок");
					//Если ЧетыреКолонкиНаЛифте Тогда	
					//	ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифыПрограммно_4Колонки");
					//Иначе					
					//	ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифыПрограммно");						
					//КонецЕсли;
				
				Иначе			
					ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифы");					
				КонецЕсли;
				
            КонецЕсли;
        КонецЕсли;
        ОбластьПодвалПодпись.Параметры.Заполнить(ВыборкаНомерТоварногоЧека);
        Если ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_248") Или ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_601") Или ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_752") Тогда
            ОбластьПодвалПодпись.Параметры.НадписьОжидание = ВыборкаНомерТоварногоЧека.СОжиданием;
        КонецЕсли;
        ТабличныйДокумент.Вывести(ОбластьПодвалПодпись);
		МассивОбластей.Добавить(ОбластьПодвалПодпись);
		
		
		Если ПодъемыПрограммно Тогда
			
			Рез_ОбластьПодвалТарифы = РезультатОбластьПодвалТарифы.Выбрать();
			НомерСтрБезЛифта = 1;
			НомерСтрНаЛифте = 1;
			
			Пока Рез_ОбластьПодвалТарифы.Следующий() Цикл
				Если Рез_ОбластьПодвалТарифы.ТипПодъемаНаЭтаж = Перечисления.ТипПодъемаНаЭтаж.ПодъемЗаказаБезЛифта Тогда		
					Если НомерСтрБезЛифта < 6 Тогда
						ОбластьПодвалТарифы.Параметры["Диапазон"+НомерСтрБезЛифта] = "от "+Рез_ОбластьПодвалТарифы.ВесОт + " - до " + Рез_ОбластьПодвалТарифы.ВесДо;
						ОбластьПодвалТарифы.Параметры["Значение"+НомерСтрБезЛифта] = Рез_ОбластьПодвалТарифы.СтоимостьПодъема;
						НомерСтрБезЛифта = НомерСтрБезЛифта + 1;
					КонецЕсли;
				ИначеЕсли Рез_ОбластьПодвалТарифы.ТипПодъемаНаЭтаж = Перечисления.ТипПодъемаНаЭтаж.ПодъемЗаказаНаЛифте Тогда	
					Если НомерСтрНаЛифте < 6 Тогда
						ОбластьПодвалТарифы.Параметры["ДиапазонНаЛифте"+НомерСтрНаЛифте] = "от "+Рез_ОбластьПодвалТарифы.ВесОт + " - до " + Рез_ОбластьПодвалТарифы.ВесДо;
						ОбластьПодвалТарифы.Параметры["ЗначениеНаЛифте"+НомерСтрНаЛифте] = Рез_ОбластьПодвалТарифы.СтоимостьПодъема;				
					    НомерСтрНаЛифте = НомерСтрНаЛифте + 1;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;		
		// <<--- Михушкин		
		ОбластьПодвалТарифы.Параметры.ДатаВремяПечати = ТекущаяДата();
		
		ВыводитьОбластьПодвалТарифы = Истина;
		
		// Михушкин --->> 	
		Если ВыборкаНомерТоварногоЧека.МетодОплатыПодъёма = Перечисления.МетодыОплатыПодъёмаЗаказа.ОплачиваетПартнер 
			ИЛИ ВыборкаНомерТоварногоЧека.МетодОплатыПодъёма = Перечисления.МетодыОплатыПодъёмаЗаказа.ОпределяетсяНастройкамиЗаказа И ВыборкаНомерТоварногоЧека.ПодъемОплачен = Истина Тогда
		    ОбластьПодвалТарифы.Параметры.ПодъемОплачен = "ДА";	
			
			ВыводитьОбластьПодвалТарифы = Ложь;
	
			ОбластьПодвалТарифы.Параметры.СуммаПолученаСКлиентом = "ДЕНЕГ ЗА ПОДЪЕМ НЕ БЕРЕМ";
		ИначеЕсли ВыборкаНомерТоварногоЧека.МетодОплатыПодъёма = Перечисления.МетодыОплатыПодъёмаЗаказа.ОплачиваетКлиент 
			ИЛИ ВыборкаНомерТоварногоЧека.МетодОплатыПодъёма = Перечисления.МетодыОплатыПодъёмаЗаказа.ОпределяетсяНастройкамиЗаказа И ВыборкаНомерТоварногоЧека.ПодъемОплачен = Ложь Тогда
		    ОбластьПодвалТарифы.Параметры.ПодъемОплачен = "НЕТ";
		ИначеЕсли ВыборкаНомерТоварногоЧека.МетодОплатыПодъёма = Перечисления.МетодыОплатыПодъёмаЗаказа.ОпределяетсяПоКомментарию Тогда 	
			ОбластьПодвалТарифы.Параметры.ПодъемОплачен = "ПО КОММЕНТАРИЮ";
		КонецЕсли;		
		// <<--- Михушкин
		
		Если ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_181") Тогда
			ОбластьПодвалТарифы.Параметры.ПодъемОплачен = "Да,кроме КГТ по лестн";
		КонецЕсли;
		
		Если ВыводитьОбластьПодвалТарифы Тогда	
			ТабличныйДокумент.Вывести(ОбластьПодвалТарифы);		
		КонецЕсли;
        
        
        #Область ПроверкаВыводОтрывнойЧасти
        Пропуск = Макет.ПолучитьОбласть("Пропуск");
        МассивОбластей = Новый Массив;
		//МассивОбластей.Добавить(ОбластьШапкаОтрыв);
        ВыборкаДетальныеЗаписиПроверка = ВыборкаНомерТоварногоЧека.Выбрать();
        НомерСтроки = 0;
		
		
        
        Если ВыборкаНомерТоварногоЧека.ТипОплатыСсылка = Справочники.ТипыОплат.ВКредит Тогда
            МассивОбластей.Добавить(ОбластьКредитОтрыв);
        КонецЕсли;
        
		        #КонецОбласти 
        
        
        ////Следующая страница
        //ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
        
        
    КонецЦикла;
    
    ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
    ТабличныйДокумент.АвтоМасштаб = Истина;

КонецФункции // ПечатьПоДоставке()

//CeHbKA
Функция ПечатьПоДоставке2(Доставка, ТабличныйДокумент, Самовывоз = Ложь) Экспорт
	
	Макет = ПолучитьМакет("МакетУрезанный2");
	МассивОбластей = Новый Массив;
	
	БПДоставка = БизнесПроцессы.новаМестнаяДоставка.НайтиПоНомеру(СокрЛП(Доставка.Номер));	
	
	
    Запрос = Новый Запрос;
	Если Самовывоз И НЕ ЗначениеЗаполнено(БПДоставка) Тогда	
		Запрос.Текст = ТекстЗапросаПоСамовывозу();	
		Запрос.УстановитьПараметр("Реализ", Доставка);
		Запрос.УстановитьПараметр("РеализНомер", Доставка.Номер);
	Иначе			
		Запрос.Текст = ТекстЗапросаПоДоставке();
		Если Самовывоз И ЗначениеЗаполнено(БПДоставка) Тогда		
			Запрос.УстановитьПараметр("Доставка", БПДоставка);		
		Иначе
		    Запрос.УстановитьПараметр("Доставка", Доставка); 
			
		КонецЕсли;		
	КонецЕсли;
	
    РезультатЗапроса = Запрос.Выполнить();
    ВыборкаНомерТоварногоЧека = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
    
	Пока ВыборкаНомерТоварногоЧека.Следующий() Цикл
		
		
		//CeHbKA 26.02.2019 #2835
		//ТоварыПоМестам = УчетТоваровПоМестам(ВыборкаНомерТоварногоЧека.Контрагент);
		ТоварыПоМестам = Истина;
		
		Если ТоварыПоМестам Тогда
			
			//РТиУ = Документы.РеализацияТоваровУслуг.НайтиПоНомеру(Доставка.Номер);
			РТиУ = ВыборкаНомерТоварногоЧека.Заказ;
			
			Макет = ПолучитьМакет("МакетУрезанный3");
			
			ОбластьШапкаШКМест = Макет.ПолучитьОбласть("ШапкаШКМест");
			ОбластьСтрокаШКМест = Макет.ПолучитьОбласть("СтрокаШКМест");
			ОбластьПодвалШКМест = Макет.ПолучитьОбласть("ПодвалШКМест");
			
			ТабДокШКМест = Новый ТабличныйДокумент;
			ТабДокШКМест.Вывести(ОбластьШапкаШКМест);
			
			ВсегоСтрокШКМест = 1;
				
			ЗапросШК = Новый Запрос;
			ЗапросШК.Текст = 
				"ВЫБРАТЬ
				|	ШтрихкодыЗаказов.Заказ КАК Заказ,
				|	ШтрихкодыЗаказов.Штрихкод КАК ШтрихкодМеста,
				|	ШтрихкодыЗаказов.ШКПереданПартнером КАК ШКПереданПартнером
				|ИЗ
				|	РегистрСведений.ШтрихкодыЗаказов КАК ШтрихкодыЗаказов
				|ГДЕ
				|	ШтрихкодыЗаказов.Заказ.Номер = &Номер
				|	И ШтрихкодыЗаказов.ШКПереданПартнером = ИСТИНА
				|
				|СГРУППИРОВАТЬ ПО
				|	ШтрихкодыЗаказов.Заказ,
				|	ШтрихкодыЗаказов.Штрихкод,
				|	ШтрихкодыЗаказов.ШКПереданПартнером";
			
			ЗапросШК.УстановитьПараметр("Номер", Доставка.Номер);
			
			РезультатЗапросаШК = ЗапросШК.Выполнить();
			
			Если РезультатЗапросаШК.Пустой() Тогда
				ТабДокШКМест.Вывести(ОбластьСтрокаШКМест);
			КонецЕсли; 
			
			ВыборкаДетальныеЗаписиШК = РезультатЗапросаШК.Выбрать();
			
			Пока ВыборкаДетальныеЗаписиШК.Следующий() Цикл
		        ОбластьСтрокаШКМест.Параметры.Заполнить(ВыборкаДетальныеЗаписиШК);
				ТабДокШКМест.Вывести(ОбластьСтрокаШКМест);
				ВсегоСтрокШКМест = ВсегоСтрокШКМест + 1;	
			КонецЦикла;
			
			//тут заполняем всё из РС
			ТабДокШКМест.Вывести(ОбластьПодвалШКМест);
			
			//вывод количества мест
			ВсегоСтрокШКМест = ?(ВсегоСтрокШКМест = 1, 2, ВсегоСтрокШКМест);
			ОбластьШКВсегоМест = ТабДокШКМест.Область("R2C1:R"+ВсегоСтрокШКМест+"C1");
			ОбластьШКВсегоМест.Объединить();
			ОбластьШКВсегоМест.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
			ОбластьШКВсегоМест.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
			ОбластьШКВсегоМест.Текст = РТиУ.КоличествоМест;
			
		КонецЕсли; 
		//CeHbKA 26.02.2019 #2835		
        
        ОбластьШапка = Макет.ПолучитьОбласть("Шапка");        
        ОбластьШапка.Параметры.Заполнить(ВыборкаНомерТоварногоЧека);
		
		//+++ БАО 15.08.2017 №1678 
		//Если рэИнтеграцияРэдЭкспресс.ЭтоРЭД(ВыборкаНомерТоварногоЧека.Контрагент) Тогда
		//	ОбластьШапка.Параметры.Стриж = "РЕД";
		//Иначе
		//	ОбластьШапка.Параметры.Стриж = "Стриж";
		//КонецЕсли;	
		//--- БАО 15.08.2017 №1678 
		
		Если ВыборкаНомерТоварногоЧека.Контрагент.Код = "Shop_234 " И ЗначениеЗаполнено(ВыборкаНомерТоварногоЧека.Заказ) Тогда
			ОбластьШапка.Параметры.ПодарочнаяПозиция = ?(ВыборкаНомерТоварногоЧека.Заказ.ПодарочныеПозиции.Количество(), ВыборкаНомерТоварногоЧека.Заказ.ПодарочныеПозиции[0].Номенклатура, "");			
		КонецЕсли;
		
		Если Самовывоз Тогда
			ОбластьШапка.Параметры.ДатаИнтервалДоставкиЗаказа = Формат(ВыборкаНомерТоварногоЧека.ДатаДоставки,"ДФ=dd.MM.yyyy");
		Иначе
			ОбластьШапка.Параметры.ДатаИнтервалДоставкиЗаказа = Формат(ВыборкаНомерТоварногоЧека.ДатаДоставки,"ДФ=dd.MM.yyyy") + " с "+ Формат(ВыборкаНомерТоварногоЧека.ВремяПрибытияС,"ДФ=ЧЧ:мм") + " до "+Формат(ВыборкаНомерТоварногоЧека.ВремяПрибытияПо,"ДФ=ЧЧ:мм")+СтрокаПЕРЕНОС(ВыборкаНомерТоварногоЧека.Доставка);
		КонецЕсли;				
		ОбластьШапка.Параметры.НомерТоварногоЧека = СокрЛП(ВыборкаНомерТоварногоЧека.Номер)+"/"+СокрЛП(ВыборкаНомерТоварногоЧека.НомерВнешнегоЗаказа);		
		
		//ОбластьШапка.Параметры.НомерТоварногоЧека = СокрЛП(ВыборкаНомерТоварногоЧека.Номер)+"/"+СокрЛП(ВыборкаНомерТоварногоЧека.НомерВнешнегоЗаказа);
        ОбластьШапка.Параметры.СтрокаПродавецАгент = СтрокаПродавецАгент(ВыборкаНомерТоварногоЧека);
		
		//Логотипы,название и штрихкод
        Логотипы = ПолучитьЛоготипыКомпании(ВыборкаНомерТоварногоЧека.Контрагент);
        Если ЗначениеЗаполнено(Логотипы) Тогда
			// Якурнов 23.10.2018 10:14:02 Неявное присвоение картинки выдает ошибку 
			//ОбластьШапка.Рисунки.ЛоготипЛевый.Картинка = Логотипы.Левый.Получить();
			
			// Якурнов 23.10.2018 10:09:56 Проверка на заполненое значение и присвоение картинки 
			ЛеваяКартинка = Логотипы.Левый.Получить();
			Если ЗначениеЗаполнено(ЛеваяКартинка) Тогда
				Попытка
					ОбластьШапка.Рисунки.ЛоготипЛевый.Картинка = ЛеваяКартинка;	
				Исключение
				    Сообщить("в бланке по заказу " + СокрЛП(ВыборкаНомерТоварногоЧека.Номер) + " произошла ошибка при выводе логотипа.");
				КонецПопытки;
			КонецЕсли;
			
			ПраваяКартинка = Логотипы.Правый.Получить();
			Если ЗначениеЗаполнено(ПраваяКартинка) Тогда
				Попытка
					ОбластьШапка.Рисунки.ЛоготипПравый.Картинка = ПраваяКартинка;	
				Исключение
					Сообщить("в бланке по заказу " + СокрЛП(ВыборкаНомерТоварногоЧека.Номер) + " произошла ошибка при выводе логотипа.");
				КонецПопытки;
			КонецЕсли;
            
        КонецЕсли;
        
        Если Не ЗначениеЗаполнено(ОбластьШапка.Рисунки.ЛоготипЛевый.Картинка) Тогда
            ОбластьШапка.Рисунки.ЛоготипЛевый.ВыводитьНаПечать = Ложь;
            ОбластьШапка.Параметры.Назв = ВыборкаНомерТоварногоЧека.Контрагент;
        КонецЕСли;	
        
        Если Не ЗначениеЗаполнено(ОбластьШапка.Рисунки.ЛоготипПравый.Картинка) Тогда
            ОбластьШапка.Рисунки.ЛоготипПравый.ВыводитьНаПечать = Ложь;
            ОбластьШапка.Параметры.Телефон = ВыборкаНомерТоварногоЧека.ТелефонИнтернетМагазина;
        КонецЕСли;
        
        Если ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_248") Или ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_601") Или ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_752")Тогда
            ОбластьШапка.Параметры.Назв = "YD";
		КонецЕсли;
		попытка
		//ОбластьШапка.Параметры.Штрихкод = "37" + Формат((Число(ВыборкаНомерТоварногоЧека.Номер)), "ЧЦ=10; ЧВН=; ЧГ="); 
		ОбластьШапка.Параметры.Штрихкод = may.ПолучитьШКCode_39(СокрЛП(ВыборкаНомерТоварногоЧека.Номер));
		//ОбластьШапка.Параметры.Штрихкод = lem.глСформироватьБарКодEAN13(ОбщегоНазначения.СформироватьШтрихкодРейса(Доставка));
		//ОбластьШапка.Параметры.Штрихкод = ВыборкаНомерТоварногоЧека.Номер; 
		//lem.глСформироватьБарКодEAN13(ОбщегоНазначения.СформироватьШтрихкодРейса(Доставка));
		исключение
		конецпопытки;
        ТабличныйДокумент.Вывести(ОбластьШапка);
		МассивОбластей.Добавить(ОбластьШапка);
        
          
        ВыборкаДетальныеЗаписи = ВыборкаНомерТоварногоЧека.Выбрать();
        НомерСтроки = 0;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
            ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
            
            НомерСтроки = НомерСтроки+1;
            ОбластьСтрока.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
            ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
			//+++ БАО 10.10.2017 №
            //---ОбластьСтрока.Параметры.ID_Код = СокрЛП(ВыборкаДетальныеЗаписи.НоменклатураКод)+"/"+ВыборкаДетальныеЗаписи.НоменклатураАртикул;
			ОбластьСтрока.Параметры.ID_Код = ВыборкаДетальныеЗаписи.НоменклатураАртикул;
			//--- БАО 10.10.2017 №
				
            ТабличныйДокумент.Вывести(ОбластьСтрока);
			МассивОбластей.Добавить(ОбластьСтрока);
            
        КонецЦикла;
					
        #Область Итоги
        Если ВыборкаНомерТоварногоЧека.УчитыватьИтогоКОплате Тогда//+++++Серегин М.В. 01.03.2016 10:01:30 было ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_248") Тогда
            ОбластьИтоги = Макет.ПолучитьОбласть("ИтогиЯндекс");
            Если ВыборкаНомерТоварногоЧека.ТипОплатыСсылка = Справочники.ТипыОплат.ОплаченоВМагазине ИЛИ  ВыборкаНомерТоварногоЧека.ТипОплатыСсылка = Справочники.ТипыОплат.БезРасчетов Тогда // Задача № 2901
                ОбластьИтоги.Параметры.СуммаКОплате = 0;
            Иначе
                ОбластьИтоги.Параметры.СуммаКОплате = ВыборкаНомерТоварногоЧека.КОплатеКлиентом;//+++++Серегин М.В. 01.03.2016 10:01:54 было ВыборкаНомерТоварногоЧека.Сумма;
            КонецЕсли;
        Иначе 
            ОбластьИтоги = Макет.ПолучитьОбласть("Итоги");
        КонецЕсли;
        ОбластьИтоги.Параметры.Заполнить(ВыборкаНомерТоварногоЧека);
		
		
		// МАС - 03.08.2017 - №1394 --->> 
		Попытка
			Если ВыборкаНомерТоварногоЧека.ТипОплатыСсылка = Справочники.ТипыОплат.ОплаченоВМагазине ИЛИ ВыборкаНомерТоварногоЧека.ТипОплатыСсылка = Справочники.ТипыОплат.БезРасчетов Тогда // Задача № 2901
				ОбластьИтоги.Параметры.СуммаКОплате = "ОПЛАЧЕНО";
			КонецЕсли;
		Исключение		
		КонецПопытки;		
		// <<--- МАС 
		
		
        Вес003 = ПолучитьВесНакладная003ПоДоставке(ВыборкаНомерТоварногоЧека.Номер);
        Если ЗначениеЗаполнено(Вес003) Тогда 
            ОбластьИтоги.Параметры.Вес = Вес003;
		КонецЕсли;
		
		
		Если ОбластьИтоги.Параметры.Вес = 0 И ЗначениеЗаполнено(ВыборкаНомерТоварногоЧека.Заказ) Тогда
			ОбластьИтоги.Параметры.Вес = ВыборкаНомерТоварногоЧека.Заказ.ОбщийВес;		
			ПараметрыВес = ВыборкаНомерТоварногоЧека.Заказ.ОбщийВес;
		КонецЕсли;
		
		
		ОбластьИтоги.Параметры.Вес = Формат(ОбластьИтоги.Параметры.Вес,"ЧЦ=14; ЧДЦ=1; ЧГ=0")+" ("+?(ЗначениеЗаполнено(ВыборкаНомерТоварногоЧека.КатегорияДляРасчетаЗП), ВыборкаНомерТоварногоЧека.КатегорияДляРасчетаЗП.Родитель, ВыборкаНомерТоварногоЧека.КатегорияДоставки)+")";
        ТабличныйДокумент.Вывести(ОбластьИтоги);
		МассивОбластей.Добавить(ОбластьИтоги);
		
		//// Михушкин - 30.06.2016 - Яндекс.Такси --->>
		//Если ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_181") 
		//	ИЛИ ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_227") 
		//	ИЛИ ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_428") Тогда
		//Иначе	
		//	ЯндексПромо = Макет.ПолучитьОбласть("ЯндексПромо");
		//	ТабличныйДокумент.Вывести(ЯндексПромо);
		//КонецЕсли;
		//// <<--- Михушкин
        
        Если ВыборкаНомерТоварногоЧека.ТипОплатыСсылка = Справочники.ТипыОплат.ВКредит Тогда
			ОбластьКредит = Макет.ПолучитьОбласть("Кредит");
			ОбластьКредит.Параметры.СуммаКредита = ВыборкаНомерТоварногоЧека.ПредоплатаПоКредиту;
			ОбластьКредит.Параметры.СуммаКОплате = ВыборкаНомерТоварногоЧека.Сумма - ВыборкаНомерТоварногоЧека.ПредоплатаПоКредиту;
            ТабличныйДокумент.Вывести(ОбластьКредит);
			МассивОбластей.Добавить(ОбластьКредит);
        КонецЕсли;
        
        Вес003 = ПолучитьВесНакладная003ПоДоставке(ВыборкаНомерТоварногоЧека.Номер);
			
        ОбластьКредитОтрыв = Неопределено;
        Если ВыборкаНомерТоварногоЧека.ТипОплатыСсылка = Справочники.ТипыОплат.ВКредит Тогда
			ОбластьКредитОтрыв = Макет.ПолучитьОбласть("КредитОтрыв");
			ОбластьКредитОтрыв.Параметры.СуммаКредита = ВыборкаНомерТоварногоЧека.ПредоплатаПоКредиту;
			ОбластьКредитОтрыв.Параметры.СуммаКОплате = ВыборкаНомерТоварногоЧека.Сумма - ВыборкаНомерТоварногоЧека.ПредоплатаПоКредиту;          
        КонецЕсли;
        #КонецОбласти         
        
        
        ОбластьПодвалПодпись = Макет.ПолучитьОбласть("ПодвалПодпись");
		
		//// Михушкин - 30.06.2016 - Яндекс.Такси --->>
		//Если ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_181") 
		//	ИЛИ ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_227") 
		//	ИЛИ ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_428") Тогда
		//	ОбластьПодвалПодписьОтрыв = Макет.ПолучитьОбласть("ПодвалПодписьОтрыв");				
		//Иначе			
		//	ОбластьПодвалПодписьОтрыв = Макет.ПолучитьОбласть("ПодвалПодписьОтрыв_ЯндексПромо");
		//КонецЕсли;
		//// <<--- Михушкин
		
		
		// Михушкин - Программное заполнение тарифов подъемов --->>
		ПодъемыПрограммно = Ложь;
		ЧетыреКолонкиНаЛифте = Ложь;
		Запрос_ОбластьПодвалТарифы = Новый Запрос("ВЫБРАТЬ
		                                          |	ВариантыТаблицыПодъемовТаблица2016.ТипПодъемаНаЭтаж,
		                                          |	ВариантыТаблицыПодъемовТаблица2016.ВесОт КАК ВесОт,
		                                          |	ВариантыТаблицыПодъемовТаблица2016.ВесДо,
		                                          |	ВариантыТаблицыПодъемовТаблица2016.СтоимостьПодъема
		                                          |ИЗ
		                                          |	РегистрСведений.ВариантыТаблицыПодъемовВБланкахЗаказов.СрезПоследних(, Контрагент = &Контрагент) КАК ВариантыТаблицыПодъемовВБланкахЗаказовСрезПоследних
		                                          |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыТаблицыПодъемов.Таблица2016 КАК ВариантыТаблицыПодъемовТаблица2016
		                                          |		ПО ВариантыТаблицыПодъемовВБланкахЗаказовСрезПоследних.ВариантТаблицыПодъемов.Ссылка = ВариантыТаблицыПодъемовТаблица2016.Ссылка
		                                          |ГДЕ
		                                          |	ВариантыТаблицыПодъемовТаблица2016.ТипПодъемаНаЭтаж <> ЗНАЧЕНИЕ(Перечисление.ТипПодъемаНаЭтаж.ПустаяСсылка)
		                                          |
		                                          |УПОРЯДОЧИТЬ ПО
		                                          |	ВесОт");
		Запрос_ОбластьПодвалТарифы.УстановитьПараметр("Контрагент", ВыборкаНомерТоварногоЧека.Контрагент);
		РезультатОбластьПодвалТарифы = Запрос_ОбластьПодвалТарифы.Выполнить();
		ПредварительноПодвалТарифы = Запрос_ОбластьПодвалТарифы.Выполнить().Выгрузить();
		
		Если ПредварительноПодвалТарифы.Количество() Тогда			
			ПодъемыПрограммно = Истина;
			НайКолПод = ПредварительноПодвалТарифы.НайтиСтроки(Новый Структура("ТипПодъемаНаЭтаж", Перечисления.ТипПодъемаНаЭтаж.ПодъемЗаказаНаЛифте));
			Если НайКолПод.Количество() > 2 Тогда
				ЧетыреКолонкиНаЛифте = Истина;	
			Иначе	
	            ЧетыреКолонкиНаЛифте = Ложь;
			КонецЕсли;		
		КонецЕсли;
				
		
        Если ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_248") Или ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_601") Или ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_752") Тогда
            Если ВыборкаНомерТоварногоЧека.МетодОплатыПодъёма = Перечисления.МетодыОплатыПодъёмаЗаказа.ОплачиваетПартнер Тогда
                ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифыЯндексБезТаблицы");
            Иначе
				//ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифыЯндекс");
				Если ПодъемыПрограммно Тогда
					
					
					ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифыЯндексПрограммно_5Колонок");
					
					//Если ЧетыреКолонкиНаЛифте Тогда					
					//	ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифыЯндексПрограммно_4Колонки");					
					//Иначе					
					//	ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифыЯндексПрограммно");						
					//КонецЕсли;
							
				Иначе			
					ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифыЯндекс");					
				КонецЕсли;
				
            КонецЕсли;
        Иначе
            Если ВыборкаНомерТоварногоЧека.МетодОплатыПодъёма = Перечисления.МетодыОплатыПодъёмаЗаказа.ОплачиваетПартнер Тогда
                ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифыБезТаблицы");
				ПодъемыПрограммно = Ложь;
            Иначе
				//ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифы");
				Если ПодъемыПрограммно Тогда
					
					ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифыПрограммно_5Колонок");
					//Если ЧетыреКолонкиНаЛифте Тогда	
					//	ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифыПрограммно_4Колонки");
					//Иначе					
					//	ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифыПрограммно");						
					//КонецЕсли;
				
				Иначе			
					ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифы");					
				КонецЕсли;
				
            КонецЕсли;
        КонецЕсли;
        ОбластьПодвалПодпись.Параметры.Заполнить(ВыборкаНомерТоварногоЧека);
        Если ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_248") Или ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_601") Или ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_752") Тогда
            ОбластьПодвалПодпись.Параметры.НадписьОжидание = ВыборкаНомерТоварногоЧека.СОжиданием;
        КонецЕсли;
        ТабличныйДокумент.Вывести(ОбластьПодвалПодпись);
		МассивОбластей.Добавить(ОбластьПодвалПодпись);
		
		
		Если ПодъемыПрограммно Тогда
			
			Рез_ОбластьПодвалТарифы = РезультатОбластьПодвалТарифы.Выбрать();
			НомерСтрБезЛифта = 1;
			НомерСтрНаЛифте = 1;
			
			Пока Рез_ОбластьПодвалТарифы.Следующий() Цикл
				Если Рез_ОбластьПодвалТарифы.ТипПодъемаНаЭтаж = Перечисления.ТипПодъемаНаЭтаж.ПодъемЗаказаБезЛифта Тогда		
					Если НомерСтрБезЛифта < 6 Тогда
						ОбластьПодвалТарифы.Параметры["Диапазон"+НомерСтрБезЛифта] = "от "+Рез_ОбластьПодвалТарифы.ВесОт + " - до " + Рез_ОбластьПодвалТарифы.ВесДо;
						ОбластьПодвалТарифы.Параметры["Значение"+НомерСтрБезЛифта] = Рез_ОбластьПодвалТарифы.СтоимостьПодъема;
						НомерСтрБезЛифта = НомерСтрБезЛифта + 1;
					КонецЕсли;
				ИначеЕсли Рез_ОбластьПодвалТарифы.ТипПодъемаНаЭтаж = Перечисления.ТипПодъемаНаЭтаж.ПодъемЗаказаНаЛифте Тогда	
					Если НомерСтрНаЛифте < 6 Тогда
						ОбластьПодвалТарифы.Параметры["ДиапазонНаЛифте"+НомерСтрНаЛифте] = "от "+Рез_ОбластьПодвалТарифы.ВесОт + " - до " + Рез_ОбластьПодвалТарифы.ВесДо;
						ОбластьПодвалТарифы.Параметры["ЗначениеНаЛифте"+НомерСтрНаЛифте] = Рез_ОбластьПодвалТарифы.СтоимостьПодъема;				
					    НомерСтрНаЛифте = НомерСтрНаЛифте + 1;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;		
		// <<--- Михушкин		
		ОбластьПодвалТарифы.Параметры.ДатаВремяПечати = ТекущаяДата();
		
		ВыводитьОбластьПодвалТарифы = Истина;
		
		// Михушкин --->> 	
		Если ВыборкаНомерТоварногоЧека.МетодОплатыПодъёма = Перечисления.МетодыОплатыПодъёмаЗаказа.ОплачиваетПартнер 
			ИЛИ ВыборкаНомерТоварногоЧека.МетодОплатыПодъёма = Перечисления.МетодыОплатыПодъёмаЗаказа.ОпределяетсяНастройкамиЗаказа И ВыборкаНомерТоварногоЧека.ПодъемОплачен = Истина Тогда
		    ОбластьПодвалТарифы.Параметры.ПодъемОплачен = "ДА";	
			
			ВыводитьОбластьПодвалТарифы = Ложь;
	
			ОбластьПодвалТарифы.Параметры.СуммаПолученаСКлиентом = "ДЕНЕГ ЗА ПОДЪЕМ НЕ БЕРЕМ";
		ИначеЕсли ВыборкаНомерТоварногоЧека.МетодОплатыПодъёма = Перечисления.МетодыОплатыПодъёмаЗаказа.ОплачиваетКлиент 
			ИЛИ ВыборкаНомерТоварногоЧека.МетодОплатыПодъёма = Перечисления.МетодыОплатыПодъёмаЗаказа.ОпределяетсяНастройкамиЗаказа И ВыборкаНомерТоварногоЧека.ПодъемОплачен = Ложь Тогда
		    ОбластьПодвалТарифы.Параметры.ПодъемОплачен = "НЕТ";
		ИначеЕсли ВыборкаНомерТоварногоЧека.МетодОплатыПодъёма = Перечисления.МетодыОплатыПодъёмаЗаказа.ОпределяетсяПоКомментарию Тогда 	
			ОбластьПодвалТарифы.Параметры.ПодъемОплачен = "ПО КОММЕНТАРИЮ";
		КонецЕсли;		
		// <<--- Михушкин
		
		Если ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_181") Тогда
			ОбластьПодвалТарифы.Параметры.ПодъемОплачен = "Да,кроме КГТ по лестн";
		КонецЕсли;
		
		Если ВыводитьОбластьПодвалТарифы Тогда	
			ТабличныйДокумент.Вывести(ОбластьПодвалТарифы);		
		КонецЕсли;
		
		//CeHbKA 26.02.2019 #2835		
		Если ТоварыПоМестам Тогда
			//Тут выводим в общий табдок
			ТабличныйДокумент.Вывести(ТабДокШКМест);
		КонецЕсли;	
		
        
        #Область ПроверкаВыводОтрывнойЧасти
        Пропуск = Макет.ПолучитьОбласть("Пропуск");
        МассивОбластей = Новый Массив;
		//МассивОбластей.Добавить(ОбластьШапкаОтрыв);
        ВыборкаДетальныеЗаписиПроверка = ВыборкаНомерТоварногоЧека.Выбрать();
        НомерСтроки = 0;
		
		
        
        Если ВыборкаНомерТоварногоЧека.ТипОплатыСсылка = Справочники.ТипыОплат.ВКредит Тогда
            МассивОбластей.Добавить(ОбластьКредитОтрыв);
        КонецЕсли;
        
		        #КонецОбласти 
        
        
        ////Следующая страница
        //ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
        
        
    КонецЦикла;
    
    ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
    ТабличныйДокумент.АвтоМасштаб = Истина;

КонецФункции // ПечатьПоДоставке()

Функция ПечатьПоРейсуЗабор2(ТабличныйДокумент,Макет,ВыборкаНомерТоварногоЧека, Реж = 1, МассивОбластей = Неопределено)
	
        БланкАкси = Ложь;
		
        #Область Шапка
		Если ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_438") Тогда   //Аксиомус
			ОбластьШапка = Макет.ПолучитьОбласть("ШапкаЗаборАкси");
			БланкАкси = Истина;
        Иначе    
	        ОбластьШапка = Макет.ПолучитьОбласть("ШапкаЗабор");
		КонецЕсли;	
        
        ОбластьШапка.Параметры.Заполнить(ВыборкаНомерТоварногоЧека);
        ОбластьШапка.Параметры.ДатаЗабора = Формат(ВыборкаНомерТоварногоЧека.ДатаЗабора,"ДФ=dd-MM-yyyy");
        //ОбластьШапка.Параметры.ДатаДоставки = Формат(ВыборкаНомерТоварногоЧека.ДатаДоставки,"ДФ=dd-MM-yyyy");
        ОбластьШапка.Параметры.ДатаИнтервалДоставкиЗаказа = Формат(ВыборкаНомерТоварногоЧека.ДатаДоставки,"ДФ=dd.MM.yyyy") + " с "+ Формат(ВыборкаНомерТоварногоЧека.ВремяПрибытияС,"ДФ=ЧЧ:мм") + ?(ЗначениеЗаполнено(ВыборкаНомерТоварногоЧека.ВремяПрибытияПо)," до "+Формат(ВыборкаНомерТоварногоЧека.ВремяПрибытияПо,"ДФ=ЧЧ:мм"),"");
		//ОбластьШапка.Параметры.НомерТоварногоЧека = "д"+СокрЛП(ВыборкаНомерТоварногоЧека.Номер)+?(ЗначениеЗаполнено(ВыборкаНомерТоварногоЧека.НомерВнешнегоЗаказа),"/"+СокрЛП(ВыборкаНомерТоварногоЧека.НомерВнешнегоЗаказа),"");
		
		//Если ЗначениеЗаполнено(ВыборкаНомерТоварногоЧека.ДополнительныйНомерЗаказа) Тогда		
		//	ОбластьШапка.Параметры.НомерТоварногоЧека = СокрЛП(ВыборкаНомерТоварногоЧека.Номер)+?(ЗначениеЗаполнено(ВыборкаНомерТоварногоЧека.НомерВнешнегоЗаказа),"/"+СокрЛП(ВыборкаНомерТоварногоЧека.ДополнительныйНомерЗаказа),"");
		//Иначе	
			ОбластьШапка.Параметры.НомерТоварногоЧека = СокрЛП(ВыборкаНомерТоварногоЧека.Номер)+?(ЗначениеЗаполнено(ВыборкаНомерТоварногоЧека.НомерВнешнегоЗаказа),"/"+СокрЛП(ВыборкаНомерТоварногоЧека.НомерВнешнегоЗаказа),"");		
		//КонецЕсли;
		
		//ОбластьШапка.Параметры.НомерТоварногоЧека = СокрЛП(ВыборкаНомерТоварногоЧека.Номер)+?(ЗначениеЗаполнено(ВыборкаНомерТоварногоЧека.НомерВнешнегоЗаказа),"/"+СокрЛП(ВыборкаНомерТоварногоЧека.НомерВнешнегоЗаказа),"");
        
        //ОбластьШапка.Параметры.Покупатель = СокрЛП(ВыборкаНомерТоварногоЧека.Покупатель);
		
		Если НЕ БланкАкси Тогда
			ОбластьШапка.Параметры.СтрокаПродавецАгент = СтрокаПродавецАгент(ВыборкаНомерТоварногоЧека);	
		КонецЕсли;
		
        
        //Логотипы,название и штрихкод
        Логотипы = ПолучитьЛоготипыКомпании(ВыборкаНомерТоварногоЧека.Контрагент);
		
		//+++ БАО 15.08.2017 №1678 
		//Если рэИнтеграцияРэдЭкспресс.ЭтоРЭД(ВыборкаНомерТоварногоЧека.Контрагент) Тогда
		//	ОбластьШапка.Параметры.Стриж = "РЕД";
		//Иначе
		//	ОбластьШапка.Параметры.Стриж = "Стриж";
		//КонецЕсли;	
		//--- БАО 15.08.2017 №1678 

		
		Если БланкАкси Тогда
			Если ЗначениеЗаполнено(Логотипы) Тогда
				//ОбластьШапка.Рисунки.ЛоготипЛевыйЗаборАкси.Картинка = Логотипы.Левый.Получить();
				// Якурнов 23.10.2018 10:09:56 Проверка на заполненое значение и присвоение картинки 
				ЛеваяКартинка = Логотипы.Левый.Получить();
				Если ЗначениеЗаполнено(ЛеваяКартинка) Тогда
					Попытка
						ОбластьШапка.Рисунки.ЛоготипЛевыйЗаборАкси.Картинка = ЛеваяКартинка;	
					Исключение
						Сообщить("в бланке по заказу " + СокрЛП(ВыборкаНомерТоварногоЧека.Номер) + " произошла ошибка при выводе логотипа.");
					КонецПопытки;
				КонецЕсли;
			//ОбластьШапка.Рисунки.ЛоготипПравыйЗаборАкси.Картинка = Логотипы.Правый.Получить();
				ПраваяКартинка = Логотипы.Правый.Получить();
				Если ЗначениеЗаполнено(ПраваяКартинка) Тогда
					Попытка
						ОбластьШапка.Рисунки.ЛоготипПравыйЗаборАкси.Картинка = ПраваяКартинка;	
					Исключение
						Сообщить("в бланке по заказу " + СокрЛП(ВыборкаНомерТоварногоЧека.Номер) + " произошла ошибка при выводе логотипа.");
					КонецПопытки;
				КонецЕсли;
			КонецЕсли;
			
	        Если Не ЗначениеЗаполнено(ОбластьШапка.Рисунки.ЛоготипЛевыйЗаборАкси.Картинка) Тогда
	            ОбластьШапка.Рисунки.ЛоготипЛевыйЗаборАкси.ВыводитьНаПечать = Ложь;
	            ОбластьШапка.Параметры.Назв = ВыборкаНомерТоварногоЧека.Контрагент;
	        КонецЕСли;	
	        
	        Если Не ЗначениеЗаполнено(ОбластьШапка.Рисунки.ЛоготипПравыйЗаборАкси.Картинка) Тогда
	            ОбластьШапка.Рисунки.ЛоготипПравыйЗаборАкси.ВыводитьНаПечать = Ложь;
	            ОбластьШапка.Параметры.Телефон = ВыборкаНомерТоварногоЧека.ТелефонИнтернетМагазина;
	        КонецЕСли;
		    
		Иначе
			Если ЗначениеЗаполнено(Логотипы) Тогда
				ОбластьШапка.Рисунки.ЛоготипЛевыйЗабор.Картинка = Логотипы.Левый.Получить();
				//ОбластьШапка.Рисунки.ЛоготипПравыйЗабор.Картинка = Логотипы.Правый.Получить();
				ПраваяКартинка = Логотипы.Правый.Получить();
				Если ЗначениеЗаполнено(ПраваяКартинка) Тогда
					ОбластьШапка.Рисунки.ЛоготипПравыйЗабор.Картинка = ПраваяКартинка;	
				КонецЕсли;
			КонецЕсли;
			
	        Если Не ЗначениеЗаполнено(ОбластьШапка.Рисунки.ЛоготипЛевыйЗабор.Картинка) Тогда
	            ОбластьШапка.Рисунки.ЛоготипЛевыйЗабор.ВыводитьНаПечать = Ложь;
	            ОбластьШапка.Параметры.Назв = ВыборкаНомерТоварногоЧека.Контрагент;
	        КонецЕСли;	
	        
	        Если Не ЗначениеЗаполнено(ОбластьШапка.Рисунки.ЛоготипПравыйЗабор.Картинка) Тогда
	            ОбластьШапка.Рисунки.ЛоготипПравыйЗабор.ВыводитьНаПечать = Ложь;
	            ОбластьШапка.Параметры.Телефон = ВыборкаНомерТоварногоЧека.ТелефонИнтернетМагазина;
	        КонецЕСли;
		КонецЕсли;
	
		
        
        //+++++Серегин М.В. 20.01.2016 17:49:13 даже тут без костылей никак
        Если ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_248") Или ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_601") Или ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_752") Тогда
            ОбластьШапка.Параметры.Назв = "YD";
        КонецЕсли;
        //-----Серегин М.В. 20.01.2016 17:49:27
		
		//ОбластьШапка.Рисунки.ШК_Забор.Текст = lem.глСформироватьБарКодEAN13("37" + Формат((Число(ВыборкаНомерТоварногоЧека.Номер)), "ЧЦ=10; ЧВН=; ЧГ=") + "0");
		Если Реж = 1 Тогда
			Если БланкАкси Тогда
				попытка
				//ОбластьШапка.Рисунки.ШтрихкодЗаборАкси.Объект.barcode = "37" + Формат((Число(ВыборкаНомерТоварногоЧека.Номер)), "ЧЦ=10; ЧВН=; ЧГ=");
				//ОбластьШапка.Параметры.ШтрихкодЗаборАкси = lem.глСформироватьБарКодEAN13(ОбщегоНазначения.СформироватьШтрихкодРейса(ВыборкаНомерТоварногоЧека.Доставка));			
				ОбластьШапка.Параметры.ШтрихкодЗаборАкси = may.ПолучитьШКCode_39(СокрЛП(ВыборкаНомерТоварногоЧека.Номер));				
				исключение
				конецПопытки;
			Иначе
				попытка
				//ОбластьШапка.Рисунки.ШтрихкодЗабор.Объект.barcode = "37" + Формат((Число(ВыборкаНомерТоварногоЧека.Номер)), "ЧЦ=10; ЧВН=; ЧГ=");	
				//ОбластьШапка.Параметры.ШтрихкодЗабор = lem.глСформироватьБарКодEAN13(ОбщегоНазначения.СформироватьШтрихкодРейса(ВыборкаНомерТоварногоЧека.Доставка));			
				ОбластьШапка.Параметры.ШтрихкодЗабор = may.ПолучитьШКCode_39(СокрЛП(ВыборкаНомерТоварногоЧека.Номер));
				исключение
				конецПопытки;
				
			КонецЕсли;
		Иначе
			//ОбластьШапка.Рисунки.ШтрихкодЗабор.Текст = lem.глСформироватьБарКодEAN13("37" + Формат((Число(ВыборкаНомерТоварногоЧека.Номер)), "ЧЦ=10; ЧВН=; ЧГ=") + "0");
			//ОбластьШапка.Параметры.ШтрихкодЗабор = lem.глСформироватьБарКодEAN13(ОбщегоНазначения.СформироватьШтрихкодРейса(ВыборкаНомерТоварногоЧека.Доставка));			
			ОбластьШапка.Параметры.ШтрихкодЗабор = may.ПолучитьШКCode_39(СокрЛП(ВыборкаНомерТоварногоЧека.Номер));
		КонецеСли;	
        Для каждого Стр Из ВыборкаНомерТоварногоЧека.Доставка.АПП Цикл
            Если ЗначениеЗаполнено(ОбластьШапка.Параметры.Комментарий) И Стр.НомерСтроки = 1 Тогда
                ОбластьШапка.Параметры.Комментарий = ОбластьШапка.Параметры.Комментарий + Символы.ПС+"На складе необходимо забрать возвратные заказы ";
            ИначеЕсли Стр.НомерСтроки = 1 Тогда
                ОбластьШапка.Параметры.Комментарий = ОбластьШапка.Параметры.Комментарий + "На складе необходимо забрать возвратные заказы ";
            КонецЕсли;
             ОбластьШапка.Параметры.Комментарий =  ОбластьШапка.Параметры.Комментарий+"по АПП №"+Стр.НомерАПП+"; ";
		 КонецЦикла;
		 
		 // МАС - 25.12.2017 - № --->> 
		 Попытка			 
			 ОбъемЗ = ВыборкаНомерТоварногоЧека.Доставка.ОбъемЗабора;
			 ОбластьШапка.Параметры.Объем = ОбъемЗ;
			 Если ОбъемЗ = 0 Тогда		
				ОбластьШапка.Параметры.Брэйк = "-";
			 Иначе	
			 	ОбластьШапка.Параметры.Брэйк = ПолучитьБрейкСогласноОбъемуПартнера(ВыборкаНомерТоварногоЧека.Доставка, ОбъемЗ);		 
			 КонецЕсли;	 
		 Исключение		 
		 КонецПопытки;	 
		 // <<--- МАС 	 
                       
        ТабличныйДокумент.Вывести(ОбластьШапка);   
		МассивОбластей.Добавить(ОбластьШапка);
        #КонецОбласти 
		
		
		
        #Область Строки
		Если БланкАкси Тогда
			ОбластьИтоги = Макет.ПолучитьОбласть("ВозвратныеЗаказыАксиШапка");
		КонецЕсли;
		
		
		Если БланкАкси Тогда   //Аксиомус			
			ЗапросТЧВозвраты = Новый Запрос("ВЫБРАТЬ
		                                |	ЗаборТовараВозвраты.Ссылка,
		                                |	ЗаборТовараВозвраты.НомерСтроки,
		                                |	ЗаборТовараВозвраты.НомерЗаказа,
		                                |	ЗаборТовараВозвраты.КоличествоМест
		                                |ИЗ
		                                |	Документ.ЗаборТовара.Возвраты КАК ЗаборТовараВозвраты
		                                |ГДЕ
		                                |	ЗаборТовараВозвраты.Ссылка = &Ссылка");
			ЗапросТЧВозвраты.УстановитьПараметр("Ссылка", ВыборкаНомерТоварногоЧека.Доставка.Ссылка);
			Выборка = ЗапросТЧВозвраты.Выполнить();
			Если НЕ Выборка.Пустой() Тогда
				ОбластьВозвратныеЗаказыАксиШапка = Макет.ПолучитьОбласть("ВозвратныеЗаказыАксиШапка");
				ТабличныйДокумент.Вывести(ОбластьВозвратныеЗаказыАксиШапка);	
				МассивОбластей.Добавить(ОбластьВозвратныеЗаказыАксиШапка);
			КонецЕсли;
			
			Рез = Выборка.Выбрать();
			НомерСтроки = 0; КоличествоМестАкси = 0;
			
			Пока Рез.Следующий() Цикл				
				ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаЗаборАкси");	
				НомерСтроки = НомерСтроки + 1;
				КоличествоМестАкси = КоличествоМестАкси + Рез.КоличествоМест;
	            ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
				ОбластьСтрока.Параметры.НомерЗаказа	= Рез.НомерЗаказа;
				ОбластьСтрока.Параметры.КоличествоМест	= Рез.КоличествоМест;
	            ТабличныйДокумент.Вывести(ОбластьСтрока);
				МассивОбластей.Добавить(ОбластьСтрока);
			КонецЦикла;			
		Иначе 
			
			ВыборкаДетальныеЗаписи = ВыборкаНомерТоварногоЧека.Выбрать();
	        НомерСтроки = 0;  
			
	        Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	            Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Номенклатура) Тогда	            		   
				    ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаЗабор");     
		            НомерСтроки = НомерСтроки + 1;
		            ОбластьСтрока.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		            ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
					//+++ БАО 10.10.2017 №
					//---ОбластьСтрока.Параметры.ID_Код = СокрЛП(ВыборкаДетальныеЗаписи.НоменклатураКод)+"/"+ВыборкаДетальныеЗаписи.НоменклатураАртикул;
					ОбластьСтрока.Параметры.ID_Код = ВыборкаДетальныеЗаписи.НоменклатураАртикул;
					//--- БАО 10.10.2017 №

					
		            ТабличныйДокумент.Вывести(ОбластьСтрока);
					МассивОбластей.Добавить(ОбластьСтрока);
	            КонецЕсли;
			КонецЦикла;			
		КонецЕсли;											       
        #КонецОбласти 
		
        
        #Область Итоги
		Если БланкАкси Тогда   //Аксиомус
			Если КоличествоМестАкси > 0 Тогда		
				ОбластьИтоги = Макет.ПолучитьОбласть("ИтогиЗаборАкси");
				ОбластьИтоги.Параметры.КоличествоМестАкси = КоличествоМестАкси;	
				ОбластьИтоги.Параметры.Заполнить(ВыборкаНомерТоварногоЧека);
        		ТабличныйДокумент.Вывести(ОбластьИтоги);
				МассивОбластей.Добавить(ОбластьИтоги);
			КонецЕсли;
        Иначе    
	        ОбластьИтоги = Макет.ПолучитьОбласть("ИтогиЗабор");
			ОбластьИтоги.Параметры.Заполнить(ВыборкаНомерТоварногоЧека);
        	ТабличныйДокумент.Вывести(ОбластьИтоги);
			МассивОбластей.Добавить(ОбластьИтоги);
		КонецЕсли;  
        #КонецОбласти
        
        #Область Подвал
        Если ВыборкаНомерТоварногоЧека.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Shop_438") Тогда   //Аксиомус
	        ОбластьПодвалПодпись = Макет.ПолучитьОбласть("ПодвалПодписьЗаборAxiomus");
	        ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифыЗаборAxiomus");
        Иначе    
	        ОбластьПодвалПодпись = Макет.ПолучитьОбласть("ПодвалПодписьЗабор");
	        ОбластьПодвалТарифы = Макет.ПолучитьОбласть("ПодвалТарифыЗабор");
    	КонецЕсли;
    
        ТабличныйДокумент.Вывести(ОбластьПодвалПодпись);
		МассивОбластей.Добавить(ОбластьПодвалПодпись);
        ОбластьПодвалТарифы.Параметры.ДатаВремяПечати = ТекущаяДата();
        ТабличныйДокумент.Вывести(ОбластьПодвалТарифы);
		МассивОбластей.Добавить(ОбластьПодвалТарифы);
        #КонецОбласти 
		
		//Если НЕ ТабличныйДокумент.ПроверитьВывод(МассивОбластей) Тогда		
		//	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();	
		//	МассивОбластей = Новый Массив;
		//КонецЕсли;
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
        Возврат ТабличныйДокумент;
    
КонецФункции


Функция ПечатьЗабор(Забор, ТабличныйДокумент) Экспорт
	
	Макет = ПолучитьМакет("МакетУрезанный2");
	МассивОбластей = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаборТовара.Ссылка КАК Ссылка,
		|	ЗаборТовараТовары.Номенклатура КАК Номенклатура,
		|	ЗаборТовараТовары.Номенклатура.Код КАК НоменклатураКод,
		|	ЗаборТовараТовары.Номенклатура.Артикул КАК НоменклатураАртикул,
		|	СУММА(ЗаборТовараТовары.Количество) КАК Количество,
		|	МАКСИМУМ(ЗаборТовараТовары.Цена) КАК Цена,
		|	СУММА(ЗаборТовараТовары.Сумма) КАК Сумма,
		|	СУММА(ЗаборТовараТовары.Вес * ЗаборТовараТовары.Количество) КАК Вес,
		|	ЗаборТовараТовары.Ссылка КАК Доставка,
		|	ЗаборТовараТовары.НомерСтроки КАК НомерСтроки,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор) КАК ТипЗаказа
		|ПОМЕСТИТЬ ВТ_Забор
		|ИЗ
		|	Документ.ЗаборТовара КАК ЗаборТовара
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаборТовара.Товары КАК ЗаборТовараТовары
		|		ПО (ЗаборТовараТовары.Ссылка = ЗаборТовара.Ссылка)
		|ГДЕ
		|	ЗаборТовара.Ссылка = &Забор
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаборТовара.Ссылка,
		|	ЗаборТовараТовары.Номенклатура,
		|	ЗаборТовараТовары.Номенклатура.Код,
		|	ЗаборТовараТовары.Номенклатура.Артикул,
		|	ЗаборТовараТовары.Ссылка,
		|	ЗаборТовараТовары.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Забор.Ссылка КАК Ссылка,
		|	ВТ_Забор.Номенклатура КАК Номенклатура,
		|	ВТ_Забор.НоменклатураКод КАК НоменклатураКод,
		|	ВТ_Забор.НоменклатураАртикул КАК НоменклатураАртикул,
		|	ВТ_Забор.Количество КАК Количество,
		|	ВТ_Забор.Цена КАК Цена,
		|	ВТ_Забор.Сумма КАК Сумма,
		|	ВТ_Забор.Вес КАК Вес,
		|	ВТ_Забор.Ссылка.Номер КАК Номер,
		|	ВТ_Забор.Ссылка.АдресДоставки КАК АдресДоставки,
		|	ВТ_Забор.Ссылка.Телефон КАК ТелефонПокупателя,
		|	ВТ_Забор.Ссылка.Контрагент КАК Контрагент,
		|	ВТ_Забор.Ссылка.Комментарий КАК Комментарий,
		|	ВТ_Забор.Ссылка.ДатаДоставки КАК ДатаДоставки,
		|	ВТ_Забор.Ссылка.ВремяДоставкиС КАК ВремяПрибытияС,
		|	ВТ_Забор.Ссылка.ВремяДоставкиПо КАК ВремяПрибытияПо,
		|	ЕСТЬNULL(ТипыОплат.Ссылка, ЗНАЧЕНИЕ(Справочник.ТипыОплат.ПустаяСсылка)) КАК ТипОплаты,
		|	ВТ_Забор.Ссылка.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
		|	ВТ_Забор.Ссылка.Контрагент.ТелефонИнтернетМагазина КАК ТелефонИнтернетМагазина,
		|	ВТ_Забор.Ссылка.Грузополучатель КАК Покупатель,
		|	ВТ_Забор.НомерСтроки КАК НомерСтроки,
		|	ВТ_Забор.Ссылка КАК Доставка,
		|	ВТ_Забор.Ссылка.Контрагент КАК ИнтернетМагазинЯндекса,
		|	ТипыОплат.Ссылка КАК ТипОплатыСсылка,
		|	ВТ_Забор.Ссылка.Контрагент.Приоритет КАК ВладелецТовараПриоритет,
		|	ВТ_Забор.ТипЗаказа КАК ТипЗаказа,
		|	ВТ_Забор.Ссылка.Дата КАК ДатаЗабора,
		|	ВЫБОР
		|		КОГДА ВТ_Забор.Ссылка.Автор = """"
		|			ТОГДА ""Не указан""
		|		ИНАЧЕ ВТ_Забор.Ссылка.Автор
		|	КОНЕЦ КАК МенеджерЗабора
		|ИЗ
		|	ВТ_Забор КАК ВТ_Забор
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыОплат КАК ТипыОплат
		|		ПО ВТ_Забор.Ссылка.ТипОплаты = ТипыОплат.Код
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТипЗаказа,
		|	ВладелецТовараПриоритет,
		|	Номер,
		|	НомерСтроки,
		|	Номенклатура
		|ИТОГИ
		|	СУММА(Количество),
		|	СУММА(Сумма),
		|	СУММА(Вес),
		|	МАКСИМУМ(АдресДоставки),
		|	МАКСИМУМ(ТелефонПокупателя),
		|	МАКСИМУМ(Контрагент),
		|	МАКСИМУМ(Комментарий),
		|	МАКСИМУМ(ДатаДоставки),
		|	МАКСИМУМ(ВремяПрибытияС),
		|	МАКСИМУМ(ВремяПрибытияПо),
		|	МАКСИМУМ(ТипОплаты),
		|	МАКСИМУМ(НомерВнешнегоЗаказа),
		|	МАКСИМУМ(ТелефонИнтернетМагазина),
		|	МАКСИМУМ(Покупатель),
		|	МАКСИМУМ(Доставка),
		|	МАКСИМУМ(ИнтернетМагазинЯндекса),
		|	МАКСИМУМ(ТипОплатыСсылка),
		|	МАКСИМУМ(ВладелецТовараПриоритет),
		|	МАКСИМУМ(ДатаЗабора),
		|	МАКСИМУМ(МенеджерЗабора)
		|ПО
		|	Номер
		|АВТОУПОРЯДОЧИВАНИЕ";	
	
	Запрос.УстановитьПараметр("Забор", Забор);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПечатьПоРейсуЗабор2(ТабличныйДокумент,Макет,ВыборкаДетальныеЗаписи,,МассивОбластей);
	КонецЦикла;
	
    ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
    ТабличныйДокумент.АвтоМасштаб = Истина;
	
КонецФункции // ()

Функция УчетТоваровПоМестам(Контрагент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПараметрыКонтрагентовСрезПоследних.Контрагент КАК Контрагент,
		|	ПараметрыКонтрагентовСрезПоследних.УчетТоваровПоМестам КАК УчетТоваровПоМестам
		|ИЗ
		|	РегистрСведений.ПараметрыКонтрагентов.СрезПоследних(, Контрагент = &Контрагент) КАК ПараметрыКонтрагентовСрезПоследних";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.УчетТоваровПоМестам;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции // ()
 
//CeHbKA


Функция ПечатьПоРейсу(Рейс,ТабличныйДокумент, РежимСбораДанных = "Старый", ПериодПечати = Неопределено) Экспорт
	
	//Макет = ПолучитьМакет("МакетУрезанный");
	//CeHbKA 03.06.2019 
	Макет = ПолучитьМакет("МакетУрезанный2");
	//CeHbKA 03.06.2019 
	МассивОбластей = Новый Массив;
	
	
    Запрос = Новый Запрос;
    Запрос.Текст = ТекстЗапросаПоРейсам();
	
	Если РежимСбораДанных = "Старый" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "@СтрокаУсловия@", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "@ПОРЯДОК@", "");
		
	ИначеЕсли РежимСбораДанных = "БезДоставокЯндекс" Тогда	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "@СтрокаУсловия@", " ГДЕ Выбор Когда ВТ_Объединение.ТипЗаказа = Значение(Перечисление.ТипыЗаказов.Доставка) Тогда (ВТ_Объединение.Контрагент.Код <> ""Shop_601"") И (ВТ_Объединение.Контрагент.Код <> ""Shop_752"")  Иначе 1=1 Конец ");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "@ПОРЯДОК@", "");
	ИначеЕсли РежимСбораДанных = "ТолькоДоставкиЯндекс" Тогда	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "@СтрокаУсловия@", " ГДЕ Выбор Когда ВТ_Объединение.ТипЗаказа = Значение(Перечисление.ТипыЗаказов.Доставка) Тогда (ВТ_Объединение.Контрагент.Код = ""Shop_601"") ИЛИ (ВТ_Объединение.Контрагент.Код = ""Shop_752"") Иначе 1=0 Конец ");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "РейсЗаказы.Ссылка = &Рейс", "РейсЗаказы.Ссылка.ДатаРейса Между &НачДата И &КонДата");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "@ПОРЯДОК@", " НомерЛог, ");
	КонецеСли;	
	
	
	Запрос.УстановитьПараметр("ТерминалДоставки", ПараметрыСеанса.ТерминалДоставки);
	
	Если Не РежимСбораДанных = "ТолькоДоставкиЯндекс" Тогда
    	Запрос.УстановитьПараметр("Рейс", Рейс);
	Иначе	
		Запрос.УстановитьПараметр("НачДата", ПериодПечати.ДатаНачала);
		Запрос.УстановитьПараметр("КонДата", ПериодПечати.ДатаОкончания);
	КонецеСли;
	
    РезультатЗапроса = Запрос.Выполнить();
    
    ВыборкаТипЗаказа = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
    
    Пока ВыборкаТипЗаказа.Следующий() Цикл
        // Вставить обработку выборки ВыборкаТипЗаказа
    
        ВыборкаНомер = ВыборкаТипЗаказа.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
    
		Пока ВыборкаНомер.Следующий() Цикл
			
			//Если ВыборкаНомер.Озон Тогда			
			//	Продолжить;		
			//КонецЕсли;			
			
			
			//// проверка 
			//Если НЕ ТабличныйДокумент.ПроверитьВывод(МассивОбластей) Тогда		
			//	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();	
			//	МассивОбластей = Новый Массив;
			//КонецЕсли;
					
			
            Если ВыборкаНомер.ТипЗаказа = Перечисления.ТипыЗаказов.Доставка Тогда
				//ПечатьПоРейсуДоставка(ТабличныйДокумент,Макет,ВыборкаНомер,,МассивОбластей);
				//CeHbKA 03.06.2019
				ПечатьПоДоставке2(ВыборкаНомер.Доставка, ТабличныйДокумент);	
				//CeHbKA 03.06.2019
			ИначеЕсли ВыборкаНомер.ТипЗаказа = Перечисления.ТипыЗаказов.Забор Тогда 
                //ПечатьПоРейсуЗабор(ТабличныйДокумент,Макет,ВыборкаНомер,,МассивОбластей);
				//CeHbKA 03.06.2019
                ПечатьПоРейсуЗабор2(ТабличныйДокумент,Макет,ВыборкаНомер,,МассивОбластей);
				//CeHbKA 03.06.2019
			КонецЕсли;
     
		//CeHbKA 04.06.2019
        ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		//CeHbKA 04.06.2019
            
        КонецЦикла;
    КонецЦикла;
    
    ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
    ТабличныйДокумент.АвтоМасштаб = Истина;
    

КонецФункции // ПечатьПоРейсу()


Функция ПолучитьБрейкСогласноОбъемуПартнера(Забор, ОбъемФ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбъемныеБрейки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ОбъемныеБрейки КАК ОбъемныеБрейки
		|ГДЕ
		|	ОбъемныеБрейки.Владелец = &Владелец
		|	И ОбъемныеБрейки.ОбъемОт <= &Объем
		|	И ОбъемныеБрейки.ОбъемДо >= &Объем";

	Запрос.УстановитьПараметр("Объем", ОбъемФ);
	Запрос.УстановитьПараметр("Владелец", Забор.ТарифнаяСетка);

	РезМ = Запрос.Выполнить().Выбрать();
	Пока РезМ.Следующий() Цикл
		Возврат РезМ.Ссылка;
	КонецЦикла;		
	Возврат Неопределено;
	
КонецФункции