
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не Объект.Ссылка.Пустая() Тогда
		СписокЭтаповРазработки.Параметры.УстановитьЗначениеПараметра("Владелец", Объект.Ссылка);
	Иначе
		СписокЭтаповРазработки.Параметры.УстановитьЗначениеПараметра("Владелец", 1);
	КонецеСли;	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверкаПроведенияПроектаПоУчету(Проект)
	// Вставить содержимое обработчика.
	СтрукОтвета = Новый Структура;
	
	СтрукОтвета.Вставить("ЕстьЭтапы", УправлениеПроектамиРазработкиСервер.ПоПроектуСозданыЭтапыПроекта(Проект));
	СтрукОтвета.Вставить("ЕстьУчет", УправлениеПроектамиРазработкиСервер.ПроектУчтенВРСУчетПроектовРазработки(Проект));
	СтрукОтвета.Вставить("ЕстьСостояние", УправлениеПроектамиРазработкиСервер.ПроектУчтенВРССостояниеПроектовРазработки(Проект));

	Если Не СтрукОтвета.ЕстьЭтапы Тогда
		УправлениеПроектамиРазработкиСервер.СоздатьЭтапыРазработкиПоУмолчанию(Проект);
	КонецеСли;	
	
	Если Не СтрукОтвета.ЕстьУчет Тогда
		УправлениеПроектамиРазработкиСервер.ЗафиксироватьПроектВРСПроектовРазработки(Проект);
	КонецеСли;	
	
	
	Возврат СтрукОтвета;
КонецФункции

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Ответ = ПроверкаПроведенияПроектаПоУчету(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	// Вставить содержимое обработчика.
	Отказ = Не ПроверкаЗаполненностиРеквизитов();
КонецПроцедуры

&НаКлиенте
Функция ПроверкаЗаполненностиРеквизитов()
	Хорошо = Истина;
	
	Если Не ЗначениеЗаполнено(Объект.НомерРелиза) Тогда
		Сообщить("Укажите планируемый номер релиза!");
		Хорошо = Ложь;
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Объект.Подсистема) Тогда
		Сообщить("Выберите подсистему!");
		Хорошо = Ложь;
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Объект.ОписаниеПроекта) Тогда
		Сообщить("Заполните описание проекта!");
		Хорошо = Ложь;
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Объект.ПодразделениеЗаказчик) Тогда
		Сообщить("Укажите подразделение-заказчик!");
		Хорошо = Ложь;
	КонецЕсли;	
	
	Если Объект.Участники.Количество() = 0 Тогда
		Сообщить("Внесите сведения об участниках проекта!");
		Хорошо = Ложь;
	КонецЕСли;
	
	Если Объект.Участники.Количество() > 0 Тогда
		ОтветПроверки = ПроверитьСоставУчастниковПроекта();
		Если Не ОтветПроверки.ЕстьЗаказчик Тогда
			Сообщить("Среди участников проекта нет заказчика!");
			Хорошо = Ложь;
		КонецеСли;	
		
		Если Не ОтветПроверки.ЕстьЗаказчик Тогда
			Сообщить("Среди участников проекта нет постановщика!");
			Хорошо = Ложь;
		КонецеСли;	
	КонецеСли;
	
	Возврат Хорошо;
КонецФункции	

&НаСервере
Функция ПроверитьСоставУчастниковПроекта()
	ЕстьЗаказчик = Ложь;
	ЕстьПостановщик = Ложь;
	
	Для Каждого Тек Из Объект.Участники Цикл
		Если Тек.РольУчастника = Перечисления.РолиУчастниковПроектовРазработки.Заказчик Тогда
			ЕстьЗаказчик = Истина;
		ИначеЕсли Тек.РольУчастника = Перечисления.РолиУчастниковПроектовРазработки.Постановщик Тогда	
			ЕстьПостановщик = Истина;
		КонецеСли;	
	КонецЦикла;
	
	Струк = Новый Структура;
	Струк.Вставить("ЕстьЗаказчик", ЕстьЗаказчик);
	Струк.Вставить("ЕстьПостановщик", ЕстьПостановщик);
	
	Возврат Струк;
КонецФункции	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеПроектамиРазработкиСервер.ПолучитьСписокПодсистемКонфигурации(Элементы.Подсистема.СписокВыбора);
	УправлениеПроектамиРазработкиСервер.ДополнитьСписокПодсистем(Элементы.Подсистема.СписокВыбора);
	// Вставить содержимое обработчика.
КонецПроцедуры
