
Процедура ПередЗаписью(Отказ)
	
	// Проверка заполнения
	Перем Заголовок;
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = "Запись элемента """ + СокрЛП(Ссылка) + """: ";
	
	спОшибки = Новый Массив;
	// Проверка заполнения шапки
	СтруктураОбязательныхПолей = Новый Структура("ОсновнойГСМ");
	Для Каждого ОбязательноеПоле Из СтруктураОбязательныхПолей Цикл
		Если Не ЗначениеЗаполнено(ЭтотОбъект[ОбязательноеПоле.Ключ]) Тогда
			спОшибки.Добавить("  Не заполнен реквизит "+ОбязательноеПоле.Ключ+".");
		КонецЕсли;
	КонецЦикла;
		
	Если спОшибки.Количество() <> 0 Тогда
		Отказ = Истина;
		Сообщить(Заголовок,СтатусСообщения.Важное);
		Для Каждого Ошибка Из спОшибки Цикл
			Сообщить(Ошибка);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
