
&НаСервере

Функция ПолучитьМакетНаСервере()  
	
	ЭтотОбъект=РеквизитФормыВЗначение("Отчет");  
	
	Макет = ЭтотОбъект.ПолучитьМакет("Макет");  
	
	Возврат Макет;
	
КонецФункции

&НаКлиенте
Функция СформироватьОтправитьПоПочте() Экспорт
	СхемаКомпоновкиДанных = ПолучитьМакетНаСервере();
	
	СтруктураВариантов = Новый Структура;
	пВарианты = СхемаКомпоновкиДанных.ВариантыНастроек;
	Для Каждого пЭл ИЗ пВарианты Цикл
		СтруктураВариантов.Вставить(пЭл.Имя,пЭл.Настройки);
	КонецЦикла;
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.ЗагрузитьНастройки(СтруктураВариантов.Основной);
	КомпоновщикНастроек.Настройки.параметрыданных.Элементы[2].Значение = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение;
	
	Если Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[1].использование Тогда
		КомпоновщикНастроек.Настройки.отбор.элементы[0].ПравоеЗначение = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[1].ПравоеЗначение;
		КомпоновщикНастроек.Настройки.отбор.элементы[0].ВидСравнения = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[1].ВидСравнения;
		КомпоновщикНастроек.Настройки.отбор.элементы[0].Использование = Истина;
	КонецеСли;
	//Из схемы возьмем настройки по умолчанию
	Настройки = КомпоновщикНастроек.Настройки;
	
	//СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	
	//Помещаем в переменную данные о расшифровке данных
	//ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	//Формируем макет, с помощью компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	//Передаем в макет компоновки схему, настройки и данные расшифровки   ДанныеРасшифровки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,Настройки);	
	//Выполним компоновку с помощью процессора компоновки   ДанныеРасшифровки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,,, Истина);
	
	//Очищаем поле табличного документа
	Результат = Элементы.Результат;
	Результат.Очистить();
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	Возврат Результат;
КонецФункции	

&НаКлиенте
Процедура ОтправитьПоПочте(Команда)
	СформироватьОтправитьПоПочте();
КонецПроцедуры
