
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	//CeHbKA 13.05.2019 #3103
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Терминал = ПараметрыСеанса.ТерминалДоставки;
		Объект.Терминал = ?(Объект.Терминал.Пустая(), Справочники.РегиональныеТерминалы.МоскваСтриж, Объект.Терминал);
	КонецЕсли; 
	//CeHbKA 13.05.2019 #3103
	
КонецПроцедуры

//&НаСервере
//Функция ПолучитьБэйджНаСервере(ТекСотрудник)
//	
//	// ищем бэйдж
//	Запрос = Новый Запрос("ВЫБРАТЬ
//	                      |	БэйджиСотрудников.Ссылка КАК Ссылка,
//	                      |	УчетБэйджейСотрудниковСрезПервых.Сотрудник КАК Сотрудник,
//	                      |	ЕСТЬNULL(УчетБэйджейСотрудниковСрезПервых.БэйджАктуален, ЛОЖЬ) КАК БэйджАктуален
//	                      |ИЗ
//	                      |	Справочник.БэйджиСотрудников КАК БэйджиСотрудников
//	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетБэйджейСотрудников.СрезПервых КАК УчетБэйджейСотрудниковСрезПервых
//	                      |		ПО БэйджиСотрудников.Владелец = УчетБэйджейСотрудниковСрезПервых.Сотрудник
//	                      |ГДЕ
//	                      |	БэйджиСотрудников.Владелец = &Владелец");
//	Запрос.УстановитьПараметр("Владелец", ТекСотрудник);
//	Рез = Запрос.Выполнить().Выбрать();
//	
//	Если Рез.Следующий() Тогда			
//		Если Рез.БэйджАктуален Тогда			
//			
//			Возврат Рез.ссылка;		
//		Иначе
//		    Сообщить("Бэйдж сотрудника более не актуален. ");
//			Возврат Неопределено;	
//		КонецЕсли;				
//	Иначе
//		Сообщить("Нет назначенного бейджа. ");
//		Возврат Неопределено;	
//	КонецЕсли;
//	
//	
//КонецФункции


&НаКлиенте
Процедура ПечатьБэйджей(Команда)
	
	МассивБэйджей = Новый Массив;
	
	Для каждого Чел Из Объект.Сотрудники Цикл
	
		Бэйдж = ПолучитьБэйджНаСервере(Чел.Сотрудник);	
	    Если Бэйдж = Неопределено Тогда	
			//// вопрос о создании бэйджа
			//Парам = Новый Структура("Сотрудник", ТекСотрудник);
			//ТекстВопроса = "Создать и назначить бэйдж на сотрудника " + ТекСотрудник + "?";
			//ПоказатьВопрос(Новый ОписаниеОповещения("СоздатьБэйдж", ЭтотОбъект, Парам), ТекстВопроса, РежимДиалогаВопрос.ДаНет);   
			Бэйдж = mas.СоздатьБэйджСотрудника(Чел.Сотрудник);
		Иначе				
		КонецЕсли;
		МассивБэйджей.Добавить(Бэйдж);
		
	КонецЦикла;
	
	
	Если МассивБэйджей.Количество() Тогда		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		ТабличныйДокумент = mas.ПечатьБэйджаГрупповая(МассивБэйджей, ТабличныйДокумент);	
		ТабличныйДокумент.Показать();		
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура СоздатьБэйдж(Парам1, Парам2) Экспорт

	Если Парам1 = КодВозвратаДиалога.Да Тогда 
		Бэйдж = mas.СоздатьБэйджСотрудника(Парам2.Сотрудник);	
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		mas.НапечататьБэйджНаСервере(Бэйдж.Ссылка, ТабличныйДокумент);
		ТабличныйДокумент.Показать();
	Иначе	
	КонецЕсли;
	
КонецПроцедуры

// печать бэйджа
Процедура НапечататьБэйджНаСервере(БэйджСсылка, ТабличныйДокумент)

		
	Макет = Справочники.БэйджиСотрудников.ПолучитьМакет("Бэйдж");
	//ТабличныйДокумент = Новый ТабличныйДокумент;	
	
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Должность = "";
	Если ТипЗнч(БэйджСсылка.Владелец) = Тип("СправочникСсылка.новаВодители") Тогда		
		Должность = "Водитель";	
	ИначеЕсли ТипЗнч(БэйджСсылка.Владелец) = Тип("СправочникСсылка.новаЭкспедиторы") Тогда	
		Должность = "Экспедитор";	
	КонецЕсли;
	
	ОбластьБэйджа = Макет.ПолучитьОбласть("ОбластьБэйджа");
	
	ОбластьБэйджа.Параметры.ФИО = БэйджСсылка.Владелец.Наименование;		
	ОбластьБэйджа.Параметры.Должность = Должность;
	ОбластьБэйджа.Параметры.Штрихкод = may.ПолучитьШКCode_39(СокрЛП(БэйджСсылка.Код));	

	ТабличныйДокумент.Вывести(ОбластьБэйджа);
	

КонецПроцедуры


Функция ПолучитьБэйджНаСервере(Владелец) Экспорт
	
	// ищем бэйдж
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	БэйджиСотрудников.Ссылка КАК Ссылка,
	                      |	УчетБэйджейСотрудниковСрезПервых.Сотрудник КАК Сотрудник,
	                      |	ЕСТЬNULL(УчетБэйджейСотрудниковСрезПервых.БэйджАктуален, ЛОЖЬ) КАК БэйджАктуален
	                      |ИЗ
	                      |	Справочник.БэйджиСотрудников КАК БэйджиСотрудников
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетБэйджейСотрудников.СрезПервых КАК УчетБэйджейСотрудниковСрезПервых
	                      |		ПО БэйджиСотрудников.Владелец = УчетБэйджейСотрудниковСрезПервых.Сотрудник
	                      |ГДЕ
	                      |	БэйджиСотрудников.Владелец = &Владелец");
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда			
		Если Рез.БэйджАктуален Тогда			
			
			Возврат Рез.ссылка;		
		Иначе
		    Сообщить("Бэйдж сотрудника более не актуален: " + Владелец);
			Возврат Неопределено;	
		КонецЕсли;				
	Иначе
		Сообщить("Нет назначенного бейджа: " + Владелец);
		Возврат Неопределено;	
	КонецЕсли;
	
	
КонецФункции

&НаКлиенте
Процедура СотрудникиСотрудникПриИзменении(Элемент)
	
	//CeHbKA 13.05.2019 #3103	
	ТекСтрока = Элементы.Сотрудники.ТекущиеДанные;
	
	ТекСтрока.ФизЛицо = ПолучитьФизЛицоНаСервере(ТекСтрока.Сотрудник);
	//CeHbKA 13.05.2019 #3103
		
КонецПроцедуры

//CeHbKA 13.05.2019 #3103
&НаСервере
Функция ПолучитьФизЛицоНаСервере(Сотрудник)
	
	Попытка
		Возврат Сотрудник.ФизЛицо;	
	Исключение	
		Возврат Справочники.ФизическиеЛица.ПустаяСсылка();	
	КонецПопытки; 
	
КонецФункции


//CeHbKA 13.05.2019 #3103

//Переварюха В.В. Задача № 3649 07.11.2019
&НаКлиенте
Процедура СотрудникиДолжностьПриИзменении(Элемент)
	
	РольСотрудника = ЭтотОбъект.ТекущийЭлемент.ТекущиеДанные.Должность.РольСотрудника;
	ЭтотОбъект.ТекущийЭлемент.ТекущиеДанные.ОсновнаяРольСотрудника = РольСотрудника;
	
КонецПроцедуры
//Переварюха В.В. Задача № 3649 07.11.2019
