
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	#Если Не МобильноеПриложениеСервер Тогда
		Элементы.ВыбранныйТипОплаты.Видимость = Ложь;  	
	#КонецЕсли
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура РейсПриИзменении(Элемент)
	
	Список.Параметры.УстановитьЗначениеПараметра("ВыбранныйРейс", ВыбранныйРейс);
	Итоги.Параметры.УстановитьЗначениеПараметра("ВыбранныйРейс", ВыбранныйРейс);
	
	Элементы.Список.Обновить();
	Элементы.Итоги.Обновить();	
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныйТипОплатыПриИзменении(Элемент)
	
	УстановитьОтборВыбранногоТипаОплатыМП(ВыбранныйТипОплаты);
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура УстановитьОтборВыбранногоТипаОплатыМП(Значение)
	Для Каждого ЭлементОтбора Из Итоги.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			Если ЗначениеЗаполнено(Значение) Тогда	
				ЭлементОтбора.Использование = Истина;
				ЭлементОтбора.ПравоеЗначение = ВыбранныйТипОплаты;
			Иначе
				ЭлементОтбора.Использование = Ложь;
			КонецеСли;											
		КонецЕСли;	
	КонецЦикла;				
	Элементы.Итоги.Обновить();		
КонецПроцедуры
#КонецОбласти

