
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр мгЗарплатаУдержания Приход
	Движения.мгЗарплатаУдержания.Записывать = Истина;
	Движения.мгЗарплатаУдержания.Очистить();
	Для Каждого ТекСтрокаАвансЗарПлата Из АвансЗарПлата Цикл
		Движение = Движения.мгЗарплатаУдержания.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ПериодРегистрации;
		Движение.Организация = Организация;
		Движение.Терминал = Терминал;
		Движение.ВидУдержания = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.ВыданАвансИЗП");
		Движение.Сотрудник = ТекСтрокаАвансЗарПлата.Сотрудник;
		Движение.Тариф = ТекСтрокаАвансЗарПлата.Сумма;
	КонецЦикла;

	Для Каждого ТекСтрокаИсполнительныйЛист Из ИсполнительныйЛист Цикл
		Движение = Движения.мгЗарплатаУдержания.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ПериодРегистрации;
		Движение.Организация = Организация;
		Движение.Терминал = Терминал;
		Движение.ВидУдержания = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.ИсполнительныйЛист");
		Движение.Сотрудник = ТекСтрокаИсполнительныйЛист.Сотрудник;
		Движение.Тариф = ТекСтрокаИсполнительныйЛист.Сумма;
	КонецЦикла;

	Для Каждого ТекСтрокаОтпускныеБольничные Из ОтпускныеБольничные Цикл
		Движение = Движения.мгЗарплатаУдержания.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ПериодРегистрации;
		Движение.Организация = Организация;
		Движение.Терминал = Терминал;
		Движение.ВидУдержания = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.ОтпускныеБольничные");
		Движение.Сотрудник = ТекСтрокаОтпускныеБольничные.Сотрудник;
		Движение.Тариф = ТекСтрокаОтпускныеБольничные.Сумма;
	КонецЦикла;


	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

