
&НаКлиенте
Процедура ТелефонПриИзменении(Элемент)
	Объект.Наименование = Объект.Телефон;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.Родитель.Пустая() Тогда
		//#Если Клиент Тогда
			Сообщить("Не указан регион!");
		//#КонецЕсли	
		Отказ = Истина;
	КонецеСли;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.ЭтоГруппа Тогда
		Элементы.Регион.Видимость = Истина;	
		Если РольДоступна("РегиональныйЛогист") Тогда		
			Элементы.Регион.ТолькоПросмотр = Истина;	
		КонецЕсли;
	Иначе	
		Элементы.Регион.Видимость = Ложь;
	КонецЕсли;
		
КонецПроцедуры
