
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДатаСегодня = ТекущаяДата();
	
	ТерминалОбработки = ПараметрыСеанса.ТерминалДоставки; // Задача № 3045 
	
	Таблица.Параметры.УстановитьЗначениеПараметра("Событие", Перечисления.СобытияЗаписиЗаказа.ЗагрузкаЗаказаИзФронта);
	Таблица.Параметры.УстановитьЗначениеПараметра("НачалоДня", НачалоДня(ДатаСегодня));
	Таблица.Параметры.УстановитьЗначениеПараметра("КонецДня", КонецДня(ДатаСегодня));
	Таблица.Параметры.УстановитьЗначениеПараметра("Выполнена", Справочники.новаРезультатМестнойДоставки.НайтиПоКоду("000000001"));
	Таблица.Параметры.УстановитьЗначениеПараметра("ПричинаНеВыполнения", Справочники.ПричиныНеВыполненияДоставки.НайтиПоКоду("000000003"));
	Таблица.Параметры.УстановитьЗначениеПараметра("ТерминалОбработки", ТерминалОбработки); // Задача № 3045 
	
	
КонецПроцедуры

&НаКлиенте
Процедура СозданиеДанныеЗаказаСамовывоза(ТекущиеДанные)
	Форма = ПолучитьФорму("Документ.ДанныеЗаказаСамовывоза.Форма.ФормаДокумента");
	Форма.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	
	Форма.Объект.Реализация = ТекущиеДанные.Ссылка;
	Форма.ЗаполнитьДокумент(ТерминалОбработки);
	
	Форма.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СозданиеДанныеЗаказаСамовывоза(Элементы.Таблица.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//ДатаСегодня = ТекущаяДата();
	//ЗадатьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьОтбор()
	//ПользовательскийОтбор = Таблица.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Таблица.КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки);
	//ПользовательскийОтбор.Элементы.Очистить();
	//ЭлементОтбора = ПользовательскийОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата");
	//ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	//ЭлементОтбора.Использование = Истина;
	//ЭлементОтбора.ПравоеЗначение = НачалоДня(ДатаСегодня);
	//
	//ЭлементОтбора = ПользовательскийОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата");
	//ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	//ЭлементОтбора.Использование = Истина;
	//ЭлементОтбора.ПравоеЗначение = КонецДня(ДатаСегодня);
	
	Таблица.Параметры.УстановитьЗначениеПараметра("НачалоДня", НачалоДня(ДатаСегодня));
	Таблица.Параметры.УстановитьЗначениеПараметра("КонецДня", КонецДня(ДатаСегодня));
	Таблица.Параметры.УстановитьЗначениеПараметра("ТерминалОбработки", ТерминалОбработки); // Задача № 3045 
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаСегодняПриИзменении(Элемент)
	ЗадатьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновитьТаблицуЗаказыДляСамовывоза" Тогда
		Элементы.Таблица.Обновить();		
	КонецеСли;
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	Элементы.Таблица.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ТерминалОбработкиПриИзменении(Элемент)
	ЗадатьОтбор();
КонецПроцедуры
