#Если Клиент Тогда

// Дерево страниц настройки, создается при создании обработки.
//
Перем ДеревоСтраниц Экспорт; // <ДеревоЗначений[ДеревоСтраницНастроек]>

Перем соИнтерфейсыСтраниц;

// Подключает к форме интерфейс редактирования страницы настройки.
//
// Параметры:
//  Страница  <СтрокаДереваЗначений[СтрокаДереваСтраницНастроек]>
//  Контейнер <ЭлементУправления>: элемент управления, на месте которого будет размещен интерфейс.
//  Форма     <Форма>
//  Панель    <Панель>
//
Процедура ПодключитьИнтерфейс(Страница, Контейнер, Форма, Панель) Экспорт
	Страница.Форма = Форма;
	Страница.Панель = Панель;
	Страница.Контейнер = Контейнер;
	
	Страница.Контейнер.Видимость = Ложь;
	
	Интерфейс = ПолучитьФорму(Страница.Имя, ЭтотОбъект, Новый УникальныйИдентификатор());
	соИнтерфейсыСтраниц.Вставить(Страница.Имя, Интерфейс);
	
	Интерфейс.ПодключитьИнтерфейс(Страница);
	
	Если Страница.ИмеетСтандартныеКнопки Тогда
		Интерфейс.ОтменитьИзменениеНастройки();
	КонецЕсли;
КонецПроцедуры

// Отменяет изменения настроек, сделанные на странице.
//
// Параметры:
//  Страница <СтрокаДереваЗначений[СтрокаДереваСтраницНастроек]>
//
Процедура ОтменитьИзменениеНастройки(Страница) Экспорт
	соИнтерфейсыСтраниц[Страница.Имя].ОтменитьИзменениеНастройки();
КонецПроцедуры

// Записывает в ИБ настройки, сделанные на странице.
//
// Параметры:
//  Страница <СтрокаДереваЗначений[СтрокаДереваСтраницНастроек]>
//  Отказ    <Булево>
//
Процедура ПрименитьНастройку(Страница, Отказ) Экспорт
	соИнтерфейсыСтраниц[Страница.Имя].ПрименитьНастройку(Отказ);
КонецПроцедуры

// Устанавливает настройки по умолчанию для страницы.
//
// Параметры:
//  Страница <СтрокаДереваЗначений[СтрокаДереваСтраницНастроек]>
//
Процедура УстановитьНастройкуПоУмолчанию(Страница) Экспорт
	соИнтерфейсыСтраниц[Страница.Имя].УстановитьНастройкуПоУмолчанию();
КонецПроцедуры

// Открывает окно справки по странице.
//
// Параметры:
//  Страница <СтрокаДереваЗначений[СтрокаДереваСтраницНастроек]>
//
Процедура ПоказатьСправку(Страница) Экспорт
	ОткрытьСправку(Метаданные().Формы[Страница.Имя]);	
КонецПроцедуры

ДеревоСтраниц = Новый ДеревоЗначений;
ДеревоСтраниц.Колонки.Добавить("Представление");
ДеревоСтраниц.Колонки.Добавить("Имя");
ДеревоСтраниц.Колонки.Добавить("ИмеетИнтерфейс", Новый ОписаниеТипов("Булево"));
ДеревоСтраниц.Колонки.Добавить("ИмеетСтандартныеКнопки", Новый ОписаниеТипов("Булево"));
ДеревоСтраниц.Колонки.Добавить("НеОтображатьВНастройке", Новый ОписаниеТипов("Булево"));
ДеревоСтраниц.Колонки.Добавить("ОтображатьВПомощникеНачалаРаботы", Новый ОписаниеТипов("Булево"));
ДеревоСтраниц.Колонки.Добавить("Форма");
ДеревоСтраниц.Колонки.Добавить("Панель");
ДеревоСтраниц.Колонки.Добавить("Контейнер");
ДеревоСтраниц.Колонки.Добавить("ОбъектСправки");

соИнтерфейсыСтраниц = Новый Соответствие;

стрНастройкиМестнойДоставки = ДеревоСтраниц.Строки.Добавить();
стрНастройкиМестнойДоставки.Представление = "Местная доставка";

//стрНастройка = стрНастройкиМестнойДоставки.Строки.Добавить();
//стрНастройка.Представление = "Точки доставки";
//стрНастройка.Имя = "ТочкиДоставки";
//стрНастройка.ИмеетИнтерфейс = Истина;
//стрНастройка.ИмеетСтандартныеКнопки = Истина;
//стрНастройка.ОтображатьВПомощникеНачалаРаботы = Истина;

стрНастройка = стрНастройкиМестнойДоставки.Строки.Добавить();
стрНастройка.Представление = "Планирование";
стрНастройка.Имя = "Планирование";
стрНастройка.ИмеетИнтерфейс = Истина;
стрНастройка.ИмеетСтандартныеКнопки = Истина;
стрНастройка.ОтображатьВПомощникеНачалаРаботы = Истина;

стрНастройка = стрНастройкиМестнойДоставки.Строки.Добавить();
стрНастройка.Представление = "Карта маршрута доставки";
стрНастройка.Имя = "КартаМаршрутаДоставки";
стрНастройка.ИмеетИнтерфейс = Истина;
стрНастройка.ИмеетСтандартныеКнопки = Истина;
стрНастройка.ОтображатьВПомощникеНачалаРаботы = Истина;

стрНастройка = стрНастройкиМестнойДоставки.Строки.Добавить();
стрНастройка.Представление = "Шаблоны печатных форм";
стрНастройка.Имя = "ШаблоныПечатныхФорм";
стрНастройка.ИмеетИнтерфейс = Истина;

стрНастройка = стрНастройкиМестнойДоставки.Строки.Добавить();
стрНастройка.Представление = "Ответственные лица для печати";
стрНастройка.Имя = "УчетнаяПолитика";
стрНастройка.ИмеетИнтерфейс = Истина;

стрРейс = стрНастройкиМестнойДоставки.Строки.Добавить();
стрРейс.Представление = "Рейс";

стрНастройка = стрРейс.Строки.Добавить();
стрНастройка.Представление = "Карта маршрута";
стрНастройка.Имя = "КартаМаршрутаРейса";
стрНастройка.ИмеетИнтерфейс = Истина;
стрНастройка.ИмеетСтандартныеКнопки = Истина;
стрНастройка.ОтображатьВПомощникеНачалаРаботы = Истина;

стрНастройка = стрРейс.Строки.Добавить();
стрНастройка.Представление = "Отображение маршрута";
стрНастройка.Имя = "ОтображениеМаршрутаРейса";
стрНастройка.ИмеетИнтерфейс = Истина;
стрНастройка.ИмеетСтандартныеКнопки = Истина;
стрНастройка.ОтображатьВПомощникеНачалаРаботы = Истина;

стрНастройка = стрРейс.Строки.Добавить();
стрНастройка.Представление = "Стили";
стрНастройка.Имя = "СтилиРейсов";
стрНастройка.ИмеетИнтерфейс = Истина;

Интерфейсы = ДеревоСтраниц.Строки.НайтиСтроки(Новый Структура("ИмеетИнтерфейс", Истина), Истина);
Для Каждого стрНастройка Из Интерфейсы Цикл
	стрНастройка.ОбъектСправки = Метаданные().Формы[стрНастройка.Имя];
КонецЦикла;

#КонецЕсли
