
Функция СформироватьОтправитьПоПочте(Период, Контрагент) Экспорт
	СхемаКомпоновкиДанных = ПолучитьМакет("Макет");
	СтруктураВариантов = Новый Структура;
	пВарианты = СхемаКомпоновкиДанных.ВариантыНастроек;
	Для Каждого пЭл ИЗ пВарианты Цикл
		СтруктураВариантов.Вставить(пЭл.Имя,пЭл.Настройки);
	КонецЦикла;
	КомпоновщикНастроек.ЗагрузитьНастройки(СтруктураВариантов.Основной);
	
	КомпоновщикНастроек.Настройки.параметрыданных.Элементы[2].Значение = Период;
	КомпоновщикНастроек.Настройки.параметрыданных.Элементы[2].использование = Истина;
	
	КомпоновщикНастроек.Настройки.отбор.элементы[0].ПравоеЗначение = Контрагент;
	КомпоновщикНастроек.Настройки.отбор.элементы[0].ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	КомпоновщикНастроек.Настройки.отбор.элементы[0].Использование = Истина;
	
	Настройки = КомпоновщикНастроек.Настройки;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,Настройки);	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,,, Истина);
	
	Результат = Новый ТабличныйДокумент;
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	Возврат Результат;
КонецФункции	


