
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	#Если Не МобильноеПриложениеСервер Тогда
		Элементы.ВыбранныйТипОплаты.Видимость = Ложь;  	
	#КонецЕсли
	
	ЗаполнитьСписокРейсовНаСервере();
	ПоискИУстановкаРейсаНаСегодняНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаОповещенияВыполненОбменСЦУ", ЭтотОбъект);
	//@skip-check bsl-legacy-check-dynamic-feature-access
	УведомленияКлиента.ПодключитьОбработчик("ВыполненОбменСЦУ", ОписаниеОповещения);
	РейсПриИзмененииНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ИзмененСтатус" Тогда
		ОбновитьСпискиНаКлиенте();
	КонецеСли;	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура РейсПриИзменении(Элемент)
	РейсПриИзмененииНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныйТипОплатыПриИзменении(Элемент)
	
	УстановитьОтборВыбранногоТипаОплатыМП(ВыбранныйТипОплаты);
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка= Ложь;
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьСпискиНаКлиенте()
	Элементы.Список.Обновить();
	Элементы.СписокИтоги.Обновить();	
КонецПроцедуры	

&НаКлиенте
Процедура РейсПриИзмененииНаКлиенте()
	Список.Параметры.УстановитьЗначениеПараметра("ВыбранныйРейс", ВыбранныйРейс);
	СписокИтоги.Параметры.УстановитьЗначениеПараметра("ВыбранныйРейс", ВыбранныйРейс);
	
	ОбновитьСпискиНаКлиенте();
	ПолучитьПараметрыРейса();		
КонецПроцедуры	

&НаСервере
Процедура ПолучитьПараметрыРейса()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Рейсы.ДатаРейса КАК ДатаРейса,
	|	Рейсы.НомерПалетты КАК НомерПалетты,
	|	Рейсы.НомерРейса КАК НомерРейса,
	|	Рейсы.РаспечатанМЛ КАК РаспечатанМЛ,
	|	Рейсы.ВыданТерминалAssist КАК ВыданТерминалAssist
	|ИЗ
	|	Справочник.Рейсы КАК Рейсы
	|ГДЕ
	|	Рейсы.Ссылка = &ВыбранныйРейс";
	Запрос.УстановитьПараметр("ВыбранныйРейс", ВыбранныйРейс);
	ВыборкаРейс = Запрос.Выполнить().Выбрать();
	Если ВыборкаРейс.Следующий() Тогда
		ВыбранныйРейсНомерПалетты = ВыборкаРейс.НомерПалетты;
		ВыбранныйРейсДатаРейса = ВыборкаРейс.ДатаРейса;
		ПоВыбранномуРейсуРаспечатанМЛ = ВыборкаРейс.РаспечатанМЛ;
		ПоВыбранномуРейсуВыданТерминалAssist = ВыборкаРейс.ВыданТерминалAssist;
		ВыбранныйРейсНомерРейса = ВыборкаРейс.НомерРейса;
	КонецеСли;	
КонецПроцедуры	

&НаКлиенте
Процедура УстановитьОтборВыбранногоТипаОплатыМП(Значение)
	Для Каждого ЭлементОтбора Из СписокИтоги.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			Если ЗначениеЗаполнено(Значение) Тогда	
				ЭлементОтбора.Использование = Истина;
				ЭлементОтбора.ПравоеЗначение = ВыбранныйТипОплаты;
			Иначе
				ЭлементОтбора.Использование = Ложь;
			КонецеСли;											
		КонецЕСли;	
	КонецЦикла;				
	Элементы.Итоги.Обновить();		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокРейсовНаСервере()
	Зап = Новый Запрос();
	Зап.Текст = "ВЫБРАТЬ
	|	Рейсы.Ссылка КАК Рейс
	|ИЗ
	|	Справочник.Рейсы КАК Рейсы
	|ГДЕ
	|	Рейсы.ДатаРейса >= &ДатаРейса
	|	И Рейсы.Транспорт = &Транспорт
	|	И Рейсы.ПометкаУдаления = ЛОЖЬ";
	Зап.УстановитьПараметр("ДатаРейса", ТекущаяДатаСеанса() - 86400*5);
	Зап.УстановитьПараметр("Транспорт", ПараметрыСеанса.ТранспортМП);
	
	Выб = Зап.Выполнить().Выбрать();
	Пока Выб.Следующий() Цикл
		Элементы.ВыбранныйРейс.СписокВыбора.Добавить(Выб.Рейс);
	КонецЦикла;	
КонецПроцедуры	

// Поиск и установка рейса на сегодня на сервере.
// 
// Возвращаемое значение:
//  Булево - Рейс был найден
&НаСервере
Функция ПоискИУстановкаРейсаНаСегодняНаСервере();
	Если Не ВыбранныйРейс.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	СтруктураРейса = МаршрутизацияСервер.НайтиРабочийРейсПоТранспортуМП();
	
	Если ЗначениеЗаполнено(СтруктураРейса.Рейс) Тогда
		ВыбранныйРейс = СтруктураРейса.Рейс;
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура ОбработкаОповещенияВыполненОбменСЦУ(Результат, ДополнительныеПараметры) Экспорт
//	Если ПоискИУстановкаРейсаНаСегодняНаСервере() Тогда
//		РейсПриИзмененииНаКлиенте();				
//	КонецЕсли;
	ПоискИУстановкаРейсаНаСегодняНаСервере();
	РейсПриИзмененииНаКлиенте();
КонецПроцедуры
#КонецОбласти

