Перем СвязанныйЖурнал Экспорт;
Перем флОткрытИзПланирования Экспорт;

Процедура СформироватьОтчет(ТабличныйДокумент , ДанныеРасшифровки) Экспорт
	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаДоставки"));;
	Параметр.Значение = НачалоДня(ДатаДоставки);
	Параметр.Использование = Истина;

	ПолеРейс = Новый ПолеКомпоновкиДанных("Рейс");
	Для Каждого Элемент Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если Элемент.ЛевоеЗначение = ПолеРейс Тогда
			ЭлементОтбора = Элемент;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если ЭлементОтбора = Неопределено Тогда
		ЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	КонецЕсли;
	ЭлементОтбора.Использование = ОтборРейсов.Количество() > 0;
	Если ЭлементОтбора.Использование Тогда
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ЛевоеЗначение = ПолеРейс;
		ЭлементОтбора.ПравоеЗначение = ОтборРейсов;
	КонецЕсли;

	// Установим параметр компоновки данных
	Настройки = КомпоновщикНастроек.Настройки;
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	// Инициализируем процессор СКД
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,, ДанныеРасшифровки);
	ТабличныйДокумент.Очистить();
	// Инициализируем процессор вывода
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ТабличныйДокумент);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
КонецПроцедуры

Процедура ПеренестиПараметрыСвязанногоЖурнала() Экспорт
	Если флОткрытИзПланирования Тогда
		Строки = СвязанныйЖурнал.Дерево.Значение.Строки.НайтиСтроки(Новый Структура("Источник, РейсВыбран", ЭтотОбъект, Истина), Истина);
		Если Строки.Количество() = 0 Тогда
			ОтборРейсов.Очистить();
		Иначе
			Список = Новый СписокЗначений;
			Для Каждого Строка Из Строки Цикл
				Если ЗначениеЗаполнено(Строка.ЗадачаРейса) Тогда
					Список.Добавить(Строка.Рейс);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		ДатаДоставки = СвязанныйЖурнал.ФормаЖурнала.ДатаПланирования;
		ОтборРейсов = Список;
	КонецЕсли;
КонецПроцедуры

