
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Дерево = ДанныеФормыВЗначение(Параметры.ДеревоРейсовПоГруппам, Тип("ДеревоЗначений"));
	ЗначениеВРеквизитФормы(Дерево, "ДеревоРейсовПоГруппам");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Для каждого СтрокаДерева Из ДеревоРейсовПоГруппам.ПолучитьЭлементы() Цикл
		ИД = СтрокаДерева.ПолучитьИдентификатор();		
		Элементы.ДеревоРейсовПоГруппам.Развернуть(ИД);
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРейсовПоГруппамОтметкаПриИзменении(Элемент)

	Попытка
		ТекСтрока = Элементы.ДеревоРейсовПоГруппам.ТекущиеДанные;	
	Исключение	
		Возврат;
	КонецПопытки; 
	
	КоллекцияПодчиненных = ТекСтрока.ПолучитьЭлементы();
	
	Если КоллекцияПодчиненных.Количество() > 0 Тогда
		
		Для каждого ТекСтрокаДерева Из КоллекцияПодчиненных Цикл
			ТекСтрокаДерева.Отметка = ТекСтрока.Отметка;
		КонецЦикла; 
		
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСнятьПометку(ЗначениеОтметки)

	Для каждого СтрокаДереваГруппа Из ДеревоРейсовПоГруппам.ПолучитьЭлементы() Цикл
		
		СтрокаДереваГруппа.Отметка = ЗначениеОтметки;
		
		Для каждого СтрокаДереваРейс Из СтрокаДереваГруппа.ПолучитьЭлементы() Цикл
			СтрокаДереваРейс.Отметка = ЗначениеОтметки;	
		КонецЦикла;		
	
	КонецЦикла; 	

КонецПроцедуры // ()
 
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ЗакрыватьПриВыборе = Ложь;
	ОповеститьОВыборе(ДеревоРейсовПоГруппам);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометку(Команда)
	
	УстановитьСнятьПометку(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометку(Команда)

	УстановитьСнятьПометку(Ложь);
	
КонецПроцедуры
