
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//ТолькоПросмотр = Истина;
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	//Перенесено в модуль объекта 04.04.2022 ++
	//группаФизЛиц = РаботаСФизЛицамиСервер.ПолучитьГруппуФизическогоЛица(Объект.Фамилия);
	//Если Не группаФизЛиц = Неопределено Тогда
	//	Объект.ГруппаФизЛиц = группаФизЛиц;
	//Иначе
	//	ПоказатьОповещениеПользователя("Внимание!!! Запись карточки невозможна. Не найдена группа физического лица!");
	//	Отказ = Истина;
	//КонецЕсли;
	//Перенесено в модуль объекта 04.04.2022 --
	
КонецПроцедуры

