
&НаКлиенте

&НаКлиенте
Процедура ТипЗаказаПриИзменении(Элемент)
	Если Объект.Регион = Справочники.РегиональныеТерминалы.МоскваСтриж Тогда	//Москва
		Если Объект.ТипЗаказа = Перечисления.ТипыЗаказов.Доставка Тогда
			Объект.Карта = Справочники.КартыКонструктораКарт.ЗПДоставкиМСК;
		ИначеЕсли Объект.ТипЗаказа = Перечисления.ТипыЗаказов.Забор Тогда
			Объект.Карта = Справочники.КартыКонструктораКарт.ЗПЗаборыМСК;
		Иначе
			Объект.Карта = Справочники.КартыКонструктораКарт.ПустаяСсылка();
		КонецЕсли;
	ИначеЕсли Объект.Регион = Справочники.РегиональныеТерминалы.СПбСтриж Тогда	//Санкт-Петербург
		Если Объект.ТипЗаказа = Перечисления.ТипыЗаказов.Доставка Тогда
			Объект.Карта = Справочники.КартыКонструктораКарт.ЗПДоставкиСПб;
		ИначеЕсли Объект.ТипЗаказа = Перечисления.ТипыЗаказов.Забор Тогда
			Объект.Карта = Справочники.КартыКонструктораКарт.ЗПЗаборыСПб;
		Иначе
			Объект.Карта = Справочники.КартыКонструктораКарт.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;	
	//Элементы.КартаНаименованиеНадпись.Заголовок = Объект.Карта;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	НетОшибкиСозданияСхемы = Истина;
	Если НЕ ЗначениеЗаполнено(Объект.ДатаСоздания) Тогда
		НетОшибкиСозданияСхемы = зпРаботаСРасчетомЗарплатыСервер.СоздатьСхемуЗонРасчетаЗП(Объект.Ссылка);
		Если Не НетОшибкиСозданияСхемы Тогда 
			Сообщить("Ошибка создания схемы зоны расчета зп!"); 
		КонецЕсли;
	КонецЕсли;
	
	ОповеститьОВыборе(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотретьКарту(Команда)
	
	Если ЗначениеЗаполнено(Объект.Карта) Тогда
		СтрокаПросмотраКарты = "https://yandex.ru/maps/?um=constructor%" + Объект.Карта.ИдентификаторКарты + "&source=constructorLink";
		ЗапуститьПриложение(СтрокаПросмотраКарты);
	КонецЕсли;	

КонецПроцедуры
