
Процедура ПечатьАПП(ТабДок) Экспорт

	
	Макет = ПолучитьМакет("АПП");

	ОблШапка = Макет.ПолучитьОбласть("Шапка");
	ОблСтрокаЗаказа = Макет.ПолучитьОбласть("СтрокаЗаказа");
	//+++ БАО 10.10.2017 №1920
	//---ОблСтрокаТовара = Макет.ПолучитьОбласть("СтрокаТовара");
	ОблСтрокаТовара = Макет.ПолучитьОбласть("СтрокаТовараИдИШк");
	//--- БАО 10.10.2017 №1920 
	
	ОблЗаголовокОтказы = Макет.ПолучитьОбласть("ЗаголовокОтказы");	
	ОблЗаголовокПереносы = Макет.ПолучитьОбласть("ЗаголовокПереносы");
	ОблЗаголовокЧастичный = Макет.ПолучитьОбласть("ЗаголовокЧастичный");
	ОблЗаголовокВРучномРежиме = Макет.ПолучитьОбласть("ПринятыеВРучномРежиме");
	ОблПодвал = Макет.ПолучитьОбласть("Подвал");
	ПустоеМесто = Макет.ПолучитьОбласть("ПустоеМесто");
	
	
	// ------------ ОТКАЗЫ	
	ЗапросОтказы = Новый Запрос("ВЫБРАТЬ
	                            |	ВозвратЗаказовОтВодителяДоставки.Доставка КАК Доставка,
	                            |	СУММА(ВозвратЗаказовОтВодителяДоставки.КоличествоМестПринято) КАК КоличествоМестПринято,
	                            |	ВозвратЗаказовОтВодителяДоставки.АктПоступил КАК АктПоступил
	                            |ПОМЕСТИТЬ ВТ_Возвраты
	                            |ИЗ
	                            |	Документ.ВозвратЗаказовОтВодителя.Доставки КАК ВозвратЗаказовОтВодителяДоставки
	                            |ГДЕ
	                            |	ВозвратЗаказовОтВодителяДоставки.Ссылка.Рейс = &Рейс
								|	И ВозвратЗаказовОтВодителяДоставки.Ссылка.РежимПодтвержденияУдаленногоЗакрытия = &РежимПодтвержденияУдаленногоЗакрытия
	                            |	И ВозвратЗаказовОтВодителяДоставки.ПринятНаСкладеПолностью = ИСТИНА
	                            |	И ВозвратЗаказовОтВодителяДоставки.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.НеВыполнена)
	                            |	И ВозвратЗаказовОтВодителяДоставки.ПричинаНеВыполненияДоставки <> ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ПереносДоставки)
	                            |	И ВозвратЗаказовОтВодителяДоставки.ПричинаНеВыполненияДоставки <> ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ПереносСЗаездом)
	                            |
	                            |СГРУППИРОВАТЬ ПО
	                            |	ВозвратЗаказовОтВодителяДоставки.Доставка,
	                            |	ВозвратЗаказовОтВодителяДоставки.АктПоступил
	                            |;
	                            |
	                            |////////////////////////////////////////////////////////////////////////////////
	                            |ВЫБРАТЬ
	                            |	ВозвратЗаказовОтВодителяТовары.Доставка КАК Заказ,
	                            |	ВозвратЗаказовОтВодителяТовары.Номенклатура КАК Номенклатура,
	                            |	ВозвратЗаказовОтВодителяТовары.Количество КАК Количество,
	                            |	ВозвратЗаказовОтВодителяТовары.Цена КАК Цена,
	                            |	ВозвратЗаказовОтВодителяТовары.Сумма КАК Сумма,
	                            |	ВозвратЗаказовОтВодителяТовары.КоличествоИсходное КАК КоличествоИсходное,
	                            |	ВозвратЗаказовОтВодителяТовары.Доставка.Номер КАК Номер,
	                            |	ВозвратЗаказовОтВодителяТовары.Доставка.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
	                            |	ВТ_Возвраты.КоличествоМестПринято КАК КоличествоМестПринято,
	                            |	ВТ_Возвраты.АктПоступил КАК АктПоступил,
//+++ БАО 10.10.2017 №1920								
	                            |	ВозвратЗаказовОтВодителяТовары.Номенклатура.Артикул КАК ID_товара,
								|	ВозвратЗаказовОтВодителяТовары.Номенклатура.Код КАК Код_товара,
	                            |	ВозвратЗаказовОтВодителяТовары.ШтрихкодНоменклатуры.Код КАК ШК
//--- БАО 10.10.2017 №1920								
	                            |ИЗ
	                            |	ВТ_Возвраты КАК ВТ_Возвраты
	                            |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратЗаказовОтВодителя.Товары КАК ВозвратЗаказовОтВодителяТовары
	                            |		ПО ВТ_Возвраты.Доставка = ВозвратЗаказовОтВодителяТовары.Доставка
	                            |ГДЕ
	                            |	ВозвратЗаказовОтВодителяТовары.Ссылка.Рейс = &Рейс
	                            |	И ВозвратЗаказовОтВодителяТовары.Ссылка.РежимПодтвержденияУдаленногоЗакрытия = &РежимПодтвержденияУдаленногоЗакрытия
	                            |
	                            |СГРУППИРОВАТЬ ПО
	                            |	ВозвратЗаказовОтВодителяТовары.Номенклатура,
	                            |	ВозвратЗаказовОтВодителяТовары.Доставка,
	                            |	ВТ_Возвраты.АктПоступил,
	                            |	ВозвратЗаказовОтВодителяТовары.Количество,
	                            |	ВозвратЗаказовОтВодителяТовары.Цена,
	                            |	ВозвратЗаказовОтВодителяТовары.Сумма,
	                            |	ВозвратЗаказовОтВодителяТовары.КоличествоИсходное,
	                            |	ВозвратЗаказовОтВодителяТовары.Доставка.Номер,
	                            |	ВозвратЗаказовОтВодителяТовары.Доставка.НомерВнешнегоЗаказа,
	                            |	ВТ_Возвраты.КоличествоМестПринято,
//+++ БАО 10.10.2017 №1920								
	                            |	ВозвратЗаказовОтВодителяТовары.ШтрихкодНоменклатуры.Код,
								|	ВозвратЗаказовОтВодителяТовары.Номенклатура.Код ,
	                            |	ВозвратЗаказовОтВодителяТовары.Номенклатура.Артикул
//--- БАО 10.10.2017 №1920								
	                            |ИТОГИ ПО
	                            |	Заказ");
	ЗапросОтказы.УстановитьПараметр("Рейс", Рейс);	
	//Асеев 24.09.2020 (Задача № 4271)>>>
	ЗапросОтказы.УстановитьПараметр("РежимПодтвержденияУдаленногоЗакрытия", РежимПодтвержденияУдаленногоЗакрытия);
	//Асеев 24.09.2020 (Задача № 4271)<<<
	РезОтказы = ЗапросОтказы.Выполнить().Выгрузить();	
		
	
	// ------------ ПЕРЕНОСЫ	
	ЗапросПереносы = Новый Запрос("ВЫБРАТЬ
	                              |	ВозвратЗаказовОтВодителяДоставки.Доставка,
	                              |	СУММА(ВозвратЗаказовОтВодителяДоставки.КоличествоМестПринято) КАК КоличествоМестПринято,
	                              |	ВозвратЗаказовОтВодителяДоставки.АктПоступил
	                              |ПОМЕСТИТЬ ВТ_Переносы
	                              |ИЗ
	                              |	Документ.ВозвратЗаказовОтВодителя.Доставки КАК ВозвратЗаказовОтВодителяДоставки
	                              |ГДЕ
	                              |	ВозвратЗаказовОтВодителяДоставки.Ссылка.Рейс = &Рейс
	                              |	И ВозвратЗаказовОтВодителяДоставки.Ссылка.РежимПодтвержденияУдаленногоЗакрытия = &РежимПодтвержденияУдаленногоЗакрытия
	                              |	И ВозвратЗаказовОтВодителяДоставки.ПринятНаСкладеПолностью = ИСТИНА
	                              |	И (ВозвратЗаказовОтВодителяДоставки.ПричинаНеВыполненияДоставки = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ПереносДоставки)
	                              |			ИЛИ ВозвратЗаказовОтВодителяДоставки.ПричинаНеВыполненияДоставки = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ПереносСЗаездом))
	                              |
	                              |СГРУППИРОВАТЬ ПО
	                              |	ВозвратЗаказовОтВодителяДоставки.Доставка,
	                              |	ВозвратЗаказовОтВодителяДоставки.АктПоступил
	                              |;
	                              |
	                              |////////////////////////////////////////////////////////////////////////////////
	                              |ВЫБРАТЬ
	                              |	ВозвратЗаказовОтВодителяТовары.Доставка КАК Заказ,
	                              |	ВозвратЗаказовОтВодителяТовары.Номенклатура,
	                              |	ВозвратЗаказовОтВодителяТовары.Количество,
	                              |	ВозвратЗаказовОтВодителяТовары.Цена,
	                              |	ВозвратЗаказовОтВодителяТовары.Сумма,
	                              |	ВозвратЗаказовОтВодителяТовары.КоличествоИсходное,
	                              |	ВозвратЗаказовОтВодителяТовары.Доставка.Номер КАК Номер,
	                              |	ВозвратЗаказовОтВодителяТовары.Доставка.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
	                              |	ВТ_Возвраты.КоличествоМестПринято,
//+++ БАО 10.10.2017 №1920								
	                            |	ВозвратЗаказовОтВодителяТовары.Номенклатура.Артикул КАК ID_товара,
								|	ВозвратЗаказовОтВодителяТовары.Номенклатура.Код КАК Код_товара,
	                            |	ВозвратЗаказовОтВодителяТовары.ШтрихкодНоменклатуры.Код КАК ШК,
//--- БАО 10.10.2017 №1920	

	                              |	ВТ_Возвраты.АктПоступил
	                              |ИЗ
	                              |	ВТ_Переносы КАК ВТ_Возвраты
	                              |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратЗаказовОтВодителя.Товары КАК ВозвратЗаказовОтВодителяТовары
	                              |		ПО ВТ_Возвраты.Доставка = ВозвратЗаказовОтВодителяТовары.Доставка
	                              |ГДЕ
	                              |	ВозвратЗаказовОтВодителяТовары.Ссылка.Рейс = &Рейс
	                              |	И ВозвратЗаказовОтВодителяТовары.Ссылка.РежимПодтвержденияУдаленногоЗакрытия = &РежимПодтвержденияУдаленногоЗакрытия
	                              |
	                              |СГРУППИРОВАТЬ ПО
	                              |	ВозвратЗаказовОтВодителяТовары.Номенклатура,
	                              |	ВозвратЗаказовОтВодителяТовары.Доставка,
	                              |	ВТ_Возвраты.АктПоступил,
	                              |	ВозвратЗаказовОтВодителяТовары.Количество,
	                              |	ВозвратЗаказовОтВодителяТовары.Цена,
	                              |	ВозвратЗаказовОтВодителяТовары.Сумма,
	                              |	ВозвратЗаказовОтВодителяТовары.КоличествоИсходное,
	                              |	ВозвратЗаказовОтВодителяТовары.Доставка.Номер,
	                              |	ВозвратЗаказовОтВодителяТовары.Доставка.НомерВнешнегоЗаказа,
//+++ БАО 10.10.2017 №1920								
	                            |	ВозвратЗаказовОтВодителяТовары.Номенклатура.Артикул,
								|	ВозвратЗаказовОтВодителяТовары.Номенклатура.Код,
	                            |	ВозвратЗаказовОтВодителяТовары.ШтрихкодНоменклатуры.Код,
//--- БАО 10.10.2017 №1920		                              	                              
								  |	ВТ_Возвраты.КоличествоМестПринято
								  |ИТОГИ ПО
	                              |	Заказ");
	ЗапросПереносы.УстановитьПараметр("Рейс", Рейс);	
	//Асеев 24.09.2020 (Задача № 4271)>>>
	ЗапросПереносы.УстановитьПараметр("РежимПодтвержденияУдаленногоЗакрытия", РежимПодтвержденияУдаленногоЗакрытия);
	//Асеев 24.09.2020 (Задача № 4271)<<<
	РезПереносы = ЗапросПереносы.Выполнить().Выгрузить();	
	
	
	
	// ----------- ЧАСТИЧНЫЙ ОТКАЗ, ВОЗВРАТ, ОБМЕН	    // !!!!!!!!!  НЕ ОТКРЫВАЙ КОНСТРУКТОР, НЕ СОВЕРШАЙ ОШИБКУ  !!!!!!!!!
														// !!!!!!!!!  НЕ ОТКРЫВАЙ КОНСТРУКТОР, НЕ СОВЕРШАЙ ОШИБКУ  !!!!!!!!!
														// !!!!!!!!!  НЕ ОТКРЫВАЙ КОНСТРУКТОР, НЕ СОВЕРШАЙ ОШИБКУ  !!!!!!!!!
														// !!!!!!!!!  НЕ ОТКРЫВАЙ КОНСТРУКТОР, НЕ СОВЕРШАЙ ОШИБКУ  !!!!!!!!!
	ЗапросЧастички = Новый Запрос("ВЫБРАТЬ     
	                              |	ВозвратЗаказовОтВодителяДоставки.Доставка,
	                              |	СУММА(ВозвратЗаказовОтВодителяДоставки.КоличествоМестПринято) КАК КоличествоМестПринято,
	                              |	ВозвратЗаказовОтВодителяДоставки.АктПоступил
	                              |ПОМЕСТИТЬ ВТ_Переносы             
	                              |ИЗ
	                              |	Документ.ВозвратЗаказовОтВодителя.Доставки КАК ВозвратЗаказовОтВодителяДоставки
	                              |ГДЕ
	                              |	ВозвратЗаказовОтВодителяДоставки.Ссылка.Рейс = &Рейс
	                              |	И ВозвратЗаказовОтВодителяДоставки.Ссылка.РежимПодтвержденияУдаленногоЗакрытия = &РежимПодтвержденияУдаленногоЗакрытия
	                              |	И ((ВозвратЗаказовОтВодителяДоставки.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.ВыполненаЧастично)
	                              |		И (ВозвратЗаказовОтВодителяДоставки.ПринятНаСкладеЧастично = ИСТИНА ИЛИ ВозвратЗаказовОтВодителяДоставки.ПринятНаСкладеПолностью = ИСТИНА))
								  |         ИЛИ (ВозвратЗаказовОтВодителяДоставки.ПринятНаСкладеЧастично = ИСТИНА И ВозвратЗаказовОтВодителяДоставки.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.НеВыполнена))
	                              |			ИЛИ (ВозвратЗаказовОтВодителяДоставки.ПринятНаСкладеПолностью = ИСТИНА
	                              |				И ((ВозвратЗаказовОтВодителяДоставки.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.ВыполненаЧастично)
	                              |					ИЛИ ВозвратЗаказовОтВодителяДоставки.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.Выполнена))
	                              |					И (НЕ ВозвратЗаказовОтВодителяДоставки.ВозвратТоваров ЕСТЬ NULL 
	                              |						И ВозвратЗаказовОтВодителяДоставки.ВозвратТоваров <> ЗНАЧЕНИЕ(Документ.ВозвратТоваровОтПокупателя.ПустаяСсылка)))))
	                              |
	                              |СГРУППИРОВАТЬ ПО
	                              |	ВозвратЗаказовОтВодителяДоставки.Доставка,
	                              |	ВозвратЗаказовОтВодителяДоставки.АктПоступил
	                              |;
	                              |
	                              |////////////////////////////////////////////////////////////////////////////////
	                              |ВЫБРАТЬ
	                              |	ВозвратЗаказовОтВодителяТовары.Доставка КАК Заказ,
	                              |	ВозвратЗаказовОтВодителяТовары.Номенклатура,
	                              |	ВозвратЗаказовОтВодителяТовары.Количество,
	                              |	ВозвратЗаказовОтВодителяТовары.Цена,
	                              |	ВозвратЗаказовОтВодителяТовары.Сумма,
	                              |	ВозвратЗаказовОтВодителяТовары.КоличествоИсходное,
	                              |	ВозвратЗаказовОтВодителяТовары.Доставка.Номер КАК Номер,
	                              |	ВозвратЗаказовОтВодителяТовары.Доставка.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
	                              |	ВТ_Возвраты.КоличествоМестПринято,
//+++ БАО 10.10.2017 №1920								
	                            |	ВозвратЗаказовОтВодителяТовары.Номенклатура.Артикул КАК ID_товара,
								|	ВозвратЗаказовОтВодителяТовары.Номенклатура.Код КАК Код_товара,
	                            |	ВозвратЗаказовОтВодителяТовары.ШтрихкодНоменклатуры.Код КАК ШК,
//--- БАО 10.10.2017 №1920	
	                              |	ВТ_Возвраты.АктПоступил
	                              |ИЗ
	                              |	ВТ_Переносы КАК ВТ_Возвраты
	                              |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратЗаказовОтВодителя.Товары КАК ВозвратЗаказовОтВодителяТовары
	                              |		ПО ВТ_Возвраты.Доставка = ВозвратЗаказовОтВодителяТовары.Доставка
	                              |ГДЕ
	                              |	ВозвратЗаказовОтВодителяТовары.Ссылка.Рейс = &Рейс
	                              |	И ВозвратЗаказовОтВодителяТовары.Ссылка.РежимПодтвержденияУдаленногоЗакрытия = &РежимПодтвержденияУдаленногоЗакрытия
	                              |
	                              |СГРУППИРОВАТЬ ПО
	                              |	ВозвратЗаказовОтВодителяТовары.Номенклатура,
	                              |	ВозвратЗаказовОтВодителяТовары.Доставка,
	                              |	ВТ_Возвраты.АктПоступил,
	                              |	ВозвратЗаказовОтВодителяТовары.Количество,
	                              |	ВозвратЗаказовОтВодителяТовары.Цена,
	                              |	ВозвратЗаказовОтВодителяТовары.Сумма,
	                              |	ВозвратЗаказовОтВодителяТовары.КоличествоИсходное,
	                              |	ВозвратЗаказовОтВодителяТовары.Доставка.Номер,
	                              |	ВозвратЗаказовОтВодителяТовары.Доставка.НомерВнешнегоЗаказа,
//+++ БАО 10.10.2017 №1920								
	                            |	ВозвратЗаказовОтВодителяТовары.Номенклатура.Артикул,
								|	ВозвратЗаказовОтВодителяТовары.Номенклатура.Код  ,
	                            |	ВозвратЗаказовОтВодителяТовары.ШтрихкодНоменклатуры.Код,
//--- БАО 10.10.2017 №1920	
	                              |	ВТ_Возвраты.КоличествоМестПринято
	                              |ИТОГИ ПО
	                              |	Заказ");
	ЗапросЧастички.УстановитьПараметр("Рейс", Рейс);	
	//Асеев 24.09.2020 (Задача № 4271)>>>
	ЗапросЧастички.УстановитьПараметр("РежимПодтвержденияУдаленногоЗакрытия", РежимПодтвержденияУдаленногоЗакрытия);
	//Асеев 24.09.2020 (Задача № 4271)<<<
	РезЧастично = ЗапросЧастички.Выполнить().Выгрузить();
	
	
	
	// ------------ ПРИНЯТЫЕ В РУЧНОМ РЕЖИМЕ	
	ЗапросРучники = Новый Запрос("ВЫБРАТЬ
	                             |	ВозвратЗаказовОтВодителяДоставки.Доставка КАК Доставка,
	                             |	СУММА(ВозвратЗаказовОтВодителяДоставки.КоличествоМестПринято) КАК КоличествоМестПринято,
	                             |	ВозвратЗаказовОтВодителяДоставки.АктПоступил КАК АктПоступил,
	                             |	ВозвратЗаказовОтВодителяДоставки.Доставка.Номер КАК Номер,
	                             |	ВозвратЗаказовОтВодителяДоставки.Доставка.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа
	                             |ИЗ
	                             |	Документ.ВозвратЗаказовОтВодителя.Доставки КАК ВозвратЗаказовОтВодителяДоставки
	                             |ГДЕ
	                             |	ВозвратЗаказовОтВодителяДоставки.Ссылка.Рейс = &Рейс
	                             |	И ВозвратЗаказовОтВодителяДоставки.Ссылка.РежимПодтвержденияУдаленногоЗакрытия = &РежимПодтвержденияУдаленногоЗакрытия
	                             |	И (ВозвратЗаказовОтВодителяДоставки.ПринятНаСкладеПолностью = ИСТИНА
	                             |			ИЛИ ВозвратЗаказовОтВодителяДоставки.ПринятНаСкладеЧастично = ИСТИНА)
	                             |	И ВозвратЗаказовОтВодителяДоставки.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.ПустаяСсылка)
	                             |	И ВозвратЗаказовОтВодителяДоставки.ПричинаНеВыполненияДоставки = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ПустаяСсылка)
	                             |	И ВозвратЗаказовОтВодителяДоставки.Ссылка.ПометкаУдаления = ЛОЖЬ
	                             |
	                             |СГРУППИРОВАТЬ ПО
	                             |	ВозвратЗаказовОтВодителяДоставки.Доставка,
	                             |	ВозвратЗаказовОтВодителяДоставки.АктПоступил,
	                             |	ВозвратЗаказовОтВодителяДоставки.Доставка.Номер,
	                             |	ВозвратЗаказовОтВодителяДоставки.Доставка.НомерВнешнегоЗаказа");
	ЗапросРучники.УстановитьПараметр("Рейс", Рейс);	
	//Асеев 24.09.2020 (Задача № 4271)>>>
	ЗапросРучники.УстановитьПараметр("РежимПодтвержденияУдаленногоЗакрытия", РежимПодтвержденияУдаленногоЗакрытия);
	//Асеев 24.09.2020 (Задача № 4271)<<<
	РезРучники = ЗапросРучники.Выполнить().Выгрузить();
	
	
	
	
	
	
	// вывод данных
	ЗапросСклад = Новый Запрос("ВЫБРАТЬ
	                           |	ВозвратЗаказовОтВодителя.Номер,
	                           |	ВозвратЗаказовОтВодителя.Склад
	                           |ИЗ
	                           |	Документ.ВозвратЗаказовОтВодителя КАК ВозвратЗаказовОтВодителя
	                           |ГДЕ
	                           |	ВозвратЗаказовОтВодителя.Рейс = &Рейс
	                           |	И ВозвратЗаказовОтВодителя.РежимПодтвержденияУдаленногоЗакрытия = &РежимПодтвержденияУдаленногоЗакрытия
	                           |	И ВозвратЗаказовОтВодителя.Проведен
	                           |
	                           |СГРУППИРОВАТЬ ПО
	                           |	ВозвратЗаказовОтВодителя.Номер,
	                           |	ВозвратЗаказовОтВодителя.Склад");
	ЗапросСклад.УстановитьПараметр("Рейс", Рейс);	
	//Асеев 24.09.2020 (Задача № 4271)>>>
	ЗапросСклад.УстановитьПараметр("РежимПодтвержденияУдаленногоЗакрытия", РежимПодтвержденияУдаленногоЗакрытия);
	//Асеев 24.09.2020 (Задача № 4271)<<<
	РезСклад = ЗапросСклад.Выполнить().Выбрать();
	ТекстСклад = "";
	Пока РезСклад.Следующий() Цикл
		ТекстСклад = ТекстСклад + РезСклад.Номер + "(" + РезСклад.Склад + ")" + Символы.ПС;		
	КонецЦикла;
	
	КолПереносы = 0;
	Для каждого Стр Из РезПереносы Цикл
		Если НЕ ЗначениеЗаполнено(Стр.Номенклатура) Тогда	
			КолПереносы = КолПереносы + 1;		
		КонецЕсли;			
	КонецЦикла;
	
	КолОтказы = 0;
	Для каждого Стр Из РезОтказы Цикл
		Если НЕ ЗначениеЗаполнено(Стр.Номенклатура) Тогда	
			КолОтказы = КолОтказы + 1;		
		КонецЕсли;			
	КонецЦикла;
	
	
	ОблШапка.Параметры.ДатаАПП = Дата;
	ОблШапка.Параметры.КолПереносы = КолПереносы;
	ОблШапка.Параметры.КолОтказы = КолОтказы;
	ОблШапка.Параметры.ГосНомер = Транспорт.НомерГосударственнойРегистрации;
	ОблШапка.Параметры.Водитель = Водитель;
	ОблШапка.Параметры.Экспедитор = Экспедитор;	
	
	
	ОблШапка.Параметры.Склад = ТекстСклад;		
	
	ТабДок.Вывести(ОблШапка);
	
	
	
	
	// ------------ ОТКАЗЫ	
	Если РезОтказы.Количество() Тогда
		ТабДок.Вывести(ОблЗаголовокОтказы);		
		НПП_Заказ = 1;	
		ТекЗаказ = Неопределено;
		
		Для каждого Стр Из РезОтказы Цикл	
			
			Если Стр.Номенклатура = NULL Тогда	// группировочное поле по заказу	
				
				Если ТекЗаказ <> Неопределено Тогда
					НПП_Заказ = НПП_Заказ + 1;
				КонецЕсли;
				
				ОблСтрокаЗаказа.Параметры.НПП = НПП_Заказ;
			    ОблСтрокаЗаказа.Параметры.НомераЗаказа = "" + СокрЛП(Стр.Номер) + " / " + СокрЛП(Стр.НомерВнешнегоЗаказа);
				ОблСтрокаЗаказа.Параметры.КоличествоМестПоЗаказу = Стр.КоличествоМестПринято;
				ТабДок.Вывести(ОблСтрокаЗаказа);							
				
				НПП_Товар = 1;
				ТекЗаказ = Стр.Заказ;
				Продолжить;
			КонецЕсли;
					
			ОблСтрокаТовара.Параметры.НПП = "" + НПП_Заказ + "." + НПП_Товар;
			ОблСтрокаТовара.Параметры.Товар = Стр.Номенклатура;
			ОблСтрокаТовара.Параметры.Количество = Стр.Количество;
			ОблСтрокаТовара.Параметры.НаличиеАкта = Стр.АктПоступил;
			
			//+++ БАО 10.10.2017 №1920
			ОблСтрокаТовара.Параметры.ID_товара = СокрЛП(Стр.Код_товара) + "/" + Стр.ID_товара;
			ОблСтрокаТовара.Параметры.ШК = Стр.ШК;
			//--- БАО 10.10.2017 №1920
			
			ТабДок.Вывести(ОблСтрокаТовара);
			НПП_Товар = НПП_Товар + 1;		
			
		КонецЦикла;		
				
	КонецЕсли;
	
	ТабДок.Вывести(ПустоеМесто);
	
	
	// ------------ ПЕРЕНОСЫ 
	Если РезПереносы.Количество() Тогда	
		ТабДок.Вывести(ОблЗаголовокПереносы);		
		НПП_Заказ = 1;	
		ТекЗаказ = Неопределено;
		
		Для каждого Стр Из РезПереносы Цикл		
			
			Если Стр.Номенклатура = NULL Тогда	// группировочное поле по заказу		
				
				Если ТекЗаказ <> Неопределено Тогда
					НПП_Заказ = НПП_Заказ + 1;
				КонецЕсли;
				
				ОблСтрокаЗаказа.Параметры.НПП = НПП_Заказ;
			    ОблСтрокаЗаказа.Параметры.НомераЗаказа = "" + СокрЛП(Стр.Номер) + " / " + СокрЛП(Стр.НомерВнешнегоЗаказа);
				ОблСтрокаЗаказа.Параметры.КоличествоМестПоЗаказу = Стр.КоличествоМестПринято;
				ТабДок.Вывести(ОблСтрокаЗаказа);
				
				НПП_Товар = 1;
				ТекЗаказ = Стр.Заказ;
				Продолжить;
			КонецЕсли;
			
			ОблСтрокаТовара.Параметры.НПП = "" + НПП_Заказ + "." + НПП_Товар;
			ОблСтрокаТовара.Параметры.Товар = Стр.Номенклатура;
			ОблСтрокаТовара.Параметры.Количество = Стр.Количество;
			ОблСтрокаТовара.Параметры.НаличиеАкта = Стр.АктПоступил;
			//+++ БАО 10.10.2017 №1920
			ОблСтрокаТовара.Параметры.ID_товара = СокрЛП(Стр.Код_товара) + "/" + Стр.ID_товара;
			ОблСтрокаТовара.Параметры.ШК = Стр.ШК;
			//--- БАО 10.10.2017 №1920

			ТабДок.Вывести(ОблСтрокаТовара);
			НПП_Товар = НПП_Товар + 1;	
			
		КонецЦикла;			
					
	КонецЕсли;
	
	ТабДок.Вывести(ПустоеМесто);
	
	// ----------- ЧАСТИЧНЫЙ ОТКАЗ, ВОЗВРАТ, ОБМЕН	
	Если РезЧастично.Количество() Тогда	
		ТабДок.Вывести(ОблЗаголовокЧастичный);		
		НПП_Заказ = 1;		
		ТекЗаказ = Неопределено;
		
		Для каждого Стр Из РезЧастично Цикл	
			
			Если Стр.Номенклатура = NULL Тогда	// группировочное поле по заказу	
				
				Если ТекЗаказ <> Неопределено Тогда
					НПП_Заказ = НПП_Заказ + 1;
				КонецЕсли;
				
				ОблСтрокаЗаказа.Параметры.НПП = НПП_Заказ;
			    ОблСтрокаЗаказа.Параметры.НомераЗаказа = "" + СокрЛП(Стр.Номер) + " / " + СокрЛП(Стр.НомерВнешнегоЗаказа);
				ОблСтрокаЗаказа.Параметры.КоличествоМестПоЗаказу = Стр.КоличествоМестПринято;
				ТабДок.Вывести(ОблСтрокаЗаказа);
				
				НПП_Товар = 1;
				ТекЗаказ = Стр.Заказ;
				Продолжить;
			КонецЕсли;
			
			ОблСтрокаТовара.Параметры.НПП = "" + НПП_Заказ + "." + НПП_Товар;
			ОблСтрокаТовара.Параметры.Товар = Стр.Номенклатура;
			ОблСтрокаТовара.Параметры.Количество = Стр.Количество;
			ОблСтрокаТовара.Параметры.НаличиеАкта = Стр.АктПоступил;
			//+++ БАО 10.10.2017 №1920
			ОблСтрокаТовара.Параметры.ID_товара = СокрЛП(Стр.Код_товара) + "/" + Стр.ID_товара;
			ОблСтрокаТовара.Параметры.ШК = Стр.ШК;
			//--- БАО 10.10.2017 №1920
			ТабДок.Вывести(ОблСтрокаТовара);	
			НПП_Товар = НПП_Товар + 1;
						
		КонецЦикла;					
	КонецЕсли;	
	
	ТабДок.Вывести(ПустоеМесто);
	
	
	
	
	// ----------- ПРИНЯТЫЕ В РУЧНОМ РЕЖИМЕ	
	Если РезРучники.Количество() Тогда	
		ТабДок.Вывести(ОблЗаголовокВРучномРежиме);		
		НПП_Заказ = 1;		
		ТекЗаказ = Неопределено;
		
		Для каждого Стр Из РезРучники Цикл							
			ОблСтрокаЗаказа.Параметры.НПП = НПП_Заказ;
		    ОблСтрокаЗаказа.Параметры.НомераЗаказа = "" + СокрЛП(Стр.Номер) + " / " + СокрЛП(Стр.НомерВнешнегоЗаказа);
			ОблСтрокаЗаказа.Параметры.КоличествоМестПоЗаказу = Стр.КоличествоМестПринято;
			ТабДок.Вывести(ОблСтрокаЗаказа);
			
			НПП_Заказ = НПП_Заказ + 1;
		КонецЦикла;
		
	КонецЕсли;	
	
	ТабДок.Вывести(ПустоеМесто);
	
	
	ТабДок.Вывести(ОблПодвал);	

КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли;
	
	//+++ БАО 08.06.2017 №1024 
	//Если РейсЗакрыт Тогда
	Если baoВызовСервера.РейсЗакрыт(Ссылка) Тогда
	//--- БАО 08.06.2017 №1024 	
		
		Отказ = Истина;
		Сообщить("Рейс закрыт");
		Возврат;
	КонецЕсли;
	
	//+++ БАО 22.08.2017 №1730
	
	Если ЭтоНовый() Тогда
		
		ТерминалДоставки = Рейс.ТерминалДоставки;	
		
	КонецЕсли;	
	
	//--- БАО 22.08.2017 №1730
	
	ВсегоМест = 0;
	
	//CeHbKA
	Для каждого СтрокаТЧ Из Доставки Цикл
		
		// МАС - 11.07.2018 - № --->> 		
		//ВсегоМест = ВсегоМест + СтрокаТЧ.Доставка.КоличествоМест;
		ВсегоМест = ВсегоМест + СтрокаТЧ.КоличествоМест;
		// <<--- МАС 
		
		МассивСтрок = МестаЗаказов.НайтиСтроки(Новый Структура("Доставка", СтрокаТЧ.Доставка));
		
		СтрокаТЧ.КоличествоМестПринято = 0;
		
		Для каждого СтрокаМест Из МассивСтрок Цикл
			СтрокаТЧ.КоличествоМестПринято = СтрокаТЧ.КоличествоМестПринято + СтрокаМест.Принято;
		КонецЦикла; 
		
	КонецЦикла; 
	
	ЗакрытСРасхождением = ВсегоМест <> МестаЗаказов.Итог("Принято");
	
	
КонецПроцедуры

//Асеев 24.09.2020 (Задача № 4271)>>>
Процедура ЗаписьСкладскихСтатусов()
	
	Движения.СтатусыСкладскогоУчета.Записывать = Истина;
	Движения.СтатусыСкладскогоУчета.Очистить();
	
	Если УдаленноеЗакрытие Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВозвратЗаказовОтВодителяДоставки.Доставка КАК Заказ,
	|	ВЫБОР
	|		КОГДА ВозвратЗаказовОтВодителяДоставки.ПричинаНеВыполненияДоставки В (ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ОтказКлиентаБезЗаезда), ЗНАЧЕНИЕ(Справочник.ПричинынеВыполненияДоставки.НеДоставлен))
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатусыСкладскогоУчета.Возврат1)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВозвратЗаказовОтВодителяДоставки.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.ВыполненаЧастично)
	|						ИЛИ ВозвратЗаказовОтВодителяДоставки.ПричинаНеВыполненияДоставки = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ОтказКлиентаСЗаездом)
	|						ИЛИ НЕ ВозвратТоваровОтПокупателя.Ссылка ЕСТЬ NULL
	|							И (НЕ ВозвратЗаказовОтВодителяДоставки.ПричинаНеВыполненияДоставки = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.НеДоставлен)
	|								ИЛИ НЕ ВозвратЗаказовОтВодителяДоставки.ПричинаНеВыполненияДоставки = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ОтказКлиентаБезЗаезда))
	|					ТОГДА ЗНАЧЕНИЕ(Справочник.СтатусыСкладскогоУчета.Возврат2)
	|			КОНЕЦ
	|	КОНЕЦ КАК СтатусСкладскогоУчета,
	|	ВозвратТоваровОтПокупателя.Номер ЕСТЬ NULL КАК НетВозврата,
	|	ВозвратТоваровОтПокупателяТовары.Ссылка ЕСТЬ NULL КАК НетТоваровВозврата,
	|	РеализацияТоваровУслугТовары.Ссылка ЕСТЬ NULL КАК НетТоваров,
	|	ВозвратЗаказовОтВодителяДоставки.РезультатДоставки КАК РезультатДоставки,
	|	РеализацияТоваровУслугПодарочныеПозиции.Ссылка ЕСТЬ NULL КАК НетПодарочныхПозиций
	|ИЗ
	|	Документ.ВозвратЗаказовОтВодителя.Доставки КАК ВозвратЗаказовОтВодителяДоставки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
	|			ПО ВозвратТоваровОтПокупателя.Ссылка = ВозвратТоваровОтПокупателяТовары.Ссылка
	|				И (ВозвратТоваровОтПокупателяТовары.НомерСтроки = 1)
	|		ПО ВозвратЗаказовОтВодителяДоставки.Доставка.Номер = ВозвратТоваровОтПокупателя.Номер
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ПО ВозвратЗаказовОтВодителяДоставки.Доставка = РеализацияТоваровУслугТовары.Ссылка
	|			И (РеализацияТоваровУслугТовары.НомерСтроки = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.ПодарочныеПозиции КАК РеализацияТоваровУслугПодарочныеПозиции
	|		ПО ВозвратЗаказовОтВодителяДоставки.Доставка = РеализацияТоваровУслугПодарочныеПозиции.Ссылка
	|			И (РеализацияТоваровУслугПодарочныеПозиции.НомерСтроки = 1)
	|ГДЕ
	|	ВозвратЗаказовОтВодителяДоставки.Ссылка = &Ссылка
	|	И (ВозвратЗаказовОтВодителяДоставки.ПричинаНеВыполненияДоставки В (ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ОтказКлиентаБезЗаезда), ЗНАЧЕНИЕ(Справочник.ПричинынеВыполненияДоставки.ОтказКлиентаСЗаездом), ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.НеДоставлен))
	|			ИЛИ ВозвратЗаказовОтВодителяДоставки.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.ВыполненаЧастично)
	|			ИЛИ НЕ ВозвратТоваровОтПокупателя.Номер ЕСТЬ NULL
	|				И ВозвратЗаказовОтВодителяДоставки.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.Выполнена))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратЗаказовОтВодителяДоставки.Доставка,
	|	ЗНАЧЕНИЕ(Справочник.СтатусыСкладскогоУчета.ЗаказВыполнен),
	|	ИСТИНА,
	|	ИСТИНА,
	|	РеализацияТоваровУслугТовары.Ссылка ЕСТЬ NULL,
	|	НЕОПРЕДЕЛЕНО,
	|	ИСТИНА
	|ИЗ
	|	Документ.ВозвратЗаказовОтВодителя.Доставки КАК ВозвратЗаказовОтВодителяДоставки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя
	|		ПО ВозвратЗаказовОтВодителяДоставки.Доставка.Номер = ВозвратТоваровОтПокупателя.Номер
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ПО ВозвратЗаказовОтВодителяДоставки.Доставка = РеализацияТоваровУслугТовары.Ссылка
	|			И (РеализацияТоваровУслугТовары.НомерСтроки = 1)
	|ГДЕ
	|	ВозвратЗаказовОтВодителяДоставки.Ссылка = &Ссылка
	|	И ВозвратЗаказовОтВодителяДоставки.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.Выполнена)
	|	И ВозвратТоваровОтПокупателя.Номер ЕСТЬ NULL";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.НетВозврата Тогда
			Движение = Движения.СтатусыСкладскогоУчета.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, Выборка);
			Движение.ТипЗаказа = Перечисления.ТипыЗаказов.Доставка;
			Движение.Период = Дата;
		ИначеЕсли Выборка.НетТоваров И Выборка.НетПодарочныхПозиций Тогда
			Если Выборка.РезультатДоставки = Справочники.новаРезультатМестнойДоставки.Выполнена Или Выборка.РезультатДоставки = Справочники.новаРезультатМестнойДоставки.ВыполненаЧастично Тогда
				Движение = Движения.СтатусыСкладскогоУчета.Добавить();
				ЗаполнитьЗначенияСвойств(Движение, Выборка);
				Движение.СтатусСкладскогоУчета = Справочники.СтатусыСкладскогоУчета.Возврат2;
				Движение.ТипЗаказа = Перечисления.ТипыЗаказов.Возврат;
				Движение.Период = Дата;
			КонецЕсли;
		ИначеЕсли Не Выборка.НетТоваров И Выборка.РезультатДоставки = Справочники.новаРезультатМестнойДоставки.ВыполненаЧастично Тогда
			Движение = Движения.СтатусыСкладскогоУчета.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, Выборка);
			Движение.ТипЗаказа = Перечисления.ТипыЗаказов.Возврат;
			Движение.Период = Дата;
		ИначеЕсли Выборка.НетТоваровВозврата Тогда
			//Это выполненая доставка ничего делать не нужно
		Иначе
			Движение = Движения.СтатусыСкладскогоУчета.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, Выборка);
			Движение.ТипЗаказа = Перечисления.ТипыЗаказов.Обмен;
			Движение.Период = Дата;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
//Асеев 24.09.2020 (Задача № 4271)<<<


//Асеев 24.09.2020 (Задача № 4271)>>>
Процедура ОбработатьРасхожденияУдаленногоЗакрытия()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДокументУдаленногоЗакрытия", ДокументУдаленногоЗакрытия);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Заказ КАК Заказ,
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	СУММА(ВложенныйЗапрос.Заявлено) КАК Заявлено,
	|	СУММА(ВложенныйЗапрос.Фактически) КАК Фактически
	|ПОМЕСТИТЬ ВТ_ЗаявленоФактически
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВозвратЗаказовОтВодителяДоставки.Доставка КАК Заказ,
	|		ЕСТЬNULL(ВозвратЗаказовОтВодителяТовары.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	|		ЕСТЬNULL(ВозвратЗаказовОтВодителяТовары.Количество, 0) КАК Заявлено,
	|		0 КАК Фактически
	|	ИЗ
	|		Документ.ВозвратЗаказовОтВодителя.Доставки КАК ВозвратЗаказовОтВодителяДоставки
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратЗаказовОтВодителя.Товары КАК ВозвратЗаказовОтВодителяТовары
	|			ПО (ВозвратЗаказовОтВодителяТовары.Ссылка = &ДокументУдаленногоЗакрытия)
	|				И ВозвратЗаказовОтВодителяДоставки.Доставка = ВозвратЗаказовОтВодителяТовары.Доставка
	|	ГДЕ
	|		ВозвратЗаказовОтВодителяДоставки.Ссылка = &ДокументУдаленногоЗакрытия
	|		И (ВозвратЗаказовОтВодителяДоставки.ПринятНаСкладеПолностью
	|				ИЛИ ВозвратЗаказовОтВодителяДоставки.ПринятНаСкладеЧастично)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВозвратЗаказовОтВодителяДоставки.Доставка,
	|		ЕСТЬNULL(ВозвратЗаказовОтВодителяТовары.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)),
	|		0,
	|		ЕСТЬNULL(ВозвратЗаказовОтВодителяТовары.Количество, 0)
	|	ИЗ
	|		Документ.ВозвратЗаказовОтВодителя.Доставки КАК ВозвратЗаказовОтВодителяДоставки
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратЗаказовОтВодителя.Товары КАК ВозвратЗаказовОтВодителяТовары
	|			ПО (ВозвратЗаказовОтВодителяТовары.Ссылка = &Ссылка)
	|				И ВозвратЗаказовОтВодителяДоставки.Доставка = ВозвратЗаказовОтВодителяТовары.Доставка
	|	ГДЕ
	|		ВозвратЗаказовОтВодителяДоставки.Ссылка = &Ссылка
	|		И (ВозвратЗаказовОтВодителяДоставки.ПринятНаСкладеПолностью
	|				ИЛИ ВозвратЗаказовОтВодителяДоставки.ПринятНаСкладеЧастично)) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Заказ,
	|	ВложенныйЗапрос.Номенклатура
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВложенныйЗапрос.Заявлено) <> СУММА(ВложенныйЗапрос.Фактически)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗаявленоФактически.Фактически < ВТ_ЗаявленоФактически.Заявлено КАК НеПринятоПоФакту,
	|	ВТ_ЗаявленоФактически.Заказ.Номер КАК ЗаказНомер,
	|	ВТ_ЗаявленоФактически.Номенклатура КАК Номенклатура,
	|	ВТ_ЗаявленоФактически.Номенклатура.Наименование КАК НоменклатураНаименование,
	|	ВЫБОР
	|		КОГДА ВТ_ЗаявленоФактически.Фактически > ВТ_ЗаявленоФактически.Заявлено
	|			ТОГДА ВТ_ЗаявленоФактически.Фактически - ВТ_ЗаявленоФактически.Заявлено
	|		ИНАЧЕ ВТ_ЗаявленоФактически.Заявлено - ВТ_ЗаявленоФактически.Фактически
	|	КОНЕЦ КАК Количество
	|ИЗ
	|	ВТ_ЗаявленоФактически КАК ВТ_ЗаявленоФактически
	|
	|УПОРЯДОЧИТЬ ПО
	|	НеПринятоПоФакту,
	|	ЗаказНомер,
	|	НоменклатураНаименование
	|ИТОГИ ПО
	|	НеПринятоПоФакту,
	|	ЗаказНомер";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Макет = Документы.ВозвратЗаказовОтВодителя.ПолучитьМакет("РасхожденияУдаленногоЗакрытия");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ПараметрыОбластиЗаголовок = ОбластьЗаголовок.Параметры;
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ПараметрыОбластиШапка = ОбластьШапка.Параметры;
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ПараметрыОбластиСтрока = ОбластьСтрока.Параметры;
	
	ТабДок = Новый ТабличныйДокумент;
	
	ПустаяНоменклатура = Справочники.Номенклатура.ПустаяСсылка();
	
	ВыборкаНеПринятоПоФакту = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаНеПринятоПоФакту.Следующий() Цикл
		Если ВыборкаНеПринятоПоФакту.НеПринятоПоФакту Тогда
			ПараметрыОбластиЗаголовок.Заголовок = "НЕ ПРИНЯТО ПО ФАКТУ";
		Иначе
			ПараметрыОбластиЗаголовок.Заголовок = "ПРИНЯТО ПО ФАКТУ";
		КонецЕсли;
		ТабДок.Вывести(ОбластьЗаголовок);
		ВыборкаЗаказ = ВыборкаНеПринятоПоФакту.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаЗаказ.Следующий() Цикл
			ПараметрыОбластиШапка.ЗаказНомер = ВыборкаЗаказ.ЗаказНомер;
			ТабДок.Вывести(ОбластьШапка);
			НПП = 0;
			ВыборкаНоменклатура = ВыборкаЗаказ.Выбрать();
			Пока ВыборкаНоменклатура.Следующий() Цикл
				Если ВыборкаНоменклатура.Номенклатура <> ПустаяНоменклатура Тогда
					НПП = НПП + 1;
					ПараметрыОбластиСтрока.НПП = НПП;
					ПараметрыОбластиСтрока.НоменклатураНаименование = ВыборкаНоменклатура.НоменклатураНаименование;
					ПараметрыОбластиСтрока.Количество = ВыборкаНоменклатура.Количество;
					ТабДок.Вывести(ОбластьСтрока);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ТекстПисьма = Новый ТекстовыйДокумент;
	ТекстПисьма.ДобавитьСтроку("Обнаружены расхождения, при подтверждении удаленного закрытия");
	ТекстПисьма.ДобавитьСтроку("Удаленное закрытие: " + ДокументУдаленногоЗакрытия);
	ТекстПисьма.ДобавитьСтроку("Подтверждение удаленного закрытия: " + ЭтотОбъект);
	
	ИмяФайла = КаталогВременныхФайлов() + Номер + ".xls";
	
	ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLS);
	
	МассивПолучателей = Новый Массив;
	Если ПараметрыСеанса.ЭтоТестоваяСреда Тогда
		МассивПолучателей.Добавить("m.aseev@strizh-logistic.ru");
	Иначе
		Если ТерминалДоставки = Справочники.РегиональныеТерминалы.МоскваСтриж Тогда
			МассивПолучателей.Добавить("tovaroved@strizh-logistic");
			МассивПолучателей.Добавить("kassir@strizh-logistic");
		ИначеЕсли ТерминалДоставки = Справочники.РегиональныеТерминалы.СПбСтриж Тогда
			МассивПолучателей.Добавить("kassirspb@strizh-logistic");
		КонецЕсли;
		МассивПолучателей.Добавить("m.aseev@strizh-logistic.ru");
		МассивПолучателей.Добавить("evgeniy.marochkin@strizh-logistic.ru");
		МассивПолучателей.Добавить("dmitry.sherbinkin@strizh-logistic.ru");
	КонецЕсли;
	
	lem.ОтправитьСообщение(МассивПолучателей, "Подтверждение удаленного закрытия " + Формат(Дата, "ДФ=dd.MM.yyyy"), ТекстПисьма.ПолучитьТекст(), ИмяФайла);
	
	Попытка
		УдалитьФайлы(ИмяФайла);
	Исключение
	КонецПопытки;
	
КонецПроцедуры
//Асеев 24.09.2020 (Задача № 4271)<<<

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Асеев 24.09.2020 (Задача № 4271)>>>
	//Если Транспорт = Справочники.новаТранспорт.НайтиПоКоду("000524")//KIA В 062 НК 777
	//	Или Транспорт = Справочники.новаТранспорт.НайтиПоКоду("000233")//Тойота С 876 ТР 197
	//	Тогда
		ЗаписьСкладскихСтатусов();
	//КонецЕсли;
	//Асеев 24.09.2020 (Задача № 4271)<<<
	
	//Асеев 03.11.2023 (Задача № 5161)>>>
	ВыполнитьДвиженияПоРСэкУчетПроизводственныхОпераций();
	//Асеев 03.11.2023 (Задача № 5161)<<<
	
	ЭтапОбработки = "Старт, ";
	Попытка
		Зап = Новый Запрос;
		
		Зап.Текст = "ВЫБРАТЬ
		|	ВозвратЗаказовОтВодителяДоставки.Доставка КАК Заказ,
		|	ВозвратЗаказовОтВодителяДоставки.Ссылка.Рейс.ТерминалДоставки КАК Терминал
		|ИЗ
		|	Документ.ВозвратЗаказовОтВодителя.Доставки КАК ВозвратЗаказовОтВодителяДоставки
		|ГДЕ
		|	ВозвратЗаказовОтВодителяДоставки.Ссылка = &Док
		|	И (ВозвратЗаказовОтВодителяДоставки.ПринятНаСкладеПолностью = ИСТИНА
		|			ИЛИ ВозвратЗаказовОтВодителяДоставки.ПринятНаСкладеЧастично = ИСТИНА)";
		Зап.УстановитьПараметр("Док", Ссылка);			
		
		
		Рез = Зап.Выполнить().Выгрузить();
		
		
		//+++ БАО 02.08.2017 №1550	
		
		//Список = Новый СписокЗначений;
		//Массив = Рез.ВыгрузитьКолонку("Заказ");
		//Список.ЗагрузитьЗначения(Массив);
		Список = Рез.Скопировать(, "Заказ, Терминал");
		
		//--- БАО 02.08.2017 №1550
		
		//Асеев 24.09.2020 (Задача № 4271)>>>
		Если Не РежимПодтвержденияУдаленногоЗакрытия Тогда
		//Асеев 24.09.2020 (Задача № 4271)<<<	
			lem.ЗафиксироватьМестонахождениеЗаказа(Список, Справочники.ВидыМестонахожденияЗаказа.НаСкладе, Ссылка);
			ЭтапОбработки = ЭтапОбработки = ", местонахождение";
		КонецЕсли;
		
		ЗаписатьПозицииКВозврату();
		ЭтапОбработки = ЭтапОбработки = ", Позиции к возврату";

	Исключение
		СтрокаОшибка = ОписаниеОшибки();
		//Записать(РежимЗаписиДокумента.Запись);
		//pkv.ДобавитьВСписокОтложенногоПроведения(Ссылка,СтрокаОшибка);
		lem.ОтправитьНормальноеСообщениеАдминам("Возврат от водителя " + Номер, СтрокаОшибка + Символы.ПС + Символы.пс + ЭтапОбработки);
	КонецПопытки;
	
	//Асеев 24.09.2020 (Задача № 4271)>>>
	Если РежимПодтвержденияУдаленногоЗакрытия Тогда
		ОбработатьРасхожденияУдаленногоЗакрытия();
	КонецЕсли;
	//Асеев 24.09.2020 (Задача № 4271)<<<
	
		
КонецПроцедуры

//Асеев 03.11.2023 (Задача № 5161)>>>
Процедура ВыполнитьДвиженияПоРСэкУчетПроизводственныхОпераций()
	
	Движения.экУчетПроизводственныхОпераций.Записывать = Истина;
	Движения.экУчетПроизводственныхОпераций.Очистить();
	
	Если УдаленноеЗакрытие Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ТерминалДоставки", ТерминалДоставки);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	ВозвратЗаказовОтВодителяДоставки.Доставка КАК Заказ,
	|	&ТерминалДоставки КАК Регион,
	|	ЗНАЧЕНИЕ(Справочник.экВидыПроизводственныхОпераций.ПриходЗаказовОтЭкипажа) КАК ВидОперации,
	|	ЛОЖЬ КАК ОбратныйПоток
	|ПОМЕСТИТЬ ВТ_ИсходныеДанные
	|ИЗ
	|	Документ.ВозвратЗаказовОтВодителя.Доставки КАК ВозвратЗаказовОтВодителяДоставки
	|ГДЕ
	|	ВозвратЗаказовОтВодителяДоставки.Ссылка = &Ссылка
	|	И (ВозвратЗаказовОтВодителяДоставки.ПринятНаСкладеПолностью
	|			ИЛИ ВозвратЗаказовОтВодителяДоставки.ПринятНаСкладеЧастично)";
	
	ТаблицаДвижений = РегистрыСведений.экУчетПроизводственныхОпераций.ПолучитьТаблицуДвижений(Запрос);
	
	Движения.экУчетПроизводственныхОпераций.Загрузить(ТаблицаДвижений);
	
КонецПроцедуры
//Асеев 03.11.2023 (Задача № 5161)<<<

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	
	Зап = Новый Запрос;
	
	Зап.Текст = "ВЫБРАТЬ
	            |	ВозвратЗаказовОтВодителяДоставки.Доставка КАК Заказ,
	            |	ВозвратЗаказовОтВодителяДоставки.Ссылка.Рейс.ТерминалДоставки КАК Терминал
	            |ИЗ
	            |	Документ.ВозвратЗаказовОтВодителя.Доставки КАК ВозвратЗаказовОтВодителяДоставки
	            |ГДЕ
	            |	ВозвратЗаказовОтВодителяДоставки.Ссылка.Ссылка = &Док
	            |	И (ВозвратЗаказовОтВодителяДоставки.ПринятНаСкладеПолностью = ИСТИНА
	            |			ИЛИ ВозвратЗаказовОтВодителяДоставки.ПринятНаСкладеЧастично = ИСТИНА)";
	Зап.УстановитьПараметр("Док", Ссылка);			
	
	
	Рез = Зап.Выполнить().Выгрузить();
	
	
//+++ БАО 02.08.2017 №1550	

	//Список = Новый СписокЗначений;
	//Массив = Рез.ВыгрузитьКолонку("Заказ");
	//Список.ЗагрузитьЗначения(Массив);
	Список = Рез.Скопировать(, "Заказ, Терминал");
	
//--- БАО 02.08.2017 №1550

	
	
	Зап2 = Новый Запрос;
	Зап2.Текст = "ВЫБРАТЬ
	             |	ПривязкаМашинКРейсамСрезПоследних.Рейс,
	             |	ПривязкаМашинКРейсамСрезПоследних.Транспорт КАК РасшифровкаМестонахождения,
	             |	ПривязкаМашинКРейсамСрезПоследних.Водитель,
	             |	ПривязкаМашинКРейсамСрезПоследних.Экспедитор
	             |ИЗ
	             |	РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних КАК ПривязкаМашинКРейсамСрезПоследних
	             |ГДЕ
	             |	ПривязкаМашинКРейсамСрезПоследних.Рейс = &Рейс";
				 
	Зап2.УстановитьПараметр("Рейс", Ссылка.Рейс);			 
	Выб2 = Зап2.Выполнить().Выбрать();
	
	СписокМестонахождения = Неопределено;
	
	Если Выб2.Следующий() Тогда
		СписокМестонахождения = Новый Структура;
		СписокМестонахождения.Вставить("РасшифровкаМестонахождения", Выб2.РасшифровкаМестонахождения);
		СписокМестонахождения.Вставить("Рейс", Выб2.Рейс);
		СписокМестонахождения.Вставить("Водитель", Выб2.Водитель);
		СписокМестонахождения.Вставить("Экспедитор", Выб2.Экспедитор);
	КонецеСли;	
	
	
	lem.ЗафиксироватьМестонахождениеЗаказа(Список, Справочники.ВидыМестонахожденияЗаказа.УКурьера, Ссылка, СписокМестонахождения);	
	
	ЗаписатьПозицииКВозврату(Истина);  // удаление записей по документу
	
		
КонецПроцедуры

//+++ БАО 10.08.2017 №1620
//Перенес из модуля формы 

&НаСервере
Функция ПроверкаНаЧастичку(ДокДанныеМП)
	
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ДанныеЗаказаВодителяДоставленныеТовары.Номенклатура,
	                      |	СУММА(ДанныеЗаказаВодителяДоставленныеТовары.КоличествоДоставлено) КАК КоличествоДоставлено
	                      |ПОМЕСТИТЬ ВТ_Данные
	                      |ИЗ
	                      |	Документ.ДанныеЗаказаВодителя.ДоставленныеТовары КАК ДанныеЗаказаВодителяДоставленныеТовары
	                      |ГДЕ
	                      |	ДанныеЗаказаВодителяДоставленныеТовары.Ссылка.Ссылка = &СсылкаМП
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ДанныеЗаказаВодителяДоставленныеТовары.Номенклатура
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	РеализацияТоваровУслугТовары.Номенклатура,
	                      |	СУММА(РеализацияТоваровУслугТовары.Количество) КАК Количество
	                      |ПОМЕСТИТЬ ВТ_Реализация
	                      |ИЗ
	                      |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	                      |ГДЕ
	                      |	РеализацияТоваровУслугТовары.Ссылка.Ссылка = &СсылкаРеализация
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	РеализацияТоваровУслугТовары.Номенклатура
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура,
	                      |	СУММА(РеализацияТоваровУслугПодарочныеПозиции.Количество)
	                      |ИЗ
	                      |	Документ.РеализацияТоваровУслуг.ПодарочныеПозиции КАК РеализацияТоваровУслугПодарочныеПозиции
	                      |ГДЕ
	                      |	РеализацияТоваровУслугПодарочныеПозиции.Ссылка.Ссылка = &СсылкаРеализация
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_Данные.Номенклатура,
	                      |	ВТ_Реализация.Количество - ВТ_Данные.КоличествоДоставлено КАК КоличествоНеДоставлено
	                      |ИЗ
	                      |	ВТ_Данные КАК ВТ_Данные
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Реализация КАК ВТ_Реализация
	                      |		ПО ВТ_Данные.Номенклатура = ВТ_Реализация.Номенклатура");
	Запрос.УстановитьПараметр("СсылкаМП", ДокДанныеМП);
	Запрос.УстановитьПараметр("СсылкаРеализация", ДокДанныеМП.Реализация);
	Рез = Запрос.Выполнить().Выбрать();
	
	Пока Рез.Следующий() Цикл
		
		Если Рез.КоличествоНеДоставлено = NULL Тогда
			Продолжить;	
		КонецЕсли;
		
		Если Рез.КоличествоНеДоставлено > 0 Тогда		
			Возврат	Истина;		
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат Ложь;
	

КонецФункции // ()

// Якурнов 13.09.2018 11:18:16
&НаСервере
Функция ПроверкаНаЧастичкуСВозвратами(ДокДанныеМП)
	
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ДанныеЗаказаВодителяДоставленныеТовары.Номенклатура КАК Номенклатура,
	                      |	СУММА(ДанныеЗаказаВодителяДоставленныеТовары.КоличествоДоставлено) КАК КоличествоДоставлено
	                      |ПОМЕСТИТЬ ВТ_Данные
	                      |ИЗ
	                      |	Документ.ДанныеЗаказаВодителя.ДоставленныеТовары КАК ДанныеЗаказаВодителяДоставленныеТовары
	                      |ГДЕ
	                      |	ДанныеЗаказаВодителяДоставленныеТовары.Ссылка.Ссылка = &СсылкаМП
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ДанныеЗаказаВодителяДоставленныеТовары.Номенклатура
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	                      |	СУММА(РеализацияТоваровУслугТовары.Количество) КАК Количество
	                      |ПОМЕСТИТЬ ВТ_Реализация
	                      |ИЗ
	                      |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	                      |ГДЕ
	                      |	РеализацияТоваровУслугТовары.Ссылка.Ссылка = &СсылкаРеализация
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	РеализацияТоваровУслугТовары.Номенклатура
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура,
	                      |	СУММА(РеализацияТоваровУслугПодарочныеПозиции.Количество)
	                      |ИЗ
	                      |	Документ.РеализацияТоваровУслуг.ПодарочныеПозиции КАК РеализацияТоваровУслугПодарочныеПозиции
	                      |ГДЕ
	                      |	РеализацияТоваровУслугПодарочныеПозиции.Ссылка.Ссылка = &СсылкаРеализация
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_Данные.Номенклатура КАК Номенклатура,
	                      |	ВТ_Реализация.Количество - ВТ_Данные.КоличествоДоставлено КАК КоличествоНеДоставлено
	                      |ИЗ
	                      |	ВТ_Данные КАК ВТ_Данные
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Реализация КАК ВТ_Реализация
	                      |		ПО ВТ_Данные.Номенклатура = ВТ_Реализация.Номенклатура
	                      |ГДЕ
	                      |	НЕ ВТ_Данные.Номенклатура В
	                      |				(ВЫБРАТЬ
	                      |					ВозвратТоваровОтПокупателяТовары.Номенклатура КАК Номенклатура
	                      |				ИЗ
	                      |					Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
	                      |				ГДЕ
	                      |					ВозвратТоваровОтПокупателяТовары.Ссылка.Номер = &НомерДокВозврата)");
	Запрос.УстановитьПараметр("СсылкаМП", ДокДанныеМП);
	Запрос.УстановитьПараметр("СсылкаРеализация", ДокДанныеМП.Реализация);
	Запрос.УстановитьПараметр("НомерДокВозврата", ДокДанныеМП.Реализация.Номер);
	Рез = Запрос.Выполнить().Выбрать();
	
	Пока Рез.Следующий() Цикл
		
		Если Рез.КоличествоНеДоставлено = NULL Тогда
			Продолжить;	
		КонецЕсли;
		
		Если Рез.КоличествоНеДоставлено > 0 Тогда		
			Возврат	Истина;		
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат Ложь;
	

КонецФункции // ()

//Асеев 17.09.2020 (Задача № 4251)>>>
Процедура ЗаполнитьПодтверждениеУдаленногоЗакрытия(Объект, ЭтоИзДокумента = Истина)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Объект.ДокументУдаленногоЗакрытия);
	Запрос.УстановитьПараметр("ДатаДокумента", НачалоДня(Объект.Дата));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВозвратЗаказовОтВодителя.Транспорт КАК Транспорт,
	|	ВозвратЗаказовОтВодителя.Водитель КАК Водитель,
	|	ВозвратЗаказовОтВодителя.Экспедитор КАК Экспедитор,
	|	ВозвратЗаказовОтВодителя.ТерминалДоставки КАК ТерминалДоставки
	|ИЗ
	|	Документ.ВозвратЗаказовОтВодителя КАК ВозвратЗаказовОтВодителя
	|ГДЕ
	|	ВозвратЗаказовОтВодителя.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВозвратЗаказовОтВодителяДоставки.Доставка КАК Доставка,
	|	ВозвратЗаказовОтВодителяДоставки.РезультатДоставки КАК РезультатДоставки,
	|	ВозвратЗаказовОтВодителяДоставки.ПричинаНеВыполненияДоставки КАК ПричинаНеВыполненияДоставки,
	|	ВозвратЗаказовОтВодителяДоставки.ВозвратТоваров КАК ВозвратТоваров,
	|	ВозвратЗаказовОтВодителяДоставки.ЗаполненоПоДаннымБД КАК ЗаполненоПоДаннымБД,
	|	ЛОЖЬ КАК ПринятНаСкладеПолностью,
	|	ЛОЖЬ КАК ПринятНаСкладеЧастично,
	|	ВозвратЗаказовОтВодителяДоставки.БылоВскрытиеЗаказа КАК БылоВскрытиеЗаказа,
	|	ВозвратЗаказовОтВодителяДоставки.ПринятНаСкладеПолностью
	|		ИЛИ ВозвратЗаказовОтВодителяДоставки.ПринятНаСкладеЧастично КАК КВозврату,
	|	ВозвратЗаказовОтВодителяДоставки.АктПоступил КАК АктПоступил,
	|	ЛОЖЬ КАК ПринятоРанее,
	|	0 КАК КоличествоМестПринято,
	|	ВозвратЗаказовОтВодителяДоставки.ВидПроблемы КАК ВидПроблемы,
	|	ВозвратЗаказовОтВодителяДоставки.ЭтоДоговор КАК ЭтоДоговор,
	|	ВозвратЗаказовОтВодителяДоставки.ТипВозврата КАК ТипВозврата,
	|	ВозвратЗаказовОтВодителяДоставки.Вскрытый КАК Вскрытый,
	|	ВозвратЗаказовОтВодителяДоставки.КоличествоМест КАК КоличествоМест,
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(ВозвратЗаказовОтВодителяДоставки.Доставка.Дата, ДЕНЬ) = &ДатаДокумента
	|				И ВозвратЗаказовОтВодителяДоставки.Доставка.СтатусИнтернетМагазина = 2
	|			ТОГДА 1
	|		КОГДА НАЧАЛОПЕРИОДА(ВозвратЗаказовОтВодителяДоставки.Доставка.Дата, ДЕНЬ) > &ДатаДокумента
	|				И ВозвратЗаказовОтВодителяДоставки.Доставка.СтатусИнтернетМагазина = 2
	|			ТОГДА 2
	|	КОНЕЦ КАК СтатусИндикации
	|ИЗ
	|	Документ.ВозвратЗаказовОтВодителя.Доставки КАК ВозвратЗаказовОтВодителяДоставки
	|ГДЕ
	|	ВозвратЗаказовОтВодителяДоставки.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВозвратЗаказовОтВодителяДоставки.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВозвратЗаказовОтВодителяТовары.Доставка КАК Доставка,
	|	ВозвратЗаказовОтВодителяТовары.Номенклатура КАК Номенклатура,
	|	ВозвратЗаказовОтВодителяТовары.Количество КАК Количество,
	|	ВозвратЗаказовОтВодителяТовары.Цена КАК Цена,
	|	ВозвратЗаказовОтВодителяТовары.Сумма КАК Сумма,
	|	ВозвратЗаказовОтВодителяТовары.КоличествоИсходное КАК КоличествоИсходное,
	|	ЛОЖЬ КАК ПринятНаСкладе,
	|	ВозвратЗаказовОтВодителяТовары.ШтрихкодНоменклатуры КАК ШтрихкодНоменклатуры,
	|	0 КАК Принято,
	|	ВозвратЗаказовОтВодителяТовары.Штрихкод КАК Штрихкод,
	|	ВозвратЗаказовОтВодителяТовары.КодМаркировки КАК КодМаркировки
	|ИЗ
	|	Документ.ВозвратЗаказовОтВодителя.Товары КАК ВозвратЗаказовОтВодителяТовары
	|ГДЕ
	|	ВозвратЗаказовОтВодителяТовары.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВозвратЗаказовОтВодителяТовары.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВозвратЗаказовОтВодителяДанныеМПВодителя.ДанныеМП КАК ДанныеМП,
	|	ВозвратЗаказовОтВодителяДанныеМПВодителя.Учитывать КАК Учитывать,
	|	ВозвратЗаказовОтВодителяДанныеМПВодителя.Доставка КАК Доставка
	|ИЗ
	|	Документ.ВозвратЗаказовОтВодителя.ДанныеМПВодителя КАК ВозвратЗаказовОтВодителяДанныеМПВодителя
	|ГДЕ
	|	ВозвратЗаказовОтВодителяДанныеМПВодителя.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВозвратЗаказовОтВодителяДанныеМПВодителя.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВозвратЗаказовОтВодителяМестаЗаказов.Доставка КАК Доставка,
	|	ВозвратЗаказовОтВодителяМестаЗаказов.Место КАК Место,
	|	ЛОЖЬ КАК Принято,
	|	ВозвратЗаказовОтВодителяМестаЗаказов.Штрихкод КАК Штрихкод
	|ИЗ
	|	Документ.ВозвратЗаказовОтВодителя.МестаЗаказов КАК ВозвратЗаказовОтВодителяМестаЗаказов
	|ГДЕ
	|	ВозвратЗаказовОтВодителяМестаЗаказов.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВозвратЗаказовОтВодителяМестаЗаказов.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВозвратЗаказовОтВодителяШтрихкоды.Заказ КАК Заказ,
	|	ВозвратЗаказовОтВодителяШтрихкоды.Товар КАК Товар,
	|	ВозвратЗаказовОтВодителяШтрихкоды.Штрихкод КАК Штрихкод,
	|	ВозвратЗаказовОтВодителяШтрихкоды.ШКТовара КАК ШКТовара,
	|	ВозвратЗаказовОтВодителяШтрихкоды.МестоЗаказа КАК МестоЗаказа
	|ИЗ
	|	Документ.ВозвратЗаказовОтВодителя.Штрихкоды КАК ВозвратЗаказовОтВодителяШтрихкоды
	|ГДЕ
	|	ВозвратЗаказовОтВодителяШтрихкоды.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВозвратЗаказовОтВодителяШтрихкоды.НомерСтроки";
	
	РезультатПакета = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатПакета[0].Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(Объект, Выборка);
	
	Объект.Доставки.Загрузить(РезультатПакета[1].Выгрузить());
	Объект.Товары.Загрузить(РезультатПакета[2].Выгрузить());
	Объект.ДанныеМПВодителя.Загрузить(РезультатПакета[3].Выгрузить());
	Объект.МестаЗаказов.Загрузить(РезультатПакета[4].Выгрузить());
	Объект.Штрихкоды.Загрузить(РезультатПакета[5].Выгрузить());
	
	Записать();
	
КонецПроцедуры
//Асеев 17.09.2020 (Задача № 4251)<<<

&НаСервере
Процедура ЗаполнитьПоРейсуНаСервере(Объект, ЭтоИзДокумента = Истина) Экспорт 
	
	//Асеев 16.09.2020 (Задача № 4249)>>>
	Если Объект.РежимПодтвержденияУдаленногоЗакрытия Тогда
		ЗаполнитьПодтверждениеУдаленногоЗакрытия(Объект, ЭтоИзДокумента = Истина);
	Иначе
		//Асеев 16.09.2020 (Задача № 4249)<<<
		
		// Якурнов 13.09.2018 11:00:47 Переключаем на новый алгоритм заполнения по ДанныеЗаказаВодителя 
		ЗаполнитьПоСтаромуАлгоритму = Ложь;
		Если ЗаполнитьПоСтаромуАлгоритму Тогда
			ЗаполнитьПоРейсуНаСервереСтарая(Объект, ЭтоИзДокумента = Истина);
		Иначе
			ЗаполнитьПоРейсуНаСервереНовая(Объект, ЭтоИзДокумента = Истина);
		КонецЕсли; 
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоРейсуНаСервереНовая(Объект, ЭтоИзДокумента = Истина) Экспорт 

	Мас = Объект.Рейс.Заказы.ВыгрузитьКолонку("Заказ");	
	Транспорт = Неопределено;
	Водитель = Неопределено;	
	рейс = Объект.Рейс;	 
	
	ЗапросПоРейсу = Новый Запрос("ВЫБРАТЬ
	|	ПривязкаМашинКРейсамСрезПоследних.Период,
	|	ПривязкаМашинКРейсамСрезПоследних.Рейс,
	|	ПривязкаМашинКРейсамСрезПоследних.Транспорт,
	|	ПривязкаМашинКРейсамСрезПоследних.Водитель,
	|	ПривязкаМашинКРейсамСрезПоследних.Экспедитор,
	|	ПривязкаМашинКРейсамСрезПоследних.КтоПривязал
	|ИЗ
	|	РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних КАК ПривязкаМашинКРейсамСрезПоследних
	|ГДЕ
	|	ПривязкаМашинКРейсамСрезПоследних.Рейс = &Рейс");
	ЗапросПоРейсу.УстановитьПараметр("Рейс", Рейс);	
	РезРейс = ЗапросПоРейсу.Выполнить().Выбрать();
	Если РезРейс.Следующий() Тогда	
		Транспорт = РезРейс.Транспорт;
		Водитель = РезРейс.Водитель;
		Экспедитор = РезРейс.Экспедитор;	
	КонецЕсли;
	
	Объект.Транспорт = Транспорт;
	Объект.Водитель = Водитель;
	Объект.Экспедитор = Экспедитор;
	
	
	Зап = Новый Запрос;					
	//Асеев 21.09.2020 (Задача № 4259)>>>
	//поскольку Тек.ТипЗаказа = Перечисления.ТипыЗаказов.Забор пропускается в цикле обработки, исключим запрос по заборам
	//Асеев 21.09.2020 (Задача № 4259)<<<
	Зап.Текст =
	"ВЫБРАТЬ
	|	ДанныеЗаказаВодителя.Ссылка КАК Док,
	|	ДанныеЗаказаВодителя.ВерсияДанных КАК ВерсияДанных,
	|	ДанныеЗаказаВодителя.ПометкаУдаления КАК ПометкаУдаления,
	|	ДанныеЗаказаВодителя.Номер КАК Номер,
	|	ДанныеЗаказаВодителя.Дата КАК Дата,
	|	ДанныеЗаказаВодителя.Проведен КАК Проведен,
	|	РейсЗаказы.Заказ КАК Реализация,
	|	ДанныеЗаказаВодителя.Водитель КАК Водитель,
	|	ДанныеЗаказаВодителя.Статус КАК Статус,
	|	ЕСТЬNULL(ДанныеЗаказаВодителя.ПричинаНеВыполненияДоставки, ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ПустаяСсылка)) КАК ПричинаНеВыполненияДоставки,
	|	ЕСТЬNULL(ДанныеЗаказаВодителя.ПричинаОтказаПереноса, ЗНАЧЕНИЕ(Справочник.ПричиныОтказаПереноса.ПустаяСсылка)) КАК ПричинаОтказаПереноса,
	|	ДанныеЗаказаВодителя.ДатаПереноса КАК ДатаПереноса,
	|	ДанныеЗаказаВодителя.Транспорт КАК Транспорт,
	|	новаМестнаяДоставка.Ссылка КАК Доставка,
	|	ДанныеЗаказаВодителя.Реализация.Номер КАК НомерДоставки,
	|	ВозвратТоваровОтПокупателя.Ссылка КАК Возврат,
	|	ДанныеЗаказаВодителя.ТипОплаты КАК ТипОплаты,
	|	ДанныеЗаказаВодителя.Забор КАК Забор,
	|	1 КАК Кол,
	|	ВЫБОР
	|		КОГДА ВозвратЗаказовОтВодителяДоставки.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК УжеВернули,
	|	ЕСТЬNULL(РеализацияТоваровУслуг.ЭтоДоговор, ЛОЖЬ) КАК ЭтоДоговор,
	|	РейсЗаказы.Заказ.КоличествоМест КАК КоличествоМест,
	|	ЕСТЬNULL(ДанныеЗаказаВодителя.ВозвратНаДоставку, ЛОЖЬ) КАК ВозвратНаДоставку
	|ИЗ
	|	Документ.Рейс.Заказы КАК РейсЗаказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ДанныеЗаказаВодителя КАК ДанныеЗаказаВодителя
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ БизнесПроцесс.новаМестнаяДоставка КАК новаМестнаяДоставка
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|				ПО (РеализацияТоваровУслуг.Номер = новаМестнаяДоставка.Номер)
	|			ПО ДанныеЗаказаВодителя.Реализация.Номер = новаМестнаяДоставка.Номер
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя
	|			ПО ДанныеЗаказаВодителя.Реализация.Номер = ВозвратТоваровОтПокупателя.Номер
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратЗаказовОтВодителя.Доставки КАК ВозвратЗаказовОтВодителяДоставки
	|			ПО ДанныеЗаказаВодителя.Реализация = ВозвратЗаказовОтВодителяДоставки.Доставка
	|				И (ВозвратЗаказовОтВодителяДоставки.Ссылка.Проведен)
	|				И (ВозвратЗаказовОтВодителяДоставки.Ссылка <> &СсылкаВозврат)
	|				И (ВозвратЗаказовОтВодителяДоставки.Ссылка.Дата МЕЖДУ &Дата И &ДатаОкончания)
	|				И (ВозвратЗаказовОтВодителяДоставки.ПринятНаСкладеПолностью = ИСТИНА
	|					ИЛИ ВозвратЗаказовОтВодителяДоставки.ПринятНаСкладеЧастично = ИСТИНА)
	|				И (ВозвратЗаказовОтВодителяДоставки.Ссылка.Рейс = &Ссылка)
	|		ПО РейсЗаказы.Заказ = ДанныеЗаказаВодителя.Реализация
	//|			И (ДанныеЗаказаВодителя.Дата МЕЖДУ &Дата И &ДатаОкончания)
	|			И (ДанныеЗаказаВодителя.ПометкаУдаления = ЛОЖЬ)
	//|			И (ДанныеЗаказаВодителя.Водитель = &ВыбВодитель
	//|				ИЛИ ДанныеЗаказаВодителя.Транспорт = &ВыбТранспорт)
	|			И (ДанныеЗаказаВодителя.ТипЗаказа <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор))
	//CeHbKA #3981 13.05.2020
	|			И РейсЗаказы.Ссылка = ДанныеЗаказаВодителя.Рейс
	//CeHbKA #3981 13.05.2020
	|ГДЕ
	|	РейсЗаказы.Ссылка = &Ссылка
	|	И РейсЗаказы.УдаленИзРейса = ЛОЖЬ
	|	И РейсЗаказы.Заказ ССЫЛКА Документ.РеализацияТоваровУслуг
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Зап.УстановитьПараметр("Дата", НачалоДня(Рейс.ДатаРейса));			
	
	Если ЭтоИзДокумента Тогда	
		Зап.УстановитьПараметр("ДатаОкончания", ТекущаяДата());
	Иначе 
		Зап.УстановитьПараметр("ДатаОкончания", НачалоДня(Рейс.ДатаРейса) + 86400);	
	КонецЕсли;	
	Зап.УстановитьПараметр("ВыбТранспорт", Транспорт);			
	Зап.УстановитьПараметр("ВыбВодитель", Водитель);	
	Зап.УстановитьПараметр("Ссылка", Рейс.Ссылка);
	Зап.УстановитьПараметр("СсылкаВозврат", ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка, Документы.ВозвратЗаказовОтВодителя.ПустаяСсылка()));
		
	Рез = Зап.Выполнить().Выгрузить();	
	
	Если НЕ Рез.Количество() Тогда	
		//#Если Клиент Тогда
		Сообщить("Нет данных по возвратам для рейса " + Рейс.Ссылка);
		//#КонецЕсли	
		Возврат;		
	КонецЕсли;
	
	
	Объект.ДанныеМПВодителя.Очистить();
	Объект.Доставки.Очистить();
	Объект.Товары.Очистить();
	
	МасЧаст = Новый Массив;
	
	Для Каждого Тек Из Рез Цикл	
		
		//Асеев 21.09.2020 (Задача № 4259)>>>
		//Если Тек.ТипЗаказа = Перечисления.ТипыЗаказов.Забор Тогда		
		//	Продолжить;			
		//КонецЕсли;
		//Асеев 21.09.2020 (Задача № 4259)<<<
		
		//Если Тек.УжеВернули Тогда	
		//	Продолжить;				
		//КонецЕсли;
		
		// проверка не было ли уже этой реализации
		НайТекДоставка = Объект.ДанныеМПВодителя.НайтиСтроки(Новый Структура("Доставка", Тек.Реализация));
		Если НайТекДоставка.Количество() Тогда
			Продолжить;	
		КонецЕсли;
		
		// заполняем ДанныеМПВодителя
		Нов = Объект.ДанныеМПВодителя.Добавить();
		Нов.Учитывать = Истина;
		Нов.ДанныеМП = Тек.Док;
		Нов.Доставка = Тек.Реализация;	
		
		//Асеев 28.10.2024 (Задача № 5337)>>>
		Если Тек.ВозвратНаДоставку Тогда
			Продолжить;
		КонецЕсли;
		//Асеев 28.10.2024 (Задача № 5337)<<<
		
		// Якурнов 13.09.2018 9:25:39  Проверяем на частичное выполнение заказа
		ЭтоЧастичка = ?(ЗначениеЗаполнено(Тек.Док), ПроверкаНаЧастичкуСВозвратами(Тек.Док), Ложь);			
		
		НовД = Объект.Доставки.Добавить();
		НовД.Доставка = Тек.Реализация;
		НовД.ПричинаНеВыполненияДоставки = Тек.ПричинаНеВыполненияДоставки;
		Если ЗначениеЗаполнено(Тек.Возврат) Тогда
			НовД.ВозвратТоваров = Тек.Возврат;
		КонецЕсли;		
		НовД.ЗаполненоПоДаннымБД = Истина;
		НовД.ПринятНаСкладеПолностью = Ложь;
		НовД.ПринятНаСкладеЧастично = Ложь;
		НовД.ЭтоДоговор = Тек.ЭтоДоговор;
		НовД.КоличествоМест = Тек.КоличествоМест;
		
		Если Тек.УжеВернули Тогда	
			НовД.ПринятоРанее = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Тек.ПричинаНеВыполненияДоставки) ИЛИ ЭтоЧастичка ИЛИ ЗначениеЗаполнено(Тек.Возврат) Тогда
			
			НовД.КВозврату = Истина;
			
			Если Тек.ПричинаНеВыполненияДоставки = Справочники.ПричиныНеВыполненияДоставки.ПереносДоставки 
				ИЛИ Тек.ПричинаНеВыполненияДоставки = Справочники.ПричиныНеВыполненияДоставки.ПереносСЗаездом 
				ИЛИ Тек.ПричинаНеВыполненияДоставки = Справочники.ПричиныНеВыполненияДоставки.ОтказКлиентаБезЗаезда 
				ИЛИ Тек.ПричинаНеВыполненияДоставки = Справочники.ПричиныНеВыполненияДоставки.ОтказКлиентаСЗаездом Тогда
				
				НовД.РезультатДоставки = Справочники.новаРезультатМестнойДоставки.НеВыполнена;				
			Иначе
				Если ЭтоЧастичка Тогда	
					НовД.РезультатДоставки = Справочники.новаРезультатМестнойДоставки.ВыполненаЧастично;
				ИначеЕсли ЗначениеЗаполнено(Тек.Возврат) Тогда	
					НовД.РезультатДоставки = Справочники.новаРезультатМестнойДоставки.Выполнена;
				Иначе
					НовД.РезультатДоставки = Справочники.новаРезультатМестнойДоставки.НеВыполнена;					
				КонецЕсли;									
			КонецЕсли;
			
			Если НовД.РезультатДоставки = Справочники.новаРезультатМестнойДоставки.ВыполненаЧастично 
				//Асеев 24.03.2021 (по письму Отказ с заездом)>>>
				//ИЛИ НовД.ПричинаНеВыполненияДоставки = Справочники.ПричиныНеВыполненияДоставки.ОтказКлиентаСЗаездом Тогда
				Тогда
				//Асеев 24.03.2021 (по письму Отказ с заездом)<<<
				
				НовД.ТипВозврата = Справочники.СтатусыСкладскогоУчета.Возврат2;	
				НовД.Вскрытый = Истина;
				
			ИначеЕсли НовД.РезультатДоставки = Справочники.новаРезультатМестнойДоставки.НеВыполнена 
				И (Тек.ПричинаНеВыполненияДоставки = Справочники.ПричиныНеВыполненияДоставки.ОтказКлиентаБезЗаезда 
				ИЛИ Тек.ПричинаНеВыполненияДоставки = Справочники.ПричиныНеВыполненияДоставки.ОтказКлиентаСЗаездом) Тогда
				
				НовД.ТипВозврата = Справочники.СтатусыСкладскогоУчета.Возврат1;
				НовД.Вскрытый = Ложь;
				
			КонецЕсли;
		Иначе
			//Асеев 24.09.2020 (Задача № 4271)>>>
			НовД.РезультатДоставки = Справочники.новаРезультатМестнойДоставки.Выполнена;
			//Асеев 24.09.2020 (Задача № 4271)<<<
		КонецЕсли;	
		
	КонецЦикла;	
	
	
	
	// заполним ТЧ товары	
	Для каждого Стр Из Объект.Доставки Цикл	
		
		// Якурнов 13.09.2018 13:53:29 Сначала проверяем на Частичную Отгрузку
		// то что не отгрузили клиенту
		БезЧастичнойОтгрузкиИВозвратов = Истина;
		
		Если Стр.РезультатДоставки = Справочники.новаРезультатМестнойДоставки.ВыполненаЧастично Тогда
			
			ЗапросЧастичка = Новый Запрос("ВЫБРАТЬ
			|	ДанныеЗаказаВодителяДоставленныеТовары.Номенклатура КАК Номенклатура,
			//Асеев 25.08.2020>>>
			|	ДанныеЗаказаВодителяДоставленныеТовары.КодМаркировки КАК КодМаркировки,
			//Асеев 25.08.2020<<<
			|	СУММА(ДанныеЗаказаВодителяДоставленныеТовары.КоличествоДоставлено) КАК КоличествоДоставлено
			|ПОМЕСТИТЬ ВТ_Данные
			|ИЗ
			|	Документ.ДанныеЗаказаВодителя.ДоставленныеТовары КАК ДанныеЗаказаВодителяДоставленныеТовары
			|ГДЕ
			|	ДанныеЗаказаВодителяДоставленныеТовары.Ссылка = &СсылкаМП
			|
			|СГРУППИРОВАТЬ ПО
			|	ДанныеЗаказаВодителяДоставленныеТовары.Номенклатура,
			//Асеев 25.08.2020>>>
			|	ДанныеЗаказаВодителяДоставленныеТовары.КодМаркировки
			//Асеев 25.08.2020<<<
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
			|	СУММА(РеализацияТоваровУслугТовары.Количество) КАК Количество,
			|	РеализацияТоваровУслугТовары.ШтрихкодНоменклатуры КАК ШтрихкодНоменклатуры
			//CeHbKA #4073 06.07.2020
			|	,РеализацияТоваровУслугТовары.КодМаркировки КАК КодМаркировки
			//CeHbKA #4073 06.07.2020
			|ПОМЕСТИТЬ ВТ_Реализация
			|ИЗ
			|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
			|ГДЕ
			|	РеализацияТоваровУслугТовары.Ссылка = &СсылкаРеализация
			|
			|СГРУППИРОВАТЬ ПО
			|	РеализацияТоваровУслугТовары.Номенклатура,
			|	РеализацияТоваровУслугТовары.ШтрихкодНоменклатуры
			//CeHbKA #4073 06.07.2020
			|	,РеализацияТоваровУслугТовары.КодМаркировки
			//CeHbKA #4073 06.07.2020
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура,
			|	СУММА(РеализацияТоваровУслугПодарочныеПозиции.Количество),
			|	РеализацияТоваровУслугПодарочныеПозиции.ШтрихкодНоменклатуры
			//CeHbKA #4073 06.07.2020
			|	,РеализацияТоваровУслугПодарочныеПозиции.КодМаркировки
			//CeHbKA #4073 06.07.2020
			|ИЗ
			|	Документ.РеализацияТоваровУслуг.ПодарочныеПозиции КАК РеализацияТоваровУслугПодарочныеПозиции
			|ГДЕ
			|	РеализацияТоваровУслугПодарочныеПозиции.Ссылка = &СсылкаРеализация
			|
			|СГРУППИРОВАТЬ ПО
			|	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура,
			|	РеализацияТоваровУслугПодарочныеПозиции.ШтрихкодНоменклатуры
			//CeHbKA #4073 06.07.2020
			|	,РеализацияТоваровУслугПодарочныеПозиции.КодМаркировки
			//CeHbKA #4073 06.07.2020
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_Данные.Номенклатура КАК Номенклатура,
			|	ВТ_Реализация.Количество - ВТ_Данные.КоличествоДоставлено КАК КоличествоНеДоставлено,
			|	ВТ_Реализация.ШтрихкодНоменклатуры КАК ШтрихкодНоменклатуры
			//CeHbKA #4073 06.07.2020
			|	,ВТ_Реализация.КодМаркировки
			//CeHbKA #4073 06.07.2020
			|ИЗ
			|	ВТ_Данные КАК ВТ_Данные
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Реализация КАК ВТ_Реализация
			|		ПО ВТ_Данные.Номенклатура = ВТ_Реализация.Номенклатура
			//Асеев 25.08.2020>>>
			|			И ВТ_Данные.КодМаркировки = ВТ_Реализация.КодМаркировки
			//Асеев 25.08.2020<<<
			|ГДЕ
			|	НЕ ВТ_Данные.Номенклатура В
			|				(ВЫБРАТЬ
			|					ВозвратТоваровОтПокупателяТовары.Номенклатура КАК Номенклатура
			|				ИЗ
			|					Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
			|				ГДЕ
			|					ВозвратТоваровОтПокупателяТовары.Ссылка = &СсылкаНаВозврат)");
			
			ДанныеМПМассив = Объект.ДанныеМПВодителя.НайтиСтроки(Новый Структура("Доставка", Стр.Доставка));	
			Если ДанныеМПМассив.Количество()>0 Тогда
				
				СсылкаМП = ДанныеМПМассив[0].ДанныеМП;	
				ЗапросЧастичка.УстановитьПараметр("СсылкаМП", СсылкаМП);
				ЗапросЧастичка.УстановитьПараметр("СсылкаРеализация", Стр.Доставка);
				ЗапросЧастичка.УстановитьПараметр("СсылкаНаВозврат", Стр.ВозвратТоваров);
				РезЧастичка = ЗапросЧастичка.Выполнить().Выгрузить();
				
				Для каждого СтрТ Из РезЧастичка Цикл
					
					Если СтрТ.КоличествоНеДоставлено = NULL Тогда
						Продолжить;	
					КонецЕсли;
					
					Если СтрТ.КоличествоНеДоставлено > 0 Тогда
						
						НовТ = Объект.Товары.Добавить();
						НовТ.Доставка = Стр.Доставка;
						НовТ.Номенклатура = СтрТ.Номенклатура;
						НовТ.Количество = СтрТ.КоличествоНеДоставлено;
						НовТ.ШтрихкодНоменклатуры = СтрТ.ШтрихкодНоменклатуры;
						
						Если ЗначениеЗаполнено(СтрТ.ШтрихкодНоменклатуры) Тогда
							НовТ.Штрихкод = СокрЛП(Строка(СтрТ.ШтрихкодНоменклатуры.Код));	
						КонецЕсли;				
						
						Если Стр.ПринятоРанее Тогда					
							НовТ.ПринятНаСкладе = Истина;			
						Иначе
							НовТ.ПринятНаСкладе = Ложь;	
						КонецЕсли;
						
						//CeHbKA #4073 06.07.2020
						Если ЗначениеЗаполнено(СтрТ.КодМаркировки) Тогда
							НовТ.КодМаркировки = СокрЛП(СтрТ.КодМаркировки);
						КонецЕсли;
						//CeHbKA #4073 06.07.2020

					КонецЕсли;	
					БезЧастичнойОтгрузкиИВозвратов = Ложь;
					
				КонецЦикла;			
				
			КонецЕсли;
		КонецЕсли;
		
		// Якурнов 13.09.2018 13:53:29 проверяем на Возвраты
		// то что идет по документу
		
		//Асеев 01.12.2021 (по письму Приемка Экипажа)>>>
		//Если ЗначениеЗаполнено(Стр.ВозвратТоваров) Тогда
		Если ЗначениеЗаполнено(Стр.ВозвратТоваров) И Не ЗначениеЗаполнено(Стр.ПричинаНеВыполненияДоставки) Тогда
		//Асеев 01.12.2021 (по письму Приемка Экипажа)<<<
			
			ЗапросВозвраты = Новый Запрос("ВЫБРАТЬ
			|	ВозвратТоваровОтПокупателяТовары.Номенклатура КАК Номенклатура,
			|	ВозвратТоваровОтПокупателяТовары.Количество КАК Количество,
			|	ВозвратТоваровОтПокупателяТовары.Цена КАК Цена,
			|	ВозвратТоваровОтПокупателяТовары.Сумма КАК Сумма,
			|	ВозвратТоваровОтПокупателяТовары.ШтрихкодНоменклатуры КАК ШтрихкодНоменклатуры
			//CeHbKA #4073 06.07.2020
			|	,ВозвратТоваровОтПокупателяТовары.КодМаркировки КАК КодМаркировки
			//CeHbKA #4073 06.07.2020
			|ИЗ
			|	Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
			|ГДЕ
			|	ВозвратТоваровОтПокупателяТовары.Ссылка = &Ссылка");
			ЗапросВозвраты.УстановитьПараметр("Ссылка", Стр.ВозвратТоваров);
			РезВозвраты = ЗапросВозвраты.Выполнить().Выгрузить();
			
			Для каждого Тек Из РезВозвраты Цикл
				
				НовТ = Объект.Товары.Добавить();
				НовТ.Доставка = Стр.Доставка;
				НовТ.Номенклатура = Тек.Номенклатура;
				НовТ.Количество = Тек.Количество;
				НовТ.Цена = Тек.Цена;
				НовТ.Сумма = Тек.Сумма;
				НовТ.КоличествоИсходное = Тек.Количество;
				НовТ.ШтрихкодНоменклатуры = Тек.ШтрихкодНоменклатуры;
				
				Если ЗначениеЗаполнено(Тек.ШтрихкодНоменклатуры) Тогда
					НовТ.Штрихкод = СокрЛП(Строка(Тек.ШтрихкодНоменклатуры.Код));	
				КонецЕсли;				
				
				Если Стр.ПринятоРанее Тогда					
					НовТ.ПринятНаСкладе = Истина;			
				Иначе
					НовТ.ПринятНаСкладе = Ложь;	
				КонецЕсли;
				
				//CeHbKA #4073 06.07.2020
				Если ЗначениеЗаполнено(Тек.КодМаркировки) Тогда
					НовТ.КодМаркировки = СокрЛП(Тек.КодМаркировки);
				КонецЕсли;
				//CeHbKA #4073 06.07.2020
				
			КонецЦикла;
			БезЧастичнойОтгрузкиИВозвратов = Ложь;
		КонецЕсли;
		
		// Якурнов 13.09.2018 13:53:29 если нет никаких отклонений по Заказу то просто заполняем в обычном режиме
		// то что идет по документу
		
		Если БезЧастичнойОтгрузкиИВозвратов Тогда
			
			Запрос = Новый Запрос("ВЫБРАТЬ
			|	ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
			|	ПоступлениеТоваровУслугТовары.Количество КАК Количество,
			|	ПоступлениеТоваровУслугТовары.Цена КАК Цена,
			|	ПоступлениеТоваровУслугТовары.Сумма КАК Сумма,
			|	УслугиПоЗаказам.Ссылка КАК Ссылка,
			|	ПоступлениеТоваровУслугТовары.ШтрихкодНоменклатуры КАК ШтрихкодНоменклатуры
			//CeHbKA #4073 06.07.2020
			|	,ПоступлениеТоваровУслугТовары.КодМаркировки КАК КодМаркировки
			//CeHbKA #4073 06.07.2020
			|ПОМЕСТИТЬ ВТ
			|ИЗ
			|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
			|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УслугиПоЗаказам КАК УслугиПоЗаказам
			|			ПО ПоступлениеТоваровУслугТовары.Номенклатура.Артикул = УслугиПоЗаказам.Артикул
			|				И ПоступлениеТоваровУслугТовары.Ссылка.Контрагент = УслугиПоЗаказам.Владелец
			|		ПО РеализацияТоваровУслуг.Номер = ПоступлениеТоваровУслугТовары.Ссылка.Номер
			|ГДЕ
			|	РеализацияТоваровУслуг.Ссылка = &РеализацияСсылка
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ПоступлениеТоваровУслугПодарочныеПозиции.Номенклатура,
			|	ПоступлениеТоваровУслугПодарочныеПозиции.Количество,
			|	ПоступлениеТоваровУслугПодарочныеПозиции.Цена,
			|	ПоступлениеТоваровУслугПодарочныеПозиции.Сумма,
			|	УслугиПоЗаказам.Ссылка,
			|	ПоступлениеТоваровУслугПодарочныеПозиции.ШтрихкодНоменклатуры
			//CeHbKA #4073 06.07.2020
			|	,"""" КАК КодМаркировки
			//CeHbKA #4073 06.07.2020
			|ИЗ
			|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.ПодарочныеПозиции КАК ПоступлениеТоваровУслугПодарочныеПозиции
			|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УслугиПоЗаказам КАК УслугиПоЗаказам
			|			ПО ПоступлениеТоваровУслугПодарочныеПозиции.Номенклатура.Артикул = УслугиПоЗаказам.Артикул
			|				И ПоступлениеТоваровУслугПодарочныеПозиции.Ссылка.Контрагент = УслугиПоЗаказам.Владелец
			|		ПО РеализацияТоваровУслуг.Номер = ПоступлениеТоваровУслугПодарочныеПозиции.Ссылка.Номер
			|ГДЕ
			|	РеализацияТоваровУслуг.Ссылка = &РеализацияСсылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ПоступлениеТоваровУслугПодарочныеПозиции.Номенклатура,
			|	ПоступлениеТоваровУслугПодарочныеПозиции.Цена,
			|	ПоступлениеТоваровУслугПодарочныеПозиции.ШтрихкодНоменклатуры,
			|	УслугиПоЗаказам.Ссылка,
			|	ПоступлениеТоваровУслугПодарочныеПозиции.Количество,
			|	ПоступлениеТоваровУслугПодарочныеПозиции.Сумма
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ.Номенклатура КАК Номенклатура,
			|	ВТ.Количество КАК Количество,
			|	ВТ.Цена КАК Цена,
			|	ВТ.ШтрихкодНоменклатуры КАК ШтрихкодНоменклатуры,
			|	ВТ.Сумма КАК Сумма
			//CeHbKA #4073 06.07.2020
			|	,ВТ.КодМаркировки КАК КодМаркировки
			//CeHbKA #4073 06.07.2020
			|ИЗ
			|	ВТ КАК ВТ
			|ГДЕ
			|	ВТ.Ссылка ЕСТЬ NULL
			|	И НЕ ВТ.Номенклатура ЕСТЬ NULL");
			Запрос.УстановитьПараметр("РеализацияСсылка", Стр.Доставка);
			
			Рез = Запрос.Выполнить().Выгрузить();
			
			Для каждого Тек Из Рез Цикл
				
				НовТ = Объект.Товары.Добавить();
				НовТ.Доставка = Стр.Доставка;
				НовТ.Номенклатура = Тек.Номенклатура;
				НовТ.Количество = Тек.Количество;
				НовТ.Цена = Тек.Цена;
				НовТ.Сумма = Тек.Сумма;
				НовТ.КоличествоИсходное = Тек.Количество;
				НовТ.ШтрихкодНоменклатуры = Тек.ШтрихкодНоменклатуры;
				
				Если ЗначениеЗаполнено(Тек.ШтрихкодНоменклатуры) Тогда
					НовТ.Штрихкод = СокрЛП(Строка(Тек.ШтрихкодНоменклатуры.Код));	
				КонецЕсли;				
				
				Если Стр.ПринятоРанее Тогда					
					НовТ.ПринятНаСкладе = Истина;			
				Иначе
					НовТ.ПринятНаСкладе = Ложь;	
				КонецЕсли;
				
				//CeHbKA #4073 06.07.2020
				Если ЗначениеЗаполнено(Тек.КодМаркировки) Тогда
					НовТ.КодМаркировки = СокрЛП(Тек.КодМаркировки);
				КонецЕсли;
				//CeHbKA #4073 06.07.2020
				
			КонецЦикла;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	
	
	Если НЕ Объект.Доставки.Количество() Тогда
		
		#Если Клиент Тогда	
			ПоказатьПредупреждение(, "По рейсу №" + рейс.Номер + " Заказы к возврату отсутствуют");
		#КонецЕсли	
		
	КонецЕсли;
	
	Записать();
	
	МассивЗаказов = ЭтотОбъект.Доставки.Выгрузить(, "Доставка");
	ЗаполнитьШтрихкоды(МассивЗаказов);
	
	ЗаполнитьМестаДоставкиНаСервере();
	
	Для каждого Ст Из Доставки Цикл	
		Если Ст.КВозврату И Ст.ТипВозврата = ПредопределенноеЗначение("Справочник.СтатусыСкладскогоУчета.Возврат2") Тогда
			Ст.БылоВскрытиеЗаказа = Истина;		
		КонецЕсли;
	КонецЦикла;	
	
	Записать();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоРейсуНаСервереСтарая(Объект, ЭтоИзДокумента = Истина) Экспорт 

	Мас = Объект.Рейс.Заказы.ВыгрузитьКолонку("Заказ");	
	Транспорт = Неопределено;
	Водитель = Неопределено;	
	рейс = Объект.Рейс;	 
	
	ЗапросПоРейсу = Новый Запрос("ВЫБРАТЬ
	                             |	ПривязкаМашинКРейсамСрезПоследних.Период,
	                             |	ПривязкаМашинКРейсамСрезПоследних.Рейс,
	                             |	ПривязкаМашинКРейсамСрезПоследних.Транспорт,
	                             |	ПривязкаМашинКРейсамСрезПоследних.Водитель,
	                             |	ПривязкаМашинКРейсамСрезПоследних.Экспедитор,
	                             |	ПривязкаМашинКРейсамСрезПоследних.КтоПривязал
	                             |ИЗ
	                             |	РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних КАК ПривязкаМашинКРейсамСрезПоследних
	                             |ГДЕ
	                             |	ПривязкаМашинКРейсамСрезПоследних.Рейс = &Рейс");
	ЗапросПоРейсу.УстановитьПараметр("Рейс", Рейс);	
	РезРейс = ЗапросПоРейсу.Выполнить().Выбрать();
	Если РезРейс.Следующий() Тогда	
		Транспорт = РезРейс.Транспорт;
		Водитель = РезРейс.Водитель;
		Экспедитор = РезРейс.Экспедитор;	
	КонецЕсли;
	
	Объект.Транспорт = Транспорт;
	Объект.Водитель = Водитель;
	Объект.Экспедитор = Экспедитор;
	
	
	Зап = Новый Запрос;					
	Зап.Текст = "ВЫБРАТЬ
	            |	ДанныеЗаказаВодителя.Ссылка КАК Док,
	            |	ДанныеЗаказаВодителя.ВерсияДанных КАК ВерсияДанных,
	            |	ДанныеЗаказаВодителя.ПометкаУдаления КАК ПометкаУдаления,
	            |	ДанныеЗаказаВодителя.Номер КАК Номер,
	            |	ДанныеЗаказаВодителя.Дата КАК Дата,
	            |	ДанныеЗаказаВодителя.Проведен КАК Проведен,
	            |	РейсЗаказы.Заказ КАК Реализация,
	            |	ДанныеЗаказаВодителя.Водитель КАК Водитель,
	            |	ДанныеЗаказаВодителя.Статус КАК Статус,
	            |	ЕСТЬNULL(ДанныеЗаказаВодителя.ПричинаНеВыполненияДоставки, ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ПустаяСсылка)) КАК ПричинаНеВыполненияДоставки,
	            |	ЕСТЬNULL(ДанныеЗаказаВодителя.ПричинаОтказаПереноса, ЗНАЧЕНИЕ(Справочник.ПричиныОтказаПереноса.ПустаяСсылка)) КАК ПричинаОтказаПереноса,
	            |	ДанныеЗаказаВодителя.ДатаПереноса КАК ДатаПереноса,
	            |	ДанныеЗаказаВодителя.Транспорт КАК Транспорт,
	            |	ДанныеЗаказаВодителя.ДоставленныеТовары.(
	            |		Ссылка КАК Ссылка,
	            |		НомерСтроки КАК НомерСтроки,
	            |		Номенклатура КАК Номенклатура,
	            |		КоличествоДоставлено КАК КоличествоДоставлено
	            |	) КАК ДоставленныеТовары,
	            |	новаМестнаяДоставка.Ссылка КАК Доставка,
	            |	ДанныеЗаказаВодителя.Реализация.Номер КАК НомерДоставки,
	            |	ВозвратТоваровОтПокупателя.Ссылка КАК Возврат,
	            |	ДанныеЗаказаВодителя.ТипОплаты КАК ТипОплаты,
	            |	ВЫБОР
	            |		КОГДА РейсЗаказы.Заказ ССЫЛКА Документ.РеализацияТоваровУслуг
	            |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
	            |		КОГДА РейсЗаказы.Заказ ССЫЛКА Документ.ЗаборТовара
	            |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор)
	            |	КОНЕЦ КАК ТипЗаказа,
	            |	ДанныеЗаказаВодителя.Забор КАК Забор,
	            |	1 КАК Кол,
	            |	ВЫБОР
	            |		КОГДА ВозвратЗаказовОтВодителяДоставки.Ссылка ЕСТЬ NULL
	            |			ТОГДА ЛОЖЬ
	            |		ИНАЧЕ ИСТИНА
	            |	КОНЕЦ КАК УжеВернули,
	            |	ЕСТЬNULL(РеализацияТоваровУслуг.ЭтоДоговор, ЛОЖЬ) КАК ЭтоДоговор,
	            |	РейсЗаказы.Заказ.КоличествоМест КАК КоличествоМест
	            |ИЗ
	            |	Константа.ОсновнойТипПривязкиТелефонов КАК ОсновнойТипПривязкиТелефонов,
	            |	Документ.Рейс.Заказы КАК РейсЗаказы
	            |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ДанныеЗаказаВодителя КАК ДанныеЗаказаВодителя
	            |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ БизнесПроцесс.новаМестнаяДоставка КАК новаМестнаяДоставка
	            |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	            |				ПО (РеализацияТоваровУслуг.Номер = новаМестнаяДоставка.Номер)
	            |			ПО ДанныеЗаказаВодителя.Реализация.Номер = новаМестнаяДоставка.Номер
	            |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя
	            |			ПО ДанныеЗаказаВодителя.Реализация.Номер = ВозвратТоваровОтПокупателя.Номер
	            |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратЗаказовОтВодителя.Доставки КАК ВозвратЗаказовОтВодителяДоставки
	            |			ПО ДанныеЗаказаВодителя.Реализация = ВозвратЗаказовОтВодителяДоставки.Доставка
	            |				И (ВозвратЗаказовОтВодителяДоставки.Ссылка.Проведен)
	            |				И (ВозвратЗаказовОтВодителяДоставки.Ссылка.Ссылка <> &СсылкаВозврат)
	            |				И (ВозвратЗаказовОтВодителяДоставки.Ссылка.Дата МЕЖДУ &Дата И &ДатаОкончания)
	            |				И (ВозвратЗаказовОтВодителяДоставки.ПринятНаСкладеПолностью = ИСТИНА
	            |					ИЛИ ВозвратЗаказовОтВодителяДоставки.ПринятНаСкладеЧастично = ИСТИНА)
	            |				И (ВозвратЗаказовОтВодителяДоставки.Ссылка.Рейс = &Ссылка)
	            |		ПО РейсЗаказы.Заказ = ДанныеЗаказаВодителя.Реализация
	            |			И (ДанныеЗаказаВодителя.Дата МЕЖДУ &Дата И &ДатаОкончания)
	            |			И (ДанныеЗаказаВодителя.Проведен = ИСТИНА)
	            |			И (ДанныеЗаказаВодителя.Водитель = &ВыбВодитель
	            |				ИЛИ ДанныеЗаказаВодителя.Транспорт = &ВыбТранспорт)
	            |			И (ДанныеЗаказаВодителя.ТипЗаказа <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор))
	            |ГДЕ
	            |	РейсЗаказы.Ссылка.Ссылка = &Ссылка
	            |	И РейсЗаказы.УдаленИзРейса = ЛОЖЬ
	            |	И РейсЗаказы.Заказ ССЫЛКА Документ.РеализацияТоваровУслуг
	            |
	            |ОБЪЕДИНИТЬ ВСЕ
	            |
	            |ВЫБРАТЬ
	            |	ДанныеЗаказаВодителя.Ссылка,
	            |	ДанныеЗаказаВодителя.ВерсияДанных,
	            |	ДанныеЗаказаВодителя.ПометкаУдаления,
	            |	ДанныеЗаказаВодителя.Номер,
	            |	ДанныеЗаказаВодителя.Дата,
	            |	ДанныеЗаказаВодителя.Проведен,
	            |	РейсЗаказы.Заказ,
	            |	ДанныеЗаказаВодителя.Водитель,
	            |	ДанныеЗаказаВодителя.Статус,
	            |	ЕСТЬNULL(ДанныеЗаказаВодителя.ПричинаНеВыполненияДоставки, ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ПустаяСсылка)),
	            |	ЕСТЬNULL(ДанныеЗаказаВодителя.ПричинаОтказаПереноса, ЗНАЧЕНИЕ(Справочник.ПричиныОтказаПереноса.ПустаяСсылка)),
	            |	ДанныеЗаказаВодителя.ДатаПереноса,
	            |	ДанныеЗаказаВодителя.Транспорт,
	            |	ДанныеЗаказаВодителя.ДоставленныеТовары.(
	            |		Ссылка,
	            |		НомерСтроки,
	            |		Номенклатура,
	            |		КоличествоДоставлено
	            |	),
	            |	NULL,
	            |	ДанныеЗаказаВодителя.Реализация.Номер,
	            |	NULL,
	            |	ДанныеЗаказаВодителя.ТипОплаты,
	            |	ВЫБОР
	            |		КОГДА РейсЗаказы.Заказ ССЫЛКА Документ.РеализацияТоваровУслуг
	            |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
	            |		КОГДА РейсЗаказы.Заказ ССЫЛКА Документ.ЗаборТовара
	            |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор)
	            |	КОНЕЦ,
	            |	ДанныеЗаказаВодителя.Забор,
	            |	1,
	            |	ВЫБОР
	            |		КОГДА ВозвратЗаказовОтВодителяДоставки.Ссылка ЕСТЬ NULL
	            |			ТОГДА ЛОЖЬ
	            |		ИНАЧЕ ИСТИНА
	            |	КОНЕЦ,
	            |	ЛОЖЬ,
	            |	0
	            |ИЗ
	            |	Константа.ОсновнойТипПривязкиТелефонов КАК ОсновнойТипПривязкиТелефонов,
	            |	Документ.Рейс.Заказы КАК РейсЗаказы
	            |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ДанныеЗаказаВодителя КАК ДанныеЗаказаВодителя
	            |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратЗаказовОтВодителя.Доставки КАК ВозвратЗаказовОтВодителяДоставки
	            |			ПО ДанныеЗаказаВодителя.Реализация = ВозвратЗаказовОтВодителяДоставки.Доставка
	            |				И (ВозвратЗаказовОтВодителяДоставки.Ссылка.Проведен)
	            |				И (ВозвратЗаказовОтВодителяДоставки.Ссылка.Ссылка <> &СсылкаВозврат)
	            |				И (ВозвратЗаказовОтВодителяДоставки.Ссылка.Дата МЕЖДУ &Дата И &ДатаОкончания)
	            |				И (ВозвратЗаказовОтВодителяДоставки.ПринятНаСкладеПолностью = ИСТИНА
	            |					ИЛИ ВозвратЗаказовОтВодителяДоставки.ПринятНаСкладеЧастично = ИСТИНА)
	            |				И (ВозвратЗаказовОтВодителяДоставки.Ссылка.Рейс = &Ссылка)
	            |		ПО РейсЗаказы.Заказ = ДанныеЗаказаВодителя.Реализация
	            |			И (ДанныеЗаказаВодителя.Проведен = ИСТИНА)
	            |			И (ДанныеЗаказаВодителя.Дата МЕЖДУ &Дата И &ДатаОкончания)
	            |			И (ДанныеЗаказаВодителя.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор))
	            |			И (ДанныеЗаказаВодителя.Водитель = &ВыбВодитель
	            |				ИЛИ ДанныеЗаказаВодителя.Транспорт = &ВыбТранспорт)
	            |ГДЕ
	            |	РейсЗаказы.Ссылка.Ссылка = &Ссылка
	            |	И РейсЗаказы.УдаленИзРейса = ЛОЖЬ
	            |	И РейсЗаказы.Заказ ССЫЛКА Документ.ЗаборТовара
	            |
	            |УПОРЯДОЧИТЬ ПО
	            |	Дата УБЫВ";
				
	Зап.УстановитьПараметр("Дата", НачалоДня(Рейс.ДатаРейса));			
	//Зап.УстановитьПараметр("ДатаОкончания", НачалоДня(Рейс.Дата) + 86400);	
	
	Если ЭтоИзДокумента Тогда	
		Зап.УстановитьПараметр("ДатаОкончания", ТекущаяДата());
	Иначе 
		Зап.УстановитьПараметр("ДатаОкончания", НачалоДня(Рейс.ДатаРейса) + 86400);	
	КонецЕсли;	
	Зап.УстановитьПараметр("ВыбТранспорт", Транспорт);			
	Зап.УстановитьПараметр("ВыбВодитель", Водитель);	
	Зап.УстановитьПараметр("Ссылка", Рейс.Ссылка);
	Зап.УстановитьПараметр("СсылкаВозврат", ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка, Документы.ВозвратЗаказовОтВодителя.ПустаяСсылка()));
	
	
	Рез = Зап.Выполнить().Выгрузить();	
	
	Если НЕ Рез.Количество() Тогда	
		//#Если Клиент Тогда
			Сообщить("Нет данных по возвратам для рейса " + Рейс.Ссылка);
		//#КонецЕсли	
		Возврат;		
	КонецЕсли;
	
	
	Объект.ДанныеМПВодителя.Очистить();
	Объект.Доставки.Очистить();
	Объект.Товары.Очистить();
	
	МасЧаст = Новый Массив;
	
	Для Каждого Тек Из Рез Цикл	
		
		Если Тек.ТипЗаказа = Перечисления.ТипыЗаказов.Забор Тогда		
			Продолжить;			
		КонецЕсли;
		
		//Если Тек.УжеВернули Тогда	
		//	Продолжить;				
		//КонецЕсли;
		
		// проверка не было ли уже этой реализации
		НайТекДоставка = Объект.ДанныеМПВодителя.НайтиСтроки(Новый Структура("Доставка", Тек.Реализация));
		Если НайТекДоставка.Количество() Тогда
			Продолжить;	
		КонецЕсли;
		
		// заполняем ДанныеМПВодителя
		Нов = Объект.ДанныеМПВодителя.Добавить();
		Нов.Учитывать = Истина;
		Нов.ДанныеМП = Тек.Док;
		Нов.Доставка = Тек.Реализация;	
		
		Если ЗначениеЗаполнено(Тек.Возврат) Тогда		
			ЭтоЧастичка = Ложь;		
		Иначе		
			ЭтоЧастичка = ?(ЗначениеЗаполнено(Тек.Док), ПроверкаНаЧастичку(Тек.Док), Ложь);			
		КонецЕсли;
			
		//Если ЗначениеЗаполнено(Тек.ПричинаНеВыполненияДоставки) ИЛИ ЭтоЧастичка ИЛИ ЗначениеЗаполнено(Тек.Возврат) Тогда	
			
		НовД = Объект.Доставки.Добавить();
		НовД.Доставка = Тек.Реализация;
		НовД.ПричинаНеВыполненияДоставки = Тек.ПричинаНеВыполненияДоставки;
		Если ЗначениеЗаполнено(Тек.Возврат) Тогда
			НовД.ВозвратТоваров = Тек.Возврат;
		КонецЕсли;		
		НовД.ЗаполненоПоДаннымБД = Истина;
		НовД.ПринятНаСкладеПолностью = Ложь;
		НовД.ПринятНаСкладеЧастично = Ложь;
		НовД.ЭтоДоговор = Тек.ЭтоДоговор;
		НовД.КоличествоМест = Тек.КоличествоМест;
		
		Если Тек.УжеВернули Тогда	
			НовД.ПринятоРанее = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Тек.ПричинаНеВыполненияДоставки) ИЛИ ЭтоЧастичка ИЛИ ЗначениеЗаполнено(Тек.Возврат) Тогда
			
			НовД.КВозврату = Истина;

			Если Тек.ПричинаНеВыполненияДоставки = Справочники.ПричиныНеВыполненияДоставки.ПереносДоставки 
				ИЛИ Тек.ПричинаНеВыполненияДоставки = Справочники.ПричиныНеВыполненияДоставки.ПереносСЗаездом 
				ИЛИ Тек.ПричинаНеВыполненияДоставки = Справочники.ПричиныНеВыполненияДоставки.ОтказКлиентаБезЗаезда 
				ИЛИ Тек.ПричинаНеВыполненияДоставки = Справочники.ПричиныНеВыполненияДоставки.ОтказКлиентаСЗаездом Тогда
				
					НовД.РезультатДоставки = Справочники.новаРезультатМестнойДоставки.НеВыполнена;				
			Иначе
				Если ЭтоЧастичка Тогда	
					НовД.РезультатДоставки = Справочники.новаРезультатМестнойДоставки.ВыполненаЧастично;
				ИначеЕсли ЗначениеЗаполнено(Тек.Возврат) Тогда	
					НовД.РезультатДоставки = Справочники.новаРезультатМестнойДоставки.Выполнена;
				Иначе
					НовД.РезультатДоставки = Справочники.новаРезультатМестнойДоставки.НеВыполнена;					
				КонецЕсли;									
			КонецЕсли;
			
			// МАС - 23.10.2017 - № --->> 
			Если НовД.РезультатДоставки = Справочники.новаРезультатМестнойДоставки.ВыполненаЧастично 
				ИЛИ НовД.ПричинаНеВыполненияДоставки = Справочники.ПричиныНеВыполненияДоставки.ОтказКлиентаСЗаездом Тогда
		
				НовД.ТипВозврата = Справочники.СтатусыСкладскогоУчета.Возврат2;	
				НовД.Вскрытый = Истина;
		
			ИначеЕсли НовД.РезультатДоставки = Справочники.новаРезультатМестнойДоставки.НеВыполнена 
				И (Тек.ПричинаНеВыполненияДоставки = Справочники.ПричиныНеВыполненияДоставки.ОтказКлиентаБезЗаезда 
				ИЛИ Тек.ПричинаНеВыполненияДоставки = Справочники.ПричиныНеВыполненияДоставки.ОтказКлиентаСЗаездом) Тогда
			
				НовД.ТипВозврата = Справочники.СтатусыСкладскогоУчета.Возврат1;
				НовД.Вскрытый = Ложь;
			
			КонецЕсли;
			// <<--- МАС 		
			
		
		КонецЕсли;	
				
	КонецЦикла;	
	
	
	
	// заполним ТЧ товары	
	Для каждого Стр Из Объект.Доставки Цикл	
		
		// ------------- Частичный возврат
		Если ЗначениеЗаполнено(Стр.ВозвратТоваров) Тогда
					
			
			ЗапросВозвраты = Новый Запрос("ВЫБРАТЬ
			                              |	ВозвратТоваровОтПокупателяТовары.Номенклатура КАК Номенклатура,
			                              |	ВозвратТоваровОтПокупателяТовары.Количество КАК Количество,
			                              |	ВозвратТоваровОтПокупателяТовары.Цена КАК Цена,
			                              |	ВозвратТоваровОтПокупателяТовары.Сумма КАК Сумма,
//+++ БАО 09.10.2017 №1920							  
			                              |	ВозвратТоваровОтПокупателяТовары.ШтрихкодНоменклатуры КАК ШтрихкодНоменклатуры
//--- БАО 09.10.2017 №1920							  
			                              |ИЗ
			                              |	Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
			                              |ГДЕ
			                              |	ВозвратТоваровОтПокупателяТовары.Ссылка = &Ссылка");
			ЗапросВозвраты.УстановитьПараметр("Ссылка", Стр.ВозвратТоваров);
			РезВозвраты = ЗапросВозвраты.Выполнить().Выгрузить();
			
			Для каждого Тек Из РезВозвраты Цикл
				
				НовТ = Объект.Товары.Добавить();
				НовТ.Доставка = Стр.Доставка;
				НовТ.Номенклатура = Тек.Номенклатура;
				НовТ.Количество = Тек.Количество;
				НовТ.Цена = Тек.Цена;
				НовТ.Сумма = Тек.Сумма;
				НовТ.КоличествоИсходное = Тек.Количество;
//+++ БАО 09.10.2017 №1920
				НовТ.ШтрихкодНоменклатуры = Тек.ШтрихкодНоменклатуры;
//--- БАО 09.10.2017 №1920

				// МАС - 23.05.2018 - № --->> 
				Если ЗначениеЗаполнено(Тек.ШтрихкодНоменклатуры) Тогда
					НовТ.Штрихкод = СокрЛП(Строка(Тек.ШтрихкодНоменклатуры.Код));	
				КонецЕсли;				
				// <<--- МАС 
				
				Если Стр.ПринятоРанее Тогда					
					НовТ.ПринятНаСкладе = Истина;			
				Иначе
					НовТ.ПринятНаСкладе = Ложь;	
				КонецЕсли;
				
			КонецЦикла;
			
			
			
		ИначеЕсли Стр.РезультатДоставки = Справочники.новаРезультатМестнойДоставки.ВыполненаЧастично Тогда
			
			//ЗапросТовары = Новый Запрос("ВЫБРАТЬ
			//                            |	ПоступлениеТоваровУслугТовары.Номенклатура,
			//                            |	ПоступлениеТоваровУслугТовары.Количество
			//                            |ПОМЕСТИТЬ ВТ
			//                            |ИЗ
			//                            |	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
			//                            |ГДЕ
			//                            |	ПоступлениеТоваровУслугТовары.Ссылка.Номер = &Номер
			//                            |
			//                            |ОБЪЕДИНИТЬ ВСЕ
			//                            |
			//                            |ВЫБРАТЬ
			//                            |	ДанныеЗаказаВодителяДоставленныеТовары.Номенклатура,
			//                            |	-ДанныеЗаказаВодителяДоставленныеТовары.КоличествоДоставлено
			//                            |ИЗ
			//                            |	Документ.ДанныеЗаказаВодителя.ДоставленныеТовары КАК ДанныеЗаказаВодителяДоставленныеТовары
			//                            |ГДЕ
			//                            |	ДанныеЗаказаВодителяДоставленныеТовары.Ссылка.Ссылка = &Ссылка
			//                            |
			//                            |ОБЪЕДИНИТЬ ВСЕ
			//                            |
			//                            |ВЫБРАТЬ
			//                            |	ПоступлениеТоваровУслугПодарочныеПозиции.Номенклатура,
			//                            |	ПоступлениеТоваровУслугПодарочныеПозиции.Количество
			//                            |ИЗ
			//                            |	Документ.ПоступлениеТоваровУслуг.ПодарочныеПозиции КАК ПоступлениеТоваровУслугПодарочныеПозиции
			//                            |ГДЕ
			//                            |	ПоступлениеТоваровУслугПодарочныеПозиции.Ссылка.Номер = &Номер
			//                            |;
			//                            |
			//                            |////////////////////////////////////////////////////////////////////////////////
			//                            |ВЫБРАТЬ
			//                            |	СУММА(ВТ.Количество) КАК Количество,
			//                            |	ВТ.Номенклатура
			//                            |ИЗ
			//                            |	ВТ КАК ВТ
			//                            |
			//                            |СГРУППИРОВАТЬ ПО
			//                            |	ВТ.Номенклатура");
			//ЗапросТовары.УстановитьПараметр("Номер", Стр.Доставка.Номер);
			//Най = Объект.ДанныеМПВодителя.НайтиСтроки(Новый Структура("Доставка", Стр.Доставка));
			//ЗапросТовары.УстановитьПараметр("Ссылка", Най[0].Доставка.Ссылка);
			//РезТовары = ЗапросТовары.Выполнить().Выгрузить();
			//
			//Для каждого СтрТ Из РезТовары Цикл
			//	
			//	НовТ = Объект.Товары.Добавить();
			//	НовТ.Доставка = Стр.Доставка;
			//	НовТ.Номенклатура = СтрТ.Номенклатура;
			//	НовТ.Количество = СтрТ.Количество;
			//	//НовТ.Цена = СтрТ.Цена;
			//	//НовТ.Сумма = ;
			//	//НовТ.КоличествоИсходное = ;
			//	НовТ.ПринятНаСкладе = Ложь;
			//	
			//КонецЦикла;
			
			ЗапросЧастичка = Новый Запрос("ВЫБРАТЬ
			                              |	ДанныеЗаказаВодителяДоставленныеТовары.Номенклатура КАК Номенклатура,
			                              |	СУММА(ДанныеЗаказаВодителяДоставленныеТовары.КоличествоДоставлено) КАК КоличествоДоставлено
			                              |ПОМЕСТИТЬ ВТ_Данные
			                              |ИЗ
			                              |	Документ.ДанныеЗаказаВодителя.ДоставленныеТовары КАК ДанныеЗаказаВодителяДоставленныеТовары
			                              |ГДЕ
			                              |	ДанныеЗаказаВодителяДоставленныеТовары.Ссылка.Ссылка = &СсылкаМП
			                              |
			                              |СГРУППИРОВАТЬ ПО
			                              |	ДанныеЗаказаВодителяДоставленныеТовары.Номенклатура
			                              |;
			                              |
			                              |////////////////////////////////////////////////////////////////////////////////
			                              |ВЫБРАТЬ
			                              |	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
			                              |	СУММА(РеализацияТоваровУслугТовары.Количество) КАК Количество,
			                              |	РеализацияТоваровУслугТовары.ШтрихкодНоменклатуры КАК ШтрихкодНоменклатуры
			                              |ПОМЕСТИТЬ ВТ_Реализация
			                              |ИЗ
			                              |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
			                              |ГДЕ
			                              |	РеализацияТоваровУслугТовары.Ссылка.Ссылка = &СсылкаРеализация
			                              |
			                              |СГРУППИРОВАТЬ ПО
			                              |	РеализацияТоваровУслугТовары.Номенклатура,
			                              |	РеализацияТоваровУслугТовары.ШтрихкодНоменклатуры
			                              |
			                              |ОБЪЕДИНИТЬ ВСЕ
			                              |
			                              |ВЫБРАТЬ
			                              |	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура,
			                              |	СУММА(РеализацияТоваровУслугПодарочныеПозиции.Количество),
			                              |	РеализацияТоваровУслугПодарочныеПозиции.ШтрихкодНоменклатуры
			                              |ИЗ
			                              |	Документ.РеализацияТоваровУслуг.ПодарочныеПозиции КАК РеализацияТоваровУслугПодарочныеПозиции
			                              |ГДЕ
			                              |	РеализацияТоваровУслугПодарочныеПозиции.Ссылка.Ссылка = &СсылкаРеализация
			                              |
			                              |СГРУППИРОВАТЬ ПО
			                              |	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура,
			                              |	РеализацияТоваровУслугПодарочныеПозиции.ШтрихкодНоменклатуры
			                              |;
			                              |
			                              |////////////////////////////////////////////////////////////////////////////////
			                              |ВЫБРАТЬ
			                              |	ВТ_Данные.Номенклатура КАК Номенклатура,
			                              |	ВТ_Реализация.Количество - ВТ_Данные.КоличествоДоставлено КАК КоличествоНеДоставлено,
			                              |	ВТ_Реализация.ШтрихкодНоменклатуры КАК ШтрихкодНоменклатуры
			                              |ИЗ
			                              |	ВТ_Данные КАК ВТ_Данные
			                              |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Реализация КАК ВТ_Реализация
			                              |		ПО ВТ_Данные.Номенклатура = ВТ_Реализация.Номенклатура");
						  
			ДанныеМПМассив = Объект.ДанныеМПВодителя.НайтиСтроки(Новый Структура("Доставка", Стр.Доставка));	
			Если ДанныеМПМассив.Количество() Тогда
				
				СсылкаМП = ДанныеМПМассив[0].ДанныеМП.Ссылка;	
				ЗапросЧастичка.УстановитьПараметр("СсылкаМП", СсылкаМП);
				ЗапросЧастичка.УстановитьПараметр("СсылкаРеализация", Стр.Доставка);
				РезЧастичка = ЗапросЧастичка.Выполнить().Выгрузить();
				
				Для каждого СтрТ Из РезЧастичка Цикл
					
					Если СтрТ.КоличествоНеДоставлено = NULL Тогда
						Продолжить;	
					КонецЕсли;
					
					Если СтрТ.КоличествоНеДоставлено > 0 Тогда
						
						НовТ = Объект.Товары.Добавить();
						НовТ.Доставка = Стр.Доставка;
						НовТ.Номенклатура = СтрТ.Номенклатура;
						НовТ.Количество = СтрТ.КоличествоНеДоставлено;
//+++ БАО 09.10.2017 №1920
						НовТ.ШтрихкодНоменклатуры = СтрТ.ШтрихкодНоменклатуры;
//--- БАО 09.10.2017 №1920

						// МАС - 23.05.2018 - № --->> 
						Если ЗначениеЗаполнено(СтрТ.ШтрихкодНоменклатуры) Тогда
							НовТ.Штрихкод = СокрЛП(Строка(СтрТ.ШтрихкодНоменклатуры.Код));	
						КонецЕсли;				
						// <<--- МАС
				
						Если Стр.ПринятоРанее Тогда					
							НовТ.ПринятНаСкладе = Истина;			
						Иначе
							НовТ.ПринятНаСкладе = Ложь;	
						КонецЕсли;
						
					КонецЕсли;	
					
				КонецЦикла;			
				
			КонецЕсли;
						 
		
			
		// ------------- Полный возврат	
		//ИначеЕсли Стр.РезультатДоставки = Справочники.новаРезультатМестнойДоставки.НеВыполнена ИЛИ НЕ Стр.КВозврату Тогда	
		
		Иначе // во всех остальных случаях заполняем все товары
			
			
			// МАС - 11.07.2018 - оптимизация --->> 
		
//			Запрос = Новый Запрос("ВЫБРАТЬ
//			                      |	ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
//			                      |	ПоступлениеТоваровУслугТовары.Количество КАК Количество,
//			                      |	ПоступлениеТоваровУслугТовары.Цена КАК Цена,
//			                      |	ПоступлениеТоваровУслугТовары.Сумма КАК Сумма,
//			                      |	УслугиПоЗаказам.Ссылка КАК Ссылка,
////+++ БАО 09.10.2017 №1920								  
//			                      |	ПоступлениеТоваровУслугТовары.ШтрихкодНоменклатуры КАК ШтрихкодНоменклатуры
////--- БАО 09.10.2017 №1920								  
//			                      |ПОМЕСТИТЬ ВТ
//			                      |ИЗ
//			                      |	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
//			                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УслугиПоЗаказам КАК УслугиПоЗаказам
//			                      |		ПО ПоступлениеТоваровУслугТовары.Номенклатура.Артикул = УслугиПоЗаказам.Артикул
//			                      |			И ПоступлениеТоваровУслугТовары.Ссылка.Контрагент = УслугиПоЗаказам.Владелец
//			                      |ГДЕ
//			                      |	ПоступлениеТоваровУслугТовары.Ссылка.Номер = &Номер
//			                      |
//			                      |ОБЪЕДИНИТЬ ВСЕ
//			                      |
//			                      |ВЫБРАТЬ
//			                      |	ПоступлениеТоваровУслугПодарочныеПозиции.Номенклатура,
//			                      |	СУММА(ПоступлениеТоваровУслугПодарочныеПозиции.Количество),
//			                      |	ПоступлениеТоваровУслугПодарочныеПозиции.Цена,
//			                      |	СУММА(ПоступлениеТоваровУслугПодарочныеПозиции.Сумма),
//			                      |	УслугиПоЗаказам.Ссылка,
////+++ БАО 09.10.2017 №1920	
//								  | ПоступлениеТоваровУслугПодарочныеПозиции.ШтрихкодНоменклатуры
////--- БАО 09.10.2017 №1920									  
//			                      |ИЗ
//			                      |	Документ.ПоступлениеТоваровУслуг.ПодарочныеПозиции КАК ПоступлениеТоваровУслугПодарочныеПозиции
//			                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УслугиПоЗаказам КАК УслугиПоЗаказам
//			                      |		ПО ПоступлениеТоваровУслугПодарочныеПозиции.Номенклатура.Артикул = УслугиПоЗаказам.Артикул
//			                      |			И ПоступлениеТоваровУслугПодарочныеПозиции.Ссылка.Контрагент = УслугиПоЗаказам.Владелец
//			                      |ГДЕ
//			                      |	ПоступлениеТоваровУслугПодарочныеПозиции.Ссылка.Номер = &Номер
//			                      |
//			                      |СГРУППИРОВАТЬ ПО
//			                      |	ПоступлениеТоваровУслугПодарочныеПозиции.Номенклатура,
//			                      |	ПоступлениеТоваровУслугПодарочныеПозиции.Цена,
////+++ БАО 10.10.2017 №1920
//		  						  | ПоступлениеТоваровУслугПодарочныеПозиции.ШтрихкодНоменклатуры, 
////--- БАО 10.10.2017 №1920
//			                      |	УслугиПоЗаказам.Ссылка
//			                      |;
//			                      |
//			                      |////////////////////////////////////////////////////////////////////////////////
//			                      |ВЫБРАТЬ
//			                      |	ВТ.Номенклатура КАК Номенклатура,
//			                      |	СУММА(ВТ.Количество) КАК Количество,
//			                      |	ВТ.Цена КАК Цена,
////+++ БАО 09.10.2017 №1920								  
//								  |	ВТ.ШтрихкодНоменклатуры КАК ШтрихкодНоменклатуры,
////--- БАО 09.10.2017 №1920								  
//			                      |	СУММА(ВТ.Сумма) КАК Сумма
//			                      |ИЗ
//			                      |	ВТ КАК ВТ
//			                      |ГДЕ
//			                      |	ВТ.Ссылка ЕСТЬ NULL
//			                      |
//			                      |СГРУППИРОВАТЬ ПО
//			                      |	ВТ.Номенклатура,
////+++ БАО 09.10.2017 №1920								  
//								  |	ВТ.ШтрихкодНоменклатуры,
////--- БАО 09.10.2017 №1920											  
//			                      |	ВТ.Цена");


			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
			                      |	ПоступлениеТоваровУслугТовары.Количество КАК Количество,
			                      |	ПоступлениеТоваровУслугТовары.Цена КАК Цена,
			                      |	ПоступлениеТоваровУслугТовары.Сумма КАК Сумма,
			                      |	УслугиПоЗаказам.Ссылка КАК Ссылка,
			                      |	ПоступлениеТоваровУслугТовары.ШтрихкодНоменклатуры КАК ШтрихкодНоменклатуры
			                      |ПОМЕСТИТЬ ВТ
			                      |ИЗ
			                      |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
			                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
			                      |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УслугиПоЗаказам КАК УслугиПоЗаказам
			                      |			ПО ПоступлениеТоваровУслугТовары.Номенклатура.Артикул = УслугиПоЗаказам.Артикул
			                      |				И ПоступлениеТоваровУслугТовары.Ссылка.Контрагент = УслугиПоЗаказам.Владелец
			                      |		ПО РеализацияТоваровУслуг.Номер = ПоступлениеТоваровУслугТовары.Ссылка.Номер
			                      |ГДЕ
			                      |	РеализацияТоваровУслуг.Ссылка = &РеализацияСсылка
			                      |
			                      |ОБЪЕДИНИТЬ ВСЕ
			                      |
			                      |ВЫБРАТЬ
			                      |	ПоступлениеТоваровУслугПодарочныеПозиции.Номенклатура,
			                      |	ПоступлениеТоваровУслугПодарочныеПозиции.Количество,
			                      |	ПоступлениеТоваровУслугПодарочныеПозиции.Цена,
			                      |	ПоступлениеТоваровУслугПодарочныеПозиции.Сумма,
			                      |	УслугиПоЗаказам.Ссылка,
			                      |	ПоступлениеТоваровУслугПодарочныеПозиции.ШтрихкодНоменклатуры
			                      |ИЗ
			                      |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
			                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.ПодарочныеПозиции КАК ПоступлениеТоваровУслугПодарочныеПозиции
			                      |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УслугиПоЗаказам КАК УслугиПоЗаказам
			                      |			ПО ПоступлениеТоваровУслугПодарочныеПозиции.Номенклатура.Артикул = УслугиПоЗаказам.Артикул
			                      |				И ПоступлениеТоваровУслугПодарочныеПозиции.Ссылка.Контрагент = УслугиПоЗаказам.Владелец
			                      |		ПО РеализацияТоваровУслуг.Номер = ПоступлениеТоваровУслугПодарочныеПозиции.Ссылка.Номер
			                      |ГДЕ
			                      |	РеализацияТоваровУслуг.Ссылка = &РеализацияСсылка
			                      |
			                      |СГРУППИРОВАТЬ ПО
			                      |	ПоступлениеТоваровУслугПодарочныеПозиции.Номенклатура,
			                      |	ПоступлениеТоваровУслугПодарочныеПозиции.Цена,
			                      |	ПоступлениеТоваровУслугПодарочныеПозиции.ШтрихкодНоменклатуры,
			                      |	УслугиПоЗаказам.Ссылка,
			                      |	ПоступлениеТоваровУслугПодарочныеПозиции.Количество,
			                      |	ПоступлениеТоваровУслугПодарочныеПозиции.Сумма
			                      |;
			                      |
			                      |////////////////////////////////////////////////////////////////////////////////
			                      |ВЫБРАТЬ
			                      |	ВТ.Номенклатура КАК Номенклатура,
			                      |	ВТ.Количество КАК Количество,
			                      |	ВТ.Цена КАК Цена,
			                      |	ВТ.ШтрихкодНоменклатуры КАК ШтрихкодНоменклатуры,
			                      |	ВТ.Сумма КАК Сумма
			                      |ИЗ
			                      |	ВТ КАК ВТ
			                      |ГДЕ
			                      |	ВТ.Ссылка ЕСТЬ NULL
			                      |	И НЕ ВТ.Номенклатура ЕСТЬ NULL");
			// <<--- МАС - 11.07.2018 - оптимизация
					
			// МАС - 11.07.2018 - № --->> 
			//Запрос.УстановитьПараметр("Номер", Стр.Доставка.Номер);
			Запрос.УстановитьПараметр("РеализацияСсылка", Стр.Доставка);
			// <<--- МАС 
			
			
			Рез = Запрос.Выполнить().Выгрузить();
			
			Для каждого Тек Из Рез Цикл
				
				НовТ = Объект.Товары.Добавить();
				НовТ.Доставка = Стр.Доставка;
				НовТ.Номенклатура = Тек.Номенклатура;
				НовТ.Количество = Тек.Количество;
				НовТ.Цена = Тек.Цена;
				НовТ.Сумма = Тек.Сумма;
				НовТ.КоличествоИсходное = Тек.Количество;
//+++ БАО 09.10.2017 №1920
				НовТ.ШтрихкодНоменклатуры = Тек.ШтрихкодНоменклатуры;
//--- БАО 09.10.2017 №1920

				// МАС - 23.05.2018 - № --->> 
				Если ЗначениеЗаполнено(Тек.ШтрихкодНоменклатуры) Тогда
					НовТ.Штрихкод = СокрЛП(Строка(Тек.ШтрихкодНоменклатуры.Код));	
				КонецЕсли;				
				// <<--- МАС
				
				Если Стр.ПринятоРанее Тогда					
					НовТ.ПринятНаСкладе = Истина;			
				Иначе
					НовТ.ПринятНаСкладе = Ложь;	
				КонецЕсли;
		
			КонецЦикла;
							
		КонецЕсли;	
		
	КонецЦикла;
	

	Если НЕ Объект.Доставки.Количество() Тогда
	
		#Если Клиент Тогда	
			ПоказатьПредупреждение(, "По рейсу №" + рейс.Номер + " Заказы к возврату отсутствуют");
		#КонецЕсли	
	
	КонецЕсли;
	
	// МАС - 22.05.2018 - № --->> 
	Записать();
	
	МассивЗаказов = ЭтотОбъект.Доставки.Выгрузить(, "Доставка");
	ЗаполнитьШтрихкоды(МассивЗаказов);
	
	// МАС - 19.07.2018 - № --->> 
	ЗаполнитьМестаДоставкиНаСервере();
	// <<--- МАС 
	
	// МАС - 23.07.2018 - № --->> 
	Для каждого Ст Из Доставки Цикл	
		Если Ст.КВозврату И Ст.ТипВозврата = ПредопределенноеЗначение("Справочник.СтатусыСкладскогоУчета.Возврат2") Тогда
			Ст.БылоВскрытиеЗаказа = Истина;		
		КонецЕсли;
	КонецЦикла;	
	// <<--- МАС 
	
	Записать();
	// <<--- МАС 
	
	
КонецПроцедуры


Процедура ЗаполнитьМестаДоставкиНаСервере() Экспорт
	
	// МАС - 23.07.2018 - № --->> 
	 	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	ДокТЧ.Доставка КАК Доставка,
	//	|	ДокТЧ.РезультатДоставки КАК РезультатДоставки
	//	|ПОМЕСТИТЬ ДокТЧ
	//	|ИЗ
	//	|	&ДокТЧ КАК ДокТЧ
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ДокТЧ.Доставка КАК Доставка,
	//	|	МестаПоЗаказам.Ссылка КАК Место,
	//	|	МестаПоЗаказам.Штрихкод КАК Штрихкод
	//	|ИЗ
	//	|	ДокТЧ КАК ДокТЧ
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.МестаПоЗаказам КАК МестаПоЗаказам
	//	|		ПО ДокТЧ.Доставка = МестаПоЗаказам.Заказ
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ДокТЧ.Доставка,
	//	|	МестаПоЗаказам.Ссылка,
	//	|	МестаПоЗаказам.Штрихкод";
	
	Запрос = Новый Запрос;
	//Асеев 31.08.2021 (по письму Маркировка заказов.)>>>
	//Запрос.Текст = 
	//	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	ДокТЧ.Доставка КАК Доставка,
	//	|	ДокТЧ.РезультатДоставки КАК РезультатДоставки
	//	|ПОМЕСТИТЬ ДокТЧ
	//	|ИЗ
	//	|	&ДокТЧ КАК ДокТЧ
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ДокТЧ.Доставка КАК Доставка,
	//	|	МестаПоЗаказам.Ссылка КАК Место,
	//	|	МестаПоЗаказам.Штрихкод КАК Штрихкод
	//	|ИЗ
	//	|	ДокТЧ КАК ДокТЧ
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.МестаПоЗаказам КАК МестаПоЗаказам
	//	|		ПО ДокТЧ.Доставка = МестаПоЗаказам.Заказ
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	//	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыКонтрагентов.СрезПоследних КАК ПараметрыКонтрагентовСрезПоследних
	//	|			ПО РеализацияТоваровУслуг.ВладелецТовара = ПараметрыКонтрагентовСрезПоследних.Контрагент
	//	|				И (ЕСТЬNULL(ПараметрыКонтрагентовСрезПоследних.УчетЗаказовПоМестам, ЛОЖЬ) = ИСТИНА)
	//	|		ПО ДокТЧ.Доставка = РеализацияТоваровУслуг.Ссылка
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ДокТЧ.Доставка,
	//	|	МестаПоЗаказам.Ссылка,
	//	|	МестаПоЗаказам.Штрихкод";

	//// <<--- МАС
	//
	//Запрос.УстановитьПараметр("ДокТЧ", Доставки.Выгрузить());
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//МестаЗаказов.Загрузить(РезультатЗапроса.Выгрузить());
	Запрос.УстановитьПараметр("Доставки", Доставки.ВыгрузитьКолонку("Доставка"));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.ВладелецТовара КАК ВладелецТовара
	|ПОМЕСТИТЬ ВТ_Доставки
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В(&Доставки)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПараметрыКонтрагентовСрезПоследних.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ ВТ_УчетПоМестам
	|ИЗ
	|	РегистрСведений.ПараметрыКонтрагентов.СрезПоследних(
	|			,
	|			Контрагент В
	|				(ВЫБРАТЬ
	|					ВТ_Доставки.ВладелецТовара КАК ВладелецТовара
	|				ИЗ
	|					ВТ_Доставки КАК ВТ_Доставки)) КАК ПараметрыКонтрагентовСрезПоследних
	|ГДЕ
	|	ПараметрыКонтрагентовСрезПоследних.УчетЗаказовПоМестам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Доставки.Ссылка КАК Доставка,
	|	МестаПоЗаказам.Ссылка КАК Место,
	|	МестаПоЗаказам.Штрихкод КАК Штрихкод
	|ИЗ
	|	ВТ_Доставки КАК ВТ_Доставки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_УчетПоМестам КАК ВТ_УчетПоМестам
	|		ПО ВТ_Доставки.ВладелецТовара = ВТ_УчетПоМестам.Контрагент
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.МестаПоЗаказам КАК МестаПоЗаказам
	|		ПО ВТ_Доставки.Ссылка = МестаПоЗаказам.Заказ
	|			И (НЕ МестаПоЗаказам.НеАктуальное)";
	
	МестаЗаказов.Загрузить(Запрос.Выполнить().Выгрузить());
	//Асеев 31.08.2021 (по письму Маркировка заказов.)<<<
	
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//КонецЦикла;
	
КонецПроцедуры // ()



Процедура ЗаполнитьШтрихкоды(МассивЗаказов)		
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	МестаПоЗаказам.Ссылка КАК Ссылка,
	                      |	МестаПоЗаказам.Заказ КАК Заказ,
	                      |	МестаПоЗаказам.Штрихкод КАК Штрихкод
	                      |ПОМЕСТИТЬ ВТ
	                      |ИЗ
	                      |	Справочник.МестаПоЗаказам КАК МестаПоЗаказам
	                      |ГДЕ
	                      |	МестаПоЗаказам.Заказ В(&МассивЗаказов)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	МестаПоЗаказам.Ссылка,
	                      |	МестаПоЗаказам.Заказ,
	                      |	МестаПоЗаказам.Штрихкод
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ШтрихкодыЗаказов.Штрихкод КАК Штрихкод,
	                      |	NULL КАК ШКТовара,
	                      |	ШтрихкодыЗаказов.Заказ КАК Заказ,
	                      |	NULL КАК Товар,
	                      |	NULL КАК МестоЗаказа
	                      |ИЗ
	                      |	РегистрСведений.ШтрихкодыЗаказов КАК ШтрихкодыЗаказов
	                      |ГДЕ
	                      |	ШтрихкодыЗаказов.Заказ В(&МассивЗаказов)
	                      |	И НЕ ШтрихкодыЗаказов.Штрихкод В
	                      |				(ВЫБРАТЬ
	                      |					ВТ.Штрихкод
	                      |				ИЗ
	                      |					ВТ КАК ВТ)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ШтрихкодыЗаказов.Заказ,
	                      |	ШтрихкодыЗаказов.Штрихкод
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	РеализацияТоваровУслугТовары.ШтрихкодНоменклатуры.Код,
	                      |	РеализацияТоваровУслугТовары.ШтрихкодНоменклатуры,
	                      |	РеализацияТоваровУслугТовары.Ссылка,
	                      |	РеализацияТоваровУслугТовары.Номенклатура,
	                      |	NULL
	                      |ИЗ
	                      |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	                      |ГДЕ
	                      |	РеализацияТоваровУслугТовары.Ссылка В(&МассивЗаказов)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	РеализацияТоваровУслугТовары.ШтрихкодНоменклатуры,
	                      |	РеализацияТоваровУслугТовары.ШтрихкодНоменклатуры.Код,
	                      |	РеализацияТоваровУслугТовары.Номенклатура,
	                      |	РеализацияТоваровУслугТовары.Ссылка
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	МестаПоЗаказам.Штрихкод,
	                      |	NULL,
	                      |	МестаПоЗаказам.Заказ,
	                      |	NULL,
	                      |	МестаПоЗаказам.Ссылка
	                      |ИЗ
	                      |	Справочник.МестаПоЗаказам КАК МестаПоЗаказам
	                      |ГДЕ
	                      |	МестаПоЗаказам.Заказ В(&МассивЗаказов)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	МестаПоЗаказам.Штрихкод,
	                      |	МестаПоЗаказам.Заказ,
	                      |	МестаПоЗаказам.Ссылка");
	Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
	РезТЗ = Запрос.Выполнить().Выгрузить();
	
	ТоварыТЗ = ЭтотОбъект.Товары.Выгрузить();
	//ТоварыТЗ.Свернуть("Доставка,Номенклатура,ШтрихкодНоменклатуры");			
	//CeHbKA #4073 08.07.2020
	ТоварыТЗ.Свернуть("Доставка,Номенклатура,ШтрихкодНоменклатуры,КодМаркировки");			
	
	Для каждого Стр Из ТоварыТЗ Цикл	
		НСтр = РезТЗ.Добавить();	
		НСтр.ШКТовара = Стр.ШтрихкодНоменклатуры;
	    НСтр.Штрихкод = Стр.ШтрихкодНоменклатуры.Код;
	    НСтр.Заказ    = Стр.Доставка;   
		НСтр.Товар    = Стр.Номенклатура;	
		
		//CeHbKA #4073 08.07.2020
		Если ЗначениеЗаполнено(Стр.КодМаркировки) Тогда
			НСтр2 = РезТЗ.Добавить();	
			НСтр2.Штрихкод = Стр.КодМаркировки;
		    НСтр2.Заказ    = Стр.Доставка;   
			НСтр2.Товар    = Стр.Номенклатура;		
			
			МассивСтрокТЗ = РезТЗ.НайтиСтроки(Новый Структура("Штрихкод", Стр.ШтрихкодНоменклатуры.Код));
			
			Для каждого СтрокаТЗ Из МассивСтрокТЗ Цикл
				
				Если ЗначениеЗаполнено(СтрокаТЗ.МестоЗаказа) Тогда
					НСтр2.МестоЗаказа = СтрокаТЗ.МестоЗаказа;
				КонецЕсли; 
				
			КонецЦикла; 
			
		КонецЕсли; 
		//CeHbKA #4073 08.07.2020
		
	КонецЦикла;
			
	Штрихкоды.Загрузить(РезТЗ);
	
КонецПроцедуры


Процедура ДозаполнитьПоДаннымОтчетПоТоварамМП(ОтчетПоТоварамМП, ДокументОбъект) Экспорт 
	
	// МАС - 18.07.2018 - № --->>
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	РейсЗаказы.Заказ КАК Доставка,
	//               |	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	//               |	СУММА(РеализацияТоваровУслугТовары.Количество) КАК КоличествоИсходное,
	//               |	РеализацияТоваровУслугТовары.Цена КАК Цена
	//               |ПОМЕСТИТЬ ВТ_ИсходноеКоличество
	//               |ИЗ
	//               |	Документ.Рейс.Заказы КАК РейсЗаказы
	//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	//               |		ПО ((ВЫРАЗИТЬ(РейсЗаказы.Заказ КАК Документ.РеализацияТоваровУслуг)) = РеализацияТоваровУслугТовары.Ссылка)
	//               |ГДЕ
	//               |	РейсЗаказы.УдаленИзРейса = ЛОЖЬ
	//               |	И РейсЗаказы.Ссылка = &Рейс
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	РейсЗаказы.Заказ,
	//               |	РеализацияТоваровУслугТовары.Номенклатура,
	//               |	РеализацияТоваровУслугТовары.Цена
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	ВТ_ИсходноеКоличество.Доставка КАК Доставка,
	//               |	ВТ_ИсходноеКоличество.Номенклатура КАК Номенклатура,
	//               |	ВТ_ИсходноеКоличество.КоличествоИсходное КАК КоличествоИсходное,
	//               |	ВТ_ИсходноеКоличество.Цена КАК Цена,
	//               |	ОтчетПоТоварамМПТовары.Количество КАК Количество,
	//               |	ОтчетПоТоварамМПТовары.ШтрихкодТовара КАК ШтрихкодНоменклатуры
	//               |ИЗ
	//               |	Документ.ОтчетПоТоварамМП.Товары КАК ОтчетПоТоварамМПТовары
	//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ИсходноеКоличество КАК ВТ_ИсходноеКоличество
	//               |		ПО ОтчетПоТоварамМПТовары.Заказ = ВТ_ИсходноеКоличество.Доставка
	//               |			И ОтчетПоТоварамМПТовары.Номенклатура = ВТ_ИсходноеКоличество.Номенклатура
	//               |			И ОтчетПоТоварамМПТовары.Цена = ВТ_ИсходноеКоличество.Цена
	//               |ГДЕ
	//               |	ОтчетПоТоварамМПТовары.Ссылка = &ОтчетПоТоварамМП";
	//Запрос.УстановитьПараметр("Рейс", ДокументОбъект.Рейс);
	//Запрос.УстановитьПараметр("ОтчетПоТоварамМП", ОтчетПоТоварамМП);
	 
	// Якурнов 20.09.2018 10:30:20
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	РейсЗаказы.Заказ КАК Доставка,
	//               |	ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	//               |	СУММА(ПоступлениеТоваровУслугТовары.Количество) КАК КоличествоИсходное,
	//               |	ПоступлениеТоваровУслугТовары.Цена КАК Цена
	//               |ПОМЕСТИТЬ ВТ_ИсходноеКоличество
	//               |ИЗ
	//               |	Документ.Рейс.Заказы КАК РейсЗаказы
	//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	//               |		ПО (ВЫРАЗИТЬ(РейсЗаказы.Заказ КАК Документ.РеализацияТоваровУслуг).Номер = ПоступлениеТоваровУслугТовары.Ссылка.Номер)
	//               |ГДЕ
	//               |	РейсЗаказы.УдаленИзРейса = ЛОЖЬ
	//               |	И РейсЗаказы.Ссылка = &Рейс
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	РейсЗаказы.Заказ,
	//               |	ПоступлениеТоваровУслугТовары.Номенклатура,
	//               |	ПоступлениеТоваровУслугТовары.Цена
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	ВТ_ИсходноеКоличество.Доставка КАК Доставка,
	//               |	ВТ_ИсходноеКоличество.Номенклатура КАК Номенклатура,
	//               |	ВТ_ИсходноеКоличество.КоличествоИсходное КАК КоличествоИсходное,
	//               |	ВТ_ИсходноеКоличество.Цена КАК Цена,
	//               |	ОтчетПоТоварамМПТовары.Количество КАК Количество,
	//               |	ОтчетПоТоварамМПТовары.ШтрихкодТовара КАК ШтрихкодНоменклатуры
	//               |ИЗ
	//               |	Документ.ОтчетПоТоварамМП.Товары КАК ОтчетПоТоварамМПТовары
	//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ИсходноеКоличество КАК ВТ_ИсходноеКоличество
	//               |		ПО ОтчетПоТоварамМПТовары.Заказ = ВТ_ИсходноеКоличество.Доставка
	//               |			И ОтчетПоТоварамМПТовары.Номенклатура = ВТ_ИсходноеКоличество.Номенклатура
	//               |ГДЕ
	//               |	ОтчетПоТоварамМПТовары.Ссылка = &ОтчетПоТоварамМП";
	
	// Якурнов 20.09.2018 10:30:34
	
	Запрос = Новый Запрос;
	//+Степанов Задача Задача № 3973. В последний запрос пакета добавлена связь по цене.
	Запрос.Текст = "ВЫБРАТЬ
	               |	РейсЗаказы.Заказ КАК Доставка,
	               |	ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	               |	СУММА(ПоступлениеТоваровУслугТовары.Количество) КАК КоличествоИсходное,
	               |	ПоступлениеТоваровУслугТовары.Цена КАК Цена
	               |ПОМЕСТИТЬ ВТ_ИсходноеКоличество
	               |ИЗ
	               |	Документ.Рейс.Заказы КАК РейсЗаказы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	               |		ПО (ВЫРАЗИТЬ(РейсЗаказы.Заказ КАК Документ.РеализацияТоваровУслуг).Номер = ПоступлениеТоваровУслугТовары.Ссылка.Номер)
	               |ГДЕ
	               |	РейсЗаказы.УдаленИзРейса = ЛОЖЬ
	               |	И РейсЗаказы.Ссылка = &Рейс
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РейсЗаказы.Заказ,
	               |	ПоступлениеТоваровУслугТовары.Номенклатура,
	               |	ПоступлениеТоваровУслугТовары.Цена
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОтчетПоТоварамМПТовары.Заказ КАК Доставка,
	               |	ОтчетПоТоварамМПТовары.Номенклатура КАК Номенклатура,
	               |	ВТ_ИсходноеКоличество.КоличествоИсходное КАК КоличествоИсходное,
	               |	ВТ_ИсходноеКоличество.Цена КАК Цена,
	               |	ОтчетПоТоварамМПТовары.Количество КАК Количество,
	               |	ОтчетПоТоварамМПТовары.ШтрихкодТовара КАК ШтрихкодНоменклатуры,
				   //Асеев 05.11.2020 (Задача № 4271)>>>
				   |	ОтчетПоТоварамМПТовары.ШтрихкодТовара.Код КАК Штрихкод
				   //Асеев 05.11.2020 (Задача № 4271)<<<
	               |ИЗ
	               |	Документ.ОтчетПоТоварамМП.Товары КАК ОтчетПоТоварамМПТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсходноеКоличество КАК ВТ_ИсходноеКоличество
	               |		ПО ОтчетПоТоварамМПТовары.Заказ = ВТ_ИсходноеКоличество.Доставка
	               |			И ОтчетПоТоварамМПТовары.Номенклатура = ВТ_ИсходноеКоличество.Номенклатура
	               |			И ОтчетПоТоварамМПТовары.Цена = ВТ_ИсходноеКоличество.Цена
	               |ГДЕ
	               |	ОтчетПоТоварамМПТовары.Ссылка = &ОтчетПоТоварамМП";

	
	Запрос.УстановитьПараметр("Рейс", ДокументОбъект.Рейс);
	Запрос.УстановитьПараметр("ОтчетПоТоварамМП", ОтчетПоТоварамМП);
	// <<--- МАС 
	
	
	Товар = Запрос.Выполнить().Выбрать();
	
	ДокументОбъект.Товары.Очистить();
	
	Пока  Товар.Следующий() Цикл 
		
		НоваяСтрока = ДокументОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Товар);
		
		//Асеев 05.11.2020 (Задача № 4271)>>>
		НоваяСтрока.Штрихкод = СокрЛП(Товар.Штрихкод);
		//Асеев 05.11.2020 (Задача № 4271)<<<
		
		НоваяСтрока.ПринятНаСкладе = Истина;
		НоваяСтрока.Сумма = Окр(НоваяСтрока.Цена*НоваяСтрока.Количество, 2);
		
		
		Отбор = Новый Структура;
		Отбор.Вставить("Доставка", Товар.Доставка);
		
		НайденныеСтроки = ДокументОбъект.Доставки.НайтиСтроки(Отбор);
		
		Для Каждого СтрокаНайденныеСтроки Из НайденныеСтроки Цикл 
			
			// МАС - 18.07.2018 - № --->> 		
			Если СтрокаНайденныеСтроки.РезультатДоставки = Справочники.новаРезультатМестнойДоставки.ВыполненаЧастично 
				ИЛИ СтрокаНайденныеСтроки.ПричинаНеВыполненияДоставки = Справочники.ПричиныНеВыполненияДоставки.ОтказКлиентаСЗаездом Тогда
		
				СтрокаНайденныеСтроки.ПринятНаСкладеЧастично = Истина;
				
			ИначеЕсли СтрокаНайденныеСтроки.РезультатДоставки = Справочники.новаРезультатМестнойДоставки.НеВыполнена 
				И (СтрокаНайденныеСтроки.ПричинаНеВыполненияДоставки = Справочники.ПричиныНеВыполненияДоставки.ОтказКлиентаБезЗаезда 
				ИЛИ СтрокаНайденныеСтроки.ПричинаНеВыполненияДоставки = Справочники.ПричиныНеВыполненияДоставки.ПереносДоставки 
				ИЛИ СтрокаНайденныеСтроки.ПричинаНеВыполненияДоставки = Справочники.ПричиныНеВыполненияДоставки.ПереносСЗаездом) Тогда
			
				СтрокаНайденныеСтроки.ПринятНаСкладеПолностью = Истина;	
				
			//CeHbKA 25.02.2019
			//возвраты и обмены	
			ИначеЕсли ЗначениеЗаполнено(СтрокаНайденныеСтроки.ВозвратТоваров) Тогда
							
				СтрокаНайденныеСтроки.ПринятНаСкладеПолностью = Истина;	
				
			КонецЕсли;		
			//CeHbKA 25.02.2019
			
			//СтрокаНайденныеСтроки.ПринятНаСкладеПолностью = Истина;
			// <<--- МАС
			
		КонецЦикла;	
		
	КонецЦикла;	
	
КонецПроцедуры	
//--- БАО 10.08.2017 №1620

//Геннадий #4191 от 31.08.2020 ->
Процедура ДозаполнитьПоДаннымОтчетПоТоварамМП_Новая(ОтчетПоТоварамМП, ДокументОбъект) Экспорт 
	
	// МАС - 18.07.2018 - № --->>
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	РейсЗаказы.Заказ КАК Доставка,
	//               |	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	//               |	СУММА(РеализацияТоваровУслугТовары.Количество) КАК КоличествоИсходное,
	//               |	РеализацияТоваровУслугТовары.Цена КАК Цена
	//               |ПОМЕСТИТЬ ВТ_ИсходноеКоличество
	//               |ИЗ
	//               |	Документ.Рейс.Заказы КАК РейсЗаказы
	//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	//               |		ПО ((ВЫРАЗИТЬ(РейсЗаказы.Заказ КАК Документ.РеализацияТоваровУслуг)) = РеализацияТоваровУслугТовары.Ссылка)
	//               |ГДЕ
	//               |	РейсЗаказы.УдаленИзРейса = ЛОЖЬ
	//               |	И РейсЗаказы.Ссылка = &Рейс
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	РейсЗаказы.Заказ,
	//               |	РеализацияТоваровУслугТовары.Номенклатура,
	//               |	РеализацияТоваровУслугТовары.Цена
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	ВТ_ИсходноеКоличество.Доставка КАК Доставка,
	//               |	ВТ_ИсходноеКоличество.Номенклатура КАК Номенклатура,
	//               |	ВТ_ИсходноеКоличество.КоличествоИсходное КАК КоличествоИсходное,
	//               |	ВТ_ИсходноеКоличество.Цена КАК Цена,
	//               |	ОтчетПоТоварамМПТовары.Количество КАК Количество,
	//               |	ОтчетПоТоварамМПТовары.ШтрихкодТовара КАК ШтрихкодНоменклатуры
	//               |ИЗ
	//               |	Документ.ОтчетПоТоварамМП.Товары КАК ОтчетПоТоварамМПТовары
	//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ИсходноеКоличество КАК ВТ_ИсходноеКоличество
	//               |		ПО ОтчетПоТоварамМПТовары.Заказ = ВТ_ИсходноеКоличество.Доставка
	//               |			И ОтчетПоТоварамМПТовары.Номенклатура = ВТ_ИсходноеКоличество.Номенклатура
	//               |			И ОтчетПоТоварамМПТовары.Цена = ВТ_ИсходноеКоличество.Цена
	//               |ГДЕ
	//               |	ОтчетПоТоварамМПТовары.Ссылка = &ОтчетПоТоварамМП";
	//Запрос.УстановитьПараметр("Рейс", ДокументОбъект.Рейс);
	//Запрос.УстановитьПараметр("ОтчетПоТоварамМП", ОтчетПоТоварамМП);
	 
	// Якурнов 20.09.2018 10:30:20
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	РейсЗаказы.Заказ КАК Доставка,
	//               |	ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	//               |	СУММА(ПоступлениеТоваровУслугТовары.Количество) КАК КоличествоИсходное,
	//               |	ПоступлениеТоваровУслугТовары.Цена КАК Цена
	//               |ПОМЕСТИТЬ ВТ_ИсходноеКоличество
	//               |ИЗ
	//               |	Документ.Рейс.Заказы КАК РейсЗаказы
	//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	//               |		ПО (ВЫРАЗИТЬ(РейсЗаказы.Заказ КАК Документ.РеализацияТоваровУслуг).Номер = ПоступлениеТоваровУслугТовары.Ссылка.Номер)
	//               |ГДЕ
	//               |	РейсЗаказы.УдаленИзРейса = ЛОЖЬ
	//               |	И РейсЗаказы.Ссылка = &Рейс
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	РейсЗаказы.Заказ,
	//               |	ПоступлениеТоваровУслугТовары.Номенклатура,
	//               |	ПоступлениеТоваровУслугТовары.Цена
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	ВТ_ИсходноеКоличество.Доставка КАК Доставка,
	//               |	ВТ_ИсходноеКоличество.Номенклатура КАК Номенклатура,
	//               |	ВТ_ИсходноеКоличество.КоличествоИсходное КАК КоличествоИсходное,
	//               |	ВТ_ИсходноеКоличество.Цена КАК Цена,
	//               |	ОтчетПоТоварамМПТовары.Количество КАК Количество,
	//               |	ОтчетПоТоварамМПТовары.ШтрихкодТовара КАК ШтрихкодНоменклатуры
	//               |ИЗ
	//               |	Документ.ОтчетПоТоварамМП.Товары КАК ОтчетПоТоварамМПТовары
	//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ИсходноеКоличество КАК ВТ_ИсходноеКоличество
	//               |		ПО ОтчетПоТоварамМПТовары.Заказ = ВТ_ИсходноеКоличество.Доставка
	//               |			И ОтчетПоТоварамМПТовары.Номенклатура = ВТ_ИсходноеКоличество.Номенклатура
	//               |ГДЕ
	//               |	ОтчетПоТоварамМПТовары.Ссылка = &ОтчетПоТоварамМП";
	
	// Якурнов 20.09.2018 10:30:34
	
	Запрос = Новый Запрос;
	//+Степанов Задача Задача № 3973. В последний запрос пакета добавлена связь по цене.
	
	//Геннадий #4169 от 01.09.2020 ->
	//добавил КодМаркировки из ОтчетаПоТоварамМП в последнем запросе
	Запрос.Текст = "ВЫБРАТЬ
	               |	РейсЗаказы.Заказ КАК Доставка,
	               |	ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	               |	СУММА(ПоступлениеТоваровУслугТовары.Количество) КАК КоличествоИсходное,
	               |	ПоступлениеТоваровУслугТовары.Цена КАК Цена
	               |ПОМЕСТИТЬ ВТ_ИсходноеКоличество
	               |ИЗ
	               |	Документ.Рейс.Заказы КАК РейсЗаказы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	               |		ПО (ВЫРАЗИТЬ(РейсЗаказы.Заказ КАК Документ.РеализацияТоваровУслуг).Номер = ПоступлениеТоваровУслугТовары.Ссылка.Номер)
	               |ГДЕ
	               |	РейсЗаказы.УдаленИзРейса = ЛОЖЬ
	               |	И РейсЗаказы.Ссылка = &Рейс
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РейсЗаказы.Заказ,
	               |	ПоступлениеТоваровУслугТовары.Номенклатура,
	               |	ПоступлениеТоваровУслугТовары.Цена
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОтчетПоТоварамМПТовары.Заказ КАК Доставка,
	               |	ОтчетПоТоварамМПТовары.Номенклатура КАК Номенклатура,
	               |	ВТ_ИсходноеКоличество.КоличествоИсходное КАК КоличествоИсходное,
	               |	ВТ_ИсходноеКоличество.Цена КАК Цена,
	               |	ОтчетПоТоварамМПТовары.Количество КАК Количество,
	               |	ОтчетПоТоварамМПТовары.ШтрихкодТовара КАК ШтрихкодНоменклатуры,
	               |	ОтчетПоТоварамМПТовары.КодМаркировки КАК КодМаркировки,
				   //Асеев 05.11.2020 (Задача № 4271)>>>
				   |	ОтчетПоТоварамМПТовары.ШтрихкодТовара.Код КАК Штрихкод
				   //Асеев 05.11.2020 (Задача № 4271)<<<
	               |ИЗ
	               |	Документ.ОтчетПоТоварамМП.Товары КАК ОтчетПоТоварамМПТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсходноеКоличество КАК ВТ_ИсходноеКоличество
	               |		ПО ОтчетПоТоварамМПТовары.Заказ = ВТ_ИсходноеКоличество.Доставка
	               |			И ОтчетПоТоварамМПТовары.Номенклатура = ВТ_ИсходноеКоличество.Номенклатура
	               |			И ОтчетПоТоварамМПТовары.Цена = ВТ_ИсходноеКоличество.Цена
	               |ГДЕ
	               |	ОтчетПоТоварамМПТовары.Ссылка = &ОтчетПоТоварамМП";
	//Геннадий #4169 от 01.09.2020 <-
	
	Запрос.УстановитьПараметр("Рейс", ДокументОбъект.Рейс);
	Запрос.УстановитьПараметр("ОтчетПоТоварамМП", ОтчетПоТоварамМП);
	// <<--- МАС 
	
	
	Товар = Запрос.Выполнить().Выбрать();
	
	ДокументОбъект.Товары.Очистить();
	
	Пока  Товар.Следующий() Цикл 
		
		НоваяСтрока = ДокументОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Товар);
		
		//Асеев 05.11.2020 (Задача № 4271)>>>
		НоваяСтрока.Штрихкод = СокрЛП(Товар.Штрихкод);
		//Асеев 05.11.2020 (Задача № 4271)<<<
		
		НоваяСтрока.ПринятНаСкладе = Истина;
		НоваяСтрока.Сумма = Окр(НоваяСтрока.Цена*НоваяСтрока.Количество, 2);
		
		
		Отбор = Новый Структура;
		Отбор.Вставить("Доставка", Товар.Доставка);
		
		НайденныеСтроки = ДокументОбъект.Доставки.НайтиСтроки(Отбор);
		
		Для Каждого СтрокаНайденныеСтроки Из НайденныеСтроки Цикл 
			
			// МАС - 18.07.2018 - № --->> 		
			Если СтрокаНайденныеСтроки.РезультатДоставки = Справочники.новаРезультатМестнойДоставки.ВыполненаЧастично 
				ИЛИ СтрокаНайденныеСтроки.ПричинаНеВыполненияДоставки = Справочники.ПричиныНеВыполненияДоставки.ОтказКлиентаСЗаездом Тогда
		
				СтрокаНайденныеСтроки.ПринятНаСкладеЧастично = Истина;
				
			ИначеЕсли СтрокаНайденныеСтроки.РезультатДоставки = Справочники.новаРезультатМестнойДоставки.НеВыполнена 
				И (СтрокаНайденныеСтроки.ПричинаНеВыполненияДоставки = Справочники.ПричиныНеВыполненияДоставки.ОтказКлиентаБезЗаезда 
				ИЛИ СтрокаНайденныеСтроки.ПричинаНеВыполненияДоставки = Справочники.ПричиныНеВыполненияДоставки.ПереносДоставки 
				ИЛИ СтрокаНайденныеСтроки.ПричинаНеВыполненияДоставки = Справочники.ПричиныНеВыполненияДоставки.ПереносСЗаездом) Тогда
			
				СтрокаНайденныеСтроки.ПринятНаСкладеПолностью = Истина;	
				
			//CeHbKA 25.02.2019
			//возвраты и обмены	
			ИначеЕсли ЗначениеЗаполнено(СтрокаНайденныеСтроки.ВозвратТоваров) Тогда
							
				СтрокаНайденныеСтроки.ПринятНаСкладеПолностью = Истина;	
				
			КонецЕсли;		
			//CeHbKA 25.02.2019
			
			//СтрокаНайденныеСтроки.ПринятНаСкладеПолностью = Истина;
			// <<--- МАС
			
		КонецЦикла;	
		
	КонецЦикла;	
	
КонецПроцедуры	
//Геннадий #4191 от 31.08.2020 <-

Процедура ЗаписатьПозицииКВозврату(Распроведение = Ложь)
	
	
	Если Распроведение Тогда  // РС ПозицииКВозврату - удаление записей по документу
			
		Набор = РегистрыСведений.ПозицииКВозврату.СоздатьНаборЗаписей();
		Набор.Отбор.ДокументИсточник.Установить(Ссылка);
		//Набор.Прочитать();
		//Набор.Очистить();
		Набор.Записать();
	
	Иначе  // РС ПозицииКВозврату - формирование записей		
		
		Набор = РегистрыСведений.ПозицииКВозврату.СоздатьНаборЗаписей();
		Набор.Отбор.ДокументИсточник.Установить(Ссылка);
		//Набор.Прочитать();
		//Набор.Очистить();
		
		
		//   --------------------------  НЕ  Вскрытые  --------------------------- 
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ВозвратЗаказовОтВодителяДоставки.Доставка КАК Заказ,
		                      |	ЛОЖЬ КАК Вскрытый,
		                      |	ВозвратЗаказовОтВодителяДоставки.Ссылка КАК ДокументИсточник,
		                      |	ВозвратЗаказовОтВодителяДоставки.Доставка.ТерминалПриема КАК ТерминалПриема,
		                      |	ВозвратЗаказовОтВодителяДоставки.Доставка.ВладелецТовара КАК ИнтернетМагазин,
		                      |	ВозвратЗаказовОтВодителяДоставки.Доставка.ТерминалДоставки КАК ТерминалДоставки
		                      |ИЗ
		                      |	Документ.ВозвратЗаказовОтВодителя.Доставки КАК ВозвратЗаказовОтВодителяДоставки
		                      |ГДЕ
		                      |	ВозвратЗаказовОтВодителяДоставки.Ссылка = &Ссылка
		                      |	И ВозвратЗаказовОтВодителяДоставки.ПринятНаСкладеПолностью = ИСТИНА
		                      |	И ВозвратЗаказовОтВодителяДоставки.КВозврату = ИСТИНА");
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Рез = Запрос.Выполнить().Выбрать();
		
		Пока Рез.Следующий() Цикл				
			НЗапись = Набор.Добавить();
			ЗаполнитьЗначенияСвойств(НЗапись, Рез);
			НЗапись.Период = Дата;	
			НЗапись.ПериодОбработки = Дата;			
		КонецЦикла;
				
				
		//   --------------------------  Вскрытые  --------------------------- 
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ВозвратЗаказовОтВодителяДоставки.Ссылка КАК ДокументИсточник,
		                      |	ВозвратЗаказовОтВодителяДоставки.Доставка.ВладелецТовара КАК ИнтернетМагазин,
		                      |	ВозвратЗаказовОтВодителяДоставки.Доставка КАК Заказ,
		                      |	ВЫБОР
		                      |		КОГДА ВозвратЗаказовОтВодителяДоставки.Доставка.ТерминалПриема <> ВозвратЗаказовОтВодителяДоставки.Доставка.ТерминалДоставки
		                      |			ТОГДА ИСТИНА
		                      |		ИНАЧЕ ЛОЖЬ
		                      |	КОНЕЦ КАК Магистраль,
		                      |	ВозвратЗаказовОтВодителяДоставки.Доставка.ТерминалПриема КАК ТерминалПриема,
		                      |	ВозвратЗаказовОтВодителяТовары.Номенклатура КАК Номенклатура,
		                      |	ВозвратЗаказовОтВодителяТовары.Количество КАК Количество,
		                      |	ВозвратЗаказовОтВодителяТовары.Сумма КАК Сумма,
		                      |	ВозвратЗаказовОтВодителяТовары.ШтрихкодНоменклатуры КАК ШтрихкодНоменклатуры,
		                      |	ВозвратЗаказовОтВодителяТовары.Принято КАК Принято,
		                      |	ВозвратЗаказовОтВодителяТовары.Доставка КАК Доставка,
		                      |	ВозвратЗаказовОтВодителяТовары.Цена КАК Цена,
		                      |	ВозвратЗаказовОтВодителяТовары.КоличествоИсходное КАК КоличествоИсходное,
		                      |	ВозвратЗаказовОтВодителяТовары.ПринятНаСкладе КАК ПринятНаСкладе,
		                      |	ВозвратЗаказовОтВодителяТовары.Штрихкод КАК Штрихкод,
		                      |	ВЫБОР
		                      |		КОГДА ВозвратЗаказовОтВодителяДоставки.ТипВозврата = ЗНАЧЕНИЕ(Справочник.СтатусыСкладскогоУчета.Возврат2)
		                      |			ТОГДА ИСТИНА
		                      |		ИНАЧЕ ЛОЖЬ
		                      |	КОНЕЦ КАК Вскрытый,
		                      |	ВозвратЗаказовОтВодителяДоставки.Доставка.ТерминалДоставки КАК ТерминалДоставки
		                      |ПОМЕСТИТЬ ВТ
		                      |ИЗ
		                      |	Документ.ВозвратЗаказовОтВодителя.Доставки КАК ВозвратЗаказовОтВодителяДоставки
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратЗаказовОтВодителя.Товары КАК ВозвратЗаказовОтВодителяТовары
		                      |		ПО ВозвратЗаказовОтВодителяДоставки.Доставка = ВозвратЗаказовОтВодителяТовары.Доставка
		                      |ГДЕ
		                      |	ВозвратЗаказовОтВодителяДоставки.Ссылка = &Ссылка
		                      |	И ВозвратЗаказовОтВодителяДоставки.ПринятНаСкладеЧастично = ИСТИНА
		                      |	И ВозвратЗаказовОтВодителяТовары.Ссылка = &Ссылка
		                      |	И ВозвратЗаказовОтВодителяДоставки.КВозврату = ИСТИНА
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ВТ.ДокументИсточник КАК ДокументИсточник,
		                      |	ВТ.ИнтернетМагазин КАК ИнтернетМагазин,
		                      |	ВТ.Заказ КАК Заказ,
		                      |	ВТ.Магистраль КАК Магистраль,
		                      |	ВТ.ТерминалПриема КАК ТерминалПриема,
		                      |	ВТ.Номенклатура КАК Номенклатура,
		                      |	СУММА(ВТ.Количество) КАК Количество,
		                      |	СУММА(ВТ.Сумма) КАК Сумма,
		                      |	СРЕДНЕЕ(ВТ.Цена) КАК Цена,
		                      |	ВТ.ШтрихкодНоменклатуры КАК ШтрихкодНоменклатурыИзмерение,
		                      |	ВТ.Принято КАК Принято,
		                      |	ВТ.Доставка КАК Доставка,
		                      |	СУММА(ВТ.КоличествоИсходное) КАК КоличествоИсходное,
		                      |	ВТ.ПринятНаСкладе КАК ПринятНаСкладе,
		                      |	ВТ.Штрихкод КАК Штрихкод,
		                      |	ИСТИНА КАК Вскрытый,
		                      |	ВТ.ТерминалДоставки КАК ТерминалДоставки
		                      |ИЗ
		                      |	ВТ КАК ВТ
		                      |ГДЕ
		                      |	НЕ ВТ.Номенклатура.Артикул В
		                      |				(ВЫБРАТЬ
		                      |					ВТ2.Артикул
		                      |				ИЗ
		                      |					Справочник.УслугиПоЗаказам КАК ВТ2)
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	ВТ.ДокументИсточник,
		                      |	ВТ.ИнтернетМагазин,
		                      |	ВТ.Заказ,
		                      |	ВТ.Магистраль,
		                      |	ВТ.ТерминалПриема,
		                      |	ВТ.Номенклатура,
		                      |	ВТ.ШтрихкодНоменклатуры,
		                      |	ВТ.Принято,
		                      |	ВТ.Доставка,
		                      |	ВТ.ПринятНаСкладе,
		                      |	ВТ.Штрихкод,
		                      |	ВТ.ТерминалДоставки");
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Рез = Запрос.Выполнить().Выбрать();
		
		Пока Рез.Следующий() Цикл				
			НЗапись = Набор.Добавить();
			ЗаполнитьЗначенияСвойств(НЗапись, Рез);
			НЗапись.Период = Дата;	
			НЗапись.ПериодОбработки = Дата;			
		КонецЦикла;

		//Асеев 24.09.2020 (Задача № 4271)>>>
		Если РежимПодтвержденияУдаленногоЗакрытия Тогда
			//сторнируем записи удаленного закрытия
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ДокументУдаленногоЗакрытия", ДокументУдаленногоЗакрытия);
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ПозицииКВозврату.ТерминалДоставки КАК ТерминалДоставки,
			|	ПозицииКВозврату.ИнтернетМагазин КАК ИнтернетМагазин,
			|	ПозицииКВозврату.Вскрытый КАК Вскрытый,
			|	ПозицииКВозврату.Заказ КАК Заказ,
			|	ПозицииКВозврату.Номенклатура КАК Номенклатура,
			|	ПозицииКВозврату.Магистраль КАК Магистраль,
			|	-ПозицииКВозврату.Количество КАК Количество,
			|	-ПозицииКВозврату.Сумма КАК Сумма,
			|	ПозицииКВозврату.Цена КАК Цена,
			|	ПозицииКВозврату.ШтрихкодНоменклатурыИзмерение КАК ШтрихкодНоменклатурыИзмерение,
			|	ПозицииКВозврату.ВозвратОбработан КАК ВозвратОбработан,
			|	ПозицииКВозврату.ТерминалПриема КАК ТерминалПриема
			|ИЗ
			|	РегистрСведений.ПозицииКВозврату КАК ПозицииКВозврату
			|ГДЕ
			|	ПозицииКВозврату.ДокументИсточник = &ДокументУдаленногоЗакрытия";
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				НЗапись = Набор.Добавить();
				ЗаполнитьЗначенияСвойств(НЗапись, Выборка);
				НЗапись.Период = Дата;
				НЗапись.ПериодОбработки = Дата;
				НЗапись.ДокументИсточник = Ссылка;
			КонецЦикла;
			
			//полученный набор требуется свернуть по измерениям из-за особенностей регистра
			ТаблицаПозицииКВозвратуРазвернутая = Набор.Выгрузить();
			ТаблицаПозицииКВозвратуСвернутая = ТаблицаПозицииКВозвратуРазвернутая.Скопировать();
			ТаблицаПозицииКВозвратуСвернутая.Свернуть("ТерминалДоставки,ИнтернетМагазин,Вскрытый,ДокументИсточник,Заказ,Номенклатура,ШтрихкодНоменклатурыИзмерение", "Количество,Сумма");
			
			Набор.Очистить();
			
			СтруктураПоиска = Новый Структура("ТерминалДоставки,ИнтернетМагазин,Вскрытый,ДокументИсточник,Заказ,Номенклатура,ШтрихкодНоменклатурыИзмерение");
			Для Каждого СтрокаТаблицы Из ТаблицаПозицииКВозвратуСвернутая Цикл
				НЗапись = Набор.Добавить();
				ЗаполнитьЗначенияСвойств(НЗапись, СтрокаТаблицы);
				ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТаблицы);
				СтрокиТаблицы = ТаблицаПозицииКВозвратуРазвернутая.НайтиСтроки(СтруктураПоиска);
				Если СтрокиТаблицы.Количество() Тогда
					//несвернутые поля
					ЗаполнитьЗначенияСвойств(НЗапись, СтрокиТаблицы[0], "ПериодОбработки,Магистраль,Цена,ВозвратОбработан,ТерминалПриема");
				КонецЕсли;
			КонецЦикла;
			
			
			
		КонецЕсли;
		//Асеев 24.09.2020 (Задача № 4271)<<<
		
		Набор.Записать(); 
			
	КонецЕсли;		
			

КонецПроцедуры



