
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Количество() И ТипЗнч(Отбор.Регистратор.Значение) <> Тип("ДокументСсылка.зпФиксацияМесяца") Тогда
		
		//Асеев 09.02.2024 (Задача № 5227)>>>
		Если РегистрыСведений.РежимыПроверокДокументовПриИзменении.ПолучитьРазрешенияДокумента(Отбор.Регистратор.Значение, Перечисления.ОбластиПроверокИзмененияДанных.зп_ФиксацияЗП) Тогда
			Возврат;
		КонецЕсли;
		ДатаРасчета = РегистрыСведений.зпИсходныеДанныеРасчетаМинимальнойЗП.ПолучитьДатуРасчетаЗапрещенныхКУдалениюЗаписей(Отбор.Регистратор.Значение);
		Если ДатаРасчета = Неопределено Тогда
			Возврат;
		КонецЕсли;
		Отказ = Истина;
		Сообщить("Произведена фиксация месяца по минимальной з/п " + Формат(ДатаРасчета, "ДФ='MMMM yyyy'"));
		//Асеев 09.02.2024 (Задача № 5227)<<<
		
	КонецЕсли;
	
КонецПроцедуры
