
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ИмяВариантаОтчета = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ИмяВариантаОтчета").Значение;	
	ЭтотОбъект.СхемаКомпоновкиДанных = ЭтотОбъект.ПолучитьМакет(ИмяВариантаОтчета);//Отчеты.ОтчетАгентаЯндекс.ПолучитьМакет(ИмяВариантаОтчета);
	Если ИмяВариантаОтчета = "ОтчетПоДоставке" Тогда 
		
		ПараметрДанныхОжидание = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Ожидание");	
		ПараметрДанныхОжидание.Значение = Справочники.ПоказателиРасчетаУслугСД.НайтиПоКоду("00000000007");
		ПараметрДанныхОжидание.Использование = Истина;    
		
		ПараметрДанныхСтрахование = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Страхование");	
		ПараметрДанныхСтрахование.Значение = Справочники.ПоказателиРасчетаУслугСД.НайтиПоКоду("00000000006");
		ПараметрДанныхСтрахование.Использование = Истина; 
				
	ИначеЕсли ИмяВариантаОтчета = "ОтчетПоПеречислению" Тогда 

		НеОплаченныеВМагазине = Истина;
		
	КонецЕсли;
	
КонецПроцедуры
