#Область ПрограммныйИнтерфейс

Процедура СохранитьДанныеСканированияДляФактическогоПрихода(ДатаСканирования, ФактическийПриход, Штрихкод, Заказ) экспорт
	//+Степанов Задача № 3935
	//НаборЗаписей = РегистрыСведений.ИсторияСканирования.СоздатьНаборЗаписей();
	//
	//НаборЗаписей.Отбор.Документ.Установить(ФактическийПриход);
	//НаборЗаписей.Отбор.Период.Установить(ДатаСканирования);
	//
	//НовЗапись = НаборЗаписей.Добавить();
	//
	//НовЗапись.Документ = ФактическийПриход;
	//НовЗапись.Период  = ДатаСканирования;
	//НовЗапись.Штрихкод = Штрихкод;
	//НовЗапись.Заказ = Заказ;
	//НовЗапись.Пользователь = ПараметрыСеанса.ТекущийПользователь;

	//НаборЗаписей.Записать(Истина);
	
	
	Попытка
		//Асеев 09.03.2021 (по письму Оперативная приемка (яндекс))>>>
		//ВнешнееЛогированиеСервер.ЗаписатьЛогСканирования_ОбщееВнешнееЛогирование(5, ТекущаяДата(), ПараметрыСеанса.РабочееМесто.Наименование, ФактическийПриход.Номер, Штрихкод, Заказ.Номер); 
		ВнешнееЛогированиеСервер.ЗаписатьЛогСканирования_ОбщееВнешнееЛогирование(5, ТекущаяДата(), ПараметрыСеанса.РабочееМесто.Наименование, ФактическийПриход.Номер, Штрихкод, ?(ЗначениеЗаполнено(Заказ), Заказ.Номер, "НД")); 
		//Асеев 09.03.2021 (по письму Оперативная приемка (яндекс))<<<
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;	
	//-Степанов Задача № 3935
	
КонецПроцедуры	


Функция ПолучитьДвоичныеДанныеКартинкиQR(СодержимоеQR = "") Экспорт
  
	КодGoogle = Ложь;
	Если КодGoogle Тогда
		Соединение = Новый HTTPСоединение("chart.googleapis.com", 80);
		
		// Get-запрос к ресурсу на сервере.
		Запрос = Новый HTTPЗапрос("/chart?choe=UTF-8&chld=H&cht=qr&chs=200x200&chl="+СодержимоеQR);
	Иначе
		Соединение = Новый HTTPСоединение("quickchart.io", 80);
		
		// Get-запрос к ресурсу на сервере.
		Запрос = Новый HTTPЗапрос("/chart?cht=qr&chld=H%7C1&chs=200x200&chl="+СодержимоеQR);
	КонецЕсли;
    Результат = Соединение.Получить(Запрос);
 
    // Сама картинка - уже в теле ответа 
	Возврат Результат.ПолучитьТелоКакДвоичныеДанные();
	
КонецФункции

#КонецОбласти