
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ВидПериодаУчета = Перечисления.упрВидыПериодовУчета.РазбивкаПоМесяцам Тогда
		Для Каждого СтрокаПериода Из ПериодыУчета Цикл
			Движение = Движения.упрУчетРасходов.Добавить();
			Движение.Период = СтрокаПериода.ПериодУчета;
			Движение.Регион = Регион;
			Движение.СтатьяРасходов = СтатьяРасходов;
			Движение.Контрагент = Контрагент;
			Движение.Сумма = СтрокаПериода.Сумма;
		КонецЦикла;
	Иначе
		Движение = Движения.упрУчетРасходов.Добавить();
		Движение.Период = НачалоПериодаУчета;
		Движение.Регион = Регион;
		Движение.СтатьяРасходов = СтатьяРасходов;
		Движение.Контрагент = Контрагент;
		Движение.Сумма = СуммаКУчету;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	НовыйДокумент = ЭтоНовый();
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", НовыйДокумент);
	
	Если Не НовыйДокумент Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	упрПлатежноеПоручение.Представление КАК Представление
		|ИЗ
		|	Документ.упрПлатежноеПоручение КАК упрПлатежноеПоручение
		|ГДЕ
		|	упрПлатежноеПоручение.ЗаписьРасхода = &Ссылка
		|	И НЕ упрПлатежноеПоручение.ПометкаУдаления";
		
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			Сообщить("Имеется " + Выборка.Представление + ". Изменение документа запрещено!");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ДополнительныеСвойства.ЭтоНовый Тогда
		ЗаписьРегистра = РегистрыСведений.упрСостоянияЗаписейРасходов.СоздатьМенеджерЗаписи();
		ЗаписьРегистра.Период = ТекущаяДата();
		ЗаписьРегистра.ЗаписьРасходов = Ссылка;
		ЗаписьРегистра.СостояниеЗаписиРасходов = Перечисления.упрСостоянияЗаписейРасходов.Новый;
		ЗаписьРегистра.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
КонецПроцедуры

