
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Установка параметров СКД
	// Владалец товара в группе КОМИТЕНТЫ
	ГруппаКонтрагентовКомитенты = Справочники.Контрагенты.НайтиПоКоду("000000004");
	
	КомпоновщикНастроек = Отчет.КомпоновщикНастроек;	
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ГруппаКонтрагентовКомитенты");
	ПараметрСКД.Использование = Истина;
	ПараметрСКД.Значение      = ГруппаКонтрагентовКомитенты;
	////////////////////////////////////////////////////////
	
КонецПроцедуры
