
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	
	СтандартнаяОбработка=ЛОжь;
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	Терминал = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Терминал"));
	
	// МАС - 24.08.2017 - №1746 --->> 
	//Терминал.Значение = ?(ЗначениеЗаполнено(ПараметрыСеанса.ТерминалДоставки), ПараметрыСеанса.ТерминалДоставки, Справочники.РегиональныеТерминалы.МоскваСтриж);
	ТермСпис = Новый СписокЗначений;
	Если ЗначениеЗаполнено(ПараметрыСеанса.ТерминалДоставки) Тогда		
		ТермСпис.Добавить(ПараметрыСеанса.ТерминалДоставки);
	Иначе
		ТермСпис.Добавить(Справочники.РегиональныеТерминалы.МоскваСтриж);
		ТермСпис.Добавить(Справочники.РегиональныеТерминалы.СПбСтриж);
	КонецЕсли;	
	Терминал.Значение = ТермСпис;
	// <<--- МАС 
	
	Терминал.Использование = Истина;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,Настройки,ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,,,Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	ПроцессорВывода.НачатьВывод();
	
	//Обл = ДокументРезультат.Область("R7:R12");
	//ДокументРезультат.ПовторятьПриПечатиСтроки = Обл;
	
	//ДокументРезультат.РазборПоКопиям = РазобратьПоКопиям;
	ДокументРезультат.Автомасштаб = истина;
	
	ЭлементРезультата = ПроцессорКомпоновки.Следующий();

	Пока ЭлементРезультата <> Неопределено Цикл
		Если ЭлементРезультата.ЗначенияПараметров.Количество()=1 Тогда
			Если ЭлементРезультата.ЗначенияПараметров[0].Значение = "Разорвать" Тогда
				ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
		КонецЕсли;
		ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
		ЭлементРезультата = ПроцессорКомпоновки.Следующий();
	КонецЦикла;
	ПроцессорВывода.ЗакончитьВывод();
	
	
КонецПроцедуры
