&НаКлиенте
Процедура ЗагрузитьПО(Команда)
	Д = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	Д.ПолноеИмяФайла = "";
	Фильтр = "Android Install Packages" 
	+ "(*.apk)|*.apk";
	Д.Фильтр = Фильтр;
	Д.МножественныйВыбор = Ложь;
	Д.Заголовок = "Выберите файл";
	Если Д.Выбрать() Тогда
		
		ЛокХранилище = Новый ХранилищеЗначения(Новый ДвоичныеДанные(Д.ПолноеИмяФайла));
		АдресПриложения = ПоместитьВоВременноеХранилище(ЛокХранилище, ЭтаФорма.УникальныйИдентификатор);
		НадписьПО = "Приложение загружено";
		Элементы.НадписьПО.ЦветТекста = WebЦвета.ЗеленыйЛес;
		ПриложениеИзменено = Истина;
	КонецеСли;	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	АдресПриложения = ПоместитьВоВременноеХранилище(ЭтотОбъект.Приложение.Получить(),ЭтаФорма.УникальныйИдентификатор);
	
	
	Зн = ЭтотОбъект.Приложение.получить();
	Если ЗначениеЗаполнено(Зн) Тогда
		НадписьПО = "Приложение загружено";
		Элементы.НадписьПО.ЦветТекста = WebЦвета.ЗеленыйЛес;
	Иначе
		НадписьПО = "Приложение не загружено";
		Элементы.НадписьПО.ЦветТекста = WebЦвета.Малиновый;
	КонецеСли;	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ПриложениеИзменено Тогда                                               
		ТекущийОбъект.Приложение = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресПриложения));
		ПриложениеИзменено = Ложь;
	КонецеСли;	
КонецПроцедуры


&НаКлиенте
Процедура ВыгрузитьПО(Команда)
	// Вставить содержимое обработчика.
	Если Не ЗначениеЗаполнено(АдресПриложения) Тогда
		Возврат;
	КонецеСли;
	
	Д = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Д.ПолноеИмяФайла = "lem.strizh.lem.str-arm.apk";
	Фильтр = "Android Install Packages" 
	+ "(*.apk)|*.apk";
	Д.Фильтр = Фильтр;
	Д.МножественныйВыбор = Ложь;
	Д.Заголовок = "Выберите файл";
	Если Д.Выбрать() Тогда
		
		Хр = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресПриложения));
		Дв = Хр.Получить().Получить();
		Дв.Записать(Д.ПолноеИмяФайла);
		Предупреждение("Пакет записан!");
	КонецеСли;		
КонецПроцедуры

