
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Ссылка.Пустая() Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("СхемаБрейков", Ссылка);
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК Поле1
		|ИЗ
		|	РегистрСведений.зпМинимальныеСтавки КАК зпМинимальныеСтавки
		|ГДЕ
		|	зпМинимальныеСтавки.БрейкОтработанныхДней.Владелец = &СхемаБрейков
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА
		|ИЗ
		|	РегистрСведений.зпМинимальныеСтавки КАК зпМинимальныеСтавки
		|ГДЕ
		|	зпМинимальныеСтавки.БрейкМинимальногоПроцентаВыполнения.Владелец = &СхемаБрейков";
		
		Если Не Запрос.Выполнить().Пустой() Тогда
			Отказ = Истина;
			Сообщить("Редактирование запрещено");
			Сообщить("Обнаружены данные по Схеме брейков!");
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры
