#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализацияНастроек();

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.НастройкиОтбораРассылки = Новый ХранилищеЗначения(ОтборЗаказов.Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийРеквизитовФормы
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервере
Функция ВыполнитьРассылкуНаСервере(ТолькоПоказать = Ложь)
	
	//тест
	//ПериодРассылки = Новый СтандартныйПериод(НачалоМесяца(Дата("20180901")), КонецМесяца(Дата("20180901")));
	//тест
	ПериодРассылки = Неопределено;
	
	ДанныеРассылки  = Неопределено;
	Если ТолькоПоказать Тогда			
		ДанныеРассылки = Справочники.ПрофилиРассылки.ОтправитьРассылку(Объект.Ссылка, ПериодРассылки, Истина, ОператорРассылки);	
		РезультатРассылки = ДанныеРассылки;
	Иначе	
		 ДанныеРассылки = Справочники.ПрофилиРассылки.ОтправитьРассылку(Объект.Ссылка, ПериодРассылки,, ОператорРассылки);
		 РезультатРассылки = ДанныеРассылки.ТаблицаЗаказов;
	КонецЕсли;
	//Возврат Справочники.ПрофилиРассылки.ОтправитьРассылку(Объект.Ссылка, , Истина);
	
	Если  ДанныеРассылки = Неопределено Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	ТабличныйДокумент = новый ТабличныйДокумент;
	
	Макет = Справочники.ПрофилиРассылки.ПолучитьМакет("ДанныеРассылки");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");

	ОбластьЗаголовок.Параметры.Профиль = СокрЛП(Объект.Ссылка);
	Если Не  ТолькоПоказать Тогда 
		
		ТекстИнфоПоРассылке = "";
		
		Для Каждого СтрокаИнфо Из ДанныеРассылки Цикл
			Если Не СтрокаИнфо.Ключ = "ТаблицаЗаказов" Тогда
				ТекстИнфоПоРассылке = ТекстИнфоПоРассылке + СокрЛП(СтрокаИнфо.Ключ) + ": " +  СокрЛП(СтрокаИнфо.Значение) + Символы.ПС;
			КонецЕслИ;
		КонецЦикла;
		
		ОбластьЗаголовок.Параметры.ИнфоПоРассылке = ТекстИнфоПоРассылке;
		
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	Для Каждого СтрокаРезультата  Из РезультатРассылки Цикл
		
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, СтрокаРезультата);
		ТабличныйДокумент.Вывести(ОбластьСтрока);

	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ОтображатьСетку = Ложь;
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьРассылку(Команда)
	//ВыполнитьРассылкуНаСервере();
	Если ЭтотОбъект.Модифицированность Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Профиль рассылки изменен, для получения данных необходимо записать профиль.");
	Иначе
		РезультатРассылки = ВыполнитьРассылкуНаСервере();
		Если Не РезультатРассылки = Неопределено Тогда
			РезультатРассылки.Показать("Результат рассылки");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДанныеРассылки(Команда)
	Если ЭтотОбъект.Модифицированность Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Профиль рассылки изменен, для получения данных необходимо записать профиль.");
	Иначе
		РезультатРассылки = ВыполнитьРассылкуНаСервере(Истина);
		Если Не РезультатРассылки = Неопределено Тогда
			РезультатРассылки.Показать("Результат рассылки");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализацияНастроек()
	
	НастройкиОтбора = Объект.Ссылка.НастройкиОтбораРассылки.Получить();
	ОО = РеквизитФормыВЗначение("Объект"); 
	СКД = ОО.ПолучитьМакет("ЗаказыОтбор");
	URLСКД = ПоместитьВоВременноеХранилище(СКД, Новый УникальныйИдентификатор());
	ОтборЗаказов.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСКД));
	
	НастройкиПоУмолчанию = СКД.НастройкиПоУмолчанию;
	ОтборЗаказов.ЗагрузитьНастройки(НастройкиПоУмолчанию);	
	
	Если НастройкиОтбора = Неопределено Тогда
		
		ЭтотОбъект.Модифицированность = Истина;
		
	Иначе
		
		ОтборЗаказов.ЗагрузитьНастройки(НастройкиОтбора);
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаИсключенийРассылки(Команда)

	ОткрытьФорму("Справочник.ПрофилиРассылки.Форма.ФормаИсключенийРассылки", Новый Структура("РежимСписка","Исключения"));
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаДоступныхДоменовРассылки(Команда)
	
	ОткрытьФорму("Справочник.ПрофилиРассылки.Форма.ФормаИсключенийРассылки", Новый Структура("РежимСписка","ДоступныеДомены"));

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОператорРассылки = 1;

КонецПроцедуры

#КонецОбласти
