
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Список.ТекущиеДанные;	
	Если ЗначениеЗаполнено(ТекДанные.Сделка) И НовыйМеханизмПриемки(ТекДанные.Сделка) Тогда
		СтандартнаяОбработка = Ложь;
		Парам = Новый Структура("Ключ", ВыбраннаяСтрока);		
		ОткрытьФорму("Документ.ВозвратТоваровПоставщику.Форма.ФормаДокументаУпр", Парам, ЭтаФорма);	
	КонецЕсли;
	
КонецПроцедуры

Функция НовыйМеханизмПриемки(ДокНаборка)

	Возврат ДокНаборка.НовыйМеханизм;
	
КонецФункции // ()
