
//**** Обработчики событий объекта ****//

//Синхронизация с КСЛ
//
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	Конецесли;
	
	Попытка
		новаОбменКСЛ.СохранитьСообщениеАРМВодителя(ЭтотОбъект);
	Исключение
		#Если Клиент Тогда			
			новаОбщиеПроцедуры.СообщитьПользователюОбОшибке("ВнутренняОшибкаСервера", ОписаниеОшибки());
		#КонецЕсли
		Отказ = Истина;
	КонецПопытки;
	
КонецПроцедуры

//Синхронизация с КСЛ
//
Процедура ПередУдалением(Отказ)
	
	Попытка
		новаОбменКСЛ.УдалитьСообщениеАРМВодителя(ЭтотОбъект);
	Исключение
		#Если Клиент Тогда			
			новаОбщиеПроцедуры.СообщитьПользователюОбОшибке("ВнутренняОшибкаСервера", ОписаниеОшибки());
		#КонецЕсли
		Отказ = Истина;
	КонецПопытки;
	
КонецПроцедуры
