
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = "Рейсы";
	
	ПараметрыОтбора = Неопределено;
	Если Параметры.Свойство("ПараметрыОтбора", ПараметрыОтбора) Тогда
		ЗначениеОтбора = Неопределено;
		Если ПараметрыОтбора.Свойство("ТерминалДоставки", ЗначениеОтбора) Тогда
		    ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТерминалДоставки");
		    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		    ЭлементОтбора.ПравоеЗначение = ЗначениеОтбора;
		    ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		    ЭлементОтбора.Использование = Истина;
			Заголовок = Заголовок + ", " + ЗначениеОтбора;
		КонецЕсли;
		Если ПараметрыОтбора.Свойство("ФизЛицо", ЗначениеОтбора) Тогда
			ГруппаОтбора = Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
			ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВодительФизЛицо");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = ЗначениеОтбора;
		    ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		    ЭлементОтбора.Использование = Истина;
			ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЭкспедиторФизЛицо");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = ЗначениеОтбора;
		    ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		    ЭлементОтбора.Использование = Истина;
			Заголовок = Заголовок + ", " + ЗначениеОтбора;
		КонецЕсли;
		Если ПараметрыОтбора.Свойство("Ссылка", ЗначениеОтбора) Тогда
			Элементы.Список.ТекущаяСтрока = ЗначениеОтбора;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	ОповеститьОВыборе(Значение);
	
КонецПроцедуры
