Перем Подкл;
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Подкл = Евген.СоздатьПодключениеКИнтернетМагазину(); 
КонецПроцедуры



//Функция СоздатьТаблицуСуммАдминки(МасНом) Экспорт
//	
//	НомерЗаказа = "";
//	Для Сч = 0 По МасНом.Количество() - 1 Цикл
//		НомерЗаказа = НомерЗаказа + СокрЛП(МасНом[Сч]) + ",";
//	КонецЦикла;	
//	
//	НомерЗаказа = Лев(НомерЗаказа, СтрДлина(НомерЗаказа) - 1);
//	
//	Соединение = Евген.СоздатьПодключениеКИнтернетМагазину();
//	Ткст = "select o.orderID, o.orderSumUSD_all
//	|from mv_OrderItemsSum o (nolock) where 
//	|o.orderId IN (" + Формат(НомерЗаказа, "ЧГ=") + ")";
//	
//	Попытка
//		RS = Евген.ЗапросКИнтернетМагазину(Ткст, Соединение);
//		Сп = СоздатьТаблицу(RS, "OrderID_Ч, orderSumUSD_all_Ч");
//	Исключение
//		#Если Клиент Тогда
//			Сообщить("Ошибка при обращении к данным админки...");
//			Возврат Неопределено;
//		#КонецЕСли	
//	КонецПопытки;	
//	Возврат Сп;
//КонецФункции



//Функция СоздатьТаблицу(RS, СписокКолонок) Экспорт
//	Таб = Новый ТаблицаЗначений;
//	Разделитель = Найти(СписокКолонок, ",");
//	Пока Разделитель > 0 Цикл
//		Таб.Колонки.Добавить(СокрЛП(Лев(СписокКолонок, Разделитель - 1)));
//		СписокКолонок = Сред(СписокКолонок, Разделитель + 1);
//		Разделитель = Найти(СписокКолонок, ",");
//	КонецЦикла;
//	Таб.Колонки.Добавить(СокрЛП(СписокКолонок));
//	
//	СписокКолонок = Таб.Колонки;
//	Пока НЕ RS.EOF Цикл
//		НоваяСтрока = Таб.Добавить();
//		Для Кол = 1 По СписокКолонок.Количество() Цикл
//			ИмяКолонки = СписокКолонок.Получить(Кол - 1).Имя;
//			Суффикс = Прав(ИмяКолонки, 2);
//			Если Суффикс = "_Ч" Тогда
//				НоваяСтрока.Установить(Кол - 1, RS.Fields(Лев(ИмяКолонки, СтрДлина(ИмяКолонки) - 2)).Value);
//			ИначеЕсли Суффикс = "_Д" Тогда
//				НоваяСтрока.Установить(Кол - 1, RS.Fields(Лев(ИмяКолонки, СтрДлина(ИмяКолонки) - 2)).Value);
//			Иначе
//				НоваяСтрока.Установить(Кол - 1,  СокрЛП(RS.Fields(ИмяКолонки).Value));
//			КонецЕсли;
//		КонецЦикла;
//		Rs.MoveNext()
//	КонецЦикла;
//	
//	Возврат Таб;
//КонецФункции

