
Процедура ОбработкаПроведения(Отказ, Режим)
	Если Не ЗначениеЗаполнено(ДатаНазначения) Тогда
		Сообщить("Не указана дата назначения!", СтатусСообщения.Важное);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Для Каждого стрПоказатель Из Показатели Цикл
		Если Не ЗначениеЗаполнено(стрПоказатель.Показатель) Тогда
			Сообщить("Строка " + Строка(стрПоказатель.НомерСтроки) + ": не заполнен показатель!", СтатусСообщения.Важное);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Движение = Движения.новаЗначенияПоказателейРасчетаНачислений.Добавить();
		Движение.Период = ДатаНазначения;
		ЗаполнитьЗначенияСвойств(Движение, стрПоказатель);
	КонецЦикла;
КонецПроцедуры
