
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Транспорт = Неопределено;
	Водитель = Неопределено;
	Экспедитор = Неопределено;
	
	Если ТипЗнч(ОтноситьНаОбъект) = Тип("СправочникСсылка.новаТранспорт") Тогда
		Транспорт = ОтноситьНаОбъект;
	
	ИначеЕсли ТипЗнч(ОтноситьНаОбъект) = Тип("СправочникСсылка.новаВодители") Тогда
		Водитель = ОтноситьНаОбъект;
	
	ИначеЕсли ТипЗнч(ОтноситьНаОбъект) = Тип("СправочникСсылка.новаЭкспедиторы") Тогда
		Экспедитор = ОтноситьНаОбъект;
		
	КонецЕсли;
	
	Для Каждого стрДоходРасход Из ДоходыРасходы Цикл
		Если стрДоходРасход.Сумма = 0 Тогда Продолжить; КонецЕсли;
		
		Движение = Движения.новаНераспределенныеДоходыРасходыМестнойДоставки.Добавить();
		Движение.Период = Дата;
		Движение.Транспорт = Транспорт;
		Движение.Водитель = Водитель;
		Движение.Экспедитор = Экспедитор;
		Движение.Статья = стрДоходРасход.Статья;
		Движение.Сумма = стрДоходРасход.Сумма;
	КонецЦикла;
КонецПроцедуры
