Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Макет = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиОтчета);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(
	СхемаКомпоновкиДанных,
	КомпоновщикНастроек.Настройки,
	ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	ОСКД = ПолучитьМакет("ЗакрытиеПредыдущегоДня");
	НастройкиОСКД = ОСКД.НастройкиПоУмолчанию;
	НастройкиОСКД.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода",КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[2].Значение.ДатаНачала);	
	НастройкиОСКД.ПараметрыДанных.УстановитьЗначениеПараметра("ТерминалДоставки",КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[3].Значение);
	Если КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[4].Использование Тогда
		НастройкиОСКД.ПараметрыДанных.УстановитьЗначениеПараметра("ИнтернетМагазин",КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[4].Значение);
	КонецЕсли;
	КомпоновщикМакетаОСКД = Новый КомпоновщикМакетаКомпоновкиДанных;
	ДанныеРасшифровкиСКД = Новый ДанныеРасшифровкиКомпоновкиДанных;
	СкомпонованныйМакет = КомпоновщикМакетаОСКД.Выполнить(ОСКД, НастройкиОСКД,ДанныеРасшифровкиСКД);
	ПроцессорКомпоновкиОСКД = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиОСКД.Инициализировать(СкомпонованныйМакет,,ДанныеРасшифровкиСКД);
	ПроцессорВыводаОСКД = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВыводаОСКД.УстановитьДокумент(ДокументРезультат);
	ПроцессорВыводаОСКД.Вывести(ПроцессорКомпоновкиОСКД);
	
КонецПроцедуры
