
#Область ПрограммныйИнтерфейс

#Область МаршрутизацияЯндекс
// Выполнить обмен получить содержимое страницы маршрутизации.
// 
// Параметры:
//  ОбщееСоединениеHTTP - Строка - Общее соединение HTTP
//  IDУзла - Строка - IDУзла
// 
// Возвращаемое значение:
//  Булево - Выполнить обмен получить содержимое страницы маршрутизации
Функция ВыполнитьОбмен_ПолучитьСодержимоеСтраницыМаршрутизации(ОбщееСоединениеHTTP = "", IDУзла) Экспорт
	СтруктураВызова = Новый Структура;
	СтруктураВызова.Вставить("ID", IDУзла);
	СтрокаJSON = СформироватьСтрокуJSON(СтруктураВызова);
	
	
	ОтветВызоваJSON = ВызватьФункциюHTTPСервиса(СтрокаJSON, "getRouteMapBody", ОбщееСоединениеHTTP);
	ВозниклаОшибка = Ложь;
	ОтветВызова = ДанныеJSONВСтруктуру(ОтветВызоваJSON, , ВозниклаОшибка);
	Если Не ВозниклаОшибка Тогда
		Если Не ОтветВызова.isEmpty Тогда
			Константы.СодержимоеВерсииСтраницыМаршрутизации.Установить(ОтветВызова.routeMapBody);
			Константы.ВерсияСтраницыМаршрутизации.Установить(ОтветВызова.routeMapVersion);
		Иначе
			Возврат Ложь;
		КонецеСли;	
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецеСли;
	
КонецФункции
#КонецОбласти


Функция ВыгрузитьДанныеСтатусов(ОбщееСоединениеHTTP = "") Экспорт
	ЗапросДокументов = Новый Запрос;
	
	ЗапросДокументов.Текст = "ВЫБРАТЬ
	                         |	ДанныеЗаказаВодителя.Номер КАК numberDoc,
	                         |	ДанныеЗаказаВодителя.Дата КАК Date,
	                         |	ВЫБОР
	                         |		КОГДА ДанныеЗаказаВодителя.Реализация.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
	                         |			ТОГДА ДанныеЗаказаВодителя.Реализация.Номер
	                         |		ИНАЧЕ """"
	                         |	КОНЕЦ КАК orderId,
	                         |	ВЫБОР
	                         |		КОГДА ДанныеЗаказаВодителя.Реализация.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор)
	                         |			ТОГДА ДанныеЗаказаВодителя.Реализация.Номер
	                         |		ИНАЧЕ """"
	                         |	КОНЕЦ КАК shipmentId,
	                         |	ЕСТЬNULL(ДанныеЗаказаВодителя.ПричинаОтказаПереноса.Код, """") КАК reasonRejectionId,
	                         |	ДанныеЗаказаВодителя.ДатаПереноса КАК DateReason,
	                         |	ДанныеЗаказаВодителя.СуммаНал КАК Summa,
	                         |	ЕСТЬNULL(ДанныеЗаказаВодителя.ВыбранныйТипОплаты.Код, """") КАК payTypeId,
	                         |	ЕСТЬNULL(ДанныеЗаказаВодителя.РезультатДоставки.Код, """") КАК ResultOfDelivery,
	                         |	ДанныеЗаказаВодителя.КоличествоМест КАК PiecesOfFreight,
	                         |	ЕСТЬNULL(ДанныеЗаказаВодителя.ОбъемныйБрейк.Код, """") КАК volumeBreakId,
	                         |	ДанныеЗаказаВодителя.КоличествоПалет КАК PaletCount,
	                         |	ВЫБОР
	                         |		КОГДА ДанныеЗаказаВодителя.ВидПодъема = ЗНАЧЕНИЕ(Перечисление.ВидыПодъемовВодителя.Лифт)
	                         |			ТОГДА 1
	                         |		КОГДА ДанныеЗаказаВодителя.ВидПодъема = ЗНАЧЕНИЕ(Перечисление.ВидыПодъемовВодителя.РучнойПодъем)
	                         |			ТОГДА 2
	                         |		КОГДА ДанныеЗаказаВодителя.ВидПодъема = ЗНАЧЕНИЕ(Перечисление.ВидыПодъемовВодителя.БезПодъема)
	                         |			ТОГДА 3
	                         |		ИНАЧЕ 0
	                         |	КОНЕЦ КАК TypeOfLifting,
	                         |	ДанныеЗаказаВодителя.Этаж КАК FloorOfLifting,
	                         |	ЕСТЬNULL(ДанныеЗаказаВодителя.Чек.ИдентификаторЧекаНаСервере, """") КАК idCheck,
	                         |	ЕСТЬNULL(ДанныеЗаказаВодителя.ТипОплаты.Код, """") КАК payTypeIdCheck,
	                         |	ДанныеЗаказаВодителя.КоличествоПовторовЗапросаСостоянияЧека КАК countRequestPrintingCheck,
	                         |	ДанныеЗаказаВодителя.ДатаОтправкиЧекаНаПечать КАК dateOfSendingDataOfCheck,
	                         |	ДанныеЗаказаВодителя.ДатаПечатиЧеков КАК dateOfPrintingCheck,
	                         |	ДанныеЗаказаВодителя.АдресОтправкиЧека КАК emailRecepient,
	                         |	ДанныеЗаказаВодителя.ОшибкаФормированияЧекаНаСервере КАК errorFormingCheck,
	                         |	ЕСТЬNULL(ДанныеЗаказаВодителя.ВозвратныйЧек.ИдентификаторЧекаНаСервере, """") КАК idReturnCheck,
	                         |	ДанныеЗаказаВодителя.КодПодъемногоБрейка КАК liftingBreakId,
	                         |	ДанныеЗаказаВодителя.ВесЗаказа КАК liftingWeight,
	                         |	ДанныеЗаказаВодителя.СтоимостьПодъемаРассчитанная КАК liftingCalcSum,
	                         |	ДанныеЗаказаВодителя.СтоимостьПодъемаПодтвержденная КАК liftingApprovedSum,
	                         |	ДанныеЗаказаВодителя.КоличествоХодокНаЭтаж КАК liftingCountOfWalkersPerFloor,
	                         |	ЕСТЬNULL(ДанныеЗаказаВодителя.Реализация.ВесЗаказа, """") КАК liftingWeightUploaded,
	                         |	ДанныеЗаказаВодителя.КодИдентификацииКлиента КАК customerIdentificationCode,
	                         |	ЕСТЬNULL(ДанныеЗаказаВодителя.Реализация.ИдентификаторРейса, """") КАК routeId,
	                         |	ДанныеЗаказаВодителя.СтатусУстановленБезКИК КАК statusSetWithoutCIC,
	                         |	ДанныеЗаказаВодителя.ОплаченаСтоимостьДоставкиПриОтменеЗаказа КАК CostDelivRequiredIfRefuse,
	                         |	ДанныеЗаказаВодителя.РасчетнаяСтоимостьДоставки КАК calculatedDeliveryCost,
	                         |	ДанныеЗаказаВодителя.СуммаДоставка КАК DeliveryCost,
	                         |	ДанныеЗаказаВодителя.ДоставленныеТовары.(
	                         |		ЕСТЬNULL(ДанныеЗаказаВодителя.ДоставленныеТовары.Номенклатура.Код, """") КАК goodsId,
	                         |		КоличествоДоставлено КАК count,
	                         |		ШтрихкодТовара КАК goodsBarcode,
	                         |		КодМаркировки КАК markingCode
	                         |	) КАК ДоставленныеТовары,
	                         |	ДанныеЗаказаВодителя.ВерсияКонфигурации КАК MetadataVersion,
	                         |	ДанныеЗаказаВодителя.ОплатаЧерезAssist КАК paymentThroughAssist,
	                         |	ЕСТЬNULL(ДанныеЗаказаВодителя.Организация.Код, """") КАК organization,
	                         |	ДанныеЗаказаВодителя.БылаПроизведенаПримерка КАК fittingHappened,
	                         |	ДанныеЗаказаВодителя.КоличествоSKUПримерки КАК countSKUForFitting,
	                         |	ДанныеЗаказаВодителя.ВозвратНаДоставку КАК returnToDelivery
	                         |ИЗ
	                         |	Документ.ДанныеЗаказаВодителя КАК ДанныеЗаказаВодителя
	                         |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ДанныеЗаказаВодителя.Изменения КАК ДанныеЗаказаВодителяИзменения
	                         |		ПО ДанныеЗаказаВодителя.Ссылка = ДанныеЗаказаВодителяИзменения.Ссылка
	                         |ГДЕ
	                         |	ДанныеЗаказаВодителяИзменения.Узел = &Узел
	                         |	И ДанныеЗаказаВодителя.Дата МЕЖДУ &ДатаНач И &ДатаКон";
	
	ЗапросДокументов.УстановитьПараметр("ДатаНач", НачалоДня(ТекущаяДата() - 86400));
	ЗапросДокументов.УстановитьПараметр("ДатаКон", КонецДня(ТекущаяДата()));
	ЗапросДокументов.УстановитьПараметр("Узел", Константы.УзелПланаОбмена.Получить());
	
	РезультатПоСтатусам = ЗапросДокументов.Выполнить();
	ВыборкаСтатусов = РезультатПоСтатусам.Выбрать();
	
	МассивДокументов = Новый Массив;
	
	Пока ВыборкаСтатусов.Следующий() Цикл
		СтруктураДокумента = Новый Структура;
		Для каждого ТекКолонка Из РезультатПоСтатусам.Колонки Цикл
			Если ТекКолонка.Имя <> "ДоставленныеТовары" Тогда
				СтруктураДокумента.Вставить(ТекКолонка.Имя, ВыборкаСтатусов[ТекКолонка.Имя]);
			КонецеСли;
		КонецЦикла;	
		ВыборкаСтрок = ВыборкаСтатусов.ДоставленныеТовары.Выбрать();
		МассивСтрок = новый Массив;
		Пока ВыборкаСтрок.Следующий() Цикл
			СтруктураСтрокиДокумента = Новый Структура;
			СтруктураСтрокиДокумента.Вставить("goodsId", ВыборкаСтрок["goodsId"]);
			СтруктураСтрокиДокумента.Вставить("count", ВыборкаСтрок["count"]);
			СтруктураСтрокиДокумента.Вставить("markingCode", ВыборкаСтрок["markingCode"]);   
			СтруктураСтрокиДокумента.Вставить("goodsBarcode", ВыборкаСтрок["goodsBarcode"]);
			МассивСтрок.Добавить(СтруктураСтрокиДокумента);
		КонецЦикла;	
		СтруктураДокумента.Вставить("goods", МассивСтрок);
		МассивДокументов.Добавить(СтруктураДокумента);
	КонецЦикла;	
	
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("IDMA", Константы.ИдентификаторМП.Получить());   
	СтруктураЗапроса.Вставить("statuses", МассивДокументов);
	
	СтрокаЗапроса = СформироватьСтрокуJSON(СтруктураЗапроса);
	СтрокаОтвета = ВызватьФункциюHTTPСервиса(СтрокаЗапроса, "unloadStatusInfo", ОбщееСоединениеHTTP);
	
	Если ЗначениеЗаполнено(СтрокаОтвета) Тогда
		ВозниклаОшибка = Ложь;
		ДанныеОтвета = ДанныеJSONВСтруктуру(СтрокаОтвета, , ВозниклаОшибка);
		Если ВозниклаОшибка Тогда
			Возврат Ложь;
		КонецеСли;	
		Попытка
			Если ДанныеОтвета.result И Не ДанныеОтвета.error Тогда
				УдалитьРегистрацию_ДанныеЗаказаВодителя(ДанныеОтвета.numbers);
				Возврат Истина;
			ИначеЕсли ДанныеОтвета.error Тогда
				ОбщегоНазначенияСервер.ЗаписатьОшибкуВЛог(ДанныеОтвета.errorText);
				Возврат Ложь;
			КонецеСли;	
		исключение
			ОбщегоНазначенияСервер.ЗаписатьОшибкуВЛог(ОписаниеОшибки() + "-----" + СтрокаОтвета);
		КонецПопытки;
	Иначе	
		ОбщегоНазначенияСервер.ЗаписатьОшибкуВЛог("Не могу выгрузить статусы, http");
	КонецеСли;
КонецФункции	
	
// Выполнить обмен поставщики товаров.
// 
// Параметры:
//  ОбщееСоединениеHTTP - Строка - Общее соединение HTTP
// 
// Возвращаемое значение:
//  Булево - Выполнить обмен поставщики товаров
Функция ВыполнитьОбмен_ПоставщикиТоваров(ОбщееСоединениеHTTP = "", IDУзла) Экспорт
	СтруктураВызова = Новый Структура;
	СтруктураВызова.Вставить("ID", IDУзла);
	
	СтрокаJSON = СформироватьСтрокуJSON(СтруктураВызова);
	Попытка
		ОтветМетода = Новый Структура;
		ДанныеПоставщиков = ВызватьФункциюHTTPСервиса(СтрокаJSON, "getGoodsSellers", ОбщееСоединениеHTTP);
		
		
		СтруктураВызова = Новый Структура;
		
		ВозниклаОшибка = Ложь;
		Поставщики = ДанныеJSONВСтруктуру(ДанныеПоставщиков, , ВозниклаОшибка);
		Если ВозниклаОшибка Тогда
			ОтветМетода.Вставить("РезультатВызова", Ложь);
			ОтветМетода.Вставить("ОписаниеОшибки", "Возникла ошибка при запросе getTrips!");
			Возврат ОтветМетода;
		КонецеСли;	   
		
			
		ТаблицаРеквизитовПоставщиков = Новый ТаблицаЗначений;
		ТаблицаРеквизитовПоставщиков.Колонки.Добавить("Код",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(11)));
		ТаблицаРеквизитовПоставщиков.Колонки.Добавить("Наименование",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(100)));
		ТаблицаРеквизитовПоставщиков.Колонки.Добавить("ИНН",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(12)));
		ТаблицаРеквизитовПоставщиков.Колонки.Добавить("Телефон",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(20)));	
			
		Для каждого Тек Из Поставщики Цикл
			НовСтрока = ТаблицаРеквизитовПоставщиков.Добавить();
			НовСтрока.Код = Тек.id;
			НовСтрока.Наименование = Тек.name;
			НовСтрока.ИНН = Тек.inn;
			НовСтрока.Телефон = Тек.phoneNumber;
		КонецЦикла;	
		
		Зап = Новый Запрос;
		Зап.Текст = "ВЫБРАТЬ
		            |	ТЗПоставщики.Код КАК Код,
		            |	ТЗПоставщики.Наименование КАК Наименование,
		            |	ТЗПоставщики.Инн КАК Инн,
		            |	ТЗПоставщики.Телефон КАК Телефон
		            |ПОМЕСТИТЬ ТабПоставщиков
		            |ИЗ
		            |	&ТЗПоставщики КАК ТЗПоставщики
		            |;
		            |
		            |////////////////////////////////////////////////////////////////////////////////
		            |ВЫБРАТЬ
		            |	ТабПоставщиков.Код КАК Код,
		            |	ТабПоставщиков.Наименование КАК Наименование,
		            |	ТабПоставщиков.Инн КАК Инн,
		            |	ТабПоставщиков.Телефон КАК Телефон,
		            |	ПоставщикиТоваров.Ссылка КАК Поставщик
		            |ИЗ
		            |	ТабПоставщиков КАК ТабПоставщиков
		            |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПоставщикиТоваров КАК ПоставщикиТоваров
		            |		ПО ТабПоставщиков.Код = ПоставщикиТоваров.Код";
		Зап.УстановитьПараметр("ТЗПоставщики", ТаблицаРеквизитовПоставщиков);
		ВыборкаПоставщиков = Зап.Выполнить().Выбрать();
		
		МассивКодов = Новый Массив;
		
		Пока ВыборкаПоставщиков.Следующий() Цикл
			Если ЗначениеЗаполнено(ВыборкаПоставщиков.Поставщик) Тогда
				Поставщик = ВыборкаПоставщиков.Поставщик.ПолучитьОбъект();
			Иначе
				Поставщик = Справочники.ПоставщикиТоваров.СоздатьЭлемент();
				Поставщик.Код = ВыборкаПоставщиков.Код;
			КонецеСли;
			
			
			Поставщик.Наименование = ВыборкаПоставщиков.Наименование;
			Поставщик.Инн = ВыборкаПоставщиков.Инн;
			Поставщик.Телефон = ВыборкаПоставщиков.Телефон;
			Поставщик.Записать();
			МассивКодов.Добавить(Поставщик.Код);
		конецЦикла;	
		
		Если МассивКодов.Количество() <> 0 Тогда
			РезультатВызова = СнятьРегистрациюСОбъектовЦУ(ОбщееСоединениеHTTP, МассивКодов, IDУзла, "Справочник.ПоставщикиТоваров");
			ОтветМетода.Вставить("РезультатВызова", РезультатВызова);
		Иначе
			ОтветМетода.Вставить("РезультатВызова", Истина);
		КонецЕсли;	
	Исключение
		ТОшибки = ОписаниеОшибки();
		ОбщегоНазначенияСервер.ЗаписатьОшибкуВЛог(ТОшибки);
		ОтветМетода.Вставить("РезультатВызова", Ложь);
		ОтветМетода.Вставить("ОписаниеОшибки", ТОшибки);
		Возврат ОтветМетода;		
	КонецПопытки;	
	Возврат ОтветМетода;
		
КонецФункции	


	


Функция ВыполнитьОбмен_ВыгрузкаТранзакцийСБП(ОбщееСоединениеHTTP = "") Экспорт
	КодУзла = Константы.ИдентификаторМП.Получить();
	УзелПланаОбмена = Константы.УзелПланаОбмена.Получить();
	СтруктураВызова = Новый Структура;
	СтруктураВызова.Вставить("ID", КодУзла);
	
	МассивТранзакций = Новый Массив;
	ЗапросТранзакций = Новый Запрос;	
	ЗапросТранзакций.Текст = "ВЫБРАТЬ
	                         |	ТранзакцииСБП.Заказ.Номер КАК order,
	                         |	ТранзакцииСБП.ЭтапПроцессаОплаты КАК stagePaymentProcess,
	                         |	ТранзакцииСБП.Сумма КАК total,
	                         |	ЕСТЬNULL(ТранзакцииСБП.Организация.Код, """") КАК Organization,
	                         |	ТранзакцииСБП.КодСообщения КАК code,
	                         |	ТранзакцииСБП.qrID КАК qrID,
	                         |	ТранзакцииСБП.qrUrl КАК qrUrl,
	                         |	ТранзакцииСБП.СтатусПлатежа КАК paymentStatus,
	                         |	ТранзакцииСБП.ДатаТранзакции КАК transactionDate,
	                         |	ТранзакцииСБП.ИдентификаторТранзакции КАК transactionId,
	                         |	ТранзакцииСБП.Сообщение КАК message,
	                         |	ТранзакцииСБП.Период КАК period
	                         |ИЗ
	                         |	РегистрСведений.ТранзакцииСБП.Изменения КАК ТранзакцииСБПИзменения
	                         |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТранзакцииСБП КАК ТранзакцииСБП
	                         |		ПО ТранзакцииСБПИзменения.Период = ТранзакцииСБП.Период
	                         |			И ТранзакцииСБПИзменения.Заказ = ТранзакцииСБП.Заказ
	                         |ГДЕ
	                         |	ТранзакцииСБПИзменения.Узел = &Узел";
	ЗапросТранзакций.УстановитьПараметр("Узел", УзелПланаОбмена);
	РезультатЗапроса = ЗапросТранзакций.Выполнить();
	ВыборкаТранзакций = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаТранзакций.Следующий() Цикл
		СтруктураТранзакции = Новый Структура;
		Для каждого ТекКолонка Из РезультатЗапроса.Колонки Цикл
			Если ТекКолонка.Имя = "stagePaymentProcess" Тогда	
				Если ЗначениеЗаполнено(ВыборкаТранзакций.stagePaymentProcess) Тогда
					ИндексЗначенияПеречисления = Перечисления.ЭтапыПроцессаОплатыСБП.Индекс(ВыборкаТранзакций.stagePaymentProcess);
					СтруктураТранзакции.Вставить(ТекКолонка.Имя, Метаданные.Перечисления.ЭтапыПроцессаОплатыСБП.ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя);
				Иначе
					СтруктураТранзакции.Вставить(ТекКолонка.Имя, "");
				КонецеСли;	
			ИначеЕсли ТекКолонка.Имя = "paymentStatus" Тогда	
				Если ЗначениеЗаполнено(ВыборкаТранзакций.paymentStatus) Тогда
					ИндексЗначенияПеречисления = Перечисления.СтатусыПлатежаСБП.Индекс(ВыборкаТранзакций.paymentStatus);
					СтруктураТранзакции.Вставить(ТекКолонка.Имя, Метаданные.Перечисления.СтатусыПлатежаСБП.ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя);
				Иначе
					СтруктураТранзакции.Вставить(ТекКолонка.Имя, "");
				КонецеСли;
			//ИначеЕсли ТекКолонка.Имя = "order" Тогда	
			//	СтруктураТранзакции.Вставить(ТекКолонка.Имя, СокрЛП(ВыборкаТранзакций[ТекКолонка.Имя]));				
			Иначе	
				СтруктураТранзакции.Вставить(ТекКолонка.Имя, ВыборкаТранзакций[ТекКолонка.Имя]);
			КонецЕсли;	
		КонецЦикла;	
		МассивТранзакций.Добавить(СтруктураТранзакции);
	КонецЦикла;	
	СтруктураВызова.Вставить("arrayOfTransactionQPS", МассивТранзакций);
	Если МассивТранзакций.Количество() = 0 Тогда
		Возврат Истина;
	КонецеСли;	
	
	
	СтрокаJSON = СформироватьСтрокуJSON(СтруктураВызова);
	ОтветВызоваJSON = ВызватьФункциюHTTPСервиса(СтрокаJSON, "loadTransactionsQPS", ОбщееСоединениеHTTP);
	ВозниклаОшибка = Ложь;
	ОтветВызова = ДанныеJSONВСтруктуру(ОтветВызоваJSON, , ВозниклаОшибка);
	Если ОтветВызова.result Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(УзелПланаОбмена.Ссылка, Метаданные.РегистрыСведений.ТранзакцииСБП);
	Иначе
		Возврат Ложь;
	КонецеСли;	
	Возврат Истина;
КонецФункции	


Функция ВыполнитьОбмен_ВыгрузкаТранзакцийAssist(ОбщееСоединениеHTTP = "") Экспорт
	КодУзла = Константы.ИдентификаторМП.Получить();
	УзелПланаОбмена = Константы.УзелПланаОбмена.Получить();
	СтруктураВызова = Новый Структура;
	СтруктураВызова.Вставить("ID", КодУзла);
	
	МассивТранзакций = Новый Массив;
	ЗапросТранзакций = Новый Запрос;	
	ЗапросТранзакций.Текст = "ВЫБРАТЬ
	                         |	ТранзакцииAssist.Заказ.Номер КАК order,
	                         |	ТранзакцииAssist.Сумма КАК total,
	                         |	ЕСТЬNULL(ТранзакцииAssist.Организация.Код, """") КАК Organization,
	                         |	ТранзакцииAssist.billnumber КАК billnumber,
	                         |	ТранзакцииAssist.Оплачен КАК payed,
	                         |	ТранзакцииAssist.ДатаТранзакции КАК transactionDate,
	                         |	ТранзакцииAssist.ТипОплаты.Код КАК PayType,
	                         |	ТранзакцииAssist.Рейс.НомерРейса КАК route,
	                         |	ЕСТЬNULL(ТранзакцииAssist.Водитель.Код, """") КАК driverId,
	                         |	ЕСТЬNULL(ТранзакцииAssist.Экспедитор.Код, """") КАК forwarderId,
	                         |	ТранзакцииAssist.merchant_id КАК merchant_id,
	                         |	ТранзакцииAssist.Период КАК period,
	                         |	ТранзакцииAssist.ТипОперации КАК OperationType
	                         |ИЗ
	                         |	РегистрСведений.ТранзакцииAssist.Изменения КАК ТранзакцииAssistИзменения
	                         |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТранзакцииAssist КАК ТранзакцииAssist
	                         |		ПО ТранзакцииAssistИзменения.Период = ТранзакцииAssist.Период
	                         |			И ТранзакцииAssistИзменения.Заказ = ТранзакцииAssist.Заказ
	                         |ГДЕ
	                         |	ТранзакцииAssistИзменения.Узел = &Узел";
	ЗапросТранзакций.УстановитьПараметр("Узел", УзелПланаОбмена);
	РезультатЗапроса = ЗапросТранзакций.Выполнить();
	ВыборкаТранзакций = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаТранзакций.Следующий() Цикл
		Если Не ЗначениеЗаполнено(ВыборкаТранзакций.PayType) Тогда
			Продолжить;
		КонецеСли;	
		СтруктураТранзакции = Новый Структура;
		Для каждого ТекКолонка Из РезультатЗапроса.Колонки Цикл
			Если ТекКолонка.Имя = "OperationType" Тогда	
				Если ЗначениеЗаполнено(ВыборкаТранзакций.OperationType) Тогда
					ИндексЗначенияПеречисления = Перечисления.ТипыОперацийAssist.Индекс(ВыборкаТранзакций.OperationType);
					СтруктураТранзакции.Вставить(ТекКолонка.Имя, Метаданные.Перечисления.ТипыОперацийAssist.ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя);
				Иначе
					СтруктураТранзакции.Вставить(ТекКолонка.Имя, "");
				КонецеСли;	
			Иначе
				СтруктураТранзакции.Вставить(ТекКолонка.Имя, ВыборкаТранзакций[ТекКолонка.Имя]);
			КонецЕсли;	
		КонецЦикла;	
		МассивТранзакций.Добавить(СтруктураТранзакции);
	КонецЦикла;	
	СтруктураВызова.Вставить("arrayOfTransactionAssist", МассивТранзакций);
	Если МассивТранзакций.Количество() = 0 Тогда
		Возврат Истина;
	КонецеСли;	
	
	
	СтрокаJSON = СформироватьСтрокуJSON(СтруктураВызова);
	ОтветВызоваJSON = ВызватьФункциюHTTPСервиса(СтрокаJSON, "loadTransactionsAssist", ОбщееСоединениеHTTP);
	ВозниклаОшибка = Ложь;
	ОтветВызова = ДанныеJSONВСтруктуру(ОтветВызоваJSON, , ВозниклаОшибка);
	Попытка
		Если ОтветВызова.result Тогда
			//спорное решение, но пока так
			ПланыОбмена.УдалитьРегистрациюИзменений(УзелПланаОбмена.Ссылка, Метаданные.РегистрыСведений.ТранзакцииAssist);
		Иначе
			Возврат Ложь;
		КонецеСли;	
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;
КонецФункции	


Функция ВыполнитьОбмен_ДанныхИнформированияОИзмененияхВЗаказе(ОбщееСоединениеHTTP = "") Экспорт
	Рейс = ОбщегоНазначенияСервер.ПолучитьТекущийРейс();
	Если Не ЗначениеЗаполнено(Рейс) Тогда
		Возврат Истина;
	КонецЕсли;	
	СтруктураВызова = Новый Структура;
	СтруктураВызова.Вставить("routeId", Рейс.НомерРейса);
	Транспорт = Константы.Транспорт.Получить().Код;
	СтрокаJSON = СформироватьСтрокуJSON(СтруктураВызова);
	ДанныеИнформированияJSON = ВызватьФункциюHTTPСервиса(СтрокаJSON, "getInformationChangesOrders", ОбщееСоединениеHTTP);
	
	
	ВозниклаОшибка = Ложь;
	ДанныеИнформирования = ДанныеJSONВСтруктуру(ДанныеИнформированияJSON, "period" , ВозниклаОшибка);
	Если ВозниклаОшибка Тогда
		Возврат Ложь;
	КонецеСли;	   
	
	
	Если Не ЗначениеЗаполнено(ДанныеИнформирования.arrayOfChangesOrders) Тогда
		Возврат Истина;
	КонецеСли;	
	
	ТаблицаИнформации = Новый ТаблицаЗначений;
	ТаблицаИнформации.Колонки.Добавить("НомерЗаказа",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(11)));
	ТаблицаИнформации.Колонки.Добавить("НаименованиеРеквизита", Новый ОписаниеТипов("ПеречислениеСсылка.РеквизитыЗаказа"));
	ТаблицаИнформации.Колонки.Добавить("СтароеЗначение",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(100)));	
	ТаблицаИнформации.Колонки.Добавить("НовоеЗначение",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(100)));	
	ТаблицаИнформации.Колонки.Добавить("ПериодЗаписи",Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	
	МассивДляОтправки = Новый Массив;
	
	Для Каждого Тек Из ДанныеИнформирования.arrayOfChangesOrders Цикл
		Нов = ТаблицаИнформации.Добавить();
		Нов.НомерЗаказа = Тек.order;
		Нов.НаименованиеРеквизита = Перечисления.РеквизитыЗаказа[Тек.property];
		Нов.СтароеЗначение = Тек.oldValue;
		Нов.НовоеЗначение = Тек.newValue;
		Нов.ПериодЗаписи = Тек.period;
		
		//Копирование данных для отправки
		КопияСтруктуры = Новый Структура;
		Для Каждого ЭлементСтруктуры Из Тек Цикл
			КопияСтруктуры.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
		КонецЦикла;
		КопияСтруктуры.Вставить("routeId", Рейс.НомерРейса);
		КопияСтруктуры.Вставить("carId", Транспорт);
		КопияСтруктуры.Вставить("period", ТекущаяДата());
		МассивДляОтправки.Добавить(КопияСтруктуры);
	КонецЦикла;	
	
	
	ЗапросМассивИнформации = Новый Запрос;
	ЗапросМассивИнформации.Текст = "ВЫБРАТЬ
	                         |	Таб.НомерЗаказа КАК НомерЗаказа,
	                         |	Таб.НаименованиеРеквизита КАК НаименованиеРеквизита,
	                         |	Таб.СтароеЗначение КАК СтароеЗначение,
	                         |	Таб.НовоеЗначение КАК НовоеЗначение,
							 |	Таб.ПериодЗаписи КАК ПериодЗаписи
	                         |ПОМЕСТИТЬ ВТ_Данные
	                         |ИЗ
	                         |	&Таб КАК Таб
	                         |;
	                         |
	                         |////////////////////////////////////////////////////////////////////////////////
	                         |ВЫБРАТЬ
	                         |	ВТ_Данные.НомерЗаказа КАК НомерЗаказа,
	                         |	ВТ_Данные.НаименованиеРеквизита КАК НаименованиеРеквизита,
	                         |	ВТ_Данные.СтароеЗначение КАК СтароеЗначение,
	                         |	ВТ_Данные.НовоеЗначение КАК НовоеЗначение,
							 |	ВТ_Данные.ПериодЗаписи КАК ПериодЗаписи,
	                         |	Заказ.Ссылка КАК Заказ
	                         |ИЗ
	                         |	ВТ_Данные КАК ВТ_Данные
	                         |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заказ КАК Заказ
	                         |		ПО ВТ_Данные.НомерЗаказа = Заказ.Номер";
	ЗапросМассивИнформации.УстановитьПараметр("Таб", ТаблицаИнформации);
	
	МассивИнформации = ЗапросМассивИнформации.Выполнить().Выбрать();
	
	//поиск причны отмены
	
	РезультатОтмены = "";
	РезультатПереноса = "";
	
	ЗапРезультаты = Новый Запрос;
	ЗапРезультаты.Текст = "ВЫБРАТЬ
	                      |	РезультатыДоставки.Ссылка КАК Отмена,
	                      |	"""" КАК Перенос
	                      |ИЗ
	                      |	Справочник.РезультатыДоставки КАК РезультатыДоставки
	                      |ГДЕ
	                      |	РезультатыДоставки.Отмена = ИСТИНА
	                      |	И РезультатыДоставки.Заезд = ЛОЖЬ
	                      |
	                      |ОБЪЕДИНИТЬ
	                      |
	                      |ВЫБРАТЬ
	                      |	"""",
	                      |	РезультатыДоставки.Ссылка
	                      |ИЗ
	                      |	Справочник.РезультатыДоставки КАК РезультатыДоставки
	                      |ГДЕ
	                      |	РезультатыДоставки.Перенос = ИСТИНА
	                      |	И РезультатыДоставки.Заезд = ЛОЖЬ";
	ВыбРезультаты = ЗапРезультаты.Выполнить().Выбрать();
	Пока ВыбРезультаты.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыбРезультаты.Отмена) Тогда
			РезультатОтмены = ВыбРезультаты.Отмена;
		КонецеСли;	
			
		Если ЗначениеЗаполнено(ВыбРезультаты.Перенос) Тогда
			РезультатПереноса = ВыбРезультаты.Перенос;
		КонецеСли;	
	КонецЦикла;	
	
	Пока МассивИнформации.Следующий() Цикл
		Наб = РегистрыСведений.ИнформированиеЭкипажейОбИзмененияхВЗаказах.СоздатьНаборЗаписей();
		Наб.Отбор.Период.Установить(МассивИнформации.ПериодЗаписи);
		Наб.Отбор.Заказ.Установить(МассивИнформации.Заказ);
		Наб.Отбор.Реквизит.Установить(МассивИнформации.НаименованиеРеквизита);
		
		Нов = Наб.Добавить();
		Нов.Период = МассивИнформации.ПериодЗаписи;
		Нов.Заказ = МассивИнформации.Заказ;
		Нов.Реквизит = МассивИнформации.НаименованиеРеквизита;
		Нов.Рейс = Рейс;
		Если МассивИнформации.НаименованиеРеквизита = Перечисления.РеквизитыЗаказа.ДатаДоставки Тогда
			Нов.СтароеЗначение = Дата(МассивИнформации.СтароеЗначение);
			Нов.НовоеЗначение = Дата(МассивИнформации.НовоеЗначение);
		Иначе
			Нов.СтароеЗначение = МассивИнформации.СтароеЗначение;
			Нов.НовоеЗначение = МассивИнформации.НовоеЗначение;
		КонецеСли;
		
		Если МассивИнформации.НаименованиеРеквизита = Перечисления.РеквизитыЗаказа.ЗапросНаСвязьОтПолучателя Тогда
			Нов.НовоеЗначение = Дата(МассивИнформации.НовоеЗначение);
		КонецеСли;
		
		
		Наб.Записать();
		
		
		
		//переносим заказ в отклоненные или меняем дату доставки
		Заказ = МассивИнформации.Заказ.ПолучитьОбъект();
		Если МассивИнформации.НаименованиеРеквизита = Перечисления.РеквизитыЗаказа.СостояниеЗаказаОтменен Тогда
			Заказ.РезультатДоставки = РезультатОтмены;
			Заказ.Записать(РежимЗаписиДокумента.Запись);
			Документы.ДанныеЗаказаВодителя.ЭмуляцияВводаДанныхВодителемПоИнициативеПартнера(Заказ.Ссылка, РезультатОтмены);
		Конецесли;	
		
		Если МассивИнформации.НаименованиеРеквизита = Перечисления.РеквизитыЗаказа.ДатаДоставки Тогда
			Заказ.РезультатДоставки = РезультатПереноса;
			Заказ.Записать(РежимЗаписиДокумента.Запись);
			Документы.ДанныеЗаказаВодителя.ЭмуляцияВводаДанныхВодителемПоИнициативеПартнера(Заказ.Ссылка, РезультатОтмены, Дата(МассивИнформации.НовоеЗначение));
		Конецесли;	
	КонецЦикла;	
	
	Если МассивДляОтправки.Количество() <> 0 Тогда
		ОтветВызова = ВыполнитьОбмен_ДанныхИнформированияОИзмененияхВЗаказе_ОтМП(ОбщееСоединениеHTTP, "ИзменениеПереданоВМП", МассивДляОтправки);
	КонецЕсли;	
	
	Возврат Истина;
КонецФункции	


Функция ВыполнитьОбмен_ДанныхИнформированияОИзмененияхВЗаказе_ОтМП(ОбщееСоединениеHTTP = "", СтатусИнформирования, МассивИнформацииИзвне = Неопределено) Экспорт
	КодУзла = Константы.ИдентификаторМП.Получить();
	УзелПланаОбмена = Константы.УзелПланаОбмена.Получить();
	Транспорт = Константы.Транспорт.Получить().Код;
	СтруктураВызова = Новый Структура;
	СтруктураВызова.Вставить("ID", КодУзла);
	СтруктураВызова.Вставить("changeStatus", СтатусИнформирования);
	
	МассивИнформации = Новый Массив;
	ЗапросИнформации = Новый Запрос;
	Если СтатусИнформирования = "ИзменениеПереданоВМП" Тогда
		СтруктураВызова.Вставить("arrayOfChangesOrders", МассивИнформацииИзвне);
	ИначеЕсли СтатусИнформирования = "ИзменениеПросмотреноВМП" Тогда	
		ЗапросИнформации.Текст = "ВЫБРАТЬ
		                         |	ИнформированиеЭкипажейОбИзмененияхВЗаказах.Заказ.Номер КАК order,
		                         |	ИнформированиеЭкипажейОбИзмененияхВЗаказах.Период КАК period,
		                         |	ИнформированиеЭкипажейОбИзмененияхВЗаказах.Реквизит КАК property,
		                         |	ИнформированиеЭкипажейОбИзмененияхВЗаказах.Рейс.НомерРейса КАК routeID,
		                         |	ИнформированиеЭкипажейОбИзмененияхВЗаказах.СтароеЗначение КАК oldValue,
		                         |	ИнформированиеЭкипажейОбИзмененияхВЗаказах.НовоеЗначение КАК newValue
		                         |ИЗ
		                         |	РегистрСведений.ИнформированиеЭкипажейОбИзмененияхВЗаказах.Изменения КАК ИнформированиеЭкипажейОбИзмененияхВЗаказахИзменения
		                         |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИнформированиеЭкипажейОбИзмененияхВЗаказах КАК ИнформированиеЭкипажейОбИзмененияхВЗаказах
		                         |		ПО ИнформированиеЭкипажейОбИзмененияхВЗаказахИзменения.Период = ИнформированиеЭкипажейОбИзмененияхВЗаказах.Период
		                         |			И ИнформированиеЭкипажейОбИзмененияхВЗаказахИзменения.Заказ = ИнформированиеЭкипажейОбИзмененияхВЗаказах.Заказ
		                         |			И ИнформированиеЭкипажейОбИзмененияхВЗаказахИзменения.Реквизит = ИнформированиеЭкипажейОбИзмененияхВЗаказах.Реквизит
		                         |ГДЕ
		                         |	ИнформированиеЭкипажейОбИзмененияхВЗаказахИзменения.Узел = &Узел";
		
		
		ЗапросИнформации.УстановитьПараметр("Узел", УзелПланаОбмена);
		РезультатЗапроса = ЗапросИнформации.Выполнить();
		ВыборкаИнформации = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаИнформации.Следующий() Цикл
			СтруктураИнформации = Новый Структура;
			Для каждого ТекКолонка Из РезультатЗапроса.Колонки Цикл
				Если ТекКолонка.Имя = "property" Тогда	
					Если ЗначениеЗаполнено(ВыборкаИнформации.property) Тогда
						ИндексЗначенияПеречисления = Перечисления.РеквизитыЗаказа.Индекс(ВыборкаИнформации.property);
						СтруктураИнформации.Вставить(ТекКолонка.Имя, Метаданные.Перечисления.РеквизитыЗаказа.ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя);
					Иначе
						СтруктураИнформации.Вставить(ТекКолонка.Имя, "");
					КонецеСли;
				Иначе	
					СтруктураИнформации.Вставить(ТекКолонка.Имя, ВыборкаИнформации[ТекКолонка.Имя]);
				КонецЕсли;	
			КонецЦикла;	
			СтруктураИнформации.Вставить("carID", Транспорт);
			МассивИнформации.Добавить(СтруктураИнформации);
		КонецЦикла;	
		
		Если МассивИнформации.Количество() = 0 Тогда
			Возврат Истина;
		КонецеСли;	
			
		СтруктураВызова.Вставить("arrayOfChangesOrders", МассивИнформации);
	КонецеСли;

	
	СтрокаJSON = СформироватьСтрокуJSON(СтруктураВызова);
	ОтветВызоваJSON = ВызватьФункциюHTTPСервиса(СтрокаJSON, "setInformationChangesOrders", ОбщееСоединениеHTTP);
	ВозниклаОшибка = Ложь;
	ОтветВызова = ДанныеJSONВСтруктуру(ОтветВызоваJSON, , ВозниклаОшибка);
	Если ОтветВызова.result И СтатусИнформирования = "ИзменениеПросмотреноВМП" Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(УзелПланаОбмена.Ссылка, Метаданные.РегистрыСведений.ИнформированиеЭкипажейОбИзмененияхВЗаказах);
	ИначеЕсли СтатусИнформирования = "ИзменениеПереданоВМП" и ОтветВызова.result Тогда
		Возврат Истина;
	Иначе	
		Возврат Ложь;
	КонецеСли;	
	Возврат Истина;
КонецФункции	


Функция МаршрутизацияЯндекс_ПолучитьТекстЗапросаНаСервереПоРейсу(ОбщееСоединениеHTTP = "", НомерРейса, МассивСтруктурЗаказов = Неопределено) Экспорт
	СтруктураВызова = Новый Структура;
	СтруктураВызова.Вставить("tripId", НомерРейса);
	Если МассивСтруктурЗаказов <> Неопределено Тогда
		СтруктураВызова.Вставить("orders", МассивСтруктурЗаказов);
	КонецеСли;	
	СтрокаJSON = СформироватьСтрокуJSON(СтруктураВызова);
	РезультатВызова = ВызватьФункциюHTTPСервиса(СтрокаJSON, "getTextYandexRouting", ОбщееСоединениеHTTP);
	
	ОтветМетода = Новый Структура;
	
	ВозниклаОшибка = Ложь;
	ДанныеВызова = ДанныеJSONВСтруктуру(РезультатВызова, , ВозниклаОшибка);
	Если ВозниклаОшибка Тогда
		ОтветМетода.Вставить("РезультатВызова", Ложь);
		Возврат ОтветМетода;
	КонецеСли;	   
	
	
	Если Не ЗначениеЗаполнено(ДанныеВызова.textQuery) Тогда
		ОтветМетода.Вставить("РезультатВызова", Ложь);
		Возврат ОтветМетода;
	Иначе
		ОтветМетода.Вставить("РезультатВызова", Истина);
		ОтветМетода.Вставить("ТекстЗапроса", ДанныеВызова.textQuery);
		Возврат ОтветМетода;
	КонецеСли;	
КонецФункции

Функция МаршрутизацияЯндекс_НачатьМаршрутизациюНаСервереПоРейсу(ОбщееСоединениеHTTP = "", НомерРейса, МассивСтруктурЗаказов = Неопределено, ДанныеТекущейТочки = Неопределено, ВыбранноеВремя, ДанныеФинальнойТочки = Неопределено, УчитыватьПорядок = Ложь) Экспорт
	СтруктураВызова = Новый Структура;
	СтруктураВызова.Вставить("tripId", НомерРейса);
	Если МассивСтруктурЗаказов <> Неопределено Тогда
		СтруктураВызова.Вставить("orders", МассивСтруктурЗаказов);
	КонецеСли;	
	
	
	Если ВыбранноеВремя <> Неопределено Тогда
		СтруктураВызова.Вставить("startTime", ВыбранноеВремя);
	КонецеСли;	
	
	Если УчитыватьПорядок Тогда
		СтруктураВызова.Вставить("useRouteIndex", Истина);
	конецеСли;	
		
	Если ДанныеТекущейТочки <> Неопределено Тогда
		СтруктураВызова.Вставить("currentPoint", ДанныеТекущейТочки);
	КонецеСли;	
	
	Если ДанныеФинальнойТочки <> Неопределено Тогда
		//СтруктураВызова.Вставить("pointReturnAddress", Строка(ДанныеФинальнойТочки.Широта) + ";" + Строка(ДанныеФинальнойТочки.Долгота));
		СтруктураВызова.Вставить("pointReturnAddress", ДанныеФинальнойТочки);
	КонецеСли;	
	
	СтрокаJSON = СформироватьСтрокуJSON(СтруктураВызова);
	РезультатВызова = ВызватьФункциюHTTPСервиса(СтрокаJSON, "putTaskYandexRouting", ОбщееСоединениеHTTP);
	
	ОтветМетода = Новый Структура;
	
	ВозниклаОшибка = Ложь;
	ДанныеВызова = ДанныеJSONВСтруктуру(РезультатВызова, , ВозниклаОшибка);
	Если ВозниклаОшибка Тогда
		ОтветМетода.Вставить("РезультатВызова", Ложь);
		Возврат ОтветМетода;
	КонецеСли;	   
	
	
	Если Не ЗначениеЗаполнено(ДанныеВызова.idQuery) Тогда
		ОтветМетода.Вставить("РезультатВызова", Ложь);
		Возврат ОтветМетода;
	Иначе
		ОтветМетода.Вставить("РезультатВызова", Истина);
		ОтветМетода.Вставить("ИдЗапроса", ДанныеВызова.idQuery);
		Возврат ОтветМетода;
	КонецеСли;	
КонецФункции

Функция МаршрутизацияЯндекс_ПолучитьДанныеМаршрутизацииНаСервереПоРейсу(ОбщееСоединениеHTTP = "", идЗапроса, НомерРейса, Рейс = Неопределено) Экспорт
	СтруктураВызова = Новый Структура;   
	КодУзла = Константы.ИдентификаторМП.Получить();
	
	СтруктураВызова.Вставить("idQuery", идЗапроса);
	СтруктураВызова.Вставить("tripId", НомерРейса);
	СтруктураВызова.Вставить("ID", КодУзла);
	
	Если Рейс <> Неопределено Тогда
		ДанныеРейса = МаршрутизацияСервер.ПолучитьДопПараметрыРейсаЯМаршрутизации(Рейс);
		СтруктураВызова.Вставить("routeData", ДанныеРейса);
	КонецЕСли;	
	
	СтрокаJSON = СформироватьСтрокуJSON(СтруктураВызова);
	РезультатВызова = ВызватьФункциюHTTPСервиса(СтрокаJSON, "getResultTaskYandexRouting", ОбщееСоединениеHTTP);
	
	ОтветМетода = Новый Структура;
	
	ВозниклаОшибка = Ложь;
	
	//МассивЗначенийДат = Новый Массив;
	//МассивЗначенийДат.Добавить("timeOfArrival");         МассивЗначенийДат
	
	ДанныеВызова = ДанныеJSONВСтруктуру(РезультатВызова, , ВозниклаОшибка);
	
	Если ВозниклаОшибка Тогда
		ОтветМетода.Вставить("РезультатВызова", Ложь);
		Возврат ОтветМетода;
	КонецеСли;	   
	
	Если ДанныеВызова.Свойство("routing") Тогда
		Если Не ЗначениеЗаполнено(ДанныеВызова.routing) Тогда
			ОтветМетода.Вставить("РезультатВызова", Ложь);
			Возврат ОтветМетода;
		Иначе
			ОтветМетода.Вставить("РезультатВызова", Истина);
			ОтветМетода.Вставить("ДанныеМаршрутизации", ДанныеВызова.routing);
			Возврат ОтветМетода;
		КонецеСли;	
	Иначе
		ОтветМетода.Вставить("РезультатВызова", Ложь);
		Возврат ОтветМетода;
	КонецеСли;
КонецФункции


Функция РаспознатьАдрес(ОбщееСоединениеHTTP = "", Адрес) Экспорт
	СтруктураВызова = Новый Структура;   
	КодУзла = Константы.ИдентификаторМП.Получить();
	
	СтруктураВызова.Вставить("Address", Адрес);
	
	СтрокаJSON = СформироватьСтрокуJSON(СтруктураВызова);
	РезультатВызова = ВызватьФункциюHTTPСервиса(СтрокаJSON, "getAdressCoordinates", ОбщееСоединениеHTTP);
	
	ОтветМетода = Новый Структура;
	
	ВозниклаОшибка = Ложь;
	
	
	ДанныеВызова = ДанныеJSONВСтруктуру(РезультатВызова, , ВозниклаОшибка);
	
	Если ВозниклаОшибка Тогда
		ОтветМетода.Вставить("РезультатВызова", Ложь);
		Возврат ОтветМетода;
	КонецеСли;	   
	
	Если ДанныеВызова.Свойство("error") Тогда
		Если ДанныеВызова.error Тогда
			ОтветМетода.Вставить("РезультатВызова", Ложь);
			ОтветМетода.Вставить("ОписаниеОшибки", ДанныеВызова.errorText);
			Возврат ОтветМетода;
		КонецеСли;
	КонецеСли;	
			
	
	
	Если ДанныеВызова.Свойство("location") Тогда
		ОтветМетода.Вставить("РезультатВызова", Истина);
		ОтветМетода.Вставить("Широта", ДанныеВызова.location.lat);
		ОтветМетода.Вставить("Долгота", ДанныеВызова.location.long);
		ОтветМетода.Вставить("РаспАдрес", ДанныеВызова.location.addressLocation);
		Возврат ОтветМетода;
	Иначе
		ОтветМетода.Вставить("РезультатВызова", Ложь);
		Возврат ОтветМетода;
	КонецеСли;
КонецФункции


Функция Маршрутизация_ВыгрузитьДанныеРучнойМаршрутизации(ОбщееСоединениеHTTP = "", НомерРейса, Маршрут) Экспорт
	КодУзла = Константы.ИдентификаторМП.Получить();
	УзелПланаОбмена = Константы.УзелПланаОбмена.Получить();
	СтруктураВызова = Новый Структура;
	СтруктураВызова.Вставить("ID", КодУзла);
	СтруктураВызова.Вставить("tripID", НомерРейса);
	СтруктураВызова.Вставить("routing", Маршрут);
	СтрокаJSON = СформироватьСтрокуJSON(СтруктураВызова);
	
	
	ОтветВызоваJSON = ВызватьФункциюHTTPСервиса(СтрокаJSON, "unloadRoutingData", ОбщееСоединениеHTTP);
	ВозниклаОшибка = Ложь;
	ОтветВызова = ДанныеJSONВСтруктуру(ОтветВызоваJSON, , ВозниклаОшибка);
	Если Не ВозниклаОшибка Тогда
		Если Не ОтветВызова.error Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецеСли;	
	Иначе
		Возврат Ложь;
	КонецеСли;
	
КонецФункции

Функция ПолучитьКодДоступаКРММаршрутизации(ОбщееСоединениеHTTP = "", Рейс) Экспорт


	Попытка
		СтруктураВызова = Новый Структура;   
		КодУзла = Константы.ИдентификаторМП.Получить();
		
		СтруктураВызова.Вставить("regionId", СокрЛП(ПараметрыСеанса.Регион.Код));
		СтруктураВызова.Вставить("idRoute", СокрЛП(Рейс.НомерРейса));
		СтруктураВызова.Вставить("ID", СокрЛП(КодУзла));
		
		СтрокаJSON = СформироватьСтрокуJSON(СтруктураВызова);
		//
		//ОбщегоНазначения.ЗаписатьОшибкуВЛог(СтрокаJSON);
		//
		РезультатВызова = ВызватьФункциюHTTPСервиса(СтрокаJSON, "getAccessCodeRoutingWorkplace", ОбщееСоединениеHTTP);
		
		ОтветМетода = Новый Структура;
		
		ВозниклаОшибка = Ложь;
		
		
		ДанныеВызова = ДанныеJSONВСтруктуру(РезультатВызова, , ВозниклаОшибка);
		ДанныеВызова = ДанныеВызова.result;
		
		Если ВозниклаОшибка Тогда
			ОтветМетода.Вставить("РезультатВызова", Ложь);
			ОтветМетода.Вставить("ОписаниеОшибки", "Возникла ошибка при запросе кода доступа!");
			Возврат ОтветМетода;
		КонецеСли;	   
		
		Если ДанныеВызова.Свойство("error") Тогда
			Если ДанныеВызова.error Тогда
				ОтветМетода.Вставить("РезультатВызова", Ложь);
				ОтветМетода.Вставить("ОписаниеОшибки", ДанныеВызова.errorText);
				Возврат ОтветМетода;
			КонецеСли;
		КонецеСли;	
		
		
		
		Если ДанныеВызова.Свойство("code") Тогда
			ОтветМетода.Вставить("РезультатВызова", Истина);
			ОтветМетода.Вставить("Код", ДанныеВызова.code);
			Возврат ОтветМетода;
		Иначе
			ОтветМетода.Вставить("РезультатВызова", Ложь);
			Возврат ОтветМетода;
		КонецеСли;
	Исключение
		ТОшибки = ОписаниеОшибки();
		ОбщегоНазначенияСервер.ЗаписатьОшибкуВЛог(ТОшибки);
		ОтветМетода.Вставить("РезультатВызова", Ложь);
		ОтветМетода.Вставить("ОписаниеОшибки", ТОшибки);
		Возврат ОтветМетода;
	КонецПопытки;
КонецФункции

// Выполнить обмен региональные терминалы.
// 
// Параметры:
//  ОбщееСоединениеHTTP - Строка - Общее соединение HTTP
//  IDУзла - Строка -  IDУзла
// 
// Возвращаемое значение:
//  Булево, Структура - Выполнить обмен региональные терминалы:
// * РезультатВызова - Булево - 
// * ОписаниеОшибки - Строка - 
Функция ВыполнитьОбмен_РегиональныеТерминалы(ОбщееСоединениеHTTP = "", IDУзла) Экспорт
	Попытка		
		СтруктураВызова = Новый Структура;   
		СтруктураВызова.Вставить("ID", СокрЛП(IDУзла));
		СтрокаJSON = СформироватьСтрокуJSON(СтруктураВызова);
		
		ОтветМетода = Новый Структура;
		
		РезультатВызова = ВызватьФункциюHTTPСервиса(СтрокаJSON, "getRegions", ОбщееСоединениеHTTP);
		
		ВозниклаОшибка = Ложь;
		
		МассивКодов = Новый Массив;
		
		ДанныеВызова = ДанныеJSONВСтруктуру(РезультатВызова, , ВозниклаОшибка);
		ДанныеВызова = ДанныеВызова.result;
		
		Если ВозниклаОшибка Тогда
			ОтветМетода.Вставить("РезультатВызова", Ложь);
			ОтветМетода.Вставить("ОписаниеОшибки", "Возникла ошибка при запросе getRegions!");
			Возврат ОтветМетода;
		КонецеСли;	   
		

		
		Если ДанныеВызова.Свойство("arrayOfRegions") Тогда
			Для Каждого ТекРегион Из ДанныеВызова.arrayOfRegions Цикл
				
				НайРегион = Справочники.РегиональныеТерминалы.НайтиПоКоду(ТекРегион.Code);
				Если НайРегион.Пустая() Тогда
					Регион = Справочники.РегиональныеТерминалы.СоздатьЭлемент();	
					Регион.Код = ТекРегион.code;
				Иначе
					Регион = НайРегион.ПолучитьОбъект();	
				Конецесли;		
				Регион.Наименование = ТекРегион.name;
				
				Регион.НачальнаяШиротаЗоны = ТекРегион.minLat;
				Регион.НачальнаяДолготаЗоны = ТекРегион.minLong;
				Регион.КонечнаяШиротаЗоны = ТекРегион.maxLat;
				Регион.КонечнаяДолготаЗоны = ТекРегион.maxLong;
				
				Регион.ксАдресСервера = ТекРегион.cashServerAdress;
				Регион.ксИмяПользователя = ТекРегион.cashUserName;
				Регион.ксПарольПользователя = ТекРегион.cashUserPassword;
				Регион.НомерТелефонаСтаршегоЛогиста = ТекРегион.phoneNumberSeniorLogist;
				
				Регион.РежимПечатиЧековРМЭкипажа = Перечисления.ВариантыПечатиЧековРМЭкипажа[ТекРегион.checkPrintingMode]; 
				Регион.НачалоИнтервалаДоставкиВОбласти = ТекРегион.startOfDeliveryIntervalInTheArea;
				Регион.ОкончаниеИнтервалаДоставкиВОбласти = ТекРегион.endOfDeliveryIntervalInTheArea;
				
				Регион.ШиротаЦентраЗоны = ТекРегион.latCenterZone;
				Регион.ДолготаЦентраЗоны = ТекРегион.longCenterZone;			
				
				Регион.Записать();

				МассивКодов.Добавить(ТекРегион.code);
				
			КонецЦикла;	
			Если МассивКодов.Количество() <> 0 Тогда
				РезультатВызова = СнятьРегистрациюСОбъектовЦУ(ОбщееСоединениеHTTP, МассивКодов, IDУзла, "Справочник.РегиональныеТерминалы");
				ОтветМетода.Вставить("РезультатВызова", РезультатВызова);
			Иначе
				ОтветМетода.Вставить("РезультатВызова", Истина);
			КонецЕсли;		
		Иначе
			Возврат Ложь;
		КонецеСли;
	Исключение
		ТОшибки = ОписаниеОшибки();
		ОбщегоНазначенияСервер.ЗаписатьОшибкуВЛог(ТОшибки);
		ОтветМетода.Вставить("РезультатВызова", Ложь);
		ОтветМетода.Вставить("ОписаниеОшибки", ТОшибки);
		Возврат ОтветМетода;
	КонецПопытки;	
	Возврат ОтветМетода;
КонецФункции

// Выполнить обмен список серверов обмена.
// 
// Параметры:
//  ОбщееСоединениеHTTP - Строка - Общее соединение HTTP
// 
// Возвращаемое значение:
//  Булево, Структура - Выполнить обмен список серверов обмена:
// * РезультатВызова - Булево - 
// * ОписаниеОшибки - Строка -  
Функция ВыполнитьОбмен_СписокСерверовОбмена(ОбщееСоединениеHTTP = "") Экспорт
	Попытка		
		ОтветМетода = Новый Структура;		
		РезультатВызова = ВызватьФункциюHTTPСервиса("", "getServersIPs", ОбщееСоединениеHTTP);
		
		
		
		ВозниклаОшибка = Ложь;
		
		ДанныеВызова = ДанныеJSONВСтруктуру(РезультатВызова, , ВозниклаОшибка);
		ДанныеВызова = ДанныеВызова.result;
		
		Если ВозниклаОшибка Тогда
			ОтветМетода.Вставить("РезультатВызова", Ложь);
			ОтветМетода.Вставить("ОписаниеОшибки", "Возникла ошибка при запросе getServersIPs!");
			Возврат ОтветМетода;
		КонецеСли;	   
		

		
		Если ДанныеВызова.Свойство("arrayOfIPs") Тогда
			НабЗаписей = РегистрыСведений.АдресаОбменаСЦУ.СоздатьНаборЗаписей();
			НабЗаписей.Отбор.ВстроенныйАдрес.Установить(Ложь);
			Для Каждого ТекАдрес Из ДанныеВызова.arrayOfIPs Цикл
				НовЗапись = НабЗаписей.Добавить();
				НовЗапись.Терминал = Справочники.РегиональныеТерминалы.НайтиПоКоду(ТекАдрес.regionID);
				НовЗапись.Адрес = ТекАдрес.address;
				НовЗапись.Приоритет = ТекАдрес.priority;
			КонецЦикла;	
			НабЗаписей.Записать();
			ОтветМетода.Вставить("РезультатВызова", Истина);		
		Иначе
			ОтветМетода.Вставить("РезультатВызова", Ложь);
		КонецеСли;
	Исключение
		ТОшибки = ОписаниеОшибки();
		ОбщегоНазначенияСервер.ЗаписатьОшибкуВЛог(ТОшибки);
		ОтветМетода.Вставить("РезультатВызова", Ложь);
		ОтветМетода.Вставить("ОписаниеОшибки", ТОшибки);
		Возврат ОтветМетода;
	КонецПопытки;	
	Возврат ОтветМетода;
КонецФункции

// Выполнить обмен список типов документов прикрепленные файлы.
// 
// Параметры:
//  ОбщееСоединениеHTTP - Строка - Общее соединение HTTP
//  IDУзла - Строка - IDУзла
//  	
// Возвращаемое значение:
//  Булево, Структура - Выполнить обмен список типов документов прикрепленные файлы:
// * РезультатВызова - Булево - 
// * ОписаниеОшибки - Строка -  
Функция ВыполнитьОбмен_СписокТиповДокументовПрикрепленныеФайлы(ОбщееСоединениеHTTP = "", IDУзла) Экспорт
	Попытка				
	
		СтруктураВызова = Новый Структура;   
		СтруктураВызова.Вставить("ID", СокрЛП(IDУзла));
		СтрокаJSON = СформироватьСтрокуJSON(СтруктураВызова);
		
		ОтветМетода = Новый Структура;
		РезультатВызова = ВызватьФункциюHTTPСервиса(СтрокаJSON, "getTypesAttachedDocs", ОбщееСоединениеHTTP);
		
		
		МассивКодов = Новый Массив;
		ВозниклаОшибка = Ложь;
		
		ДанныеВызова = ДанныеJSONВСтруктуру(РезультатВызова, , ВозниклаОшибка);
		ДанныеВызова = ДанныеВызова.result;
		
		Если ВозниклаОшибка Тогда
			ОтветМетода.Вставить("РезультатВызова", Ложь);
			ОтветМетода.Вставить("ОписаниеОшибки", "Возникла ошибка при запросе getTypesAttachedDocs!");
			Возврат ОтветМетода;
		КонецеСли;	   
		
		Если ДанныеВызова.Свойство("arrayOfTypesAttachedDocs") Тогда
			Для Каждого ТекТипДокумента Из ДанныеВызова.arrayOfTypesAttachedDocs Цикл
				Най = Справочники.ТипыПрикрепленныхДокументов.НайтиПоКоду(ТекТипДокумента.id);
				Если Най.Пустая() Тогда
					ТипПрикрепленногоДокументаОбъект = Справочники.ТипыПрикрепленныхДокументов.СоздатьЭлемент();
				Иначе
					ТипПрикрепленногоДокументаОбъект = Най.получитьОбъект();
				КонецЕсли;	
				
				ТипПрикрепленногоДокументаОбъект.Код = ТекТипДокумента.id;
				ТипПрикрепленногоДокументаОбъект.Наименование = ТекТипДокумента.name;
				ТипПрикрепленногоДокументаОбъект.ДоступенВыборВМП = ТекТипДокумента.enabledForMA;
				ТипПрикрепленногоДокументаОбъект.ПрефиксИмениФайла = ТекТипДокумента.filePrefix;
				ТипПрикрепленногоДокументаОбъект.КачествоФото = ТекТипДокумента.photoQuality;
				ТипПрикрепленногоДокументаОбъект.ЧерноБелоеФото = ТекТипДокумента.blackAndWhitePhoto;
				ТипПрикрепленногоДокументаОбъект.ОтметкаНаФотоснимке = ТекТипДокумента.photoMark;
				
				ТипПрикрепленногоДокументаОбъект.ДоступностьПоТипамЗаказов.Очистить();
				
				Для Каждого ТекДоступность Из ТекТипДокумента.availability Цикл
					Нов = ТипПрикрепленногоДокументаОбъект.ДоступностьПоТипамЗаказов.Добавить();
					Нов.ТипЗаказа = Перечисления.ТипыЗаказов[ТекДоступность.orderType];
					Нов.Доступен = ТекДоступность.available;
				КонецЦикла;
				
				ТипПрикрепленногоДокументаОбъект.Записать();
				МассивКодов.Добавить(ТекТипДокумента.id);
								
			КонецЦикла;
			Если МассивКодов.Количество() <> 0 Тогда
				РезультатВызова =  СнятьРегистрациюСОбъектовЦУ(ОбщееСоединениеHTTP, МассивКодов, IDУзла, "Справочник.ТипыПрикрепленныхДокументов");
				ОтветМетода.Вставить("РезультатВызова", РезультатВызова);
			Иначе
				ОтветМетода.Вставить("РезультатВызова", Истина);
			КонецЕсли;		
		КонецЕсли;
	Исключение
		ТОшибки = ОписаниеОшибки();
		ОбщегоНазначенияСервер.ЗаписатьОшибкуВЛог(ТОшибки);
		ОтветМетода.Вставить("РезультатВызова", Ложь);
		ОтветМетода.Вставить("ОписаниеОшибки", ТОшибки);
		Возврат ОтветМетода;
	КонецПопытки;
	Возврат ОтветМетода;
КонецФункции

// Выполнить обмен выгрузить прикрепленные файлы.
// 
// Параметры:
//  ОбщееСоединениеHTTP - Строка - Общее соединение HTTP
//  IDУзла - Строка - IDУзла
// 
// Возвращаемое значение:
//  Булево - Выполнить обмен выгрузить прикрепленные файлы
Функция ВыполнитьОбмен_ВыгрузитьПрикрепленныеФайлы(ОбщееСоединениеHTTP = "", IDУзла) Экспорт
	Зап = Новый Запрос;
	УзелОбмена = Константы.УзелПланаОбмена.Получить();
	Зап.Текст = "ВЫБРАТЬ
	            |	ПрикрепленныеФайлыИзменения.Заказ.Код КАК orderId,
	            |	ПрикрепленныеФайлыИзменения.Данные.ТипДокумента.Код КАК typeDoc,
	            |	ПрикрепленныеФайлыИзменения.Данные.РасширениеДокумента КАК nameExt,
	            |	ПрикрепленныеФайлыИзменения.Данные.ДатаСоздания КАК createDate,
	            |	ПрикрепленныеФайлыИзменения.Данные.Наименование КАК name,
	            |	ПрикрепленныеФайлыИзменения.Данные.Код КАК id,
	            |	ПрикрепленныеФайлыИзменения.Данные.Ссылка КАК Данные,
	            |	ПрикрепленныеФайлы.Заказ.ТипЗаказа КАК ТипЗаказа
	            |ИЗ
	            |	РегистрСведений.ПрикрепленныеФайлы.Изменения КАК ПрикрепленныеФайлыИзменения
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПрикрепленныеФайлы КАК ПрикрепленныеФайлы
	            |		ПО ПрикрепленныеФайлыИзменения.Период = ПрикрепленныеФайлы.Период
	            |ГДЕ
	            |	ПрикрепленныеФайлыИзменения.Узел = &Узел";
	
	Зап.УстановитьПараметр("Узел", УзелОбмена);
	Выб = Зап.Выполнить().Выбрать();
	
	ШаблонСтруктурыФайл = Новый ФиксированнаяСтруктура("orderId, typeDoc, nameExt, createDate, name, id, Данные, ТипЗаказа");
	
	
	
	МассивСтруктур = Новый Массив;
	
	Пока Выб.Следующий() Цикл
		СтруктураФайл = Новый Структура(ШаблонСтруктурыФайл); 
		ЗаполнитьЗначенияСвойств(СтруктураФайл, Выб);
		СтруктураФайл.data = Выб.Данные.Данные;
		
		ИндексЗначенияПеречисления = Перечисления.ТипыЗаказов.Индекс(Выб.ТипЗаказа);
		СтруктураФайл.orderType = Метаданные.Перечисления.ТипыЗаказов.ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя;
		
		МассивСтруктур.Добавить(СтруктураФайл);
	КонецЦикла;	
	
	ОтветМетода = Новый Структура;
	ОтветМетода.Вставить("РезультатВызова", Истина);
	
	Попытка
		Если МассивСтруктур.Количество() <> 0 Тогда
			СтруктураЗапроса = Новый Структура("ID, arrayOfAttachedDocs");
			СтруктураЗапроса.arrayOfAttachedDocs = МассивСтруктур;
			СтруктураЗапроса.ID = СокрЛП(IDУзла);		
			СтрокаJSON = СформироватьСтрокуJSON(СтруктураЗапроса);
			
			РезультатВызова = ВызватьФункциюHTTPСервиса(СтрокаJSON, "unloadAttachedDocs", ОбщееСоединениеHTTP);
			
	
			Если Не РезультатВызова.result.error Тогда
				ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена, Метаданные.РегистрыСведений.ПрикрепленныеФайлы);
				ОтветМетода.Вставить("РезультатВызова", Истина);
			Иначе
				ОбщегоНазначенияСервер.ЗаписатьОшибкуВЛог("Ошибка вызова метода http unloadAttachedDocs");
				ОтветМетода.Вставить("РезультатВызова", Ложь);	
			КонецеСли;
		КонецеСли;
	Исключение
		ТОшибки = ОписаниеОшибки();
		ОбщегоНазначенияСервер.ЗаписатьОшибкуВЛог(ТОшибки);
		ОтветМетода.Вставить("РезультатВызова", Ложь);
		ОтветМетода.Вставить("ОписаниеОшибки", ТОшибки);
		Возврат ОтветМетода;
	КонецПопытки;	
	Возврат ОтветМетода;
КонецФункции

// Выполнить обмен получить параметры.
// 
// Параметры:
//  ОбщееСоединениеHTTP - Строка - Общее соединение HTTP
//  IDУзла - Строка - IDУзла
// 
// Возвращаемое значение:
//  Структура - Выполнить обмен получить параметры:
// * РезультатВызова - Булево - 
// * ОписаниеОшибки - Строка - 
Функция ВыполнитьОбмен_ПолучитьПараметры(ОбщееСоединениеHTTP = "", IDУзла) Экспорт
	СтруктураВызова = Новый Структура;   
	СтруктураВызова.Вставить("ID", СокрЛП(IDУзла));
	ТранспортМП = Константы.ТранспортМП.Получить();
	Если ЗначениеЗаполнено(ТранспортМП) Тогда
		//@skip-check reading-attribute-from-database
		СтруктураВызова.Вставить("IDCar", Константы.ТранспортМП.Получить().Код);
	Иначе
		СтруктураВызова.Вставить("IDCar", "");				
	КонецеСли;		
	СтрокаJSON = СформироватьСтрокуJSON(СтруктураВызова);
	
	Попытка
		ОтветМетода = Новый Структура;
		РезультатВызова = ВызватьФункциюHTTPСервиса(СтрокаJSON, "getParameters", ОбщееСоединениеHTTP);
		
		
		ВозниклаОшибка = Ложь;
		
		ДанныеВызова = ДанныеJSONВСтруктуру(РезультатВызова, , ВозниклаОшибка);
		ДанныеВызова = ДанныеВызова.result;
		
		Если ВозниклаОшибка Тогда
			ОтветМетода.Вставить("РезультатВызова", Ложь);
			ОтветМетода.Вставить("ОписаниеОшибки", "Возникла ошибка при запросе параметров!");
			Возврат ОтветМетода;
		КонецеСли;	   
		
		
		АвтоЛогин = Ложь;
		
		Если ДанныеВызова.Свойство("arrayOfParameters") Тогда
			Для Каждого ТекПарам Из ДанныеВызова.arrayOfParameters Цикл
				Если ТекПарам.name = "remoteClosing" Тогда
					Если ТекПарам.value = "0" Тогда
						Константы.ИспользоватьУдаленноеЗакрытие.Установить(Ложь);
					ИначеЕсли ТекПарам.value = "1" Тогда	
						Константы.ИспользоватьУдаленноеЗакрытие.Установить(Истина);
					КонецеСли;
				КонецЕсли;
				
				Если ТекПарам.name = "periodCheckingOfTimeInterval" Тогда
					Константы.ИнтервалПроверкиОкончанияИнтервалаДоставки.Установить(Число(ТекПарам.value));
				КонецЕсли;
				
				Если ТекПарам.name = "depthOfIntervalCheckingOfTimeInterval" Тогда
					Константы.ГлубинаПросмотраИнтервалаДоставкиВМинутах.Установить(Число(ТекПарам.value));
				КонецЕсли;
				
				
				Если ТекПарам.name = "autoLogin" Тогда
					Константы.Автологин.Установить(Число(ТекПарам.value));
					Автологин = Булево(Число(ТекПарам.value));
				КонецЕсли;
				
				Если ТекПарам.name = "periodAutoExchange" Тогда
					Константы.ИнтервалОбменаСЦУ.Установить(Число(ТекПарам.value));
				КонецЕсли;
				
				
				Если ТекПарам.name = "depthOfIntervalAutoLogin" Тогда
					ЗначениеПараметра = Число(ТекПарам.value);
					Если АвтоЛогин И ЗначениеПараметра = 0 Тогда
						ЗначениеПараметра = 10;
					КонецеСли;	
					Константы.ПериодХраненияПароляПриАвтологине.Установить(ЗначениеПараметра);
				КонецЕсли;
				
				
				Если ТекПарам.name = "KeyRaifQPS" Тогда
					Константы.СекретныйКлючСБПРайффайзен.Установить(ТекПарам.value);
				КонецЕсли;
				Если ТекПарам.name = "merchantIdRaifQPS" Тогда
					Константы.merchantIdСБПРайффайзен.Установить(ТекПарам.value);
				КонецЕсли;
				Если ТекПарам.name = "intervalRequestQPS" Тогда
					ЗначениеПараметра = Число(ТекПарам.value);
					Константы.ИнтервалОпросаСостоянияОплатыСБП.Установить(ЗначениеПараметра);
				КонецЕсли;
				Если ТекПарам.name = "usingQPS" Тогда
					Если Число(ТекПарам.value) = 1 Тогда
						Константы.ИспользоватьОплатуСБП.Установить(Истина);
					Иначе
						Константы.ИспользоватьОплатуСБП.Установить(Ложь);
					КонецеСли;	
				КонецЕсли;
				Если ТекПарам.name = "routeMapVersion" Тогда
					Если СокрЛП(ТекПарам.value) <> "" Тогда
						ТекВерсия = СокрЛП(Константы.ВерсияСтраницыМаршрутизации.Получить());
						Если ТекВерсия <> ТекПарам.value Тогда
							//@skip-check query-in-loop
							ВыполнитьОбмен_ПолучитьСодержимоеСтраницыМаршрутизации(ОбщееСоединениеHTTP, IDУзла);
						КонецЕсли;	
					КонецеСли;	
				КонецЕсли;
				Если ТекПарам.name = "useYandexRouteQueryAfterBuildingRouteOnMap" Тогда
					Если Число(ТекПарам.value) = 1 Тогда
						Константы.ЗапрашиватьЯндексМаршрутизациюПослеПостроенияМаршрута.Установить(Истина);
					Иначе
						Константы.ЗапрашиватьЯндексМаршрутизациюПослеПостроенияМаршрута.Установить(Ложь);
					КонецеСли;	
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;
		ОтветМетода.Вставить("РезультатВызова", Истина);
	Исключение
		ТОшибки = ОписаниеОшибки();
		ОбщегоНазначенияСервер.ЗаписатьОшибкуВЛог(ТОшибки);
		ОтветМетода.Вставить("РезультатВызова", Ложь);
		ОтветМетода.Вставить("ОписаниеОшибки", ТОшибки);
		Возврат ОтветМетода;
	КонецПопытки;	
	Возврат ОтветМетода;
КонецФункции	

// Выполнить обмен получить список организаций.
// 
// Параметры:
//  ОбщееСоединениеHTTP - Строка - Общее соединение HTTP
//  IDУзла - Строка - IDУзла
// 
// Возвращаемое значение:
//  Булево - Выполнить обмен получить список организаций
Функция ВыполнитьОбмен_ПолучитьСписокОрганизаций(ОбщееСоединениеHTTP = "", IDУзла) Экспорт
	СтруктураВызова = Новый Структура;   
	СтруктураВызова.Вставить("ID", СокрЛП(IDУзла));
	СтрокаJSON = СформироватьСтрокуJSON(СтруктураВызова);
	
	Попытка
		ОтветМетода = Новый Структура;
		РезультатВызова = ВызватьФункциюHTTPСервиса(СтрокаJSON, "getOrganizations", ОбщееСоединениеHTTP);
		
		
		ВозниклаОшибка = Ложь;
		
		ДанныеВызова = ДанныеJSONВСтруктуру(РезультатВызова, , ВозниклаОшибка);
		ДанныеВызова = ДанныеВызова.result;
		
		Если ВозниклаОшибка Тогда
			ОтветМетода.Вставить("РезультатВызова", Ложь);
			ОтветМетода.Вставить("ОписаниеОшибки", "Возникла ошибка при запросе getOrganizations!");
			Возврат ОтветМетода;
		КонецеСли;	   
		
		МассивКодов = Новый Массив;
		
		Если ДанныеВызова.Свойство("arrayOfOrganizations") Тогда
			Для Каждого ТекОрганизация Из ДанныеВызова.arrayOfOrganizations Цикл
				НайденнаяСсылка = Справочники.Организации.НайтиПоКоду(ТекОрганизация.id);
				Если НайденнаяСсылка.Пустая() Тогда
					ОрганизацияОбъект = Справочники.Организации.СоздатьЭлемент();
					ОрганизацияОбъект.Код = ТекОрганизация.id;
				Иначе
					ОрганизацияОбъект = НайденнаяСсылка.ПолучитьОбъект();
				КонецеСли;	
				
				ОрганизацияОбъект.Наименование = ТекОрганизация.name;
				ОрганизацияОбъект.НаименованиеПолное = ТекОрганизация.nameFull;
				ОрганизацияОбъект.ИНН = ТекОрганизация.inn;
				ОрганизацияОбъект.КПП = ТекОрганизация.kpp;
				ОрганизацияОбъект.Адрес = ТекОрганизация.address;
				ОрганизацияОбъект.РасчетныйСчетСБП = ТекОрганизация.bankAccountQPS;
				ОрганизацияОбъект.assist_merchantId = ТекОрганизация.assist_merchantId;
				ОрганизацияОбъект.assist_login = ТекОрганизация.assist_login;
				ОрганизацияОбъект.assist_password = ТекОрганизация.assist_password;
				ОрганизацияОбъект.НастройкиAssistПоТерминалам.Очистить();
				
				Для Каждого ТекНастройка Из ТекОрганизация.assistRegionsPref Цикл   
					НовНастр = ОрганизацияОбъект.НастройкиAssistПоТерминалам.Добавить();
					НовНастр.РегионДоставки = Справочники.РегиональныеТерминалы.НайтиПоКоду(ТекНастройка.terminalCode); 
					НовНастр.MerchantId = ТекНастройка.MerchantId; 
					НовНастр.login = ТекНастройка.login;  
					НовНастр.password = ТекНастройка.password;
				КонецЦикла;	
				ОрганизацияОбъект.Записать();
				МассивКодов.Добавить(ТекОрганизация.id);
			КонецЦикла;
			
			Если МассивКодов.Количество() <> 0 Тогда
				РезультатВызова = СнятьРегистрациюСОбъектовЦУ(ОбщееСоединениеHTTP, МассивКодов, IDУзла, "Справочник.Организации");
				ОтветМетода.Вставить("РезультатВызова", РезультатВызова);
			Иначе
				ОтветМетода.Вставить("РезультатВызова", Истина);
			КонецЕсли;				
			Возврат ОтветМетода;
		КонецеСли;
	
	Исключение
		ТОшибки = ОписаниеОшибки();
		ОбщегоНазначенияСервер.ЗаписатьОшибкуВЛог(ТОшибки);
		ОтветМетода.Вставить("РезультатВызова", Ложь);
		ОтветМетода.Вставить("ОписаниеОшибки", ТОшибки);
		Возврат ОтветМетода;		
	КонецПопытки;	
	Возврат ОтветМетода;
КонецФункции

// Выполнить обмен получить список водителей.
// 
// Параметры:
//  ОбщееСоединениеHTTP - Строка - Общее соединение HTTP
//  IDУзла - Строка - IDУзла
// 
// Возвращаемое значение:
//  Булево - Выполнить обмен получить список водителей
Функция ВыполнитьОбмен_ПолучитьСписокВодителей(ОбщееСоединениеHTTP = "", IDУзла) Экспорт
	СтруктураВызова = Новый Структура;   
	СтруктураВызова.Вставить("ID", СокрЛП(IDУзла));
	СтрокаJSON = СформироватьСтрокуJSON(СтруктураВызова);
	
	Попытка
		ОтветМетода = Новый Структура;
		РезультатВызова = ВызватьФункциюHTTPСервиса(СтрокаJSON, "getDrivers", ОбщееСоединениеHTTP);
		
		ВозниклаОшибка = Ложь;
		
		ДанныеВызова = ДанныеJSONВСтруктуру(РезультатВызова, , ВозниклаОшибка);
		ДанныеВызова = ДанныеВызова.result;
		
		Если ВозниклаОшибка Тогда
			ОтветМетода.Вставить("РезультатВызова", Ложь);
			ОтветМетода.Вставить("ОписаниеОшибки", "Возникла ошибка при запросе getDrivers!");
			Возврат ОтветМетода;
		КонецеСли;	   
		
		МассивКодов = Новый Массив;
		
		Если ДанныеВызова.Свойство("arrayOfDrivers") Тогда
			Для Каждого ТекВодитель Из ДанныеВызова.arrayOfDrivers Цикл
				НайденнаяСсылка = Справочники.Водители.НайтиПоКоду(ТекВодитель.id);
				Если НайденнаяСсылка.Пустая() Тогда
					ВодительОбъект = Справочники.Водители.СоздатьЭлемент();
					ВодительОбъект.Код = ТекВодитель.id;
				Иначе
					ВодительОбъект = НайденнаяСсылка.ПолучитьОбъект();
				КонецеСли;	
				
				ВодительОбъект.Наименование = ТекВодитель.name;
				ВодительОбъект.ИмяЛатиницей = ТекВодитель.namelat;
				ВодительОбъект.Записать();
				
				//TODO: здесь был код по установке пароля по данным водителя Константа.Пароль
				
				МассивКодов.Добавить(ТекВодитель.id);
			КонецЦикла;
			
			Если МассивКодов.Количество() <> 0 Тогда
				РезультатВызова = СнятьРегистрациюСОбъектовЦУ(ОбщееСоединениеHTTP, МассивКодов, IDУзла, "Справочник.новаВодители");
				ОтветМетода.Вставить("РезультатВызова", РезультатВызова);
			Иначе
				ОтветМетода.Вставить("РезультатВызова", Истина);
			КонецЕсли;				
		КонецеСли;
	Исключение
		ТОшибки = ОписаниеОшибки();
		ОбщегоНазначенияСервер.ЗаписатьОшибкуВЛог(ТОшибки);
		ОтветМетода.Вставить("РезультатВызова", Ложь);
		ОтветМетода.Вставить("ОписаниеОшибки", ТОшибки);
		Возврат ОтветМетода;		
	КонецПопытки;	
	Возврат ОтветМетода;
КонецФункции

// Выполнить обмен получить список экспедиторов.
// 
// Параметры:
//  ОбщееСоединениеHTTP - Строка - Общее соединение HTTP
//  IDУзла - Строка - IDУзла
// 
// Возвращаемое значение:
//  Булево - Выполнить обмен получить список экспедиторов
Функция ВыполнитьОбмен_ПолучитьСписокЭкспедиторов(ОбщееСоединениеHTTP = "", IDУзла) Экспорт
	СтруктураВызова = Новый Структура;   
	СтруктураВызова.Вставить("ID", СокрЛП(IDУзла));
	СтрокаJSON = СформироватьСтрокуJSON(СтруктураВызова);
	Попытка
		ОтветМетода = Новый Структура;	
		РезультатВызова = ВызватьФункциюHTTPСервиса(СтрокаJSON, "getForwarders", ОбщееСоединениеHTTP);
		
		ВозниклаОшибка = Ложь;
		
		ДанныеВызова = ДанныеJSONВСтруктуру(РезультатВызова, , ВозниклаОшибка);
		ДанныеВызова = ДанныеВызова.result;
		
		Если ВозниклаОшибка Тогда
			ОтветМетода.Вставить("РезультатВызова", Ложь);
			ОтветМетода.Вставить("ОписаниеОшибки", "Возникла ошибка при запросе getForwarders!");
			Возврат ОтветМетода;
		КонецеСли;	   
		
		МассивКодов = Новый Массив;
		
		Если ДанныеВызова.Свойство("arrayOfForwarders") Тогда
			Для Каждого ТекЭкспедитор Из ДанныеВызова.arrayOfForwarders Цикл
				НайденнаяСсылка = Справочники.Экспедиторы.НайтиПоКоду(ТекЭкспедитор.id);
				Если НайденнаяСсылка.Пустая() Тогда
					ЭкспедиторОбъект = Справочники.Экспедиторы.СоздатьЭлемент();
					ЭкспедиторОбъект.Код = ТекЭкспедитор.id;
				Иначе
					ЭкспедиторОбъект = НайденнаяСсылка.ПолучитьОбъект();
				КонецеСли;	
				
				ЭкспедиторОбъект.Наименование = ТекЭкспедитор.name;
				ЭкспедиторОбъект.ИмяЛатиницей = ТекЭкспедитор.namelat;
				ЭкспедиторОбъект.Записать();
				МассивКодов.Добавить(ТекЭкспедитор.id);
			КонецЦикла;
			
			Если МассивКодов.Количество() <> 0 Тогда
				РезультатВызова = СнятьРегистрациюСОбъектовЦУ(ОбщееСоединениеHTTP, МассивКодов, IDУзла, "Справочник.новаЭкспедиторы");
				ОтветМетода.Вставить("РезультатВызова", РезультатВызова);
			Иначе
				ОтветМетода.Вставить("РезультатВызова", Истина);
			КонецЕсли;				
		КонецеСли;
	Исключение
		ТОшибки = ОписаниеОшибки();
		ОбщегоНазначенияСервер.ЗаписатьОшибкуВЛог(ТОшибки);
		ОтветМетода.Вставить("РезультатВызова", Ложь);
		ОтветМетода.Вставить("ОписаниеОшибки", ТОшибки);
		Возврат ОтветМетода;		
	КонецПопытки;	
	Возврат ОтветМетода;
КонецФункции

// Выполнить обмен получить список транспорта.
// 
// Параметры:
//  ОбщееСоединениеHTTP - Строка - Общее соединение HTTP
//  IDУзла - Строка - IDУзла
// 
// Возвращаемое значение:
//  Булево - Выполнить обмен получить список транспорта
Функция ВыполнитьОбмен_ПолучитьСписокТранспорта(ОбщееСоединениеHTTP = "", IDУзла) Экспорт
	СтруктураВызова = Новый Структура;   
	СтруктураВызова.Вставить("ID", СокрЛП(IDУзла));
	СтрокаJSON = СформироватьСтрокуJSON(СтруктураВызова);
	
	Попытка
		ОтветМетода = Новый Структура;	
		РезультатВызова = ВызватьФункциюHTTPСервиса(СтрокаJSON, "getCars", ОбщееСоединениеHTTP);
		
		ВозниклаОшибка = Ложь;
		
		ДанныеВызова = ДанныеJSONВСтруктуру(РезультатВызова, , ВозниклаОшибка);
		ДанныеВызова = ДанныеВызова.result;
		
		Если ВозниклаОшибка Тогда
			ОтветМетода.Вставить("РезультатВызова", Ложь);
			ОтветМетода.Вставить("ОписаниеОшибки", "Возникла ошибка при запросе getCars!");
			Возврат ОтветМетода;
		КонецеСли;	   
		
		КодТекущегоТранспортаМП = "";
		ТекущийТранспортМП = Константы.ТранспортМП.Получить();
		Если Не ТекущийТранспортМП.Пустая() Тогда
			//@skip-check reading-attribute-from-database
			КодТекущегоТранспортаМП = СокрЛП(ТекущийТранспортМП.Код);
		КонецЕСли;
			 
		МассивКодов = Новый Массив;
		
		Если ДанныеВызова.Свойство("arrayOfCars") Тогда
			Для Каждого ТекТранспорт Из ДанныеВызова.arrayOfCars Цикл
				НайденнаяСсылка = Справочники.Транспорт.НайтиПоКоду(ТекТранспорт.id);
				Если НайденнаяСсылка.Пустая() Тогда
					ТранспортОбъект = Справочники.Транспорт.СоздатьЭлемент();
					ТранспортОбъект.Код = ТекТранспорт.id;
				Иначе
					ТранспортОбъект = НайденнаяСсылка.ПолучитьОбъект();
				КонецеСли;	
				
				ТранспортОбъект.Наименование = ТекТранспорт.name;
				ТранспортОбъект.ГосНомер = ТекТранспорт.licenseNumber;
				ТранспортОбъект.Регион = Справочники.РегиональныеТерминалы.НайтиПоКоду(ТекТранспорт.codeRegion);
				ТранспортОбъект.ПометкаУдаления = ТекТранспорт.deletionMark;
				ТранспортОбъект.Записать();
				МассивКодов.Добавить(ТекТранспорт.id);
				
				Если ЗначениеЗаполнено(КодТекущегоТранспортаМП) Тогда
					Если КодТекущегоТранспортаМП = ТекТранспорт.id Тогда
						Константы.ПарольВходаВМП.Установить(ТекТранспорт.password);
					КонецеСли;					
				КонецеСли;	
			КонецЦикла;
			
			
			Если МассивКодов.Количество() <> 0 Тогда
				РезультатВызова = СнятьРегистрациюСОбъектовЦУ(ОбщееСоединениеHTTP, МассивКодов, IDУзла, "Справочник.новаТранспорт");
				ОтветМетода.Вставить("РезультатВызова", РезультатВызова);
			Иначе
				ОтветМетода.Вставить("РезультатВызова", Истина);
			КонецЕсли;				
		КонецеСли;
	Исключение
		ТОшибки = ОписаниеОшибки();
		ОбщегоНазначенияСервер.ЗаписатьОшибкуВЛог(ТОшибки);
		ОтветМетода.Вставить("РезультатВызова", Ложь);
		ОтветМетода.Вставить("ОписаниеОшибки", ТОшибки);
		Возврат ОтветМетода;		
	КонецПопытки;	
	Возврат ОтветМетода;
КонецФункции

// Выполнить обмен получить список рейсов.
// 
// Параметры:
//  ОбщееСоединениеHTTP - Строка - Общее соединение HTTP
//  IDУзла - Строка - IDУзла
// 
// Возвращаемое значение:
//  Булево - Выполнить обмен получить список рейсов
Функция ВыполнитьОбмен_ПолучитьСписокРейсов(ОбщееСоединениеHTTP = "", IDУзла) Экспорт
	СтруктураВызова = Новый Структура;   
	СтруктураВызова.Вставить("ID", СокрЛП(IDУзла));
	ОтветМетода = Новый Структура;
	ТранспортМП = Константы.ТранспортМП.Получить();
	Если ЗначениеЗаполнено(ТранспортМП) Тогда
		//@skip-check reading-attribute-from-database
		СтруктураВызова.Вставить("IDCar", Константы.ТранспортМП.Получить().Код);
	Иначе
		ОтветМетода.Вставить("РезультатВызова", Ложь);
		ОтветМетода.Вставить("ОписаниеОшибки", "Не заполнен транспорт!");
		ОтветМетода.Вставить("НомерРейсаНаСегодня", "");
		Возврат ОтветМетода;
	КонецеСли;		
	
	СтрокаJSON = СформироватьСтрокуJSON(СтруктураВызова);
	
	Попытка			
		РезультатВызова = ВызватьФункциюHTTPСервиса(СтрокаJSON, "getTrips", ОбщееСоединениеHTTP);
		
		ВозниклаОшибка = Ложь;
		
		ДанныеВызова = ДанныеJSONВСтруктуру(РезультатВызова, "dateTrip,dateDocument", ВозниклаОшибка);
		ДанныеВызова = ДанныеВызова.result;
		
		Если ВозниклаОшибка Тогда
			ОтветМетода.Вставить("РезультатВызова", Ложь);
			ОтветМетода.Вставить("ОписаниеОшибки", "Возникла ошибка при запросе getTrips!");
			ОтветМетода.Вставить("НомерРейсаНаСегодня", "");
			Возврат ОтветМетода;
		КонецеСли;	   
		
		
		Если ДанныеВызова.Свойство("arrayOfTrips") Тогда
			Для Каждого ТекРейс Из ДанныеВызова.arrayOfTrips Цикл
				НайденнаяСсылка = Справочники.Рейсы.НайтиПоРеквизиту("НомерРейса", ТекРейс.id);
				Если НайденнаяСсылка.Пустая() Тогда
					РейсОбъект = Справочники.Рейсы.СоздатьЭлемент();
				Иначе
					РейсОбъект = НайденнаяСсылка.ПолучитьОбъект();
				КонецЕсли;	
				
				
				РейсОбъект.НомерРейса = ТекРейс.id;
				РейсОбъект.ДатаРейса = ТекРейс.dateTrip;
				РейсОбъект.ДатаДокумента = ТекРейс.dateDocument;
				РейсОбъект.Транспорт = Справочники.Транспорт.НайтиПоКоду(ТекРейс.carId);
				РейсОбъект.Водитель = Справочники.Водители.НайтиПоКоду(ТекРейс.driverId);
				РейсОбъект.Экспедитор = Справочники.Экспедиторы.НайтиПоКоду(ТекРейс.forwarderId);
				
				РейсОбъект.НомерПалеты = ТекРейс.paletNumber;
				РейсОбъект.ПометкаУдаления = ТекРейс.deletionMark;
				//РейсОбъект.ТипИнформированияПолучателейЗаказов = Перечисления.ТипыИнформированияПолучателейЗаказов[Рейс.customerInformationMode];
				РейсОбъект.НомерТелефона = ТекРейс.phone;
				РейсОбъект.ВыданТерминалAssist = ТекРейс.assistTerminalIssued;
				РейсОбъект.РаспечатанМЛ = ТекРейс.RPHasPrinted;
				РейсОбъект.Записать();
			КонецЦикла;		
		КонецеСли;
	Исключение
		ТОшибки = ОписаниеОшибки();
		ОбщегоНазначенияСервер.ЗаписатьОшибкуВЛог(ТОшибки);
		ОтветМетода.Вставить("РезультатВызова", Ложь);
		ОтветМетода.Вставить("ОписаниеОшибки", ТОшибки);
		ОтветМетода.Вставить("НомерРейсаНаСегодня", "");
		Возврат ОтветМетода;		
	КонецПопытки;
		
	СтруктураРейсаНаСегодня = МаршрутизацияСервер.НайтиРабочийРейсПоТранспортуМП();
	НомерРейсаНаСегодня = "";
	Если ЗначениеЗаполнено(СтруктураРейсаНаСегодня.Рейс) Тогда
		НомерРейсаНаСегодня = СтруктураРейсаНаСегодня.НомерРейса;
	КонецЕсли;	
	ОтветМетода.Вставить("НомерРейсаНаСегодня", НомерРейсаНаСегодня);	
		
	Возврат ОтветМетода;
КонецФункции

// Выполнить обмен получить список результатов доставки.
// 
// Параметры:
//  ОбщееСоединениеHTTP - Строка - Общее соединение HTTP
//  IDУзла - Строка - IDУзла
// 
// Возвращаемое значение:
//  Булево - Выполнить обмен получить список результатов доставки
Функция ВыполнитьОбмен_ПолучитьСписокРезультатовДоставки(ОбщееСоединениеHTTP = "", IDУзла) Экспорт
	СтруктураВызова = Новый Структура;   
	СтруктураВызова.Вставить("ID", СокрЛП(IDУзла));
		
	СтрокаJSON = СформироватьСтрокуJSON(СтруктураВызова);
	Попытка
		ОтветМетода = Новый Структура;	
		РезультатВызова = ВызватьФункциюHTTPСервиса(СтрокаJSON, "getDeliveryResults", ОбщееСоединениеHTTP);
		
		ВозниклаОшибка = Ложь;
		
		ДанныеВызова = ДанныеJSONВСтруктуру(РезультатВызова, , ВозниклаОшибка);
		ДанныеВызова = ДанныеВызова.result;
		
		Если ВозниклаОшибка Тогда
			ОтветМетода.Вставить("РезультатВызова", Ложь);
			ОтветМетода.Вставить("ОписаниеОшибки", "Возникла ошибка при запросе getDeliveryResults!");
			Возврат ОтветМетода;
		КонецеСли;	   
		МассивКодов = Новый Массив;
		
		Если ДанныеВызова.Свойство("arrayOfDeliveryResults") Тогда
			Для Каждого ТекРезультатДоставки Из ДанныеВызова.arrayOfDeliveryResults Цикл
				НайденнаяСсылка = Справочники.РезультатыДоставки.НайтиПоКоду(ТекРезультатДоставки.id);
				Если НайденнаяСсылка.Пустая() Тогда
					РезультатДоставкиОбъект = Справочники.РезультатыДоставки.СоздатьЭлемент();
				Иначе
					РезультатДоставкиОбъект = НайденнаяСсылка.ПолучитьОбъект();
				КонецЕсли;	
				
				РезультатДоставкиОбъект.Наименование = ТекРезультатДоставки.Name;
				РезультатДоставкиОбъект.ЗапретВыбора = ТекРезультатДоставки.choiceMAProhibited;
				РезультатДоставкиОбъект.ЭтоПеренос = ТекРезультатДоставки.IsChangeDeliveryDate;
				РезультатДоставкиОбъект.Забор = ТекРезультатДоставки.IsCollection;
				РезультатДоставкиОбъект.ЭтоЗаезд = ТекРезультатДоставки.IsCheckIn;
				РезультатДоставкиОбъект.ЭтоОтмена = ТекРезультатДоставки.IsCancel;		
				РезультатДоставкиОбъект.Записать();
	
				// TODO: разобраться в передаваемым признаком ЭтоДоставка в РезультатахДоставки
				//РезультатДоставкиОбъект.ЭтоДоставка = ТекРезультатДоставки.IsDelivery;
				
				МассивКодов.Добавить(ТекРезультатДоставки.id);
			КонецЦикла;
			
			Если МассивКодов.Количество() <> 0 Тогда
				РезультатВызова = СнятьРегистрациюСОбъектовЦУ(ОбщееСоединениеHTTP, МассивКодов, IDУзла, "Справочник.ПричиныНеВыполненияДоставки");
				ОтветМетода.Вставить("РезультатВызова", РезультатВызова);
			Иначе
				ОтветМетода.Вставить("РезультатВызова", Истина);
			КонецЕсли;				
			
		КонецеСли;
	Исключение
		ТОшибки = ОписаниеОшибки();
		ОбщегоНазначенияСервер.ЗаписатьОшибкуВЛог(ТОшибки);
		ОтветМетода.Вставить("РезультатВызова", Ложь);
		ОтветМетода.Вставить("ОписаниеОшибки", ТОшибки);
		Возврат ОтветМетода;		
	КонецПопытки;	
	Возврат ОтветМетода;
КонецФункции

// Получить список тарифов и объемных брейков.
// 
// Параметры:
//  ОбщееСоединениеHTTP - Строка - Общее соединение HTTP
//  IDУзла  - Строка - IDУзла
// 
// Возвращаемое значение:
//  Булево - Получить список тарифов и объемных брейков
Функция ВыполнитьОбмен_ПолучитьСписокТарифовИОбъемныхБрейков(ОбщееСоединениеHTTP = "", IDУзла) Экспорт
	СтруктураВызова = Новый Структура;   
	СтруктураВызова.Вставить("ID", СокрЛП(IDУзла));
		
	СтрокаJSON = СформироватьСтрокуJSON(СтруктураВызова);
	Попытка
		ОтветМетода = Новый Структура;	
			
		РезультатВызова = ВызватьФункциюHTTPСервиса(СтрокаJSON, "getTariffsAndBreakes", ОбщееСоединениеHTTP);
		
		ВозниклаОшибка = Ложь;
		
		ДанныеВызова = ДанныеJSONВСтруктуру(РезультатВызова, , ВозниклаОшибка);
		ДанныеВызова = ДанныеВызова.result;
		
		Если ВозниклаОшибка Тогда
			ОтветМетода.Вставить("РезультатВызова", Ложь);
			ОтветМетода.Вставить("ОписаниеОшибки", "Возникла ошибка при запросе getTariffsAndBreakes!");
			Возврат ОтветМетода;
		КонецеСли;	   
		МассивКодов = Новый Массив;
		
		Если ДанныеВызова.Свойство("arrayOfTariffs") Тогда
			Для Каждого ТекТариф Из ДанныеВызова.arrayOfTariffs Цикл
	
				НайденныйТариф = Справочники.ТарифныеСетки.НайтиПоКоду(ТекТариф.tariffId);
				Если НайденныйТариф.Пустая() Тогда
					ТарифОбъект = Справочники.ТарифныеСетки.СоздатьЭлемент();
					ТарифОбъект.Код = ТекТариф.tariffId;
					ТарифОбъект.Записать();
					СсылкаНаТариф = ТарифОбъект.Ссылка;
				Иначе
					СсылкаНаТариф = НайденныйТариф.Ссылка;	
				КонецеСли;			
				
				Для Каждого ТекОбъемныйБрейк Из ТекТариф.breakes Цикл
					НайденнныйБрейк = Справочники.ОбъемныеБрейки.НайтиПоКоду(ТекОбъемныйБрейк.id,,,СсылкаНаТариф);
					Если НайденнныйБрейк.Пустая() Тогда
						БрейкОбъект = Справочники.ОбъемныеБрейки.СоздатьЭлемент();
						БрейкОбъект.Владелец = ТарифОбъект.Ссылка;
						БрейкОбъект.Код = ТекОбъемныйБрейк.id;
					Иначе
						БрейкОбъект = НайденнныйБрейк.ПолучитьОбъект();
					КонецеСли;	
					БрейкОбъект.Наименование = ТекОбъемныйБрейк.name;
					БрейкОбъект.Записать();				
				КонецЦикла;	
				МассивКодов.Добавить(ТекТариф.tariffId);
			КонецЦикла;
			Если МассивКодов.Количество() <> 0 Тогда
				РезультатВызова = СнятьРегистрациюСОбъектовЦУ(ОбщееСоединениеHTTP, МассивКодов, IDУзла, "Справочник.ТарифныеСетки");
				ОтветМетода.Вставить("РезультатВызова", РезультатВызова);
			Иначе
				ОтветМетода.Вставить("РезультатВызова", Истина);
			КонецЕсли;					
		КонецЕсли;
	Исключение
		ТОшибки = ОписаниеОшибки();
		ОбщегоНазначенияСервер.ЗаписатьОшибкуВЛог(ТОшибки);
		ОтветМетода.Вставить("РезультатВызова", Ложь);
		ОтветМетода.Вставить("ОписаниеОшибки", ТОшибки);
		Возврат ОтветМетода;		
	КонецПопытки;	
	Возврат ОтветМетода;
КонецФункции	

// Выполнить обмен календари доставок.
// 
// Параметры:
//  ОбщееСоединениеHTTP - Строка - Общее соединение HTTP
//  IDУзла - Строка - IDУзла
// 
// Возвращаемое значение:
//  Булево - Выполнить обмен календари доставок
Функция ВыполнитьОбмен_КалендариДоставок(ОбщееСоединениеHTTP = "", IDУзла) Экспорт
	СтруктураВызова = Новый Структура;
	СтруктураВызова.Вставить("ID", СокрЛП(IDУзла));
	
	СтрокаJSON = СформироватьСтрокуJSON(СтруктураВызова);
	
	Попытка
		ОтветМетода = Новый Структура;	
	
		РезультатВызова = ВызватьФункциюHTTPСервиса(СтрокаJSON, "getDeliveryCalendars", ОбщееСоединениеHTTP);
		
		
		ВозниклаОшибка = Ложь;
		ДанныеВызова = ДанныеJSONВСтруктуру(РезультатВызова, , ВозниклаОшибка);
		Если ВозниклаОшибка Тогда
			ОтветМетода.Вставить("РезультатВызова", Ложь);
			ОтветМетода.Вставить("ОписаниеОшибки", "Возникла ошибка при запросе getDeliveryCalendars!");
			Возврат ОтветМетода;
		КонецеСли;	
		ДанныеВызова = ДанныеВызова.result;
		
		   	
		
		МассивКодов = Новый Массив;
		
		Если ДанныеВызова.Свойство("arrayOfCalendars") Тогда	
			Для Каждого ТекКалендарь Из ДанныеВызова.arrayOfCalendars Цикл
				НайденныйКалендарь = Справочники.КалендариДоставки.НайтиПоКоду(ТекКалендарь.id);
				Если НайденныйКалендарь = Справочники.КалендариДоставки.ПустаяСсылка() Тогда
					КалендарьОбъект = Справочники.КалендариДоставки.СоздатьЭлемент();
				Иначе
					КалендарьОбъект = НайденныйКалендарь.ПолучитьОбъект();
				КонецеСли;
				
				КалендарьОбъект.Код = ТекКалендарь.id;
				КалендарьОбъект.Наименование = ТекКалендарь.name;
				КалендарьОбъект.ДнейСМоментаПоступления = ТекКалендарь.countOfDays;
				КалендарьОбъект.ПометкаУдаления = ТекКалендарь.isDeleted;
				
				КалендарьОбъект.ДниДоставки.Очистить();
				Для Каждого ТекДень Из ТекКалендарь.days Цикл
					НовДень = КалендарьОбъект.ДниДоставки.Добавить();
					НовДень.ДеньНедели = ТекДень;
				КонецЦикла;	
				КалендарьОбъект.Записать();
				МассивКодов.Добавить(ТекКалендарь.id);
			КонецЦикла;	
		
			Если МассивКодов.Количество() <> 0 Тогда
				РезультатВызова = СнятьРегистрациюСОбъектовЦУ(ОбщееСоединениеHTTP, МассивКодов, IDУзла, "Справочник.КалендариДоставки");
				ОтветМетода.Вставить("РезультатВызова", РезультатВызова);
			Иначе
				ОтветМетода.Вставить("РезультатВызова", Истина);
			КонецЕсли;
		Конецесли;
	Исключение
		ТОшибки = ОписаниеОшибки();
		ОбщегоНазначенияСервер.ЗаписатьОшибкуВЛог(ТОшибки);
		ОтветМетода.Вставить("РезультатВызова", Ложь);
		ОтветМетода.Вставить("ОписаниеОшибки", ТОшибки);
		Возврат ОтветМетода;		
	КонецПопытки;	
	Возврат ОтветМетода;
КонецФункции

// Выполнить обмен получить пароль транспорта.
// 
// Параметры:
//  ОбщееСоединениеHTTP - Строка - Общее соединение HTTP
//  КодТранспорта  - Строка - Код транспорта
// 
// Возвращаемое значение:
//  Булево - Выполнить обмен получить пароль транспорта
Функция ВыполнитьОбмен_ПолучитьПарольТранспорта(ОбщееСоединениеHTTP = "", КодТранспорта) Экспорт
	СтруктураВызова = Новый Структура;
	СтруктураВызова.Вставить("IDCar", КодТранспорта);
	
	СтрокаJSON = СформироватьСтрокуJSON(СтруктураВызова);
	Попытка
		РезультатВызова = ВызватьФункциюHTTPСервиса(СтрокаJSON, "getCarPass", ОбщееСоединениеHTTP);
		
		
		ВозниклаОшибка = Ложь;
		ДанныеВызова = ДанныеJSONВСтруктуру(РезультатВызова, , ВозниклаОшибка);
		Если ВозниклаОшибка Тогда
			Возврат Ложь;
		КонецеСли;	
		ДанныеВызова = ДанныеВызова.result;
		
		Константы.ПарольВходаВМП.Установить(ДанныеВызова.password);	
	Исключение
		ТОшибки = ОписаниеОшибки();
		ОбщегоНазначенияСервер.ЗаписатьОшибкуВЛог(ТОшибки);
		Возврат Ложь;		
	КонецПопытки;	
	
	Возврат Истина;
КонецФункции

// Выполнить обмен партнеры.
// 
// Параметры:
//  ОбщееСоединениеHTTP - Строка - Общее соединение HTTP
//  IDУзла - Строка - IDУзла
// 
// Возвращаемое значение:
//  Структура - Выполнить обмен партнеры:
// * РезультатВызова - Булево - 
// * ОписаниеОшибки - Строка - 
Функция ВыполнитьОбмен_ИМ(ОбщееСоединениеHTTP = "", IDУзла) Экспорт
	СтруктураВызова = Новый Структура;
	СтруктураВызова.Вставить("ID", СокрЛП(IDУзла));
	
	СтрокаJSON = СформироватьСтрокуJSON(СтруктураВызова);
	
	Попытка
		ОтветМетода = Новый Структура;	
	
		РезультатВызова = ВызватьФункциюHTTPСервиса(СтрокаJSON, "getShops", ОбщееСоединениеHTTP);
		
		
		ВозниклаОшибка = Ложь;
		ДанныеВызова = ДанныеJSONВСтруктуру(РезультатВызова, , ВозниклаОшибка);
		Если ВозниклаОшибка Тогда
			ОтветМетода.Вставить("РезультатВызова", Ложь);
			ОтветМетода.Вставить("ОписаниеОшибки", "Возникла ошибка при запросе getShops!");
			Возврат ОтветМетода;
		КонецеСли;	
		ДанныеВызова = ДанныеВызова.result;
		
		МассивКодов = Новый Массив;
	
		Если ДанныеВызова.Свойство("arrayOfShops") Тогда	
			Для Каждого ТекИМ Из ДанныеВызова.arrayOfShops Цикл
				НайденныйИМ = Справочники.ИнтернетМагазины.НайтиПоКоду(ТекИМ.id);
				Если НайденныйИМ = Справочники.ИнтернетМагазины.ПустаяСсылка() Тогда
					ИМОбъект = Справочники.ИнтернетМагазины.СоздатьЭлемент();
				Иначе
					ИМОбъект = НайденныйИМ.ПолучитьОбъект();
				КонецеСли;
		
				ИМОбъект.Код = ТекИМ.id;
				ИМОбъект.Наименование = ТекИМ.name;
				ИМОбъект.НаименованиеПолное = ТекИМ.fullName;
				ИМОбъект.ИНН = ТекИМ.inn;
				ИМОбъект.ЭтоАгрегатор = ТекИМ.isAggregator;
				ИМОбъект.НаименованиеЛатиницей = ТекИМ.latinName;
				ИМОбъект.НастройкиAssistПоТерминалам.Очистить();
		
				Для Каждого ТекНастройка Из ТекИМ.settingsAssistForOrganization Цикл   					
					НовНастр = ИМОбъект.НастройкиAssistПоТерминалам.Добавить();
					НовНастр.РегионДоставки = Справочники.РегиональныеТерминалы.НайтиПоКоду(ТекНастройка.terminalCode); 
					НовНастр.merchantId = ТекНастройка.merchantId; 
					НовНастр.login = ТекНастройка.login;  
					НовНастр.password = ТекНастройка.password;
				КонецЦикла;	
		
				ИМОбъект.Записать();
				МассивКодов.Добавить(ТекИМ.id);
			КонецЦикла;
			
			Если МассивКодов.Количество() <> 0 Тогда
				РезультатВызова = СнятьРегистрациюСОбъектовЦУ(ОбщееСоединениеHTTP, МассивКодов, IDУзла, "Справочник.Контрагенты");
				ОтветМетода.Вставить("РезультатВызова", РезультатВызова);
			Иначе
				ОтветМетода.Вставить("РезультатВызова", Истина);
			КонецЕсли;
		Конецесли;
	Исключение
		ТОшибки = ОписаниеОшибки();
		ОбщегоНазначенияСервер.ЗаписатьОшибкуВЛог(ТОшибки);
		ОтветМетода.Вставить("РезультатВызова", Ложь);
		ОтветМетода.Вставить("ОписаниеОшибки", ТОшибки);
		Возврат ОтветМетода;		
	КонецПопытки;	
	Возврат ОтветМетода;
КонецФункции


// Выполнить обмен установить параметры МП в ЦУ.
// 
// Параметры:
//  ОбщееСоединениеHTTP - Строка - Общее соединение HTTP
//  IDУзла - Строка - IDУзла
// 
// Возвращаемое значение:
//  Структура - Выполнить обмен установить параметры МПВЦУ:
// * РезультатВызова - Булево - 
// * ОписаниеОшибки - Строка - 
Функция ВыполнитьОбмен_УстановитьПараметрыМПВЦУ(ОбщееСоединениеHTTP = "", IDУзла) Экспорт
	Попытка
		СтруктураВызова = Новый Структура();
		
		СтруктураПараметрШаблон = Новый ФиксированнаяСтруктура("name, value");
		МассивПараметров	 = Новый Массив;
		
		ВерсияКонфигурации = Метаданные.Версия;
		Если Не ЗначениеЗаполнено(ВерсияКонфигурации) Тогда
			ВерсияКонфигурации = "1.0.0.1";
		КонецеСли;
		
		ОписаниеВерсии = ОбщегоНазначенияСервер.ПолучитьОписаниеВерсииИзМакетаВерсий(ВерсияКонфигурации);
		
		НовыйПараметр = Новый Структура(СтруктураПараметрШаблон);
		НовыйПараметр.name = "MA_VersionDescr";
		НовыйПараметр.value = ОписаниеВерсии.Описание;
		МассивПараметров.Добавить(НовыйПараметр);
		
		НовыйПараметр = Новый Структура(СтруктураПараметрШаблон);
		НовыйПараметр.name = "MA_VersionFinal";
		НовыйПараметр.value = ОписаниеВерсии.ЭтоРелизнаяВерсия;
		МассивПараметров.Добавить(НовыйПараметр);
		
		
		НовыйПараметр = Новый Структура(СтруктураПараметрШаблон);
		НовыйПараметр.name = "MA_Version";
		НовыйПараметр.value = ВерсияКонфигурации;
		МассивПараметров.Добавить(НовыйПараметр);
		
		
		НовыйПараметр = Новый Структура(СтруктураПараметрШаблон);
		НовыйПараметр.name = "routeMapVersion";
		НовыйПараметр.value = Константы.ВерсияСтраницыМаршрутизации.Получить();
		МассивПараметров.Добавить(НовыйПараметр);
	
		// TODO: реализовать прием IDПодписчикаPushУведомлений в УТ	
		СтрокаIDПодписчикаPushУведомлений = "";	
		ЗначениеIDПодписчикаPushУведомлений = Константы.IDПодписчикаPushУведомлений.Получить();
		Если ЗначениеЗаполнено(ЗначениеIDПодписчикаPushУведомлений) Тогда
			ОбъектXDTO = СериализаторXDTO.ЗаписатьXDTO(ЗначениеIDПодписчикаPushУведомлений);
			ЗаписьПримерXML = Новый ЗаписьXML;
			ЗаписьПримерXML.УстановитьСтроку();
			ФабрикаXDTO.ЗаписатьXML(ЗаписьПримерXML, ОбъектXDTO);
			
			СтрокаIDПодписчикаPushУведомлений = ЗаписьПримерXML.Закрыть();
		Иначе
			СтрокаIDПодписчикаPushУведомлений = "";
		КонецеСли;		
		НовыйПараметр = Новый Структура(СтруктураПараметрШаблон);
		НовыйПараметр.name = "idNotificationSuscriber";
		НовыйПараметр.value = СтрокаIDПодписчикаPushУведомлений;
		МассивПараметров.Добавить(НовыйПараметр);
		
		
		//а когда транспорт еще не привязан?
		НовыйПараметр = Новый Структура(СтруктураПараметрШаблон);
		НовыйПараметр.name = "car_id";
		ТранспортМП = Константы.ТранспортМП.Получить();
		Если ЗначениеЗаполнено(ТранспортМП) Тогда
			НовыйПараметр.value = ТранспортМП.Код;
		Иначе
			НовыйПараметр.value = "";	
		КонецеСли;		
		МассивПараметров.Добавить(НовыйПараметр);
		
		СтруктураВызова.Вставить("ID", СокрЛП(IDУзла));
		СтруктураВызова.Вставить("arrayOfParameters", МассивПараметров);
		
		СтрокаJSON = СформироватьСтрокуJSON(СтруктураВызова);
		
		ОтветМетода = Новый Структура;	
	
		РезультатВызова = ВызватьФункциюHTTPСервиса(СтрокаJSON, "setParameters", ОбщееСоединениеHTTP);
		
		ВозниклаОшибка = Ложь;
		ДанныеВызова = ДанныеJSONВСтруктуру(РезультатВызова, , ВозниклаОшибка);
		Если ВозниклаОшибка Тогда
			ОтветМетода.Вставить("РезультатВызова", Ложь);
			ОтветМетода.Вставить("ОписаниеОшибки", "Возникла ошибка при вызове setParameters!");
			Возврат ОтветМетода;
		КонецеСли;	
	Исключение
		ОтветМетода.Вставить("РезультатВызова", Ложь);
		ОтветМетода.Вставить("ОписаниеОшибки", "Возникла ошибка при вызове setParameters!");
		Возврат ОтветМетода;		
	КонецПопытки;	
	ОтветМетода.Вставить("РезультатВызова", ДанныеВызова.result);
	ОтветМетода.Вставить("ОписаниеОшибки", ДанныеВызова.errorText);
	Возврат ОтветМетода;	
КонецФункции


Функция ВыполнитьОбмен_ПолучитьЗаказыПоРейсу(ОбщееСоединениеHTTP = "", IDTrip) Экспорт
	СтруктураВызова = Новый Структура;
	СтруктураВызова.Вставить("IDTrip", IDTrip);
	
	СтрокаJSON = СформироватьСтрокуJSON(СтруктураВызова);
	
	Попытка
		ОтветМетода = Новый Структура;	
	
		РезультатВызова = ВызватьФункциюHTTPСервиса(СтрокаJSON, "getOrdersByTripID", ОбщееСоединениеHTTP);
		
		
		ВозниклаОшибка = Ложь;
		ДанныеВызова = ДанныеJSONВСтруктуру(РезультатВызова, "date,dateIdRowOrder,timeOfDeliveryFrom,timeOfDeliveryTo", ВозниклаОшибка);
		Если ВозниклаОшибка Тогда
			ОтветМетода.Вставить("РезультатВызова", Ложь);
			ОтветМетода.Вставить("ОписаниеОшибки", "Возникла ошибка при запросе getOrdersByTripID!");
			Возврат ОтветМетода;
		КонецеСли;	
		ДанныеВызова = ДанныеВызова.result;
		
		////ДАТЫ!!!!!  
		//deliveryCostCalculations 
		
//		СтруктураЗаказШаблон = Новый ФиксированнаяСтруктура("number, date, costDeliveryRequiredIfRefusal, calendarID, dateIdRowOrder, deliveryCostCalculations, internetShopID, status, timeOfDeliveryFrom, timeOfDeliveryTo, lat, long, phone, address
//		|, totalSum, totalSumEnabled, partialRedemptionDisabled, receiverName, numberExt, payType, deliverySum, liftingIsPaid, NDSDelivery, printCheck,
//		| receiverEmail, sendCheckOnReceiverEmail, organizationCodeCashe, organizationCodeTerminal, organizationCodeQPS,
//		| countOfPlaces, tariffWeight, methodPaymentOfLifting, changeOfPaymentTypeDisabled, idRowOrder, partnerID, tripID, requestLiftType, tariffZoneCode, customerIdentificationCode,
//		| prepaymentAmount, requestCustomerIdentificationCode, signingReturnAccDoc, fittingRequired, goods");
//		ТекущийЗаказ = Неопределено;
//		
//		СтруктураСтрокиТоваровШаблон = Новый ФиксированнаяСтруктура("artikul, code, name, count, summa, price, barcode, markingCode, idGoodSeller, NDSRow");
		
		// таблица товаров
		ТаблицаЗаказов = Новый ТаблицаЗначений();
		
		ТаблицаЗаказов.Колонки.Добавить("number", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(20)));
		ТаблицаЗаказов.Колонки.Добавить("date", Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
		ТаблицаЗаказов.Колонки.Добавить("calendarID", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(9)));
		ТаблицаЗаказов.Колонки.Добавить("costDeliveryRequiredIfRefusal", Новый ОписаниеТипов("Булево"));
		ТаблицаЗаказов.Колонки.Добавить("dateIdRowOrder", Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
		ТаблицаЗаказов.Колонки.Добавить("internetShopID", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(9)));
		ТаблицаЗаказов.Колонки.Добавить("status", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(1)));
		ТаблицаЗаказов.Колонки.Добавить("timeOfDeliveryFrom", Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
		ТаблицаЗаказов.Колонки.Добавить("timeOfDeliveryTo", Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
		ТаблицаЗаказов.Колонки.Добавить("lat", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(30)));
		ТаблицаЗаказов.Колонки.Добавить("long", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(30)));
		ТаблицаЗаказов.Колонки.Добавить("phone", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(15)));
		ТаблицаЗаказов.Колонки.Добавить("address", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(200)));
		
		ТаблицаЗаказов.Колонки.Добавить("totalSum", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 2)));
		ТаблицаЗаказов.Колонки.Добавить("totalSumEnabled", Новый ОписаниеТипов("Булево"));
		ТаблицаЗаказов.Колонки.Добавить("partialRedemptionDisabled", Новый ОписаниеТипов("Булево"));
		
		ТаблицаЗаказов.Колонки.Добавить("receiverName", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(100)));
		ТаблицаЗаказов.Колонки.Добавить("numberExt", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(50)));
		
		ТаблицаЗаказов.Колонки.Добавить("payType", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(2)));
		ТаблицаЗаказов.Колонки.Добавить("deliverySum", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 2)));
		ТаблицаЗаказов.Колонки.Добавить("liftingIsPaid", Новый ОписаниеТипов("Булево"));
		
		ТаблицаЗаказов.Колонки.Добавить("NDSDelivery", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(3)));
		ТаблицаЗаказов.Колонки.Добавить("printCheck", Новый ОписаниеТипов("Булево"));
		
		ТаблицаЗаказов.Колонки.Добавить("receiverEmail", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(50)));
		ТаблицаЗаказов.Колонки.Добавить("sendCheckOnReceiverEmail", Новый ОписаниеТипов("Булево"));
		
		ТаблицаЗаказов.Колонки.Добавить("organizationCodeCashe", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(9)));
		ТаблицаЗаказов.Колонки.Добавить("organizationCodeTerminal", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(9)));
		ТаблицаЗаказов.Колонки.Добавить("organizationCodeQPS", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(9)));
				
		ТаблицаЗаказов.Колонки.Добавить("countOfPlaces", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(3)));
		ТаблицаЗаказов.Колонки.Добавить("tariffWeight", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 3)));
		ТаблицаЗаказов.Колонки.Добавить("methodPaymentOfLifting", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(1)));
		
		ТаблицаЗаказов.Колонки.Добавить("changeOfPaymentTypeDisabled", Новый ОписаниеТипов("Булево"));
		
		ТаблицаЗаказов.Колонки.Добавить("idRowOrder", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(3)));
		ТаблицаЗаказов.Колонки.Добавить("partnerID", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(9)));
		ТаблицаЗаказов.Колонки.Добавить("tripID", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(9)));
		ТаблицаЗаказов.Колонки.Добавить("requestLiftType", Новый ОписаниеТипов("Булево"));
		
		ТаблицаЗаказов.Колонки.Добавить("tariffZoneCode", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(11)));
		ТаблицаЗаказов.Колонки.Добавить("customerIdentificationCode", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(10)));
		
		ТаблицаЗаказов.Колонки.Добавить("prepaymentAmount", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 2)));
		ТаблицаЗаказов.Колонки.Добавить("requestCustomerIdentificationCode", Новый ОписаниеТипов("Булево"));
		ТаблицаЗаказов.Колонки.Добавить("signingReturnAccDoc", Новый ОписаниеТипов("Булево"));
		ТаблицаЗаказов.Колонки.Добавить("fittingRequired", Новый ОписаниеТипов("Булево"));
		
		// таблица товаров
		ТаблицаТоваров = Новый ТаблицаЗначений();
		
		ТаблицаТоваров.Колонки.Добавить("orderNumber", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(20)));
		ТаблицаТоваров.Колонки.Добавить("rowNumber", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(5)));
		ТаблицаТоваров.Колонки.Добавить("code", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(11)));
		ТаблицаТоваров.Колонки.Добавить("artikul", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(70)));
		ТаблицаТоваров.Колонки.Добавить("name", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(100)));
		ТаблицаТоваров.Колонки.Добавить("count", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(5)));
		ТаблицаТоваров.Колонки.Добавить("price", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 2)));
		ТаблицаТоваров.Колонки.Добавить("summa", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 2)));
		ТаблицаТоваров.Колонки.Добавить("barcode", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(50)));
		ТаблицаТоваров.Колонки.Добавить("markingCode", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(200)));
		ТаблицаТоваров.Колонки.Добавить("idGoodSeller", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(11)));
		ТаблицаТоваров.Колонки.Добавить("NDSRow", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(3)));
		
		
		// таблица расчета стоимости доставки
		ТаблицаРасчетаСтоимостиДоставки = Новый ТаблицаЗначений();
		
		ТаблицаРасчетаСтоимостиДоставки.Колонки.Добавить("orderNumber", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(20)));
		ТаблицаРасчетаСтоимостиДоставки.Колонки.Добавить("totalCost", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 2)));
		ТаблицаРасчетаСтоимостиДоставки.Колонки.Добавить("deliveryCost", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 2)));		
		
		
		Если ДанныеВызова.Свойство("arrayOfOrders") Тогда	
			Для Каждого ТекЗаказ Из ДанныеВызова.arrayOfOrders Цикл
				СтрокаЗаказы = ТаблицаЗаказов.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаЗаказы, ТекЗаказ);
				Для Каждого ТекТовар Из ТекЗаказ.goods Цикл
					СтрокаТовары = ТаблицаТоваров.Добавить(); 
					ЗаполнитьЗначенияСвойств(СтрокаТовары, ТекТовар);
					СтрокаТовары.orderNumber = СтрокаЗаказы.number;										
				КонецЦикла;
					
				Для Каждого ТекРасчет Из ТекЗаказ.deliveryCostCalculations Цикл
					СтрокаРасчет = ТаблицаРасчетаСтоимостиДоставки.Добавить(); 
					ЗаполнитьЗначенияСвойств(СтрокаРасчет, ТекРасчет);		
					СтрокаРасчет.orderNumber = СтрокаЗаказы.number;								
				КонецЦикла;					
			КонецЦикла;
		Иначе
			ОтветМетода.Вставить("РезультатВызова", Ложь);
			ОтветМетода.Вставить("ОписаниеОшибки", "Отсутствуют заказы по рейсу!");
			Возврат ОтветМетода;		
		КонецеСли;				
		
		
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		|	ТоварыЗаказов.orderNumber КАК НомерЗаказа,
		|	ТоварыЗаказов.rowNumber КАК НомерСтроки,
		|	ТоварыЗаказов.code КАК КодТовара,
		|	ТоварыЗаказов.artikul КАК АртикулТовара,
		|	ТоварыЗаказов.name КАК Наименование,
		|	ТоварыЗаказов.count КАК Количество,
		|	ТоварыЗаказов.price КАК Цена,
		|	ТоварыЗаказов.summa КАК Сумма,
		|	ТоварыЗаказов.barcode КАК ШК,
		|	ТоварыЗаказов.markingCode КАК КМ,
		|	ТоварыЗаказов.idGoodSeller КАК КодПоставщика,
		|	ТоварыЗаказов.NDSRow КАК СтавкаНДС
		|ПОМЕСТИТЬ ВТ_ТоварыЗаказов
		|ИЗ
		|	&ТоварыЗаказов КАК ТоварыЗаказов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТоварыЗаказов.НомерЗаказа КАК НомерЗаказа,
		|	ВТ_ТоварыЗаказов.КодТовара КАК КодТовара,
		|	ВТ_ТоварыЗаказов.АртикулТовара КАК АртикулТовара,
		|	ВТ_ТоварыЗаказов.Наименование КАК Наименование,
		|	ВТ_ТоварыЗаказов.Количество КАК Количество,
		|	ВТ_ТоварыЗаказов.Цена КАК Цена,
		|	ВТ_ТоварыЗаказов.Сумма КАК Сумма,
		|	ВТ_ТоварыЗаказов.ШК КАК ШК,
		|	ВТ_ТоварыЗаказов.КМ КАК КМ,
		|	ВТ_ТоварыЗаказов.КодПоставщика КАК КодПоставщика,
		|	ВТ_ТоварыЗаказов.СтавкаНДС КАК СтавкаНДС,
		|	Товары.Ссылка КАК Товар,
		|	ПоставщикиТоваров.Ссылка КАК Поставщик,
		|	ВТ_ТоварыЗаказов.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ ВТ_ТоварыЗаказовИтог
		|ИЗ
		|	ВТ_ТоварыЗаказов КАК ВТ_ТоварыЗаказов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Товары КАК Товары
		|		ПО ВТ_ТоварыЗаказов.КодТовара = Товары.Код
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПоставщикиТоваров КАК ПоставщикиТоваров
		|		ПО ВТ_ТоварыЗаказов.КодПоставщика = ПоставщикиТоваров.Код
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабЗаказов.number КАК НомерЗаказа,
		|	ТабЗаказов.date КАК ДатаДоставкиЗаказа,
		|	ТабЗаказов.calendarID КАК КодКалендарьДоставки,
		|	ТабЗаказов.costDeliveryRequiredIfRefusal КАК ТребуетсяОплатаСтоимостиДоставкиПриОтменеЗаказа,
		|	ТабЗаказов.dateIdRowOrder КАК ДатаВремяПоследнейМаршрутизацииВМП,
		|	ТабЗаказов.internetShopID КАК КодИМ,
		|	ТабЗаказов.status КАК СтатусИМ,
		|	ТабЗаказов.timeOfDeliveryFrom КАК ИнтервалДоставкиС,
		|	ТабЗаказов.timeOfDeliveryTo КАК ИнтервалДоставкиПо,
		|	ТабЗаказов.lat КАК Широта,
		|	ТабЗаказов.long КАК Долгота,
		|	ТабЗаказов.phone КАК Телефон,
		|	ТабЗаказов.address КАК Адрес,
		|	ТабЗаказов.totalSum КАК СуммаЗаказаИтого,
		|	ТабЗаказов.totalSumEnabled КАК СуммаИтогоУчитывается,
		|	ТабЗаказов.partialRedemptionDisabled КАК ЗапретЧастичногоВыкупа,
		|	ТабЗаказов.receiverName КАК ИмяПолучателя,
		|	ТабЗаказов.numberExt КАК НомерЗаказаИМ,
		|	ТабЗаказов.payType КАК КодТипОплаты,
		|	ТабЗаказов.deliverySum КАК СтоимостьДоставки,
		|	ТабЗаказов.liftingIsPaid КАК ПодъемОплачен,
		|	ТабЗаказов.NDSDelivery КАК СтавкаНДССуммаДоставки,
		|	ТабЗаказов.printCheck КАК ПечататьЧек,
		|	ТабЗаказов.receiverEmail КАК ПолучательEMAIL,
		|	ТабЗаказов.sendCheckOnReceiverEmail КАК ОтправлятьЧекНаEMAILПолучателя,
		|	ТабЗаказов.organizationCodeCashe КАК КодОрганизацияОплатаНаличные,
		|	ТабЗаказов.organizationCodeTerminal КАК КодОрганизацияОплатаТерминал,
		|	ТабЗаказов.organizationCodeQPS КАК КодОрганизацияОплатаБСП,
		|	ТабЗаказов.countOfPlaces КАК КоличествоМест,
		|	ТабЗаказов.tariffWeight КАК ТарифицируемыйВес,
		|	ТабЗаказов.methodPaymentOfLifting КАК МетодОплатыПодъема,
		|	ТабЗаказов.changeOfPaymentTypeDisabled КАК ЗапретСменыТипаОплаты,
		|	ТабЗаказов.idRowOrder КАК ПорядокСортировки,
		|	ТабЗаказов.partnerID КАК КодПартнера,
		|	ТабЗаказов.tripID КАК НомерРейса,
		|	ТабЗаказов.requestLiftType КАК ЗапрашиватьДанныеПодъема,
		|	ТабЗаказов.tariffZoneCode КАК КодЗоныТарификации,
		|	ТабЗаказов.customerIdentificationCode КАК КИК,
		|	ТабЗаказов.prepaymentAmount КАК СуммаПредоплаты,
		|	ТабЗаказов.requestCustomerIdentificationCode КАК ЗапрашиватьКИК,
		|	ТабЗаказов.signingReturnAccDoc КАК ПодписаниеИВозвратСопрДокументов,
		|	ТабЗаказов.fittingRequired КАК УслугаПримерки
		|ПОМЕСТИТЬ ВТ_Заказы
		|ИЗ
		|	&ТабЗаказов КАК ТабЗаказов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Заказы.НомерЗаказа КАК НомерЗаказа,
		|	ВТ_Заказы.ДатаДоставкиЗаказа КАК ДатаДоставкиЗаказа,
		|	ВТ_Заказы.КодКалендарьДоставки КАК КодКалендарьДоставки,
		|	ВТ_Заказы.ТребуетсяОплатаСтоимостиДоставкиПриОтменеЗаказа КАК ТребуетсяОплатаСтоимостиДоставкиПриОтменеЗаказа,
		|	ВТ_Заказы.ДатаВремяПоследнейМаршрутизацииВМП КАК ДатаВремяПоследнейМаршрутизацииВМП,
		|	ВТ_Заказы.КодИМ КАК КодИМ,
		|	ВТ_Заказы.СтатусИМ КАК СтатусИМ,
		|	ВТ_Заказы.ИнтервалДоставкиС КАК ИнтервалДоставкиС,
		|	ВТ_Заказы.ИнтервалДоставкиПо КАК ИнтервалДоставкиПо,
		|	ВТ_Заказы.Широта КАК Широта,
		|	ВТ_Заказы.Долгота КАК Долгота,
		|	ВТ_Заказы.Телефон КАК Телефон,
		|	ВТ_Заказы.Адрес КАК Адрес,
		|	ВТ_Заказы.СуммаЗаказаИтого КАК СуммаЗаказаИтого,
		|	ВТ_Заказы.СуммаИтогоУчитывается КАК СуммаИтогоУчитывается,
		|	ВТ_Заказы.ЗапретЧастичногоВыкупа КАК ЗапретЧастичногоВыкупа,
		|	ВТ_Заказы.ИмяПолучателя КАК ИмяПолучателя,
		|	ВТ_Заказы.НомерЗаказаИМ КАК НомерЗаказаИМ,
		|	ВТ_Заказы.КодТипОплаты КАК КодТипОплаты,
		|	ВТ_Заказы.СтоимостьДоставки КАК СтоимостьДоставки,
		|	ВТ_Заказы.ПодъемОплачен КАК ПодъемОплачен,
		|	ВТ_Заказы.СтавкаНДССуммаДоставки КАК СтавкаНДССуммаДоставки,
		|	ВТ_Заказы.ПечататьЧек КАК ПечататьЧек,
		|	ВТ_Заказы.ПолучательEMAIL КАК ПолучательEMAIL,
		|	ВТ_Заказы.ОтправлятьЧекНаEMAILПолучателя КАК ОтправлятьЧекНаEMAILПолучателя,
		|	ВТ_Заказы.КодОрганизацияОплатаНаличные КАК КодОрганизацияОплатаНаличные,
		|	ВТ_Заказы.КодОрганизацияОплатаТерминал КАК КодОрганизацияОплатаТерминал,
		|	ВТ_Заказы.КодОрганизацияОплатаБСП КАК КодОрганизацияОплатаБСП,
		|	ВТ_Заказы.КоличествоМест КАК КоличествоМест,
		|	ВТ_Заказы.ТарифицируемыйВес КАК ТарифицируемыйВес,
		|	ВТ_Заказы.МетодОплатыПодъема КАК МетодОплатыПодъема,
		|	ВТ_Заказы.ЗапретСменыТипаОплаты КАК ЗапретСменыТипаОплаты,
		|	ВТ_Заказы.ПорядокСортировки КАК ПорядокСортировки,
		|	ВТ_Заказы.КодПартнера КАК КодПартнера,
		|	ВТ_Заказы.НомерРейса КАК НомерРейса,
		|	ВТ_Заказы.ЗапрашиватьДанныеПодъема КАК ЗапрашиватьДанныеПодъема,
		|	ВТ_Заказы.КодЗоныТарификации КАК КодЗоныТарификации,
		|	ВТ_Заказы.КИК КАК КИК,
		|	ВТ_Заказы.СуммаПредоплаты КАК СуммаПредоплаты,
		|	ВТ_Заказы.ЗапрашиватьКИК КАК ЗапрашиватьКИК,
		|	ВТ_Заказы.ПодписаниеИВозвратСопрДокументов КАК ПодписаниеИВозвратСопрДокументов,
		|	ВТ_Заказы.УслугаПримерки КАК УслугаПримерки,
		|	Заказы.Ссылка КАК Заказ,
		|	ИнтернетМагазины.Ссылка КАК ИМ,
		|	Партнеры.Ссылка КАК Партнер,
		|	Рейсы.Ссылка КАК Рейс,
		|	ТипыОплат.Ссылка КАК ТипОплаты,
		|	ВТ_ТоварыЗаказовИтог.АртикулТовара КАК Артикул,
		|	ВТ_ТоварыЗаказовИтог.КМ КАК КМ,
		|	ВТ_ТоварыЗаказовИтог.КодПоставщика КАК КодПоставщика,
		|	ВТ_ТоварыЗаказовИтог.КодТовара КАК КодТовара,
		|	ВТ_ТоварыЗаказовИтог.Количество КАК Количество,
		|	ВТ_ТоварыЗаказовИтог.Наименование КАК Наименование,
		|	ВТ_ТоварыЗаказовИтог.Поставщик КАК ПоставщикТовара,
		|	ВТ_ТоварыЗаказовИтог.СтавкаНДС КАК СтавкаНДС,
		|	ВТ_ТоварыЗаказовИтог.Сумма КАК Сумма,
		|	ВТ_ТоварыЗаказовИтог.Товар КАК Товар,
		|	ВТ_ТоварыЗаказовИтог.Цена КАК Цена,
		|	ВТ_ТоварыЗаказовИтог.ШК КАК ШК,
		|	ВТ_ТоварыЗаказовИтог.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	ВТ_Заказы КАК ВТ_Заказы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Заказы КАК Заказы
		|		ПО ВТ_Заказы.НомерЗаказа = Заказы.Код
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИнтернетМагазины КАК ИнтернетМагазины
		|		ПО ВТ_Заказы.КодИМ = ИнтернетМагазины.Код
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИнтернетМагазины КАК Партнеры
		|		ПО ВТ_Заказы.КодПартнера = Партнеры.Код
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Рейсы КАК Рейсы
		|		ПО ВТ_Заказы.НомерРейса = Рейсы.НомерРейса
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыОплат КАК ТипыОплат
		|		ПО ВТ_Заказы.КодТипОплаты = ТипыОплат.КодОплаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТоварыЗаказовИтог КАК ВТ_ТоварыЗаказовИтог
		|		ПО ВТ_Заказы.НомерЗаказа = ВТ_ТоварыЗаказовИтог.НомерЗаказа
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерЗаказа,
		|	НомерСтроки";
		Запрос.УстановитьПараметр("ТабЗаказов", ТаблицаЗаказов);
		Запрос.УстановитьПараметр("ТоварыЗаказов", ТаблицаТоваров);
		ВыборкаЗаказов = Запрос.Выполнить().Выбрать();
		
		ТекущийНомерЗаказаТриггер = Неопределено;
		ТекущийЗаказ = Неопределено;
		
		КэшСозданныхТоваров = Новый ТаблицаЗначений;
		КэшСозданныхТоваров.Колонки.Добавить("КодТовара", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(11)));
		КэшСозданныхТоваров.Колонки.Добавить("Товар", Новый ОписаниеТипов("СправочникСсылка.Товары"));
		
		
		Пока ВыборкаЗаказов.Следующий() Цикл
			
			// работа с заказами
			Если ТекущийНомерЗаказаТриггер <> ВыборкаЗаказов.НомерЗаказа Тогда
				Если ТекущийНомерЗаказаТриггер <> Неопределено Тогда
					ТекущийЗаказ.Записать();
				КонецеСли;	
				Если ЗначениеЗаполнено(ВыборкаЗаказов.Заказ) Тогда
					ТекущийЗаказ = ВыборкаЗаказов.Заказ.ПолучитьОбъект();
				Иначе
					ТекущийЗаказ = Справочники.Заказы.СоздатьЭлемент();
				КонецЕсли;		
				ЗаполнитьЗначенияСвойств(ТекущийЗаказ, ВыборкаЗаказов);
				ТекущийЗаказ.Код = ВыборкаЗаказов.НомерЗаказа;
				ТекущийНомерЗаказаТриггер = ВыборкаЗаказов.НомерЗаказа;
			КонецЕсли;
			
			// работа с товарами заказа
			Если ЗначениеЗаполнено(ВыборкаЗаказов.Товар) Тогда
				ТекущийТовар = ВыборкаЗаказов.Товар.ПолучитьОбъект();
			Иначе
				//поиск в кэше
				СтруктураПоиска = Новый Структура ("КодТовара", ВыборкаЗаказов.КодТовара);
				НайденныеСтрокиВКэше = КэшСозданныхТоваров.НайтиСтроки(СтруктураПоиска);
				Если НайденныеСтрокиВКэше.Количество() = 1 Тогда
					ТекущийТовар = НайденныеСтрокиВКэше[0].Товар;
				Иначе
					ТекущийТовар = Справочники.Товары.СоздатьЭлемент();
					ЗаполнитьЗначенияСвойств(ТекущийТовар, ВыборкаЗаказов);
					ТекущийТовар.Код = ВыборкаЗаказов.КодТовара;
					ТекущийТовар.Записать();
					
					НоваяСтрокаКэшТоваров = КэшСозданныхТоваров.Добавить();
					НоваяСтрокаКэшТоваров.КодТовара = ВыборкаЗаказов.КодТовара;
					НоваяСтрокаКэшТоваров.Товар = ТекущийТовар.Ссылка;						
				КонецЕсли;	
			КонецЕсли;		
			
			НоваяСтрокаТовара = ТекущийЗаказ.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТовара, ВыборкаЗаказов);
			Если НоваяСтрокаТовара.Товар.Пустая() Тогда
				НоваяСтрокаТовара.Товар = ТекущийТовар.Ссылка;
			КонецеСли;
		КонецЦикла;	
		ТекущийЗаказ.Записать();
		ОтветМетода.Вставить("РезультатВызова", Истина);		
	Исключение
		ТОшибки = ОписаниеОшибки();
		ОбщегоНазначенияСервер.ЗаписатьОшибкуВЛог(ТОшибки);
		ОтветМетода.Вставить("РезультатВызова", Ложь);
		ОтветМетода.Вставить("ОписаниеОшибки", ТОшибки);
		Возврат ОтветМетода;		
	КонецПопытки;	
	Возврат ОтветМетода;
КонецФункции


#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс
Функция СформироватьСтрокуJSON(СтруктураJSON) Экспорт
	НастройкиСериализации = Новый НастройкиСериализацииJSON;
	НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.Microsoft;
	НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.УниверсальнаяДата;		
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	//Попытка
		ЗаписатьJSON(ЗаписьJSON, СтруктураJSON, НастройкиСериализации);
	//Исключение
		
	//КонецПопытки;	
	СтрокаJSON = ЗаписьJSON.Закрыть();
	Возврат СтрокаJSON;
КонецФункции

Функция СнятьРегистрациюСОбъектовЦУ(ОбщееСоединениеHTTP = "", МассивКодов, IDУзла, ТипОбъекта) Экспорт
	Если МассивКодов.Количество() <> 0 Тогда
		СтруктураВызова = Новый Структура;
		СтруктураВызова.Вставить("ID", IDУзла);
		СтруктураВызова.Вставить("typeMetadata", ТипОбъекта);
		СтруктураВызова.Вставить("numbers", МассивКодов);
		
		СтрокаЗапроса = СформироватьСтрокуJSON(СтруктураВызова);
		СтрокаОтвета = ВызватьФункциюHTTPСервиса(СтрокаЗапроса, "unregisterChanges", ОбщееСоединениеHTTP);
		ВозниклаОшибка = Ложь;
		ДанныеОтвета = ДанныеJSONВСтруктуру(СтрокаОтвета, , ВозниклаОшибка);
		Если ВозниклаОшибка Тогда
			Возврат Ложь;
		КонецеСли;			
		Если ДанныеОтвета.result И Не ДанныеОтвета.error Тогда
			Возврат Истина;
		ИначеЕсли ДанныеОтвета.error Тогда
			ОбщегоНазначенияСервер.ЗаписатьОшибкуВЛог(ДанныеОтвета.errorText);
			Возврат Ложь;
		КонецеСли;	
	Иначе
		Возврат Истина;
	КонецеСли;			
КонецФункции

Функция ПолучитьIDУзла() Экспорт
	Возврат Константы.ИдентификаторМП.Получить();
КонецФункции	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция УдалитьРегистрацию_ДанныеЗаказаВодителя(МассивНомеров)
	Если Не ЗначениеЗаполнено(МассивНомеров) Тогда
		Возврат Истина;
	КонецеСли;	
	Зап = Новый запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	ДанныеЗаказаВодителя.Ссылка КАК Объект
	            |ИЗ
	            |	Документ.ДанныеЗаказаВодителя КАК ДанныеЗаказаВодителя
	            |ГДЕ
	            |	ДанныеЗаказаВодителя.Номер В(&МассивНомеров)";
	Зап.УстановитьПараметр("МассивНомеров", МассивНомеров);
	Выб = Зап.Выполнить().Выбрать();
	
	Пока Выб.Следующий() Цикл
    	ПланыОбмена.УдалитьРегистрациюИзменений(Константы.УзелПланаОбмена.Получить(), Выб.Объект);
	КонецЦикла;	
	Возврат Истина;
конецФункции

Функция ДанныеJSONВСтруктуру(ДанныеJSON, ИменаСвойствСоЗначениямиДата = "", ВозниклаОшибка = Ложь)
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ДанныеJSON);
	Попытка
		СтруктураДанных = ПрочитатьJSON(ЧтениеJSON, Ложь, ИменаСвойствСоЗначениямиДата, ФорматДатыJSON.Microsoft);
	Исключение
		ВозниклаОшибка = Истина;
		ТекстОшибки = ОписаниеОшибки();
		ОбщегоНазначенияСервер.ЗаписатьОшибкуВЛог(ТекстОшибки + "-------" + ДанныеJSON);
	КонецПопытки;	
	Возврат СтруктураДанных;
КонецФункции

Функция ВызватьФункциюHTTPСервиса(СтрокаJSON, МетодHTTPСервиса, ОбщееСоединениеHTTP = "")
	ЗаголовокЗапроса = Новый Соответствие;
	ЗаголовокЗапроса.Вставить("Content-Type", "application/json");
	ЗаголовокЗапроса.Вставить("Authorization", "55555");
	
	
	Если Константы.ТестоваяСреда.Получить() Тогда
		СтрокаРесурса = "UT_feature/hs/MARouteExchange/V1/" + МетодHTTPСервиса; 
	Иначе
		СтрокаРесурса = "logist/hs/MARouteExchange/V1/" + МетодHTTPСервиса; 
	КонецеСли;	
	
	HTTPЗапрос = Новый HTTPЗапрос(СтрокаРесурса, ЗаголовокЗапроса);
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON);
	
	
	
	ЗапросПрошел = Ложь;
	
	Если Константы.ТестоваяСреда.Получить() Тогда
		Если ОбщееСоединениеHTTP = "" Тогда
			HTTPСоединение = Новый HTTPСоединение("192.168.1.107");
		Иначе
			HTTPСоединение = ОбщееСоединениеHTTP;
		конецЕсли;	
		
		Попытка
			Результат = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
			Если Результат.КодСостояния = 200 Тогда
				ОбщееСоединениеHTTP = HTTPСоединение;
				ЗапросПрошел = Истина;
			КонецЕсли;				
		исключение
			Ошибка = ОписаниеОшибки();
			ОбщегоНазначенияСервер.ЗаписатьОшибкуВЛог(Ошибка);
		КонецПопытки;			
	Иначе
		Если ОбщееСоединениеHTTP = "" Тогда
			Зап = Новый Запрос;
			Зап.Текст = "ВЫБРАТЬ
			|	МассивАдресовДляОбменаСМП.Адрес КАК Адрес
			|ИЗ
			|	РегистрСведений.АдресаОбменаСЦУ КАК МассивАдресовДляОбменаСМП
			|ГДЕ
			|	МассивАдресовДляОбменаСМП.Терминал = &Терминал
			|
			|УПОРЯДОЧИТЬ ПО
			|	МассивАдресовДляОбменаСМП.Приоритет";
			Зап.УстановитьПараметр("Терминал", ПараметрыСеанса.Регион);
			ТабHTTPСоединений = Зап.Выполнить().Выгрузить();
			
			Для Каждого Тек Из ТабHTTPСоединений Цикл
				HTTPСоединение = Новый HTTPСоединение(Тек.Адрес,,,,,10);
				Попытка
					Результат = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
					Если Результат.КодСостояния = 200 Тогда
						ЗапросПрошел = Истина;
						ОбщееСоединениеHTTP = HTTPСоединение;	
						Прервать;
					КонецЕсли;	
				исключение
					Ошибка = ОписаниеОшибки() + ", метод " + МетодHTTPСервиса;
					ОбщегоНазначенияСервер.ЗаписатьОшибкуВЛог(Ошибка);
				КонецПопытки;	
			КонецЦикла;
		Иначе
			HTTPСоединение = ОбщееСоединениеHTTP;
			
			Попытка
				Результат = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
				Если Результат.КодСостояния = 200 Тогда
					ЗапросПрошел = Истина;
				КонецЕсли;	
			исключение
				Ошибка = ОписаниеОшибки() + ", метод " + МетодHTTPСервиса;
				ОбщегоНазначенияСервер.ЗаписатьОшибкуВЛог(Ошибка);
			КонецПопытки;	
			
		КонецЕсли;
	КонецеСли;
	
	если ЗапросПрошел Тогда
		ТекстОтвета = Результат.ПолучитьТелоКакСтроку("UTF-8");
	Иначе	
		ТекстОтвета = "";
	КонецеСли;	
	Возврат ТекстОтвета;
КонецФункции
#КонецОбласти