
Процедура ПередЗаписью(Отказ, Замещение)
	ТаблицаЗаписей = ЭтотОбъект.Выгрузить(,"Контрагент,ТипРассылки,Почта");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ.Контрагент КАК Контрагент,
	               |	ТЗ.Почта КАК Почта,
	               |	ТЗ.ТипРассылки КАК ТипРассылки
	               |ПОМЕСТИТЬ втПочты
	               |ИЗ
	               |	&ТЗ КАК ТЗ
	               |ГДЕ
	               |	ТЗ.ТипРассылки = ЗНАЧЕНИЕ(Перечисление.ТипыРассылки.ЗагрузкаЗаказов)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втПочты.Почта КАК Почта,
	               |	втПочты.ТипРассылки КАК ТипРассылки,
	               |	РассылкиКонтрагентов.Контрагент.Наименование КАК КонтрагентНаименование
	               |ИЗ
	               |	втПочты КАК втПочты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РассылкиКонтрагентов КАК РассылкиКонтрагентов
	               |		ПО втПочты.Контрагент <> РассылкиКонтрагентов.Контрагент
	               |			И втПочты.Почта = РассылкиКонтрагентов.Почта
	               |			И втПочты.ТипРассылки = РассылкиКонтрагентов.ТипРассылки";
	Запрос.УстановитьПараметр("ТЗ",ТаблицаЗаписей);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ВызватьИсключение "Почта уже используется для рассылки заказов " + Выборка.КонтрагентНаименование;
	КонецЕсли;	
КонецПроцедуры
