
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЗапретВыбораПриГрупповойОбработке") Тогда
		
		ЗапретВыбораПриГрупповойОбработке = Параметры.ЗапретВыбораПриГрупповойОбработке;
		ОтборПриИзмененииНаСервереПриГрупповойОбработке()

	КонецеслИ;
	
	Если Параметры.Свойство("ЗапретВыбораЛогистом") Тогда
		
		ЗапретВыбораЛогистом = Параметры.ЗапретВыбораЛогистом;
		ОтборПриИзмененииНаСервереЛогистом()

	КонецеслИ;
	
	//+Степанов Убираем из списка помеченные для удаления элементы.
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));   
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Ложь;   
	//-Степанов
	
КонецПроцедуры

&НаСервере
Процедура ОтборПриИзмененииНаСервереЛогистом()
	
	ОбщегоНазначенияКлиентСервер83.УстановитьЭлементОтбора(Список.Отбор, "ЗапретВыбораЛогистом", ЭтотОбъект.ЗапретВыбораЛогистом, ВидСравненияКомпоновкиДанных.Равно,,Истина);
	
КонецПроцедуры

&НаСервере
Процедура ОтборПриИзмененииНаСервереПриГрупповойОбработке()
	
	ОбщегоНазначенияКлиентСервер83.УстановитьЭлементОтбора(Список.Отбор, "ЗапретВыбораПриГрупповойОбработке", ЭтотОбъект.ЗапретВыбораПриГрупповойОбработке, ВидСравненияКомпоновкиДанных.Равно,,Истина);
	
КонецПроцедуры

//&НаКлиенте
//Процедура ОтборПриИзменении(Элемент)
//	ОтборПриИзмененииНаСервере();
//КонецПроцедуры

