
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр РаботникиОрганизации
	Движения.РаботникиОрганизации.Записывать = Истина;
	Движения.РаботникиОрганизации.Очистить();
	Для Каждого ТекСтрокаСотрудники Из Сотрудники Цикл
		Движение = Движения.РаботникиОрганизации.Добавить();
		Движение.Период = ТекСтрокаСотрудники.ДатаУвольнения;
		Движение.Организация = Организация;
		Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
		Движение.Подразделение = ТекСтрокаСотрудники.Подразделение;
		Движение.Должность = ТекСтрокаСотрудники.Должность;
		Движение.Состояние = Перечисления.СостояниеРаботникаОрганизации.Уволен;
		Движение.ГрафикУчетаРабочегоВремени = ТекСтрокаСотрудники.ГрафикРаботы;
		//CeHbKA 13.05.2019 #3103	
		Движение.ФизЛицо = ТекСтрокаСотрудники.ФизЛицо;
		Движение.Терминал = Терминал;
		//CeHbKA 13.05.2019 #3103	
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
	//Переварюха В.В. 13.02.2020 Задача № 3783
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УвольнениеСРаботыИзОрганизацияСотрудники.Ссылка КАК Ссылка,
		|	УвольнениеСРаботыИзОрганизацияСотрудники.Сотрудник КАК Сотрудник,
		|	УвольнениеСРаботыИзОрганизацияСотрудники.ДатаУвольнения КАК ДатаУвольнения
		|ПОМЕСТИТЬ новаВодители
		|ИЗ
		|	Документ.УвольнениеСРаботыИзОрганизация.Сотрудники КАК УвольнениеСРаботыИзОрганизацияСотрудники
		|ГДЕ
		|	УвольнениеСРаботыИзОрганизацияСотрудники.Ссылка = &Ссылка
		|	И ТИПЗНАЧЕНИЯ(УвольнениеСРаботыИзОрганизацияСотрудники.Сотрудник) = ТИП(Справочник.новаВодители)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	новаВодители.Ссылка КАК Ссылка,
		|	новаВодители.Сотрудник КАК Сотрудник,
		|	ПланируемыеПолигоныЭкипажейСрезПоследних.Водитель КАК Водитель,
		|	ПланируемыеПолигоныЭкипажейСрезПоследних.СхемаПолигональнойМаршрутизации КАК СхемаПолигональнойМаршрутизации,
		|	ПланируемыеПолигоныЭкипажейСрезПоследних.СменаМаршрутизации КАК СменаМаршрутизации,
		|	ПланируемыеПолигоныЭкипажейСрезПоследних.Полигон КАК Полигон,
		|	новаВодители.ДатаУвольнения КАК ДатаУвольнения
		|ИЗ
		|	новаВодители КАК новаВодители
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПланируемыеПолигоныЭкипажей.СрезПоследних(
		|				&Дата,
		|				Водитель В
		|					(ВЫБРАТЬ
		|						новаВодители.Сотрудник КАК Сотрудник
		|					ИЗ
		|						новаВодители КАК новаВодители)) КАК ПланируемыеПолигоныЭкипажейСрезПоследних
		|		ПО новаВодители.Сотрудник = ПланируемыеПолигоныЭкипажейСрезПоследних.Водитель
		|ГДЕ
		|	ПланируемыеПолигоныЭкипажейСрезПоследних.ПолигонУчитывается";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		МенеджерЗаписи = РегистрыСведений.ПланируемыеПолигоныЭкипажей.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.Период = ВыборкаДетальныеЗаписи.ДатаУвольнения;
		МенеджерЗаписи.Водитель = ВыборкаДетальныеЗаписи.Водитель;
		МенеджерЗаписи.СхемаПолигональнойМаршрутизации = ВыборкаДетальныеЗаписи.СхемаПолигональнойМаршрутизации;
		МенеджерЗаписи.СменаМаршрутизации = ВыборкаДетальныеЗаписи.СменаМаршрутизации;
		МенеджерЗаписи.Полигон = ВыборкаДетальныеЗаписи.Полигон;
		МенеджерЗаписи.ПолигонУчитывается = Ложь;
		МенеджерЗаписи.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		МенеджерЗаписи.ДокументРегистратор = Ссылка;

		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	//Переварюха В.В. 13.02.2020 Задача № 3783
КонецПроцедуры


