
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ТипДанных = ТипЗнч(ДанныеЗаполнения);
	Если ТипДанных = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
	Пользователь = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.КомплектыОборудования.Очистить();
	Движения.КомплектыОборудования.Записать();
	Движения.КомплектыОборудования.Записывать = Истина;
	
	Если РазукомплектацияОборудования И Не Оборудование.Пустая() Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Оборудование", Оборудование);
		Запрос.УстановитьПараметр("Период", Дата);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КомплектыОборудованияСрезПоследних.Транспорт КАК Транспорт,
		|	КомплектыОборудованияСрезПоследних.ТипОборудования КАК ТипОборудования
		|ИЗ
		|	РегистрСведений.КомплектыОборудования.СрезПоследних(&Период, ) КАК КомплектыОборудованияСрезПоследних
		|ГДЕ
		|	КомплектыОборудованияСрезПоследних.Оборудование = &Оборудование";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Движение = Движения.КомплектыОборудования.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, Выборка);
			Движение.Период = Дата;
			Движение.Пользователь = Пользователь;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры
