//Закрытие документа
&НаСервере
Функция ЗакрытьДокумент() Экспорт
	Если НЕ ЭтотОбъект.Закрыт Тогда
		ЭтотОбъект.Закрыт = Не ЭтотОбъект.Закрыт;
		Возврат Истина;
	Иначе
		ЭтотОбъект.Закрыт = Не ЭтотОбъект.Закрыт;
	КонецЕсли;
КонецФункции

//Асеев 03.11.2023 (Задача № 5161)>>>
Процедура ВыполнитьДвиженияПоРСэкУчетПроизводственныхОпераций()
	
	Движения.экУчетПроизводственныхОпераций.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ТерминалОтправки", ТерминалОтправки);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Заказ,
	|	РеализацияТоваровУслуг.ТерминалПриема КАК ТерминалПриема
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	Документ.ВнутреннееПеремещениеЗаказов.Заказы КАК ВнутреннееПеремещениеЗаказовЗаказы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО (ВнутреннееПеремещениеЗаказовЗаказы.Ссылка = &Ссылка)
	|			И (ВнутреннееПеремещениеЗаказовЗаказы.Отправлено)
	|			И ВнутреннееПеремещениеЗаказовЗаказы.Заказ = РеализацияТоваровУслуг.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	ВТ_Заказы.Заказ КАК Заказ,
	|	&ТерминалОтправки КАК Регион,
	|	ЗНАЧЕНИЕ(Справочник.экВидыПроизводственныхОпераций.ПередачаЗаказовНаМагистраль) КАК ВидОперации,
	|	ЛОЖЬ КАК ОбратныйПоток
	|ПОМЕСТИТЬ ВТ_ИсходныеДанные
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|ГДЕ
	|	ВТ_Заказы.ТерминалПриема = &ТерминалОтправки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период,
	|	ВТ_Заказы.Заказ,
	|	&ТерминалОтправки,
	|	ЗНАЧЕНИЕ(Справочник.экВидыПроизводственныхОпераций.ПередачаЗаказовНаМагистраль),
	|	ИСТИНА
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.экУчетПроизводственныхОпераций КАК экУчетПроизводственныхОпераций
	|		ПО (экУчетПроизводственныхОпераций.Период < &Период)
	|			И ВТ_Заказы.Заказ = экУчетПроизводственныхОпераций.Заказ
	|			И (экУчетПроизводственныхОпераций.ВидОперации = ЗНАЧЕНИЕ(Справочник.экВидыПроизводственныхОпераций.ПередачаЗаказовНаМагистраль))
	|			И (экУчетПроизводственныхОпераций.ОбратныйПоток)
	|ГДЕ
	|	ВТ_Заказы.ТерминалПриема <> &ТерминалОтправки
	|	И экУчетПроизводственныхОпераций.Заказ ЕСТЬ NULL";
	
	ТаблицаДвижений = РегистрыСведений.экУчетПроизводственныхОпераций.ПолучитьТаблицуДвижений(Запрос);
	
	Движения.экУчетПроизводственныхОпераций.Загрузить(ТаблицаДвижений);
	
КонецПроцедуры
//Асеев 03.11.2023 (Задача № 5161)<<<

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Зап = Новый Запрос;
	Зап.Текст =
	"ВЫБРАТЬ
	|	ВнутреннееПеремещениеЗаказовЗаказы.Заказ КАК Заказ,
	|	СтавкиТарифовДополнительныхУслугСрезПоследних.Тариф КАК Тариф,
	|	СтавкиТарифовДополнительныхУслугСрезПоследних.Услуга КАК ДопУслуга,
	|	СтавкиТарифовДополнительныхУслугСрезПоследних.Ставка КАК Ставка
	|ИЗ
	|	Документ.ВнутреннееПеремещениеЗаказов.Заказы КАК ВнутреннееПеремещениеЗаказовЗаказы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиТарифовДополнительныхУслуг.СрезПоследних(&ДатаЗапроса, ) КАК СтавкиТарифовДополнительныхУслугСрезПоследних
	|		ПО (ВнутреннееПеремещениеЗаказовЗаказы.Ссылка = &Док)
	|			И (ВнутреннееПеремещениеЗаказовЗаказы.Отправлено)
	|			И (ВнутреннееПеремещениеЗаказовЗаказы.Получено)
	|			И (ВнутреннееПеремещениеЗаказовЗаказы.Ссылка.ТерминалПолучения <> ВнутреннееПеремещениеЗаказовЗаказы.Заказ.ТерминалДоставки)
	|			И (ВнутреннееПеремещениеЗаказовЗаказы.Заказ.ТерминалПриема <> ВнутреннееПеремещениеЗаказовЗаказы.Заказ.ТерминалДоставки)
	|			И ВнутреннееПеремещениеЗаказовЗаказы.Заказ.ВладелецТовара = СтавкиТарифовДополнительныхУслугСрезПоследних.Контрагент
	|			И (СтавкиТарифовДополнительныхУслугСрезПоследних.Услуга = ЗНАЧЕНИЕ(Справочник.ПоказателиРасчетаУслугСД.ДоставкаСТерминалаВыдачиНаТерминалПриема))
	|			И (СтавкиТарифовДополнительныхУслугСрезПоследних.Ставка <> 0)";
				
	Зап.УстановитьПараметр("Док", Ссылка);
	Зап.УстановитьПараметр("ДатаЗапроса", Дата);
	
	Движения.НазначенныеДопУслугиПоЗаказам.Записывать = Истина;
	Движения.НазначенныеДопУслугиПоЗаказам.Очистить();
	
	Рез = Зап.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		Нов = Движения.НазначенныеДопУслугиПоЗаказам.Добавить();
		ЗаполнитьЗначенияСвойств(Нов, Рез);
		Нов.Период = Дата;
	КонецЦикла;	
	
	
	
	// РС СтатусыСкладскогоУчета
	Движения.СтатусыСкладскогоУчета.Записывать = Истина;
	
	Для Каждого Стр Из Заказы Цикл	
		Если Стр.Получено И ТерминалПолучения <> Стр.Заказ.ТерминалДоставки Тогда	
			
			Движение = Движения.СтатусыСкладскогоУчета.Добавить();	
			Движение.Заказ = Стр.Заказ;
			Движение.Период = Дата;
			Движение.Регистратор = Ссылка;
			Движение.СтатусСкладскогоУчета = Справочники.СтатусыСкладскогоУчета.ЗаказВернулсяСРегионаНаТерминалПриемки;
			Движение.ТерминалОбработки = ТерминалПолучения;      // ??????
			Движение.ТипЗаказа = Перечисления.ТипыЗаказов.Доставка;
			
			
			ЗапросЗакрытие = Новый Запрос("ВЫБРАТЬ
			                              |	ЗакрытыеЗаказы.Период,
			                              |	ЗакрытыеЗаказы.Регистратор,
			                              |	ЗакрытыеЗаказы.Реализация
			                              |ИЗ
			                              |	РегистрНакопления.ЗакрытыеЗаказы КАК ЗакрытыеЗаказы
			                              |ГДЕ
			                              |	ЗакрытыеЗаказы.Реализация = &Реализация");
			ЗапросЗакрытие.УстановитьПараметр("Реализация", Стр.Заказ);	
			РезЗакрытие = ЗапросЗакрытие.Выполнить();
										  
			Если РезЗакрытие.Пустой() Тогда
				
				// Создаем и активируем задачу товароведу
				ЗадачаТовароведу = Задачи.ЗадачиПользователя.СоздатьЗадачу();
				ЗадачаТовароведу.Дата = ТекущаяДата();
				ЗадачаТовароведу.СрокОповещения = ТекущаяДата()+ 60;
				ЗадачаТовароведу.ДатаИсполнения = ТекущаяДата() + 86400;
				ЗадачаТовароведу.Оповещение = Истина;
				ЗадачаТовароведу.Исполнитель = Справочники.Пользователи.НайтиПоНаименованию("Самохвалова");
				//ЗадачаТовароведу.Исполнитель = Справочники.Пользователи.НайтиПоНаименованию("Администратор");
				ЗадачаТовароведу.Объект = Стр.Заказ;
				ЗадачаТовароведу.Наименование = "Закройте заказ: " + Стр.Заказ;
				ЗадачаТовароведу.Записать();
				ЗадачаТовароведу.АктивироватьИнтерактивно();			
			
			КонецЕсли;		
			
		КонецЕсли;	
	КонецЦикла;	
	
	// если ТерминалПолучения = ТерминалДоставки заказов  + КОтправлению фиксируем статус  218 из справочника 
	// СтатусыЗаказов (и в 1с и выгружаем статус в админку)	
	//Подкл = Евген.СоздатьПодключениеКИнтернетМагазину();

	МассивЗаказов = Новый Массив;
	Для Каждого Стр Из Заказы Цикл	
		Если Стр.КОтправлению И Не Стр.СтатусВыгружен И ТерминалПолучения = Стр.Заказ.ТерминалДоставки Тогда
			
			МассивЗаказов.Добавить(Стр.Заказ);
			
			//Наб = РегистрыСведений.СтатусыЗаказов.СоздатьНаборЗаписей();
			//Наб.Отбор.Заказ.Установить(Стр.Заказ);
			//Наб.Отбор.Период.Установить(ТекД);
			//Наб.Прочитать();
			//
			//Нов = Наб.Добавить();
			//Нов.Период = ТекД;
			//Нов.Заказ = Стр.Заказ;
			//Нов.Статус = 218;
			//Нов.ДокументРегистратор = Ссылка;		
			////Нов.Терминал = Стр.Заказ.ТерминалДоставки; // Задача № 3027
			//Нов.Терминал = ТерминалОтправки; // Задача № 3027
			//Наб.записать();
			
			// Отключено в рамках Задача № 2813
			//СтрЗапроса = "EXEC import_setOrderStatusIDFrom1C " + Формат(Сокрлп(Стр.Заказ.Номер), "ЧГ=") + ",218,'Заказ на сортировке в пункте приема'";
			////Евген.ЗапросКИнтернетМагазину(СтрЗапроса, Подкл);
			//
			//РезВыгрузкиСтатуса = Евген.ЗапросКИнтернетМагазину(СтрЗапроса, Подкл);
			//Если РезВыгрузкиСтатуса <> Неопределено Тогда			
			//	Стр.СтатусВыгружен = Истина;			
			//КонецЕсли;
			
			ДопПараметрыСтатуса = mas.ДобавитьДополнительныйПараметрСтатуса("ProcessingTerminal", Число(ТерминалОтправки.Код)); // Задача № 3027
			
			// Задача № 2813 
			МассивСтатусов = mas.ДобавитьПараметрыЗаказаДляУстановкиСтатуса(Стр.Заказ.Номер, 218, "Заказ на сортировке в пункте приема",,,,ДопПараметрыСтатуса);
			СтруктураВозврата = mas.ОтправитьМассивСтатусовЗаказов(МассивСтатусов);
			Стр.СтатусВыгружен = СтруктураВозврата.Успешно;	
			// Задача № 2813 
			
		КонецЕсли;	
	КонецЦикла; 
	
	Если МассивЗаказов.Количество() Тогда
		ТекД = ТекущаяДата();

		Наб = РегистрыСведений.СтатусыЗаказов.СоздатьНаборЗаписей();
		Наб.Отбор.Период.Установить(ТекД);
		Наб.Отбор.ДокументРегистратор.Установить(Ссылка);
		
		Для Каждого ТекЗаказ Из МассивЗаказов Цикл
			Нов = Наб.Добавить();
			Нов.Период = ТекД;
			Нов.Заказ = ТекЗаказ;
			Нов.Статус = 218;
			Нов.ДокументРегистратор = Ссылка;
			Нов.Терминал = ТерминалОтправки;
		КонецЦикла;
		
		Наб.Записать();
	КонецЕсли;
	
	Если Не Отказ Тогда
		ОбработатьЗаказыЯндексаВАдминке();
	КонецеСли;	
	
	//Асеев 03.11.2023 (Задача № 5161)>>>
	ВыполнитьДвиженияПоРСэкУчетПроизводственныхОпераций();
	//Асеев 03.11.2023 (Задача № 5161)<<<
	
	ЭтотОбъект.Записать(РежимЗаписиДокумента.Запись);	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	//е. Если на документе ВПЗ выставлен флаг ОтправленНаМагистраль - запрещаем его запись в модуле и форму дока открываем только на просмотр
	Если ОтправленНаМагистраль Тогда
		Отказ = Истина;
		Сообщить("Документ закрыт для изменений, заказы по нему отправлены на магистраль");
		Возврат;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПечатьАПП(ПечатныйДокумент) Экспорт
	
	Макет = ПолучитьМакет("АПП");

	ОбластьДанныхШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьДанныхШапка.Параметры.НомерАкта = ЭтотОбъект.Номер;
	ОбластьДанныхШапка.Параметры.ДатаАкта = Формат(ЭтотОбъект.Дата, "ДФ=dd.MM.yyyy");	
	ОбластьДанныхШапка.Параметры.Отправитель = "Склад " + ЭтотОбъект.ТерминалОтправки.КодТерминала;	
	Если ОтправленНаМагистраль Тогда
		ОбластьДанныхШапка.Параметры.Черновик = "";	
	Иначе	
		ОбластьДанныхШапка.Параметры.Черновик = "Ч  Е  Р  Н  О  В  И  К";		
	КонецЕсли;
	
	ПечатныйДокумент.Вывести(ОбластьДанныхШапка);

	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВнутреннееПеремещениеЗаказовЗаказы.Заказ,
	                      |	ВнутреннееПеремещениеЗаказовЗаказы.Отправлено,
	                      |	ВнутреннееПеремещениеЗаказовЗаказы.Получено,
	                      |	ВнутреннееПеремещениеЗаказовЗаказы.КОтправлению,
	                      |	ВнутреннееПеремещениеЗаказовЗаказы.Заказ.Номер КАК НомерСтриж,
	                      |	ВнутреннееПеремещениеЗаказовЗаказы.Заказ.НомерВнешнегоЗаказа КАК ВнешнийНомер,
	                      |	ВнутреннееПеремещениеЗаказовЗаказы.Заказ.ВладелецТовара КАК ВладелецТовара,
	                      |	ВнутреннееПеремещениеЗаказовЗаказы.КоличествоМестПередано как КоличествоМест
	                      |ИЗ
	                      |	Документ.ВнутреннееПеремещениеЗаказов.Заказы КАК ВнутреннееПеремещениеЗаказовЗаказы
	                      |ГДЕ
	                      |	ВнутреннееПеремещениеЗаказовЗаказы.Ссылка.Ссылка = &Ссылка
	                      |	И ВнутреннееПеремещениеЗаказовЗаказы.Отправлено
	                      |ИТОГИ ПО
	                      |	ВладелецТовара");
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);	
	РезМагазин = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	НомерСтроки = 1;
	КоличествоЗаказов = 0;
	ВсегоМест = 0;
	
	Пока РезМагазин.Следующий() Цикл
		
		ОбластьДанныхСтрокаМагазин = Макет.ПолучитьОбласть("СтрокаМагазин");
		ОбластьДанныхСтрокаМагазин.Параметры.ВладелецТовара = РезМагазин.ВладелецТовара;
		ПечатныйДокумент.Вывести(ОбластьДанныхСтрокаМагазин);
		
		РезДетальные = РезМагазин.Выбрать();
		
		Пока РезДетальные.Следующий() Цикл
			
			
		
			ОбластьДанныхСтрокаТЧ = Макет.ПолучитьОбласть("СтрокаТЧ");
			ОбластьДанныхСтрокаТЧ.Параметры.НомерСтроки = НомерСтроки;
			ОбластьДанныхСтрокаТЧ.Параметры.НомерСтриж = РезДетальные.НомерСтриж;
			ОбластьДанныхСтрокаТЧ.Параметры.ВнешнийНомер = РезДетальные.ВнешнийНомер;
			ОбластьДанныхСтрокаТЧ.Параметры.КоличествоМест = РезДетальные.КоличествоМест;
			
			ВсегоМест = ВсегоМест + РезДетальные.КоличествоМест;
			
			//ДокЗаказ = РезДетальные.Заказ; 
			//
			//СуммаЗаказа = ДокЗаказ.Товары.Итог("Сумма") + ДокЗаказ.Услуги.Итог("Сумма");	
			//ОбластьДанныхСтрокаТЧ.Параметры.СуммаЗаказа = СуммаЗаказа;	
			
			ПечатныйДокумент.Вывести(ОбластьДанныхСтрокаТЧ);
			
			
			
			// Михушкин --->> 
			ЗапросТовары = Новый Запрос("ВЫБРАТЬ
			                            |	РеализацияТоваровУслугТовары.НомерСтроки КАК НомерСтроки,
			                            |	РеализацияТоваровУслугТовары.Номенклатура
			                            |ИЗ
			                            |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
			                            |ГДЕ
			                            |	РеализацияТоваровУслугТовары.Ссылка.Ссылка = &Ссылка
			                            |
			                            |УПОРЯДОЧИТЬ ПО
			                            |	НомерСтроки");
			ЗапросТовары.УстановитьПараметр("Ссылка", РезДетальные.Заказ);	
			РезТовары = ЗапросТовары.Выполнить().Выбрать();
			
			НомерСтроки_Товар = 1;
			Пока РезТовары.Следующий() Цикл
											
			    ОбластьСтрокаТовар = Макет.ПолучитьОбласть("СтрокаТовар");
				ОбластьСтрокаТовар.Параметры.Номенклатура = РезТовары.Номенклатура;
				//ОбластьСтрокаТовар.Параметры.НомерСтроки_Товар = "" + НомерСтроки + "." + НомерСтроки_Товар;
				ПечатныйДокумент.Вывести(ОбластьСтрокаТовар);
				
				НомерСтроки_Товар = НомерСтроки_Товар + 1;
			КонецЦикла;
			// <<--- Михушкин
			
			
			
			
		    НомерСтроки = НомерСтроки + 1;
			КоличествоЗаказов = КоличествоЗаказов + 1;
		КонецЦикла;	
	
	КонецЦикла;
	
	//ОбластьДанныхИтог = Макет.ПолучитьОбласть("Итог");
	//ОбластьДанныхИтог.Параметры.ВсегоМест = ВсегоМест;
	//ПечатныйДокумент.Вывести(ОбластьДанныхИтог);
	
	ОбластьДанныхПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьДанныхПодвал.Параметры.ВремяПечати = ТекущаяДата();
	ПечатныйДокумент.Вывести(ОбластьДанныхПодвал);
		

КонецПроцедуры

Процедура ОбработатьЗаказыЯндексаВАдминке()
	
	Зап = Новый Запрос;
	Зап.Текст =
	"ВЫБРАТЬ
	|	ВнутреннееПеремещениеЗаказовЗаказы.Заказ.Номер КАК Заказ
	|ИЗ
	|	Документ.ВнутреннееПеремещениеЗаказов.Заказы КАК ВнутреннееПеремещениеЗаказовЗаказы
	|ГДЕ
	|	ВнутреннееПеремещениеЗаказовЗаказы.Ссылка = &Док
	|	И ВнутреннееПеремещениеЗаказовЗаказы.Заказ.ВладелецТовара.Код В(&Мас)
	|	И ВнутреннееПеремещениеЗаказовЗаказы.Отправлено";
	
	МасЯ = Новый массив;
	МасЯ.Добавить("Shop_601");
	МасЯ.Добавить("Shop_248");
	МасЯ.Добавить("Shop_752");
	
	Зап.УстановитьПараметр("Мас", МасЯ);
	Зап.УстановитьПараметр("Док", Ссылка);
	
	Рез = Зап.Выполнить();
	Если Рез.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТЗ = "declare @orders dbo.Torder";
	
	Рез = Рез.Выбрать(); 
	Пока Рез.Следующий() Цикл
		ТЗ = ТЗ + "
		|insert into @orders values (" + Рез.Заказ + ")";
	КонецЦикла;	
	
	Подкл = Евген.СоздатьПодключениеКИнтернетМагазину();
	ТЗ = ТЗ + "
	|exec import_ya_updateDeliveryDate @orders";
	Евген.ЗапросКИнтернетМагазину(ТЗ, Подкл);
	
КонецПроцедуры

Процедура ЗаполнитьБезМестЗаказов()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Заказ,
	|	МАКСИМУМ(ИСТИНА) КАК КОтправлению,
	|	ЕСТЬNULL(Накладная003Заказы.КоличествоМест, РеализацияТоваровУслуг.КоличествоМест) КАК КоличествоМест
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗагрузкаСТСД.Штрихкоды КАК ЗагрузкаСТСДШтрихкоды
	|		ПО РеализацияТоваровУслуг.Ссылка = ЗагрузкаСТСДШтрихкоды.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Накладная003.Заказы КАК Накладная003Заказы
	|		ПО РеализацияТоваровУслуг.Ссылка = Накладная003Заказы.Заказ
	|ГДЕ
	|	РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
	|	И РеализацияТоваровУслуг.ТерминалПриема = &ТерминалПриема
	|	И РеализацияТоваровУслуг.ТерминалДоставки = &ТерминалДоставки
	|	И РеализацияТоваровУслуг.Дата >= &Дата1
	|	И ЗагрузкаСТСДШтрихкоды.Ссылка.ТерминалПриема = &ТерминалПриема
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслуг.Ссылка,
	|	ЕСТЬNULL(Накладная003Заказы.КоличествоМест, РеализацияТоваровУслуг.КоличествоМест)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Заказ КАК Заказ,
	|	ВТ.КОтправлению КАК КОтправлению,
	|	ВнутреннееПеремещениеЗаказовЗаказы.Ссылка КАК ВПЗ,
	|	ВТ.КоличествоМест КАК КоличествоМест
	|ПОМЕСТИТЬ ВТ_ВПЗ
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВнутреннееПеремещениеЗаказов.Заказы КАК ВнутреннееПеремещениеЗаказовЗаказы
	|		ПО ВТ.Заказ = ВнутреннееПеремещениеЗаказовЗаказы.Заказ
	|			И (ВнутреннееПеремещениеЗаказовЗаказы.Ссылка.Дата < &Дата1)
	|			И (ВнутреннееПеремещениеЗаказовЗаказы.Ссылка.ТерминалОтправки = &ТерминалПриема)
	|			И (ВнутреннееПеремещениеЗаказовЗаказы.Отправлено = ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВПЗ.Заказ КАК Заказ,
	|	ВТ_ВПЗ.КОтправлению КАК КОтправлению,
	|	ВТ_ВПЗ.КоличествоМест КАК КоличествоМест
	|ИЗ
	|	ВТ_ВПЗ КАК ВТ_ВПЗ
	|ГДЕ
	|	ВТ_ВПЗ.ВПЗ ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВПЗ.Заказ,
	|	ВТ_ВПЗ.КОтправлению,
	|	ВТ_ВПЗ.КоличествоМест";
	
	ДатаДоставки = ТекущаяДата() + 86400;
	//ДатаДоставки = Дата + 86400;//тест
	Запрос.УстановитьПараметр("ТерминалПриема", ТерминалОтправки);	
	Запрос.УстановитьПараметр("ТерминалДоставки", ТерминалПолучения);
	Запрос.УстановитьПараметр("Дата1", НачалоДня(ДатаДоставки));
	
	Таб = Запрос.Выполнить().Выгрузить();
	Заказы.Загрузить(Таб);
	МестаПоЗаказам.Очистить();
	
КонецПроцедуры

//Асеев 01.08.2023 (Задача № 5083)>>>
Процедура ЗаполнитьСМестамиЗаказов()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.ВладелецТовара КАК ВладелецТовара
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗагрузкаСТСД.Штрихкоды КАК ЗагрузкаСТСДШтрихкоды
	|		ПО (РеализацияТоваровУслуг.Дата >= &Дата1)
	|			И (РеализацияТоваровУслуг.ТерминалПриема = &ТерминалПриема)
	|			И (РеализацияТоваровУслуг.ТерминалДоставки = &ТерминалДоставки)
	|			И (НЕ РеализацияТоваровУслуг.ПометкаУдаления)
	|			И РеализацияТоваровУслуг.Ссылка = ЗагрузкаСТСДШтрихкоды.Заказ
	|			И (ЗагрузкаСТСДШтрихкоды.Ссылка.ТерминалПриема = &ТерминалПриема)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПараметрыКонтрагентовСрезПоследних.Контрагент КАК Контрагент,
	|	ПараметрыКонтрагентовСрезПоследних.УчетЗаказовПоМестам КАК УчетЗаказовПоМестам
	|ПОМЕСТИТЬ ВТ_ПараметрыКонтрагентов
	|ИЗ
	|	РегистрСведений.ПараметрыКонтрагентов.СрезПоследних(
	|			,
	|			Контрагент В
	|				(ВЫБРАТЬ
	|					ВТ_Заказы.ВладелецТовара КАК ВладелецТовара
	|				ИЗ
	|					ВТ_Заказы КАК ВТ_Заказы)) КАК ПараметрыКонтрагентовСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заказы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ЗаказыСМестами
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПараметрыКонтрагентов КАК ВТ_ПараметрыКонтрагентов
	|		ПО ВТ_Заказы.ВладелецТовара = ВТ_ПараметрыКонтрагентов.Контрагент
	|			И (ВТ_ПараметрыКонтрагентов.УчетЗаказовПоМестам)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заказы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ЗаказыБезМест
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗаказыСМестами КАК ВТ_ЗаказыСМестами
	|		ПО ВТ_Заказы.Ссылка = ВТ_ЗаказыСМестами.Ссылка
	|ГДЕ
	|	ВТ_ЗаказыСМестами.Ссылка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатусыМестЗаказов.Заказ КАК Заказ,
	|	СтатусыМестЗаказов.МестоЗаказа КАК МестоЗаказа,
	|	МАКСИМУМ(СтатусыМестЗаказов.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_ПоследниеПериодыМест
	|ИЗ
	|	РегистрСведений.СтатусыМестЗаказов КАК СтатусыМестЗаказов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗаказыСМестами КАК ВТ_ЗаказыСМестами
	|		ПО СтатусыМестЗаказов.Заказ = ВТ_ЗаказыСМестами.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	СтатусыМестЗаказов.Заказ,
	|	СтатусыМестЗаказов.МестоЗаказа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатусыМестЗаказов.Заказ КАК Заказ,
	|	СтатусыМестЗаказов.МестоЗаказа КАК МестоЗаказа
	|ПОМЕСТИТЬ ВТ_МестаЗаказов
	|ИЗ
	|	РегистрСведений.СтатусыМестЗаказов КАК СтатусыМестЗаказов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПоследниеПериодыМест КАК ВТ_ПоследниеПериодыМест
	|		ПО СтатусыМестЗаказов.Период = ВТ_ПоследниеПериодыМест.Период
	|			И СтатусыМестЗаказов.Заказ = ВТ_ПоследниеПериодыМест.Заказ
	|			И СтатусыМестЗаказов.МестоЗаказа = ВТ_ПоследниеПериодыМест.МестоЗаказа
	|			И (СтатусыМестЗаказов.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыЗаказов.ТоварНаСкладе))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_МестаЗаказов.Заказ КАК Заказ
	|ПОМЕСТИТЬ ВТ_ЗаказыМест
	|ИЗ
	|	ВТ_МестаЗаказов КАК ВТ_МестаЗаказов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВнутреннееПеремещениеЗаказовЗаказы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ВнутренниеПеремещенияЗаказовСМестами
	|ИЗ
	|	Документ.ВнутреннееПеремещениеЗаказов.Заказы КАК ВнутреннееПеремещениеЗаказовЗаказы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗаказыМест КАК ВТ_ЗаказыМест
	|		ПО ВнутреннееПеремещениеЗаказовЗаказы.Заказ = ВТ_ЗаказыМест.Заказ
	|			И (ВнутреннееПеремещениеЗаказовЗаказы.Ссылка.Дата < &Дата1)
	|			И (ВнутреннееПеремещениеЗаказовЗаказы.Ссылка.ТерминалОтправки = &ТерминалПриема)
	|			И (ВнутреннееПеремещениеЗаказовЗаказы.Ссылка.ЗаполненоСМестамиЗаказов)
	|			И (ВнутреннееПеремещениеЗаказовЗаказы.Отправлено)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_МестаЗаказов.Заказ КАК Заказ,
	|	ВТ_МестаЗаказов.МестоЗаказа КАК МестоЗаказа
	|ПОМЕСТИТЬ ВТ_МестаПоЗаказам
	|ИЗ
	|	ВТ_МестаЗаказов КАК ВТ_МестаЗаказов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВнутреннееПеремещениеЗаказов.МестаПоЗаказам КАК ВнутреннееПеремещениеЗаказовМестаПоЗаказам
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВнутренниеПеремещенияЗаказовСМестами КАК ВТ_ВнутренниеПеремещенияЗаказовСМестами
	|			ПО ВнутреннееПеремещениеЗаказовМестаПоЗаказам.Ссылка = ВТ_ВнутренниеПеремещенияЗаказовСМестами.Ссылка
	|		ПО ВТ_МестаЗаказов.Заказ = ВнутреннееПеремещениеЗаказовМестаПоЗаказам.Заказ
	|			И ВТ_МестаЗаказов.МестоЗаказа = ВнутреннееПеремещениеЗаказовМестаПоЗаказам.МестоЗаказа
	|			И (ВнутреннееПеремещениеЗаказовМестаПоЗаказам.КоличествоСканирований > 0)
	|ГДЕ
	|	ВнутреннееПеремещениеЗаказовМестаПоЗаказам.Заказ ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_МестаПоЗаказам.Заказ КАК Заказ,
	|	ВТ_МестаПоЗаказам.МестоЗаказа КАК МестоЗаказа
	|ИЗ
	|	ВТ_МестаПоЗаказам КАК ВТ_МестаПоЗаказам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_МестаПоЗаказам.Заказ КАК Заказ,
	|	ИСТИНА КАК КОтправлению,
	|	КОЛИЧЕСТВО(ИСТИНА) КАК КоличествоМест
	|ИЗ
	|	ВТ_МестаПоЗаказам КАК ВТ_МестаПоЗаказам
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_МестаПоЗаказам.Заказ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ЗаказыБезМест.Ссылка,
	|	ИСТИНА,
	|	ВТ_ЗаказыБезМест.Ссылка.КоличествоМест
	|ИЗ
	|	ВТ_ЗаказыБезМест КАК ВТ_ЗаказыБезМест
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВнутреннееПеремещениеЗаказов.Заказы КАК ВнутреннееПеремещениеЗаказовЗаказы
	|		ПО ВТ_ЗаказыБезМест.Ссылка = ВнутреннееПеремещениеЗаказовЗаказы.Заказ
	|			И (ВнутреннееПеремещениеЗаказовЗаказы.Ссылка.Дата < &Дата1)
	|			И (ВнутреннееПеремещениеЗаказовЗаказы.Ссылка.ТерминалОтправки = &ТерминалПриема)
	|			И (ВнутреннееПеремещениеЗаказовЗаказы.Отправлено)
	|ГДЕ
	|	ВнутреннееПеремещениеЗаказовЗаказы.Заказ ЕСТЬ NULL";
	
	ДатаДоставки = ТекущаяДата() + 86400;
	//ДатаДоставки = Дата + 86400;//тест
	Запрос.УстановитьПараметр("ТерминалПриема", ТерминалОтправки);	
	Запрос.УстановитьПараметр("ТерминалДоставки", ТерминалПолучения);
	Запрос.УстановитьПараметр("Дата1", НачалоДня(ДатаДоставки));
	
	РезультатПакета = Запрос.ВыполнитьПакет();
	МестаПоЗаказам.Загрузить(РезультатПакета[9].Выгрузить());
	Заказы.Загрузить(РезультатПакета[10].Выгрузить());
	
КонецПроцедуры

Процедура ЗаполнитьСМестамиЗаказовПереходныйПериод()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗагрузкаСТСД.Штрихкоды КАК ЗагрузкаСТСДШтрихкоды
	|		ПО (РеализацияТоваровУслуг.Дата >= &Дата1)
	|			И (РеализацияТоваровУслуг.ТерминалПриема = &ТерминалПриема)
	|			И (РеализацияТоваровУслуг.ТерминалДоставки = &ТерминалДоставки)
	|			И (НЕ РеализацияТоваровУслуг.ПометкаУдаления)
	|			И РеализацияТоваровУслуг.Ссылка = ЗагрузкаСТСДШтрихкоды.Заказ
	|			И (ЗагрузкаСТСДШтрихкоды.Ссылка.ТерминалПриема = &ТерминалПриема)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заказы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ЗаказыБезПеремещений
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВнутреннееПеремещениеЗаказов.Заказы КАК ВнутреннееПеремещениеЗаказовЗаказы
	|		ПО ВТ_Заказы.Ссылка = ВнутреннееПеремещениеЗаказовЗаказы.Заказ
	|			И (ВнутреннееПеремещениеЗаказовЗаказы.Ссылка.Дата < &Дата1)
	|			И (ВнутреннееПеремещениеЗаказовЗаказы.Ссылка.ТерминалОтправки = &ТерминалПриема)
	|			И (ВнутреннееПеремещениеЗаказовЗаказы.Отправлено)
	|ГДЕ
	|	ВнутреннееПеремещениеЗаказовЗаказы.Заказ ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатусыМестЗаказов.Заказ КАК Заказ,
	|	СтатусыМестЗаказов.МестоЗаказа КАК МестоЗаказа,
	|	МАКСИМУМ(СтатусыМестЗаказов.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_ПоследниеПериодыМест
	|ИЗ
	|	РегистрСведений.СтатусыМестЗаказов КАК СтатусыМестЗаказов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗаказыБезПеремещений КАК ВТ_ЗаказыБезПеремещений
	|		ПО СтатусыМестЗаказов.Заказ = ВТ_ЗаказыБезПеремещений.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	СтатусыМестЗаказов.Заказ,
	|	СтатусыМестЗаказов.МестоЗаказа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатусыМестЗаказов.Заказ КАК Заказ,
	|	СтатусыМестЗаказов.МестоЗаказа КАК МестоЗаказа
	|ИЗ
	|	РегистрСведений.СтатусыМестЗаказов КАК СтатусыМестЗаказов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПоследниеПериодыМест КАК ВТ_ПоследниеПериодыМест
	|		ПО СтатусыМестЗаказов.Период = ВТ_ПоследниеПериодыМест.Период
	|			И СтатусыМестЗаказов.Заказ = ВТ_ПоследниеПериодыМест.Заказ
	|			И СтатусыМестЗаказов.МестоЗаказа = ВТ_ПоследниеПериодыМест.МестоЗаказа
	|			И (СтатусыМестЗаказов.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыЗаказов.ТоварНаСкладе))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗаказыБезПеремещений.Ссылка КАК Заказ,
	|	ИСТИНА КАК КОтправлению,
	|	ВТ_ЗаказыБезПеремещений.Ссылка.КоличествоМест КАК КоличествоМест
	|ИЗ
	|	ВТ_ЗаказыБезПеремещений КАК ВТ_ЗаказыБезПеремещений";
	
	ДатаДоставки = ТекущаяДата() + 86400;
	//ДатаДоставки = Дата + 86400;//тест
	Запрос.УстановитьПараметр("ТерминалПриема", ТерминалОтправки);	
	Запрос.УстановитьПараметр("ТерминалДоставки", ТерминалПолучения);
	Запрос.УстановитьПараметр("Дата1", НачалоДня(ДатаДоставки));
	
	РезультатПакета = Запрос.ВыполнитьПакет();
	МестаПоЗаказам.Загрузить(РезультатПакета[3].Выгрузить());
	Заказы.Загрузить(РезультатПакета[4].Выгрузить());
	
КонецПроцедуры

Процедура ЗаполнитьДокумент() Экспорт
	
	Если ЗаполненоСМестамиЗаказов Тогда
		ЗаполнитьСМестамиЗаказов();
		//ЗаполнитьСМестамиЗаказовПереходныйПериод();
	Иначе
		ЗаполнитьБезМестЗаказов();
	КонецЕсли;
	
КонецПроцедуры	
//Асеев 01.08.2023 (Задача № 5083)<<<

