
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Добавить("ИсточникДанных");
	ПроверяемыеРеквизиты.Добавить("Организация");
	
	Если  ЭтотОбъект.СоздаватьПоступлениеТоваров 
		ИЛИ ЭтотОбъект.СоздаватьОтчетОРозничныхПродажах Тогда	
		ПроверяемыеРеквизиты.Добавить("СчетУчетаТоваров");		
	КонецЕсли;
	
	Если  ЭтотОбъект.СоздаватьПКО 
		ИЛИ ЭтотОбъект.СоздаватьОтчетОРозничныхПродажах Тогда	
		ПроверяемыеРеквизиты.Добавить("СчетУчетаКассы");
		ПроверяемыеРеквизиты.Добавить("ИдентификаторСтатьиДДС");
	КонецЕсли;
	
	Если ЭтотОбъект.СоздаватьПоступлениеТоваров Тогда
		ПроверяемыеРеквизиты.Добавить("ВремяДокументаПоступления");
		ПроверяемыеРеквизиты.Добавить("СчетУчетаВзаиморасчетов");
	КонецЕсли;

	Если ЭтотОбъект.СоздаватьПКО Тогда
		ПроверяемыеРеквизиты.Добавить("ВремяДокументаПКО");
	КонецЕсли;

	Если ЭтотОбъект.СоздаватьОтчетОРозничныхПродажах Тогда
		
		ПроверяемыеРеквизиты.Добавить("СчетУчетаДоходов");
		ПроверяемыеРеквизиты.Добавить("СчетУчетаРасходов");
		ПроверяемыеРеквизиты.Добавить("ВремяДокументаОтчетОРозничныхПродажах");	
		ПроверяемыеРеквизиты.Добавить("СчетУчетаНДС");	

	КонецЕсли;
	
	Если ЭтотОбъект.СоздаватьОперациюВведеннуюВручную Тогда
		ПроверяемыеРеквизиты.Добавить("ВремяОперацииВведеннойВручную");
		ПроверяемыеРеквизиты.Добавить("ОрганизацияДляНаличныхРасчетовИНН");
	КонецЕсли;

КонецПроцедуры
