
//CeHbKA
//Количество - количество сигналов
//Интервал - время в секундах
Процедура ВыполнитьСигнал(Количество, Интервал) Экспорт
	
	Если Количество = 0 ИЛИ Интервал = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	//Сообщить(Строка(ТекущаяДата())+" вызов");
	
	Если Интервал < 1 Тогда
		Для Сч = 1 По Количество Цикл
			ИздатьСигнал();
		КонецЦикла; 
	Иначе
		ПодключитьОбработчикОжидания("ИздатьСигнал", Интервал);
		ПодключитьОбработчикОжидания("ЗавершитьСигнал", (Количество+1)*Интервал-1, Истина);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ИздатьСигнал() Экспорт
	
	Сигнал();
	//Сообщить(Строка(ТекущаяДата())+" хлабысь");
	
КонецПроцедуры
 
Процедура ЗавершитьСигнал() Экспорт

	ОтключитьОбработчикОжидания("ИздатьСигнал");	
	//Сообщить(Строка(ТекущаяДата())+" хватит");

КонецПроцедуры
 