#Область ПрограммныйИнтерфейс

// Дополнить структуру.
// 
// Параметры:
//  Приемник - Структура - Приемник
//  Источник - Структура - Источник
//  Заменять - Неопределено - Заменять
Процедура ДополнитьСтруктуру(Приемник, Источник, Заменять = Неопределено) Экспорт
	
	Для Каждого Элемент Из Источник Цикл
		Если Заменять <> Истина И Приемник.Свойство(Элемент.Ключ) Тогда
			Если Заменять = Ложь Тогда
				Продолжить;
			Иначе
				ВызватьИсключение "Пересечение ключей источника и приемника";
			КонецЕсли
		КонецЕсли;
		Приемник.Вставить(Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
	
КонецПроцедуры	 
#КонецОбласти