
&НаСервере
Процедура СформироватьЛинейкуШтрихкодовНаСервере()
	Записать();
	may.ЗаписатьЛинейкуШтрихкодов(Объект);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЛинейкуШтрихкодов(Команда)
	ЗадатьВопрос();	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Этаформа.Модифицированность Тогда
    	ЗадатьВопрос();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопрос()
	Ответ = Вопрос("Записать линейку Штрихкодов?", РежимДиалогаВопрос.ДаНет);
	Если Ответ = КодВозвратаДиалога.Да Тогда
		СформироватьЛинейкуШтрихкодовНаСервере();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	Табл = may.СформироватьПечатьЛинейкиШК(Объект.Ссылка);
	Табл.АвтоМасштаб = Истина;
	Табл.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	Табл.Показать();
КонецПроцедуры





