
Функция ПодключитьсяКККМ(ККМ) Экспорт
	Если ККМ.ВерсияПлатформыATOL.Пустая() Или ККМ.ВерсияПлатформыATOL = Перечисления.ВерсииПлатформыATOL.Версия_2_5 Тогда
		Возврат ККМ_ФЗ_54.ПодключитьсяКККМ(ККМ);
	Иначе
		Возврат ККМ_ATOL_10.ПодключитьсяКККМ(ККМ);
	КонецЕсли;	
КонецФункции	


Функция ПечатьЧека(СерверККТ, КассаККМ, ТаблицаТоваров, ПараметрыЧека, ДополнительныеПараметрыЧека,ЭтоВозврат = Ложь, ТипКассовогоЧека) Экспорт
	Если КассаККМ.ВерсияПлатформыATOL.Пустая() Или КассаККМ.ВерсияПлатформыATOL = Перечисления.ВерсииПлатформыATOL.Версия_2_5 Тогда
		Возврат ККМ_ФЗ_54.ПечатьЧекаФФД_1_05(СерверККТ, КассаККМ, ТаблицаТоваров, ПараметрыЧека, ДополнительныеПараметрыЧека,ЭтоВозврат, ТипКассовогоЧека);
	Иначе
		Возврат ККМ_ATOL_10.ПечатьЧекаФФД_1_05(СерверККТ, КассаККМ, ТаблицаТоваров, ПараметрыЧека, ДополнительныеПараметрыЧека,ЭтоВозврат, ТипКассовогоЧека);
	КонецЕсли;	
КонецФункции	


Функция ПечатьЧекаФФД_1_05(СерверККТ, КассаККМ, ТаблицаТоваров, ПараметрыЧека, ДополнительныеПараметрыЧека,ЭтоВозврат = Ложь, ТипКассовогоЧека, НомерУстройства = Неопределено) Экспорт
	Если КассаККМ.ВерсияПлатформыATOL.Пустая() Или КассаККМ.ВерсияПлатформыATOL = Перечисления.ВерсииПлатформыATOL.Версия_2_5 Тогда
		Возврат ККМ_ФЗ_54.ПечатьЧекаФФД_1_05(СерверККТ, КассаККМ, ТаблицаТоваров, ПараметрыЧека, ДополнительныеПараметрыЧека,ЭтоВозврат, ТипКассовогоЧека, НомерУстройства);
	Иначе
		Возврат ККМ_ATOL_10.ПечатьЧекаФФД_1_05(СерверККТ, КассаККМ, ТаблицаТоваров, ПараметрыЧека, ДополнительныеПараметрыЧека,ЭтоВозврат, ТипКассовогоЧека);
	КонецЕсли;	
КонецФункции	


Функция ПечатьЧекаФФД_1_2(СерверККТ, КассаККМ, ТаблицаТоваров, ПараметрыЧека, ДополнительныеПараметрыЧека,ЭтоВозврат = Ложь, ТипКассовогоЧека, НомерУстройства = Неопределено) Экспорт
	если КассаККМ.ВерсияПлатформыATOL.Пустая() Или КассаККМ.ВерсияПлатформыATOL = Перечисления.ВерсииПлатформыATOL.Версия_2_5 Тогда
		//Возврат ККМ_ФЗ_54.ПечатьЧекаФФД_1_05(СерверККТ, КассаККМ, ТаблицаТоваров, ПараметрыЧека, ДополнительныеПараметрыЧека,ЭтоВозврат, ТипКассовогоЧека);
		Возврат Ложь;
	Иначе
		Возврат ККМ_ATOL_10.ПечатьЧекаФФД_1_2(СерверККТ, КассаККМ, ТаблицаТоваров, ПараметрыЧека, ДополнительныеПараметрыЧека,ЭтоВозврат, ТипКассовогоЧека);
	КонецЕсли;	
КонецФункции

Процедура ОтключитьсяОтККМ(СерверККМ, ККМ) Экспорт
	Если ККМ.ВерсияПлатформыATOL.Пустая() Или ККМ.ВерсияПлатформыATOL = Перечисления.ВерсииПлатформыATOL.Версия_2_5 Тогда
		ККМ_ФЗ_54.ОтключитьсяОтККМ(СерверККМ, ККМ);
	Иначе
		ККМ_ATOL_10.ОтключитьсяОтККМ(СерверККМ, ККМ);
	КонецЕсли;	
КонецПроцедуры	

Процедура ЗаписьЛогаОшибкиККМ(КодОшибки, Описание, ПроизводительККМ, ЧекККМ, ОписаниеОшибкиККМ = "") Экспорт
	//Если ККМ.ВерсияПлатформыATOL.Пустая() Или ККМ.ВерсияПлатформыATOL = Перечисления.ВерсииПлатформыATOL.Версия_2_5 Тогда
	//	ККМ_ФЗ_54.ЗаписьЛогаОшибкиККМ(КодОшибки, Описание, ПроизводительККМ, ЧекККМ);
	//Иначе
	//	ККМ_ATOL_10.ЗаписьЛогаОшибкиККМ(КодОшибки, Описание, ПроизводительККМ, ЧекККМ, ОписаниеОшибкиККМ);
	//КонецЕсли;	
КонецПроцедуры	

Функция СнятьОтчетККМ(СерверККТ, КассаККМ, ТипОтчета) Экспорт
	Если КассаККМ.ВерсияПлатформыATOL.Пустая() Или КассаККМ.ВерсияПлатформыATOL = Перечисления.ВерсииПлатформыATOL.Версия_2_5 Тогда	
		Возврат ККМ_ФЗ_54.СнятьОтчетККМ(СерверККТ, КассаККМ, ТипОтчета);
	Иначе
		Возврат ККМ_ATOL_10.СнятьОтчетККМ(СерверККТ, КассаККМ, ТипОтчета);
	КонецЕсли;	
КонецФункции	

Функция СнятьZОтчет(ККМ, СерверККТ = "", Кассир = "") Экспорт
	Если ККМ.ВерсияПлатформыATOL.Пустая() Или ККМ.ВерсияПлатформыATOL = Перечисления.ВерсииПлатформыATOL.Версия_2_5 Тогда
		Возврат ККМ_ФЗ_54.СнятьZОтчет(СерверККТ);
	Иначе
		Возврат ККМ_ATOL_10.СнятьZОтчет(СерверККТ, Кассир);
	КонецЕсли;	
КонецФункции	