

&НаКлиенте
Процедура ПинганутьККМ(Команда)
	
	ТекККМ = Элементы.Список.ТекущаяСтрока;
	Если ТекККМ <> Неопределено Тогда	
		ПинганутьККМНаСервере(ТекККМ);		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПинганутьККМНаСервере(КассаККМ)
		
	НормАдрес = СокрЛП(КассаККМ.АдресККМ);	
	КолСимв = СтрДлина(НормАдрес);
	АйПи = "";
	
	Для Н = 1 По КолСимв Цикл
		
		ТекСимвол = Сред(НормАдрес, Н, 1);		
		
		Если ТекСимвол = ":" Тогда		
			Прервать;	
		Иначе		
			АйПи = АйПи + ТекСимвол;			
		КонецЕсли;	 

	КонецЦикла;
	
	Результат = ксРаботаСККМСервер.Ping(АйПи);		
	Текст = ?(Результат > 0 ,"ОК", "Соединение отсутствует");
	
	Сообщить(Текст);
	
КонецПроцедуры