
&НаКлиенте
Процедура ТипАдресаВозвращенияПриИзменении(Элемент)
	Если ТипАдресаВозвращения = 3 Тогда
		Элементы.ГруппаСтрокиАдреса.Доступность = Истина;
		Если ЗначениеЗаполнено(Широта) И ЗначениеЗаполнено(Долгота) Тогда
			Элементы.РаспознанныйАдрес.Видимость = Истина;
		КонецЕсли;	
	Иначе
		Элементы.ГруппаСтрокиАдреса.Доступность = Ложь;
	КонецеСли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Вставить содержимое обработчика.
	ТипАдресаВозвращения = 1;
	ТипАдресаВозвращенияПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	// Вставить содержимое обработчика.
	Если ТипАдресаВозвращения = 0 Тогда
		Сообщить("Выберите точку возвращения!");
		Возврат;	
	ИначеЕсли ТипАдресаВозвращения = 3 И ПустаяСтрока(СтрокаАдреса) Тогда
		Сообщить("Укажите адрес!");
		Возврат;
	ИначеЕсли ТипАдресаВозвращения = 3 И (ПустаяСтрока(Широта) Или ПустаяСтрока(Долгота)) Тогда
		Сообщить("Адрес не распознан!");
		Возврат;
	Иначе	
		ПараметрОтвета = Новый Структура;
		ПараметрОтвета.Вставить("ТипАдреса", ТипАдресаВозвращения);
		ПараметрОтвета.Вставить("Широта", Широта);
		ПараметрОтвета.Вставить("Долгота", Долгота);
		ПараметрОтвета.Вставить("РаспознанныйАдрес", РаспознанныйАдрес);
		Закрыть(ПараметрОтвета);
	КонецеСли;	
КонецПроцедуры

&НаСервере
Процедура СтрокаАдресаОкончаниеВводаТекстаНаСервере(ТекстАдреса)
	// Вставить содержимое обработчика.
	//ОтветМетода = МодульОбмен_http.РаспознатьАдрес(, ТекстАдреса);
	//Если ОтветМетода.РезультатВызова Тогда
	//	Широта = ОтветМетода.Широта;
	//	Долгота = ОтветМетода.Долгота;
	//	РаспознанныйАдрес = ОтветМетода.РаспАдрес;
	//	Элементы.РаспознанныйАдрес.ЦветФона = WebЦвета.БледноЗеленый;
	//	Элементы.РаспознанныйАдрес.Видимость = Истина;		
	//Иначе
	//	Широта = "";
	//	Долгота = "";
	//	РаспознанныйАдрес = "Адрес не распознан!";
	//	Элементы.РаспознанныйАдрес.ЦветФона = WebЦвета.ЛососьСветлый;
	//	Элементы.РаспознанныйАдрес.Видимость = Истина;
	//КонецеСли;
	ВходныеДанные = Новый Структура("address", ТекстАдреса);
	СтруктураОтвета = РаботаСМобильнымПриложениемЭкипажейСервер.ПолучитьКоординатыАдреса(ВходныеДанные);
	Если СтруктураОтвета.error Тогда
		Широта = "";
		Долгота = "";
		РаспознанныйАдрес = "Адрес не распознан!";
		Элементы.РаспознанныйАдрес.ЦветФона = WebЦвета.ЛососьСветлый;
		Элементы.РаспознанныйАдрес.Видимость = Истина;
	Иначе
		Широта = СтруктураОтвета.location.lat;
		Долгота = СтруктураОтвета.location.long;
		РаспознанныйАдрес = СтруктураОтвета.location.addressLocation;
		Элементы.РаспознанныйАдрес.ЦветФона = WebЦвета.БледноЗеленый;
		Элементы.РаспознанныйАдрес.Видимость = Истина;		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура РаспознатьАдрес(Команда)
	// Вставить содержимое обработчика.
	СтрокаАдресаОкончаниеВводаТекстаНаСервере(СтрокаАдреса);
КонецПроцедуры
