
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ксСостояниеСменККМ
	Движения.ксСостояниеСменККМ.Записывать = Истина;
	Движение = Движения.ксСостояниеСменККМ.Добавить();
	Движение.Период = Дата;
	Движение.ККМ = ККМ;
	Движение.Кассир = Кассир;
	Движение.СостояниеСмены = Перечисления.ксСостояниеСменККМ.СменаОткрыта;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
