Функция Сформировать(Таб, ДатаНач, ДатаКон) Экспорт
	Таб.Очистить();
	
	Зап = Новый Запрос;
	//Зап.Текст = "ВЫБРАТЬ
	//            |	новаКалендарьВозможныхРейсов.Транспорт,
	//            |	новаКалендарьВозможныхРейсов.Водитель,
	//            |	новаКалендарьВозможныхРейсов.Транспорт.НомерЛог КАК Индекс,
	//            |	ТелефонныеАппаратыТранспортаСрезПоследних.ТА.Наименование КАК Телефон,
	//            |	новаКалендарьВозможныхРейсов.Экспедитор
	//            |ИЗ
	//            |	РегистрСведений.новаКалендарьВозможныхРейсов КАК новаКалендарьВозможныхРейсов
	//            |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТелефонныеАппаратыТранспорта.СрезПоследних КАК ТелефонныеАппаратыТранспортаСрезПоследних
	//            |		ПО новаКалендарьВозможныхРейсов.Транспорт.Ссылка = ТелефонныеАппаратыТранспортаСрезПоследних.Транспорт.Ссылка
	//            |ГДЕ
	//            |	новаКалендарьВозможныхРейсов.НачалоПериода >= &НачДата
	//            |	И новаКалендарьВозможныхРейсов.КонецПериода <= &КонДата
	//            |
	//            |УПОРЯДОЧИТЬ ПО
	//            |	Индекс";
	Зап.Текст = "ВЫБРАТЬ
	            |	ВыборкаФлагаДоступности.Транспорт КАК Транспорт,
	            |	ЕСТЬNULL(ВозможныеРейсы.Водитель, ЗНАЧЕНИЕ(Справочник.новаВодители.ПустаяСсылка)) КАК Водитель,
	            |	ЕСТЬNULL(ВозможныеРейсы.Экспедитор, ЗНАЧЕНИЕ(Справочник.новаЭкспедиторы.ПустаяСсылка)) КАК Экспедитор,
	            |	ЕСТЬNULL(ВозможныеРейсы.НачалоПериода, &НачалоРейсаПоДефолту) КАК НачалоПериода,
	            |	ВозможныеРейсы.Транспорт.НомерЛог КАК Индекс,
	            |	ТелефонныеАппаратыТранспортаСрезПоследних.ТА.Наименование КАК Телефон
	            |ИЗ
	            |	(ВЫБРАТЬ
	            |		ДоступностьТранспорта.Транспорт КАК Транспорт,
	            |		МАКСИМУМ(ДоступностьТранспорта.НачалоПериода) КАК НачалоПериода
	            |	ИЗ
	            |		РегистрСведений.новаДоступностьТранспорта КАК ДоступностьТранспорта
	            |	ГДЕ
	            |		ДоступностьТранспорта.НачалоПериода <= &ДатаРедактирования
	            |	
	            |	СГРУППИРОВАТЬ ПО
	            |		ДоступностьТранспорта.Транспорт) КАК ВыборкаФлагаДоступности
	            |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.новаДоступностьТранспорта КАК ДоступностьТранспорта
	            |		ПО ВыборкаФлагаДоступности.Транспорт = ДоступностьТранспорта.Транспорт
	            |			И ВыборкаФлагаДоступности.НачалоПериода = ДоступностьТранспорта.НачалоПериода
	            |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.новаКалендарьВозможныхРейсов КАК ВозможныеРейсы
	            |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТелефонныеАппаратыТранспорта.СрезПоследних КАК ТелефонныеАппаратыТранспортаСрезПоследних
	            |			ПО ВозможныеРейсы.Транспорт.Ссылка = ТелефонныеАппаратыТранспортаСрезПоследних.Транспорт.Ссылка
	            |		ПО (ВозможныеРейсы.Транспорт = ВыборкаФлагаДоступности.Транспорт)
	            |			И (ВозможныеРейсы.НачалоПериода >= &ДатаРедактирования)
	            |			И (ВозможныеРейсы.КонецПериода <= КОНЕЦПЕРИОДА(&ДатаРедактирования, ДЕНЬ))
	            |ГДЕ
	            |	ДоступностьТранспорта.Доступен
	            |	И ЕСТЬNULL(ВозможныеРейсы.Водитель, ЗНАЧЕНИЕ(Справочник.новаВодители.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.новаВодители.ПустаяСсылка)
	            |
	            |УПОРЯДОЧИТЬ ПО
	            |	Индекс";	
				
	Зап.УстановитьПараметр("ДатаРедактирования", НачалоДня(ДатаНач));
	Зап.УстановитьПараметр("НачалоРейсаПоДефолту", НачалоДня(ДатаНач) + 7 * 60 * 60);
				
	//Зап.УстановитьПараметр("НачДата", НачалоДня(ДатаНач));			
	//Зап.УстановитьПараметр("КонДата", КонецДня(ДатаКон));			
	
	Рез = Зап.Выполнить().Выгрузить();
	
	Мак = ПолучитьМакет("Макет");
	ОблШ1 = Мак.ПолучитьОбласть("Шапка1");
	ОблШ2 = Мак.ПолучитьОбласть("Шапка2");
	ОблСтр = Мак.ПолучитьОбласть("Строка");
	ОблСтрД = Мак.ПолучитьОбласть("СтрокаДежурный");
	
	
	ОблШ1.Параметры.Название = "График водителей на " + Формат(ДатаНач, "ДЛФ=D");
	Таб.Вывести(ОблШ1);
	
	ОблСтрД.Параметры.ИмяЛогиста = ПараметрыСеанса.ТекущийПользователь;
	
	Таб.Вывести(ОблСтрД);
	Таб.Вывести(ОблШ2);

	
	НПП = 1;
	Для Каждого Тек Из Рез Цикл
		ЗаполнитьЗначенияСвойств(ОблСтр.Параметры, Тек);
		ОблСтр.Параметры.НПП = НПП;
		Таб.Вывести(ОблСтр);
		НПП = НПП + 1;
	КонецЦикла;
	
	Возврат Таб;
КонецФункции
