
//Асеев 12.05.2023 (по письму Контроль заказов)>>>
Процедура РассылкаКонтрольЗаказов(ДанныеЗаказаВодителя, Рейс, Контрагент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РассылкиКонтрагентов.Почта КАК Почта
	|ИЗ
	|	РегистрСведений.ПараметрыКонтрагентов.СрезПоследних(, Контрагент = &Контрагент) КАК ПараметрыКонтрагентовСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РассылкиКонтрагентов КАК РассылкиКонтрагентов
	|		ПО (ПараметрыКонтрагентовСрезПоследних.ПроизводитьРассылкуКонтроляЗаказов)
	|			И (РассылкиКонтрагентов.Контрагент = &Контрагент)
	|			И (РассылкиКонтрагентов.ТипРассылки = ЗНАЧЕНИЕ(Перечисление.ТипыРассылки.КонтрольЗаказов))
	|			И (РассылкиКонтрагентов.Почта ПОДОБНО ""%@%"")
	|			И (РассылкиКонтрагентов.Активна)";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	МассивПолучателей = Результат.Выгрузить().ВыгрузитьКолонку("Почта");
	
	lem.РассылкаПоПереносуДоставки(МассивПолучателей, ДанныеЗаказаВодителя, Рейс);
	
КонецПроцедуры
//Асеев 12.05.2023 (по письму Контроль заказов)<<<

Функция ЧасыССотымиВЧасыСМинутами(Знач ЧасыССотыми) Экспорт
	
	Часы = Цел(ЧасыССотыми);
	Возврат Строка(Часы) + ":" + Формат((ЧасыССотыми - Часы) * 60, "ЧЦ=2; ЧН=; ЧВН=");
	
КонецФункции
