
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр КомплектыОборудования
	Движения.КомплектыОборудования.Записывать = Истина;
	Движения.КомплектыОборудования.Очистить();
	
	// регистр УчетОборудования
	Движения.УчетОборудования.Записывать = Истина;
	Движения.УчетОборудования.Очистить();
	
	Для Каждого ТекСтрокаСписокОборудования Из СписокОборудования Цикл
		
		Если ТекСтрокаСписокОборудования.УстановитьКомплектным Тогда
			Запись = Движения.КомплектыОборудования.Добавить();
			Запись.Период = ТекСтрокаСписокОборудования.ВремяВводаДанных;
			Запись.Транспорт = Транспорт;
			Запись.ТипОборудования = ТекСтрокаСписокОборудования.Оборудование.МодельОборудования.ТипОборудования;
			Запись.Оборудование = ТекСтрокаСписокОборудования.Оборудование;
			Запись.ФизЛицо = ФизЛицо;
			Запись.Пользователь = Пользователь;
		КонецЕсли; 
		
		Запись2 = Движения.УчетОборудования.Добавить();
		Запись2.Период = ТекСтрокаСписокОборудования.ВремяВводаДанных;
		Запись2.Оборудование = ТекСтрокаСписокОборудования.Оборудование;
		Запись2.ФизЛицо = ФизЛицо;
		Запись2.Рейс = Рейс;
		Запись2.СостояниеЕдиницыОборудования = СостояниеОборудования;
		Запись2.Транспорт = Транспорт;
		Запись2.ОборудованиеПовреждено = ТекСтрокаСписокОборудования.ОбрудованиеПовреждено;
		Запись2.Пользователь = Пользователь;
		//Асеев 10.04.2024 (Задача № 5255)>>>
		Запись2.ВыдачаНаДлительныйСрок = ВыдачаНаДлительныйСрок;
		//Асеев 10.04.2024 (Задача № 5255)<<<
		Запись2.Регион = Регион;
		
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Добавить(Регион);
	ПроверяемыеРеквизиты.Добавить(ФизЛицо);
	ПроверяемыеРеквизиты.Добавить(СостояниеОборудования);
	ПроверяемыеРеквизиты.Добавить(Рейс);
	ПроверяемыеРеквизиты.Добавить(Транспорт);
	
КонецПроцедуры
