
Функция TSDPOST(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	ИмяМетода = Запрос.ПараметрыURL.Получить("ИмяМетода");
	ТекстЗапроса = Запрос.ПолучитьТелоКакСтроку();
	
	СтруктураОтвета = Новый Структура;
	ВходныеДанные = РаботаССервисомСканированияСервер.ДанныеJSONВСтруктуру(ТекстЗапроса);
	
	Если ИмяМетода = "getRouteInfo" Тогда
		ДанныеПоРейсу = РаботаССервисомСканированияСервер.ПолучитьДанныеРейса(ВходныеДанные.paleteNumber);
		
		СтрокаJSON = РаботаССервисомСканированияСервер.СформироватьСтрокуJSON(ДанныеПоРейсу);
	//+Степанов Задача № 3825	
	ИначеЕсли ИмяМетода = "getBC" Тогда	
		ДанныеШК = РаботаССервисомСканированияСервер.ПолучитьДанныеШК(ВходныеДанные);
		СтрокаJSON =  РаботаССервисомСканированияСервер.СформироватьСтрокуJSON(ДанныеШК);		
	КонецеСли;	
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON);
	Возврат Ответ;
КонецФункции

