
&НаСервере
Процедура ЗаказПриИзмененииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НомерЗаказа", Формат(Объект.НомерЗаказа, "ЧГ="));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Заказ,
	|	РеализацияТоваровУслуг.ТерминалПриема КАК ТерминалОбработки
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Номер = &НомерЗаказа";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Объект.Заказ = Неопределено;
		Объект.ТерминалОбработки = Неопределено;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(Объект, Выборка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказПриИзменении(Элемент)
	
	Если Объект.НомерЗаказа Тогда
		ЗаказПриИзмененииНаСервере();
	Иначе
		Объект.Заказ = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСтатусНаСервере()
	
	ТерминалОбработки = Объект.ТерминалОбработки;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Заказ", Объект.Заказ);
	Запрос.УстановитьПараметр("ТерминалОбработки", Объект.ТерминалОбработки);
	Запрос.УстановитьПараметр("КодСтатуса", Объект.Статус);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА &ТерминалОбработки <> ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.ПустаяСсылка)
	|			ТОГДА &ТерминалОбработки
	|		ИНАЧЕ РеализацияТоваровУслуг.ТерминалПриема
	|	КОНЕЦ КАК ТерминалОбработки,
	|	СтатусыЗаказов.Ссылка КАК Статус
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтатусыЗаказов КАК СтатусыЗаказов
	|		ПО (СтатусыЗаказов.Код = &КодСтатуса)
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Заказ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Сейчас = ТекущаяДата();
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	
	Док = Документы.ГрупповаяУстановкаСтатусовЗаказов.СоздатьДокумент();
	Док.Дата = Сейчас;
	Док.УстановитьНовыйНомер();
	Док.Ответственный = ТекПользователь;
	Док.ТерминалОбработки = Выборка.ТерминалОбработки;
	//Док.ВнешнийОператорМаршрутизации = ВнешнийОператорМаршрутизации;
	Док.Статус = Выборка.Статус;
	
	СтрокаСтатуса = Док.СтатусыЗаказов.Добавить();
	СтрокаСтатуса.Заказ = Объект.Заказ;
	СтрокаСтатуса.Статус = Выборка.Статус;
	
	Док.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьСтатус(Команда)
	
	Если Не Объект.Заказ.Пустая() И Объект.Статус Тогда
		УстановитьСтатусНаСервере();
		ПоказатьПредупреждение(, "Статус установлен");
	Иначе
		ПоказатьПредупреждение(, "Укажите заказ и его статус");
	КонецЕсли;
	
КонецПроцедуры
