
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	Если Параметры.Отбор.Свойство("ВладельцыТоваров") И Не ПустаяСтрока(Параметры.СтрокаПоиска) Тогда 
		СтандартнаяОбработка = Ложь;
		СписокНайденныхЗначений = Новый СписокЗначений;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Контрагенты.Ссылка КАК Ссылка,
		               |	Контрагенты.Наименование КАК Наименование
		               |ПОМЕСТИТЬ втПартнеры
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	НЕ Контрагенты.ЭтоГруппа
		               |	И Контрагенты.Ссылка В ИЕРАРХИИ(&Комитенты)
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	Контрагенты.Ссылка,
		               |	Контрагенты.Наименование
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	НЕ Контрагенты.ЭтоГруппа
		               |	И Контрагенты.Родитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ ПЕРВЫЕ 10
		               |	втПартнеры.Ссылка КАК Ссылка
		               |ИЗ
		               |	втПартнеры КАК втПартнеры
		               |ГДЕ
		               |	втПартнеры.Наименование ПОДОБНО &Наименование";
		Запрос.УстановитьПараметр("Наименование", Параметры.СтрокаПоиска + "%");
		Запрос.УстановитьПараметр("Комитенты",Справочники.Контрагенты.НайтиПоКоду("000000004"));
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СписокНайденныхЗначений.Добавить(Выборка.Ссылка);
		КонецЦикла;	
		ДанныеВыбора = СписокНайденныхЗначений;
	КонецЕсли;	
КонецПроцедуры

