&НаКлиенте
Процедура ПробитьЧекиПоФЗ54(ТаблицаЧеков, Основание) Экспорт 
	Ответ = "";
	Отказ = Ложь;
	ТаблицаККМ = ТаблицаЧеков.Скопировать();
	ТаблицаККМ.Свернуть("ККМ, ККМИнтегрированаВСерверККМ, СерверККМ, СерверККТ, НомерУстройства", "Кол");
	Для Каждого ТекККМ Из ТаблицаККМ Цикл
		Если ТекККМ.ККМИнтегрированаВСерверККМ И Не ПараметрыСеанса.ЭтоТестоваяСреда Тогда
			Ответ = РаботаСКассовымСерверомСервер.ЗахватитьККМНаСервереККМ(ТекККМ.ККМ, ТекККМ.СерверККМ, Основание);
			Если Не Ответ.Результат Тогда
				Сообщить("ККМ " + Строка(ТекККМ.ККМ) + " не может быть захвачена для печати чеков! Описание проблемы: " + Ответ.Описание, СтатусСообщения.ОченьВажное);
				Возврат;
			КонецЕсли;	
		КонецЕсли;
		//ТекККМ.СерверККТ = ККМ_ФЗ_54.ИнициализироватьСерверККТ();
		//ККМ_ФЗ_54.ДобавитьУстройствоATOL(ТекККМ.СерверККТ, ТекККМ.ККМ);
	КонецЦикла;

	
	Для Каждого ТекЧек Из ТаблицаЧеков Цикл
		НайККМ = ТаблицаККМ.Найти(ТекЧек.ККМ);
		Чек = ТекЧек.Чек.ПолучитьОбъект();
		СерверККТ = ККМ_ФЗ_54СерверПереопределяемый.ПодключитьсяКККМ(ТекЧек.ККМ);
		Чек.ПровестиИРаспечататьЧек(Ответ, Отказ, Неопределено,, СерверККТ, 1);
		//Чек.ПровестиИРаспечататьЧек(Ответ, Отказ, Неопределено,, НайККМ.СерверККТ, 1);
		Если Отказ Тогда
			Сообщить("Чек № " + СокрЛП(Чек.Номер) + ", ошибка пробития: " + Ответ, СтатусСообщения.Важное);
		КонецеСли;	
	КонецЦикла;

	Для Каждого ТекККМ Из ТаблицаККМ Цикл
		Если ТекККМ.ККМИнтегрированаВСерверККМ И Не ПараметрыСеанса.ЭтоТестоваяСреда Тогда
			Ответ = РаботаСКассовымСерверомСервер.ОтпуститьККМНаСервереККМ(ТекККМ.ККМ, ТекККМ.СерверККМ, Основание);
			Если Не Ответ.Результат Тогда
				Сообщить("ККМ " + Строка(ТекККМ.ККМ) + " не может быть освобождена для печати чеков! Описание проблемы: " + Ответ.Описание, СтатусСообщения.ОченьВажное);
				Возврат;
			КонецЕсли;	
		КонецЕсли;	
		ТекККМ.СерверККТ = Неопределено;
	КонецЦикла;
КонецПроцедуры	

Функция ПолучитьТЗПоМассивуЧеков(МассивЧеков) Экспорт
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Чек");
	ТЗ.Колонки.Добавить("ККМ");
	ТЗ.Колонки.Добавить("ККМИнтегрированаВСерверККМ");
	ТЗ.Колонки.Добавить("СерверККМ");
	ТЗ.Колонки.Добавить("СерверККТ");
	ТЗ.Колонки.Добавить("НомерУстройства");
	ТЗ.Колонки.Добавить("Кол");
	
	Для Каждого Чек Из МассивЧеков Цикл
		Нов = ТЗ.Добавить();
		Нов.Чек = Чек;
		Нов.ККМ = Чек.КассаККМ;
		Нов.ККМИнтегрированаВСерверККМ = Чек.КассаККМ.ККМИнтегрированаВСерверККМ;
		Нов.СерверККМ = Чек.КассаККМ.Терминал.СерверККМ;
		Нов.СерверККТ = "";
		Нов.НомерУстройства = 1;
		Нов.Кол = 1;
	КонецЦикла;	
	
	Возврат ТЗ;
КонецФункции	