
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Движения.мгЗарплатаУдержания.Записывать = Истина;
	Движения.мгЗарплатаУдержания.Очистить();
	Для каждого ТекСтрокаМатериальныйУщерб Из МатериальныйУщерб Цикл
		Для НомерМесяца = 1 По ТекСтрокаМатериальныйУщерб.КоличествоМесяцев Цикл
			Движение = Движения.мгЗарплатаУдержания.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = ДобавитьМесяц(ПериодРегистрации, НомерМесяца-1);
			Движение.Организация = ТекСтрокаМатериальныйУщерб.Организация;
			Движение.Терминал = Терминал;
			Движение.ВидУдержания = Удержание;
			Движение.Сотрудник = ТекСтрокаМатериальныйУщерб.ФИОСотрудника;
			Движение.Тариф = ТекСтрокаМатериальныйУщерб.ЕжемесячнаяСумма;	
		КонецЦикла;
	КонецЦикла;
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
