
&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Объект.Контрагент.Пустая() Тогда
		Предупреждение("Поле ""Контрагент"" не заполнено!");
		Возврат;
	КонецеСли;	
	
	Если Не ЗначениеЗаполнено(Объект.НачалоПериода) Тогда
		Предупреждение("Поле ""Начало периода"" не заполнено!");
		Возврат;
	КонецеСли;	
	
	Если Не ЗначениеЗаполнено(Объект.КонецПериода) Тогда
		Предупреждение("Поле ""Конец периода"" не заполнено!");
		Возврат;
	КонецеСли;	
	
	//Если Не ЗначениеЗаполнено(Объект.СтатусЗаказов) Тогда
	//	Предупреждение("Поле ""Статус заказов"" не заполнено!");
	//	Возврат;
	//КонецеСли;	
	
	
	
	Если Объект.Заказы.Количество() <> 0 Тогда
		От = Вопрос("Табличная часть не пуста. При заполнении она будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
		Если От = КодВозвратаДиалога.Да Тогда
			Объект.Заказы.Очистить();
		Иначе
			Возврат;
		КонецеСли;	
	КонецеСли;	
	
	// Вставить содержимое обработчика.
	Если ЗначениеЗаполнено(Объект.СтатусЗаказов) Тогда
		Зап = Новый Запрос;
		Зап.Текст = "ВЫБРАТЬ
		            |	ЗакрытыеЗаказы.Реализация,
		            |	ЗакрытыеЗаказы.Период,
		            |	ЗакрытыеЗаказы.СуммаОценочная + ЗакрытыеЗаказы.СуммаДоставкиДоМКАД + ЗакрытыеЗаказы.СуммаДоставкиЗаМКАД КАК СуммаЗаказа,
		            |	ВЫБОР
		            |		КОГДА ЗакрытыеЗаказы.СтатусИнтернетМагазина.Ссылка = ЗНАЧЕНИЕ(Справочник.СтатусЗаказаИнтернетМагазина.ЗаказОтклонен)
		            |			ТОГДА ИСТИНА
		            |		ИНАЧЕ ВЫБОР
		            |				КОГДА ЗакрытыеЗаказы.ПричинаНевыполнения = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ОтказКлиентаСЗаездом)
		            |						ИЛИ ЗакрытыеЗаказы.ПричинаНевыполнения = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ПереносСЗаездом)
		            |					ТОГДА ИСТИНА
		            |				ИНАЧЕ ЛОЖЬ
		            |			КОНЕЦ
		            |	КОНЕЦ КАК Отклонен
		            |ИЗ
		            |	РегистрНакопления.ЗакрытыеЗаказы КАК ЗакрытыеЗаказы
		            |ГДЕ
		            |	ЗакрытыеЗаказы.Период МЕЖДУ &НачалоПериода И &КонецПериода
		            |	И ЗакрытыеЗаказы.ИнтернетМагазин = &ИнтернетМагазин
		            |	И ЗакрытыеЗаказы.СтатусИнтернетМагазина = &СтатусИнтернетМагазина
					//|	И ЗакрытыеЗаказы.ПричинаНевыполнения <> ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ОтказКлиентаСЗаездом)
					//|	И ЗакрытыеЗаказы.ПричинаНевыполнения <> ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ПереносСЗаездом)
		            |
		            |УПОРЯДОЧИТЬ ПО
		            |	ЗакрытыеЗаказы.Реализация.Номер";
		Зап.УстановитьПараметр("НачалоПериода", НачалоДня(Объект.НачалоПериода));  			
		Зап.УстановитьПараметр("КонецПериода", КонецДня(Объект.КонецПериода));
		Зап.УстановитьПараметр("ИнтернетМагазин", Объект.Контрагент);
		Зап.УстановитьПараметр("СтатусИнтернетМагазина", Объект.СтатусЗаказов);
	Иначе
		Зап = Новый Запрос;
		Зап.Текст = "ВЫБРАТЬ
		            |	ЗакрытыеЗаказы.Реализация,
		            |	ЗакрытыеЗаказы.Период,
		            |	ЗакрытыеЗаказы.СуммаОценочная + ЗакрытыеЗаказы.СуммаДоставкиДоМКАД + ЗакрытыеЗаказы.СуммаДоставкиЗаМКАД КАК СуммаЗаказа,
		            |	ВЫБОР
		            |		КОГДА ЗакрытыеЗаказы.СтатусИнтернетМагазина.Ссылка = ЗНАЧЕНИЕ(Справочник.СтатусЗаказаИнтернетМагазина.ЗаказОтклонен)
		            |			ТОГДА ИСТИНА
		            |		ИНАЧЕ ВЫБОР
		            |				КОГДА ЗакрытыеЗаказы.ПричинаНевыполнения = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ОтказКлиентаСЗаездом)
		            |						ИЛИ ЗакрытыеЗаказы.ПричинаНевыполнения = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ПереносСЗаездом)
		            |					ТОГДА ИСТИНА
		            |				ИНАЧЕ ЛОЖЬ
		            |			КОНЕЦ
		            |	КОНЕЦ КАК Отклонен
		            |ИЗ
		            |	РегистрНакопления.ЗакрытыеЗаказы КАК ЗакрытыеЗаказы
		            |ГДЕ
		            |	ЗакрытыеЗаказы.Период МЕЖДУ &НачалоПериода И &КонецПериода
		            |	И ЗакрытыеЗаказы.ИнтернетМагазин = &ИнтернетМагазин
					//|	И ЗакрытыеЗаказы.ПричинаНевыполнения <> ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ОтказКлиентаСЗаездом)
					//|	И ЗакрытыеЗаказы.ПричинаНевыполнения <> ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ПереносСЗаездом)
		            |
		            |УПОРЯДОЧИТЬ ПО
		            |	ЗакрытыеЗаказы.Реализация.Номер";
		Зап.УстановитьПараметр("НачалоПериода", НачалоДня(Объект.НачалоПериода));  			
		Зап.УстановитьПараметр("КонецПериода", КонецДня(Объект.КонецПериода));
		Зап.УстановитьПараметр("ИнтернетМагазин", Объект.Контрагент);
	КонецеСли;	
	Рез = Зап.Выполнить().Выгрузить();
	
	Для Каждого Тек Из Рез Цикл
		Нов = Объект.Заказы.Добавить();
		Нов.Заказ = Тек.Реализация;
		Нов.ДатаСтатуса = Тек.Период;
		Нов.Сумма = Тек.СуммаЗаказа;
		Нов.Отклонен = Тек.Отклонен;
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.СтатусЗаказов = Справочники.СтатусЗаказаИнтернетМагазина.ЗаказЗакрыт;
	Объект.НачалоПериода = НачалоМесяца(ТекущаяДата());
	Объект.КонецПериода = КонецМесяца(ТекущаяДата());
	ТолькоПросмотр = Объект.Проведен;
КонецПроцедуры


&НаСервере

Функция ПолучитьМакетНаСервере()  
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");  
	
	Макет = ДокОбъект.ПолучитьМакет("Макет");  
	
	Возврат Макет;
	
КонецФункции




&НаКлиенте
Процедура Печать(Команда)
	Таб = Новый ТабличныйДокумент;
	ПечатьНаСервере(Таб);
	Таб.Показать("Бланк списка заказов");
КонецПроцедуры

Процедура ПечатьНаСервере(Таб)
	
	Мак = ПолучитьМакетНаСервере();
	ОблШ = Мак.ПолучитьОбласть("Шапка");
	ОблСтр = Мак.ПолучитьОбласть("Строка");
	ОблП = Мак.ПолучитьОбласть("Подвал");
	
	ОблШ.Параметры.Контрагент = СокрЛП(Объект.Контрагент.НаименованиеПолное);
	ОблШ.Параметры.ДатаНомерДокумента = "№ " + Строка(Число(Объект.Номер)) + " от " + Формат(Объект.Дата, "ДЛФ=DD");
	
	Таб.Вывести(ОблШ);
	
	НПП = 1;
	Для Каждого Тек Из Объект.Заказы Цикл
		ОблСтр.Параметры.НПП = НПП;
		ОблСтр.Параметры.НомерЗаказа = СокрЛП(Тек.Заказ.Номер) + "/" + СокрЛП(Тек.Заказ.НомерВнешнегоЗаказа);
		ОблСтр.Параметры.ДатаЗаказа = Тек.Заказ.Дата;
		ОблСтр.Параметры.СуммаЗаказа = Тек.Сумма;
		ОблСтр.Параметры.Отклонён = Тек.Отклонен;
		НПП = НПП + 1;
		Таб.Вывести(ОблСтр);
	КонецЦикла;	
	
	ОблП.Параметры.ИтСум = Объект.Заказы.Итог("Сумма");
	Таб.Вывести(ОблП);
	Таб.ПолеСверху = 3;
	Таб.ПолеСнизу = 3;
	Таб.ПолеСлева = 3;
	Таб.ПолеСправа = 3;
	Таб.АвтоМасштаб = Истина;
	
КонецПроцедуры	


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	//Вставить содержимое обработчика
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	//Вставить содержимое обработчика
	ТолькоПросмотр = Объект.Проведен;
КонецПроцедуры

