#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда
		ЗаполнитьЗначенияСвойств(Объект, Параметры);
				
		ЗаполнитьДанныеВводНовогоДокумента();
		
		РассчитатьПодъемНаСервере();
		
		Объект.ВыбранныйТипОплаты = Объект.ТипОплаты;
		ПриСменеВыбранногоТипаОплатыНаСервере();
	КонецеСли;
	СтруктураДанныеЗаказа = ПроцедурыРаботыСЗаказамиВызовСервера.ПолучитьДанныеЗаказа(Объект.Заказ);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаКлиенте();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВыбранныйТипОплатыПриИзменении(Элемент)
	ПриСменеВыбранногоТипаОплатыНаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДанныеВводНовогоДокумента()
	ОбъектДок = РеквизитФормыВЗначение("Объект");
	ОбъектДок.ЗаполнитьТоварыПоЗаказу();
	ОбъектДок.ЗаполнитьДаннымиРейса();
	ЗначениеВРеквизитФормы(ОбъектДок, "Объект");
КонецПроцедуры


&НаСервере
Процедура ПриСменеВыбранногоТипаОплатыНаСервере()
	ОбъектДок = РеквизитФормыВЗначение("Объект");
	ОбъектДок.ПолучитьОрганизациюПоТипуОплаты();
	ЗначениеВРеквизитФормы(ОбъектДок, "Объект");
КонецПроцедуры	

&НаСервере
Процедура РассчитатьПодъемНаСервере()
	ОбъектДок = РеквизитФормыВЗначение("Объект");
	ОбъектДок.РассчитатьПодъемНаСервереСПроверкой();
	ЗначениеВРеквизитФормы(ОбъектДок, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДанныхПодъема()
	Если СтруктураДанныеЗаказа.ЗапрашиватьДанныеПодъема Тогда
		Если СтруктураДанныеЗаказа.МетодОплатыПодъема = ПредопределенноеЗначение("Перечисление.МетодыОплатыПодъемаЗаказа.ОплачиваетПартнер") 
		Или Объект.Реализация.МетодыОплатыПодъемаЗаказа.Пустая() 
		Или Объект.ВидПодъема = ПредопределенноеЗначение("Перечисление.ВидыПодъемовЗаказаНаЭтаж.БезПодъема") Тогда
			Если Объект.ВидПодъема = ПредопределенноеЗначение("Перечисление.ВидыПодъемовЗаказаНаЭтаж.БезПодъема") Тогда
				Элементы.ГруппаДанныеПодъема.Видимость = Ложь; 
			Иначе
				Элементы.ГруппаДанныеПодъема.Видимость = Истина; 
			КонецеСли;	
			Элементы.ДекорацияКлиентПодъемНеОплачивает.Видимость = Истина;
			//Элементы.ГруппаПодъемОплачиваетКлиент.Видимость = Ложь;
		Иначе		
			Элементы.ГруппаПодъем.Видимость = Истина;
			Элементы.ДекорацияКлиентПодъемНеОплачивает.Видимость = Ложь;
			//Элементы.ГруппаПодъемОплачиваетКлиент.Видимость = Истина;
		КонецеСли;	
	Иначе
		Элементы.ГруппаДанныеПодъема.Видимость = Ложь;
		Элементы.ДекорацияКлиентПодъемНеОплачивает.Видимость = Истина;
		//Элементы.ГруппаПодъемОплачиваетКлиент.Видимость = Ложь;
	КонецеСли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииНаКлиенте()
	Если Объект.ТипОплаты = ПредопределенноеЗначение("Справочник.ТипыОплат.Терминал") 
		Или Объект.ТипОплаты = ПредопределенноеЗначение("Справочник.ТипыОплат.Наличные") Тогда
		Элементы.ВыбранныйТипОплаты.Видимость = Истина;
	Иначе
		Элементы.ВыбранныйТипОплаты.Видимость = Ложь;
	КонецеСли;	
	
	Если СтруктураДанныеЗаказа.ЗапретСменыТипаОплаты Тогда
		Элементы.ДекорацияСменаТипаОплаты.Видимость = Истина;
	Иначе
		Элементы.ДекорацияСменаТипаОплаты.Видимость = Ложь;
	КонецеСли;	
	
	Если СтруктураДанныеЗаказа.ЗапретЧастичногоВыкупа Тогда
		Элементы.ДекорацияОсновная.Видимость = Ложь;
		Элементы.ДекорацияИтогоСКлиента.Видимость = Истина;
		Элементы.Товары.Доступность = Ложь;
	Иначе
		Элементы.ДекорацияОсновная.Видимость = Истина;
		Элементы.ДекорацияИтогоСКлиента.Видимость = Ложь;		
		Элементы.Товары.Доступность = Истина;
	КонецеСли;	
	Если СтруктураДанныеЗаказа.ПечататьЧек Тогда
		Элементы.АдресОтправкиЧекаEMAIL.Видимость = Истина;
	Иначе
		Элементы.АдресОтправкиЧекаEMAIL.Видимость = Ложь;
	КонецЕсли;	
	УстановитьВидимостьДанныхПодъема();
КонецПроцедуры	


//&НаСервере
//Процедура ПриОткрытииНаСервере()
//	Если Объект.Реализация.ЧастичныйВыкупЗапрещен Тогда
//		Элементы.ДекорацияОсновная.Видимость = Ложь;
//		Элементы.ДекорацияИтогоСКлиента.Видимость = Истина;
//		Элементы.ДоставленныеТовары.Доступность = Ложь;
//	Иначе
//		Элементы.ДекорацияОсновная.Видимость = Истина;
//		Элементы.ДекорацияИтогоСКлиента.Видимость = Ложь;		
//		Элементы.ДоставленныеТовары.Доступность = Истина;
//	КонецеСли;
//	
//	Если Объект.Реализация.СменаТипаОплатыЗапрещена Тогда
//		Элементы.ДекорацияСменаТипаОплаты.Видимость = Истина;
//	Иначе
//		Элементы.ДекорацияСменаТипаОплаты.Видимость = Ложь;
//	КонецеСли;
//	
//	
//	Если Объект.ТипОплаты = Справочники.ТипыОплат.Терминал Или Объект.ТипОплаты = Справочники.ТипыОплат.Наличные Тогда
//		Элементы.ТипОплаты.Видимость = Истина;
//	Иначе
//		Элементы.ТипОплаты.Видимость = Ложь;
//	КонецеСли;
//	
//	Если Объект.Реализация.ПечататьЧек Тогда
//		Элементы.АдресОтправкиЧека.Видимость = Истина;
//	Иначе
//		Элементы.АдресОтправкиЧека.Видимость = Ложь;
//	КонецЕсли;	
	
	
//	УстановитьВидимостьДанныхПодъема();
	
//	Элементы.СуммаНал.Заголовок = Объект.ТипОплаты.Наименование;
//	Элементы.кнОплатитьСтоимостьДоставки.Видимость = Объект.Реализация.ТребуетсяОплатаСтоимостиДоставкиПриОтменеЗаказа;	
//	
//	Если Объект.СуммаПредоплаты <> 0 Тогда
//		Элементы.ГруппаПредоплата.Видимость = Истина;
//	Иначе
//		Элементы.ГруппаПредоплата.Видимость = Ложь;
//	КонецеСли;
//	
//	Если Объект.Реализация.Рейс.ВыданТерминалAssist Тогда
//		Объект.ОплатаЧерезAssist = Истина;		
//	КонецеСли;

	
//КонецПроцедуры
#КонецОбласти