
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ДатаРейса = ТекущаяДата();
		Объект.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецеСли;	
	
	Если Параметры.СписокВозвратов.Количество() <> 0 Тогда
		СписокВозвратов = Параметры.СписокВозвратов;
		МассивВозвратов = СписокВозвратов.ВыгрузитьЗначения();
		Зап = Новый Запрос;
		Зап.Текст = "ВЫБРАТЬ
		            |	ВозвратТоваровПоставщику.Ссылка КАК Документ,
		            |	ПараметрыИнтеграцииВозвратКомитентуСрезПоследних.дмНомерЕдиницыОбработки КАК дмНомерЕдиницыОбработки,
		            |	ВозвратТоваровПоставщику.Контрагент КАК Контрагент
		            |ИЗ
		            |	Документ.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику
		            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыИнтеграцииВозвратКомитенту.СрезПоследних КАК ПараметрыИнтеграцииВозвратКомитентуСрезПоследних
		            |		ПО (ВозвратТоваровПоставщику.Ссылка = (ВЫРАЗИТЬ(ПараметрыИнтеграцииВозвратКомитентуСрезПоследних.Документ КАК Документ.ВозвратТоваровПоставщику)))
		            |			И (ПараметрыИнтеграцииВозвратКомитентуСрезПоследних.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОперацийИнтеграцияДМПоВозвратам.ПроверкаСтатусаВозврата))
		            |ГДЕ
		            |	ВозвратТоваровПоставщику.Ссылка В(&МассивВозвратов)";
		Зап.УстановитьПараметр("МассивВозвратов", МассивВозвратов);
		
		Таб = Зап.Выполнить().Выгрузить();
		
		Объект.Документы.Загрузить(Таб);
		Объект.Контрагент = Таб[0].Контрагент;
		Объект.КоличествоЕО = Таб.Количество();
	КонецЕсли;
	
	
	ТолькоПросмотр = Объект.Проведен;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Если СписокВозвратов.Количество() <> 0 И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ТекущийОбъект.ВыгрузитьТранспортировкуВДМ();
		МасДокументов = ТекущийОбъект.Документы.ВыгрузитьКолонку("Документ");
		РаботаСВозвратамиСервер.УстановитьСтатусОтправки(МасДокументов, Справочники.СтатусыСкладскогоУчета.ВозвратОтправлен);
	КонецеСли;	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// Вставить содержимое обработчика.
	Если ВладелецФормы <> Неопределено Тогда
		ВладелецФормы.Элементы.Список.Обновить();
	КонецЕсли;	
КонецПроцедуры
