
&НаКлиенте
Процедура ВнешнийНомерЗаказаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Если ЗначениеЗаполнено(ВнешнийНомерЗаказа) Тогда
		Зап = Новый Запрос;
		Зап.Текст = "ВЫБРАТЬ
		            |	Накладная003Заказы.Ссылка.Номер КАК Номер
		            |ИЗ
		            |	Документ.Накладная003.Заказы КАК Накладная003Заказы
		            |ГДЕ
		            |	Накладная003Заказы.Заказ.НомерВнешнегоЗаказа = &НомерВнешнегоЗаказа
		            |
		            |СГРУППИРОВАТЬ ПО
		            |	Накладная003Заказы.Ссылка.Ссылка,
		            |	Накладная003Заказы.Ссылка.Номер";
		Зап.УстановитьПараметр("НомерВнешнегоЗаказа", ВнешнийНомерЗаказа);
		
		Рез = Зап.Выполнить().Выбрать();;
		Мас = Новый Массив;
		Если Рез.Количество() = 0 Тогда
			ОчиститьПоиск(Неопределено);
		Иначе
			Пока Рез.Следующий() Цикл
				Мас.Добавить(Рез.Номер);
			КонецЦикла;	
			Список.Отбор.элементы[0].ПравоеЗначение = Мас;
			Список.Отбор.элементы[0].Использование = Истина;
		КонецеСли;	
	Иначе
		ОчиститьПоиск(Неопределено);
	КонецеСли;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПоиск(Команда)
	// Вставить содержимое обработчика.
	Список.Отбор.элементы[0].Использование = Ложь;
	ВнешнийНомерЗаказа = "";
	НомерЗаказа = "";
КонецПроцедуры


&НаКлиенте
Процедура НомерЗаказаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Если ЗначениеЗаполнено(НомерЗаказа) Тогда
		Зап = Новый Запрос;
		Зап.Текст = "ВЫБРАТЬ
		            |	Накладная003Заказы.Ссылка.Номер КАК Номер
		            |ИЗ
		            |	Документ.Накладная003.Заказы КАК Накладная003Заказы
		            |ГДЕ
		            |	Накладная003Заказы.Заказ.Номер = &НомерЗаказа
		            |
		            |СГРУППИРОВАТЬ ПО
		            |	Накладная003Заказы.Ссылка.Ссылка,
		            |	Накладная003Заказы.Ссылка.Номер";
		Зап.УстановитьПараметр("НомерЗаказа", Формат(НомерЗаказа, "ЧГ="));
		
		Рез = Зап.Выполнить().Выбрать();;
		Мас = Новый Массив;
		Если Рез.Количество() = 0 Тогда
			ОчиститьПоиск(Неопределено);
		Иначе
			Пока Рез.Следующий() Цикл
				Мас.Добавить(Рез.Номер);
			КонецЦикла;	
			Список.Отбор.элементы[0].ПравоеЗначение = Мас;
			Список.Отбор.элементы[0].Использование = Истина;
		КонецеСли;	
	Иначе
		ОчиститьПоиск(Неопределено);
	КонецеСли;
КонецПроцедуры

