
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
	ПараметрТолькоЗоныСоСложнойПарковкй = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ТолькоЗоныСоСложнойПарковкй"));
	ТолькоЗоныСоСложнойПарковкй = ПараметрТолькоЗоныСоСложнойПарковкй.Значение;

	Если ТолькоЗоныСоСложнойПарковкй Тогда
		
		ПараметрСписокПолигонов = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СписокПолигонов"));
		ПараметрСписокПолигонов.Использование = Истина;
		ПараметрСписокПолигонов.Значение = РегистрыСведений.ДополнительныеПараметрыПолигоновМаршрутизации.СписокПолигоновСоСложнойПарковкой();
		
	КонецЕсли;	
	
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиОтчета); 
	
КонецПроцедуры
