
&НаКлиенте
Процедура Заполнить(Команда)
	Если Объект.Данные.Количество() <> 0 тогда
		От = Вопрос("Табличная часть не пуста. При заполнении она будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
		Если От = КодВозвратаДиалога.Да Тогда
			Объект.Данные.Очистить();
		Иначе
			Возврат;
		КонецеСли;	
	КонецЕсли;
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РаботникиОрганизации.Сотрудник КАК Сотрудник,
	|	МАКСИМУМ(РаботникиОрганизации.Период) КАК Период
	|ПОМЕСТИТЬ вр_РаботникиОрганизации
	|ИЗ
	|	РегистрСведений.РаботникиОрганизации КАК РаботникиОрганизации
	|
	|СГРУППИРОВАТЬ ПО
	|	РаботникиОрганизации.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_РаботникиОрганизации.Сотрудник КАК Сотрудник,
	|	вр_РаботникиОрганизации.Период КАК Период,
	|	РаботникиОрганизации.Организация КАК Организация,
	|	РаботникиОрганизации.Состояние КАК Состояние,
	|	РаботникиОрганизации.Должность КАК Должность
	|ПОМЕСТИТЬ втРаботники
	|ИЗ
	|	вр_РаботникиОрганизации КАК вр_РаботникиОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизации КАК РаботникиОрганизации
	|		ПО вр_РаботникиОрганизации.Сотрудник = РаботникиОрганизации.Сотрудник
	|			И вр_РаботникиОрганизации.Период = РаботникиОрганизации.Период
	|ГДЕ
	|	НЕ РаботникиОрганизации.Регистратор ССЫЛКА Документ.УвольнениеСРаботыИзОрганизация
	|	И НЕ РаботникиОрганизации.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиОрганизаций.ВодительЗаборщик)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗакрытиеЗаказовЗаказы.Ссылка КАК Ссылка,
	|	ЗакрытиеЗаказовЗаказы.НомерСтроки КАК НомерСтроки,
	|	ЗакрытиеЗаказовЗаказы.Реализация КАК Заказ,
	|	ЗакрытиеЗаказовЗаказы.ТипЗаказа КАК ТипЗаказа,
	|	ЗакрытиеЗаказовЗаказы.Водитель КАК Сотрудник,
	|	ЗакрытиеЗаказовЗаказы.РезультатДоставки КАК РезультатДоставки,
	|	ВЫБОР
	|		КОГДА ЗакрытиеЗаказовЗаказы.ПричинаНевыполнения = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ОтказКлиентаСЗаездом)
	|			ТОГДА ЗакрытиеЗаказовЗаказы.ДанныеМПВодителя.ПричинаНеВыполненияДоставки
	|		ИНАЧЕ ЗакрытиеЗаказовЗаказы.ПричинаНевыполнения
	|	КОНЕЦ КАК ПричинаНевыполнения,
	|	НАЧАЛОПЕРИОДА(ЗакрытиеЗаказовЗаказы.Реализация.Дата, ДЕНЬ) КАК ОтработанныйДень,
	|	ВЫБОР
	|		КОГДА ЗакрытиеЗаказовЗаказы.ПричинаНевыполнения = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ОтказКлиентаСЗаездом)
	|			ТОГДА ВЫБОР
	|					КОГДА ЗакрытиеЗаказовЗаказы.ДанныеМПВодителя.ПричинаНеВыполненияДоставки = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ОтказКлиентаБезЗаезда)
	|						ТОГДА 0
	|					ИНАЧЕ 1
	|				КОНЕЦ
	|		КОГДА (ЗакрытиеЗаказовЗаказы.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.Выполнена)
	|				ИЛИ ЗакрытиеЗаказовЗаказы.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.ПустаяСсылка)
	|				ИЛИ ЗакрытиеЗаказовЗаказы.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.ВыполненаЧастично))
	|				И ЗакрытиеЗаказовЗаказы.Закрыть
	|			ТОГДА 1
	|		КОГДА ЗакрытиеЗаказовЗаказы.ПричинаНевыполнения = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ПереносСЗаездом)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВыполненныйЗаказ
	|ПОМЕСТИТЬ втЗаказыВыполненные
	|ИЗ
	|	Документ.ЗакрытиеЗаказов.Заказы КАК ЗакрытиеЗаказовЗаказы
	|ГДЕ
	|	ЗакрытиеЗаказовЗаказы.Ссылка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (ЗакрытиеЗаказовЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
	|			ИЛИ ЗакрытиеЗаказовЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор)
	|			ИЛИ ЗакрытиеЗаказовЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Фрахт))
	|	И ЗакрытиеЗаказовЗаказы.Водитель <> ЗНАЧЕНИЕ(Справочник.новаВодители.ПустаяСсылка)
	|	И ЗакрытиеЗаказовЗаказы.Ссылка.ТерминалДоставки = &ТерминалДоставки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗакрытиеЗаказовЗаказы.Ссылка,
	|	ЗакрытиеЗаказовЗаказы.НомерСтроки,
	|	ЗакрытиеЗаказовЗаказы.Реализация,
	|	ЗакрытиеЗаказовЗаказы.ТипЗаказа,
	|	ЗакрытиеЗаказовЗаказы.Экспедитор,
	|	ЗакрытиеЗаказовЗаказы.РезультатДоставки,
	|	ВЫБОР
	|		КОГДА ЗакрытиеЗаказовЗаказы.ПричинаНевыполнения = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ОтказКлиентаСЗаездом)
	|			ТОГДА ЗакрытиеЗаказовЗаказы.ДанныеМПВодителя.ПричинаНеВыполненияДоставки
	|		ИНАЧЕ ЗакрытиеЗаказовЗаказы.ПричинаНевыполнения
	|	КОНЕЦ,
	|	НАЧАЛОПЕРИОДА(ЗакрытиеЗаказовЗаказы.Реализация.Дата, ДЕНЬ),
	|	ВЫБОР
	|		КОГДА ЗакрытиеЗаказовЗаказы.ПричинаНевыполнения = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ОтказКлиентаСЗаездом)
	|			ТОГДА ВЫБОР
	|					КОГДА ЗакрытиеЗаказовЗаказы.ДанныеМПВодителя.ПричинаНеВыполненияДоставки = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ОтказКлиентаБезЗаезда)
	|						ТОГДА 0
	|					ИНАЧЕ 1
	|				КОНЕЦ
	|		КОГДА (ЗакрытиеЗаказовЗаказы.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.Выполнена)
	|				ИЛИ ЗакрытиеЗаказовЗаказы.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.ПустаяСсылка)
	|				ИЛИ ЗакрытиеЗаказовЗаказы.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.ВыполненаЧастично))
	|				И ЗакрытиеЗаказовЗаказы.Закрыть
	|			ТОГДА 1
	|		КОГДА ЗакрытиеЗаказовЗаказы.ПричинаНевыполнения = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ПереносСЗаездом)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	Документ.ЗакрытиеЗаказов.Заказы КАК ЗакрытиеЗаказовЗаказы
	|ГДЕ
	|	ЗакрытиеЗаказовЗаказы.Ссылка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (ЗакрытиеЗаказовЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
	|			ИЛИ ЗакрытиеЗаказовЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор)
	|			ИЛИ ЗакрытиеЗаказовЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Фрахт))
	|	И ЗакрытиеЗаказовЗаказы.Экспедитор <> ЗНАЧЕНИЕ(Справочник.новаЭкспедиторы.ПустаяСсылка)
	|	И ЗакрытиеЗаказовЗаказы.Ссылка.ТерминалДоставки = &ТерминалДоставки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗакрытиеЗаказовЗаказы.Ссылка КАК Ссылка,
	|	ЗакрытиеЗаказовЗаказы.НомерСтроки КАК НомерСтроки,
	|	ЗакрытиеЗаказовЗаказы.Реализация КАК Заказ,
	|	ЗакрытиеЗаказовЗаказы.ТипЗаказа КАК ТипЗаказа,
	|	ЗакрытиеЗаказовЗаказы.Водитель КАК Сотрудник,
	|	ЗакрытиеЗаказовЗаказы.РезультатДоставки КАК РезультатДоставки,
	|	ВЫБОР
	|		КОГДА ЗакрытиеЗаказовЗаказы.ПричинаНевыполнения = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ОтказКлиентаСЗаездом)
	|			ТОГДА ЗакрытиеЗаказовЗаказы.ДанныеМПВодителя.ПричинаНеВыполненияДоставки
	|		ИНАЧЕ ЗакрытиеЗаказовЗаказы.ПричинаНевыполнения
	|	КОНЕЦ КАК ПричинаНевыполнения,
	|	1 КАК ЗаказНомер
	|ПОМЕСТИТЬ втЗаказыВсе
	|ИЗ
	|	Документ.ЗакрытиеЗаказов.Заказы КАК ЗакрытиеЗаказовЗаказы
	|ГДЕ
	|	ЗакрытиеЗаказовЗаказы.Ссылка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (ЗакрытиеЗаказовЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
	|			ИЛИ ЗакрытиеЗаказовЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор)
	|			ИЛИ ЗакрытиеЗаказовЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Фрахт))
	|	И ЗакрытиеЗаказовЗаказы.Водитель <> ЗНАЧЕНИЕ(Справочник.новаВодители.ПустаяСсылка)
	|	И ЗакрытиеЗаказовЗаказы.Ссылка.ТерминалДоставки = &ТерминалДоставки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗакрытиеЗаказовЗаказы.Ссылка,
	|	ЗакрытиеЗаказовЗаказы.НомерСтроки,
	|	ЗакрытиеЗаказовЗаказы.Реализация,
	|	ЗакрытиеЗаказовЗаказы.ТипЗаказа,
	|	ЗакрытиеЗаказовЗаказы.Экспедитор,
	|	ЗакрытиеЗаказовЗаказы.РезультатДоставки,
	|	ВЫБОР
	|		КОГДА ЗакрытиеЗаказовЗаказы.ПричинаНевыполнения = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ОтказКлиентаСЗаездом)
	|			ТОГДА ЗакрытиеЗаказовЗаказы.ДанныеМПВодителя.ПричинаНеВыполненияДоставки
	|		ИНАЧЕ ЗакрытиеЗаказовЗаказы.ПричинаНевыполнения
	|	КОНЕЦ,
	|	1
	|ИЗ
	|	Документ.ЗакрытиеЗаказов.Заказы КАК ЗакрытиеЗаказовЗаказы
	|ГДЕ
	|	ЗакрытиеЗаказовЗаказы.Ссылка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (ЗакрытиеЗаказовЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
	|			ИЛИ ЗакрытиеЗаказовЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор)
	|			ИЛИ ЗакрытиеЗаказовЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Фрахт))
	|	И ЗакрытиеЗаказовЗаказы.Экспедитор <> ЗНАЧЕНИЕ(Справочник.новаЭкспедиторы.ПустаяСсылка)
	|	И ЗакрытиеЗаказовЗаказы.Ссылка.ТерминалДоставки = &ТерминалДоставки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втЗаказыВыполненные.Сотрудник КАК Сотрудник,
	|	СУММА(втЗаказыВыполненные.ВыполненныйЗаказ) КАК ВыполненныеЗаказы
	|ПОМЕСТИТЬ втИтогВыполненные
	|ИЗ
	|	втЗаказыВыполненные КАК втЗаказыВыполненные
	|
	|СГРУППИРОВАТЬ ПО
	|	втЗаказыВыполненные.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втЗаказыВсе.Сотрудник КАК Сотрудник,
	|	СУММА(втЗаказыВсе.ЗаказНомер) КАК ВсегоЗаказов
	|ПОМЕСТИТЬ втИтогВсе
	|ИЗ
	|	втЗаказыВсе КАК втЗаказыВсе
	|
	|СГРУППИРОВАТЬ ПО
	|	втЗаказыВсе.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втЗаказыВыполненные.Сотрудник КАК Сотрудник,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ втЗаказыВыполненные.ОтработанныйДень) КАК ОтработанныйДень
	|ПОМЕСТИТЬ втОтработанноДней
	|ИЗ
	|	втЗаказыВыполненные КАК втЗаказыВыполненные
	|
	|СГРУППИРОВАТЬ ПО
	|	втЗаказыВыполненные.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	мгЗарплатаУдержанияОстатки.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ втДисцШтрафы
	|ИЗ
	|	РегистрНакопления.мгЗарплатаУдержания.Остатки(&КонецПериода, ВидУдержания = ЗНАЧЕНИЕ(Справочник.мгНачисленияУдержания.ДисциплинарныеВзыскания)) КАК мгЗарплатаУдержанияОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втИтогВсе.Сотрудник КАК Сотрудник,
	|	втИтогВсе.ВсегоЗаказов КАК ВсегоЗаказов,
	|	втИтогВыполненные.ВыполненныеЗаказы КАК ВыполненныеЗаказы,
	|	втИтогВыполненные.ВыполненныеЗаказы / втИтогВсе.ВсегоЗаказов КАК ПроцентВыполнения,
	|	втОтработанноДней.ОтработанныйДень КАК ОтработанныйДень,
	|	ВЫБОР
	|		КОГДА втДисцШтрафы.Сотрудник ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Штраф,
	|	ВЫБОР
	|		КОГДА втОтработанноДней.ОтработанныйДень >= 20
	|				И втИтогВыполненные.ВыполненныеЗаказы / втИтогВсе.ВсегоЗаказов >= 0.92
	|				И ВЫБОР
	|					КОГДА втДисцШтрафы.Сотрудник ЕСТЬ NULL
	|						ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ <> ИСТИНА
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Премия
	|ПОМЕСТИТЬ втИтог
	|ИЗ
	|	втИтогВыполненные КАК втИтогВыполненные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втИтогВсе КАК втИтогВсе
	|			ЛЕВОЕ СОЕДИНЕНИЕ втДисцШтрафы КАК втДисцШтрафы
	|			ПО втИтогВсе.Сотрудник = втДисцШтрафы.Сотрудник
	|		ПО втИтогВыполненные.Сотрудник = втИтогВсе.Сотрудник
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втОтработанноДней КАК втОтработанноДней
	|		ПО втИтогВыполненные.Сотрудник = втОтработанноДней.Сотрудник
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРаботники.Сотрудник КАК Сотрудник,
	|	втРаботники.Должность КАК Должность,
	|	втРаботники.Организация КАК Организация,
	|	ЕСТЬNULL(втИтог.Премия, ЛОЖЬ) КАК Премия,
	|	&Тариф КАК Сумма
	|ИЗ
	|	втРаботники КАК втРаботники
	|		ЛЕВОЕ СОЕДИНЕНИЕ втИтог КАК втИтог
	|		ПО (втИтог.Сотрудник = втРаботники.Сотрудник)
	|ГДЕ
	|	втИтог.Премия
	|	И НЕ ЕСТЬNULL(втРаботники.Сотрудник.ПешийКурьер, ЛОЖЬ)";
	
	Запрос.УстановитьПараметр("НачалоПериода", Объект.ПериодРегистрации);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.ПериодРегистрации));
	Запрос.УстановитьПараметр("ТерминалДоставки", Объект.Терминал);
	//Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Тариф", Объект.Тариф);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Премия Тогда
			НоваяСтрока = Объект.Данные.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЕсли;
	КонецЦикла;
	           
КонецПроцедуры

&НаКлиенте
Процедура МесяцСтрокаПриИзменении(Элемент)
	
	РаботаСДиалогами.ДатаКакМесяцПодобратьДатуПоТексту(МесяцСтрока, Объект.ПериодРегистрации);
	МесяцСтрока = РаботаСДиалогами.ДатаКакМесяцПредставление(Объект.ПериодРегистрации);
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцСтрокаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	Объект.ПериодРегистрации = ДобавитьМесяц(Объект.ПериодРегистрации, Направление);
	МесяцСтрока = РаботаСДиалогами.ДатаКакМесяцПредставление(Объект.ПериодРегистрации);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ПериодРегистрации = НачалоМесяца(Объект.Дата);
		Объект.Тариф = мгДоработки.ПолучитьТекущийТариф(Объект.Дата, ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.Премия"));
	КонецЕсли;
	
	// Заполним реквизит формы МесяцСтрока.
	МесяцСтрока = РаботаСДиалогами.ДатаКакМесяцПредставление(Объект.ПериодРегистрации);
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеСотрудникПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Данные.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.Сотрудник) Тогда
		ДанныеСотрудника = мгДоработки.ПолучитьОрганизациюСотрудника(ТекущиеДанные.Сотрудник);
		Если ДанныеСотрудника.Количество() = 0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Сотрудник не принят ни в одну организацию";
			Сообщение.Сообщить();
		ИначеЕсли ДанныеСотрудника.Количество() > 1 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Сотрудник принят в несколько организаций, необходимо выбрать организацию сотрудника";
			Сообщение.Сообщить();
		Иначе
			ТекущиеДанные.Организация = ДанныеСотрудника[0].Организация;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПриИзменении(Элемент)
	Объект.Данные.Сортировать("Сотрудник");
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.Ответственный = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойОтветственный");
КонецПроцедуры
