
&НаСервере
Процедура СхемаКомпоновкиПриИзмененииНаСервере(ИмяСхемыКомпоновки)
	
	ОбъектОтчета = РеквизитФормыВЗначение("Отчет");
	
	СхемаКомпоновки  = ОбъектОтчета.ПолучитьМакет(ИмяСхемыКомпоновки);//Отчеты.ОтчетАгентаЯндекс.ПолучитьМакет(ИмяСхемыКомпоновки);
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	
	ОтчетОбъект.СхемаКомпоновкиДанных = СхемаКомпоновки;
	
	ЗначениеВРеквизитФормы(ОтчетОбъект,"Отчет");
	
	Отчет.КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновки )); 
    Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновки.НастройкиПоУмолчанию);
	
	МассивКлиентов = Новый массив;
	МассивКлиентов.Добавить(Справочники.Контрагенты.НайтиПоКоду("Shop_601"));//ЯНДЕКС.Доставка
	МассивКлиентов.Добавить(Справочники.Контрагенты.НайтиПоКоду("Shop_752"));//Беру!	

	ПараметрДанныхИнтернетМагазин = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ИнтернетМагазин");
	ПараметрИнтернетМагазин = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрДанныхИнтернетМагазин.ИдентификаторПользовательскойНастройки);
	ПараметрИнтернетМагазин.Использование = Истина;
	ПараметрИнтернетМагазин.Значение.ЗагрузитьЗначения(МассивКлиентов);
		
	ПараметрДанныхГоловнойКонтрагент = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ГоловнойКонтрагент");
	ПараметрДанныхГоловнойКонтрагент = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрДанныхГоловнойКонтрагент.ИдентификаторПользовательскойНастройки);
	ПараметрДанныхГоловнойКонтрагент.Использование = Истина;
	ПараметрДанныхГоловнойКонтрагент.Значение = Справочники.Контрагенты.НайтиПоКоду("Shop_601");
	
	ПараметрДанныхПериодОтчета = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ПериодОтчета");
	ПараметрПериод = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрДанныхПериодОтчета.ИдентификаторПользовательскойНастройки); 	
	ПараметрПериод.Использование = Истина;
	ПараметрПериод.Значение  = Новый СтандартныйПериод(НачалоМесяца(НачалоМесяца(текущаяДата())-1), КонецМесяца(НачалоМесяца(текущаяДата())-1));
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИмяСхемыКомпоновки = СтрЗаменить(Элементы.ГруппаТиповОтчета.ТекущаяСтраница.Имя,"Результат","Отчет");
	СхемаКомпоновкиПриИзмененииНаСервере(ИмяСхемыКомпоновки);

КонецПроцедуры

&НаКлиенте
Процедура ГруппаТиповОтчетаПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ИмяСхемыКомпоновки = СтрЗаменить(ТекущаяСтраница.Имя,"Результат","Отчет");
	СхемаКомпоновкиПриИзмененииНаСервере(ИмяСхемыКомпоновки);

КонецПроцедуры


&НаСервере
Процедура СформироватьОтчетНаСервере()
	
	СоответствиеЗакреплений = Новый Соответствие;
	СоответствиеЗакреплений.Вставить("РезультатПоДоставке", 5);
	СоответствиеЗакреплений.Вставить("РезультатПоПеречислению", 6);
	СоответствиеЗакреплений.Вставить("РезультатОбИсполненииПоручений", 6);
	
	СкомпоноватьРезультат();
	ЭтотОбъект[Элементы.ГруппаТиповОтчета.ТекущаяСтраница.Имя].Очистить();
	ЭтотОбъект[Элементы.ГруппаТиповОтчета.ТекущаяСтраница.Имя].Вывести(Результат);
	Результат = Новый ТабличныйДокумент;//.Очистить();
		
	ЭтотОбъект[Элементы.ГруппаТиповОтчета.ТекущаяСтраница.Имя].Автомасштаб = Истина;
	ЭтотОбъект[Элементы.ГруппаТиповОтчета.ТекущаяСтраница.Имя].ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ЭтотОбъект[Элементы.ГруппаТиповОтчета.ТекущаяСтраница.Имя].ФиксацияСверху = СоответствиеЗакреплений[Элементы.ГруппаТиповОтчета.ТекущаяСтраница.Имя];

КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	СформироватьОтчетНаСервере();
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	РезультатПоДоставке = Новый ТабличныйДокумент;//.Очистить();
	РезультатПоПеречислению = Новый ТабличныйДокумент;//.Очистить();

КонецПроцедуры


