
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	//Асеев 06.02.2023 (Задача № 4977)>>>
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		//ОповеститьОбИзменении(Объект.Ссылка);
		Оповестить("Запись_ЛьготныеКатегорииЭквайринга");
	#КонецЕсли
	//Асеев 06.02.2023 (Задача № 4977)<<<
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Асеев 06.02.2023 (Задача № 4977)>>>
	Элементы.Владелец.ТолькоПросмотр = Не Объект.Владелец.Пустая();
	//Асеев 06.02.2023 (Задача № 4977)<<<
	
КонецПроцедуры
