 Перем СЗДругиеПоддерживаемыеКонфигурации Экспорт;
 Перем мНазваниеКонфигурации Экспорт; 
 Перем мТекстЗапроса Экспорт;
 Перем мСписокПараметров Экспорт;
 Перем мРежимВыгрузки Экспорт;
 Перем мЗагрузкаСТСД Экспорт;
 
Функция ПоддержкаМодификацийРозницы(мНазваниеКонфигурации) Экспорт

	Возврат  СЗДругиеПоддерживаемыеКонфигурации.НайтиПоЗначению(мНазваниеКонфигурации) <> неопределено;
	
КонецФункции

Функция ПолучитьВерсиюКонфигурации() Экспорт
 	
	ВерсияВМассив =  РазложитьСтрокуВМассивПодстрок_(метаданные.Версия, ".");
	a0 = ВерсияВМассив.Получить(0);
	a1 = ВерсияВМассив.Получить(1);
	a2 = ВерсияВМассив.Получить(2);
	a3 = ВерсияВМассив.Получить(3);
	Версия =  ?(СтрДлина(a0)=1,"0"+a0,a0)+?(СтрДлина(a1)=1,"0"+a1,a1)+?(СтрДлина(a2)=1,"0"+a2,a2)+?(СтрДлина(a3)=1,"0"+a3,a3);
	
	//Возврат Число(СтрЗаменить(Версия,".",""));
    Возврат 10030608;
КонецФункции

Функция РазложитьСтрокуВМассивПодстрок_(Знач Стр, Разделитель = ",") Экспорт
	
	МассивСтрок = Новый Массив();
	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока 1 = 1 Цикл
			Поз = Найти(Стр, Разделитель);
			Если Поз = 0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр, Поз - 1));
			Стр = СокрЛ(Сред(Стр, Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока 1 = 1 Цикл
			Поз = Найти(Стр, Разделитель);
			Если Поз = 0 Тогда
				Если (СокрЛП(Стр) <> "") Тогда
					МассивСтрок.Добавить(Стр);
				КонецЕсли;
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз - 1));
			Стр = Сред(Стр, Поз + ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
	
КонецФункции 
  
СЗДругиеПоддерживаемыеКонфигурации = Новый СписокЗначений;
СЗДругиеПоддерживаемыеКонфигурации.Добавить("салонкрасоты");
СЗДругиеПоддерживаемыеКонфигурации.Добавить("книжныймагазин");

мНазваниеСохраненнойНастройкиЗаполненияДокументов  = "КлеверенсНЗД"; // в некоторых конфигурациях ограничена длина названия.
мНазваниеКонфигурации   = Нрег(Метаданные.Имя);
мРежимВыгрузки = Ложь;

