
&НаКлиенте
Процедура ОК(Команда)
	Если ЗначениеЗаполнено(ДатаРейса) Тогда
		ДатаОтсчета = ДатаРейса;
	Иначе
		ДатаОтсчета = ТекущаяДата();
	КонецЕсли;	
	
	СтрокаДоступныхДнейДоставки = "";
	Если НачалоДня(Дата) < НачалоДня(ДатаОтсчета + 86400) Тогда
		Сообщить("Выбрана неверная дата!");
		Возврат;
	ИначеЕсли НачалоДня(Дата) > НачалоДня(ДатаОтсчета + 86400*15) Тогда	
		От = Вопрос("Дата переноса больше чем 2 недели. Вы уверены?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
		Если От = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецеСли;	
	ИначеЕсли Не ПроверкаНаКалендарьДоставки(СтрокаДоступныхДнейДоставки) Тогда
		От = Вопрос("Дата переноса не соответствует доступным дням доставки по календарю доставки (" + СтрокаДоступныхДнейДоставки + "). Вы уверены, что хотите выбрать указанную дату доставки?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
		Если От = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецеСли;	
	КонецеСли;	
	Ок = Истина;
	Закрыть();
КонецПроцедуры


Функция ПроверкаНаКалендарьДоставки(СтрокаДнейДоставки)
	Если Не КалендарьДоставки.Пустая() Тогда
		СтрокаДнейДоставки = "";
		Для Каждого Тек Из КалендарьДоставки.ДниДоставки Цикл
			Если Тек.ДеньНедели = 1 Тогда
				СтрокаДнейДоставки = СтрокаДнейДоставки + "пн ";
			ИначеЕсли Тек.ДеньНедели = 2 Тогда
				СтрокаДнейДоставки = СтрокаДнейДоставки + "вт ";
			ИначеЕсли Тек.ДеньНедели = 3 Тогда
				СтрокаДнейДоставки = СтрокаДнейДоставки + "ср ";
			ИначеЕсли Тек.ДеньНедели = 4 Тогда
				СтрокаДнейДоставки = СтрокаДнейДоставки + "чт ";
			ИначеЕсли Тек.ДеньНедели = 5 Тогда
				СтрокаДнейДоставки = СтрокаДнейДоставки + "пт ";
			ИначеЕсли Тек.ДеньНедели = 6 Тогда
				СтрокаДнейДоставки = СтрокаДнейДоставки + "сб ";
			ИначеЕсли Тек.ДеньНедели = 7 Тогда
				СтрокаДнейДоставки = СтрокаДнейДоставки + "вс ";
			КонецЕсли;	
		КонецЦикла;	
		СтрокаДнейДоставки = СокрЛП(СтрокаДнейДоставки);
		
		СтрукПоиска = Новый СТруктура;
		СтрукПоиска.Вставить("ДеньНедели", ДеньНедели(Дата));
		НайСтроки = КалендарьДоставки.ДниДоставки.НайтиСтроки(СтрукПоиска);
		Если НайСтроки.Количество() > 0 Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецеСли;	
	Иначе
		Возврат Истина;
	КонецеСли;	
КонецФункции	

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	Если ЗначениеЗаполнено(ДатаРейса) Тогда
		ДатаОтсчета = ДатаРейса;
	Иначе
		ДатаОтсчета = ТекущаяДата();
	КонецЕсли;	
	Если Не КалендарьДоставки.Пустая() Тогда
		ОбрДата = ДатаОтсчета + 86400;
		Для Сч = 1 По 7 Цикл
			СтрукПоиска = Новый СТруктура;
			СтрукПоиска.Вставить("ДеньНедели", ДеньНедели(ОбрДата));
			НайСтроки = КалендарьДоставки.ДниДоставки.НайтиСтроки(СтрукПоиска);
			Если НайСтроки.Количество() > 0 Тогда
				Дата = ОбрДата;
				Прервать;
			Иначе
				ОбрДата = ОбрДата + 86400;;
			КонецеСли;	
		КонецЦикла;	
		Дата = ОбрДата;
	КонецеСли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры
