
&НаКлиенте
Процедура ЗаполнитьПоПустымУслугам(Команда)
    ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()

    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |   ДанныеЗаказаВодителяДоставленныеТовары.Ссылка.Реализация КАК Заказ
        |ИЗ
        |   Документ.ДанныеЗаказаВодителя.ДоставленныеТовары КАК ДанныеЗаказаВодителяДоставленныеТовары
        |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыСкладскогоУчета КАК СтатусыСкладскогоУчета
        |       ПО ДанныеЗаказаВодителяДоставленныеТовары.Ссылка.Реализация = СтатусыСкладскогоУчета.Заказ
        |           И (СтатусыСкладскогоУчета.СтатусСкладскогоУчета В (&СтатусыСкладскогоУчета))
        |ГДЕ
        |   ДанныеЗаказаВодителяДоставленныеТовары.Номенклатура.Артикул В
        |           (ВЫБРАТЬ
        |               УслугиПоЗаказам.Артикул
        |           ИЗ
        |               Справочник.УслугиПоЗаказам КАК УслугиПоЗаказам
        |           ГДЕ
        |               НЕ УслугиПоЗаказам.ПометкаУдаления)
        |   И ДанныеЗаказаВодителяДоставленныеТовары.КоличествоДоставлено = 0
        |
        |СГРУППИРОВАТЬ ПО
        |   ДанныеЗаказаВодителяДоставленныеТовары.Ссылка.Реализация";
        
    СтатусыСкладскогоУчета = Новый СписокЗначений;
    СтатусыСкладскогоУчета.Добавить(Справочники.СтатусыСкладскогоУчета.Возврат1);
    СтатусыСкладскогоУчета.Добавить(Справочники.СтатусыСкладскогоУчета.Возврат2);
    Запрос.УстановитьПараметр("СтатусыСкладскогоУчета", СтатусыСкладскогоУчета);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
    
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
        СтрокаТЧ = Объект.Заказы.Добавить();
        СтрокаТЧ.Заказ = ВыборкаДетальныеЗаписи.Заказ;
        ТипЗаказа = smv.ПолучитьТипЗаказа(ВыборкаДетальныеЗаписи.Заказ);
        СтрокаТЧ.ТипЗаказа = ТипЗаказа;
    КонецЦикла;

КонецПроцедуры

