
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Задача № 2540
	ТаблицаДвиженийВзаиморасчетовСКомитентами = РегистрыНакопления.ВзаиморасчетыСКомитентами.ТаблицаДвиженийПоРегистру();
	// Задача № 2540

	// Задача № 2570
	Для Каждого СтрокаТЧ Из ЭтотОбъект.СтатьиРасчетов Цикл
		
		СтрокаДвижения = ТаблицаДвиженийВзаиморасчетовСКомитентами.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДвижения, ЭтотОбъект);
		ЗаполнитьЗначенияСвойств(СтрокаДвижения, СтрокаТЧ);
		СтрокаДвижения.СтатьяРасчетовСКомитентами = СтрокаТЧ.СтатьяРасчетов;

	КонецЦикла;
	
	Движения.ВзаиморасчетыСКомитентами.СоздатьДвижения(ЭтотОбъект, ТаблицаДвиженийВзаиморасчетовСКомитентами, Ложь);
	// Задача № 2570
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ОбходПроверок") Тогда
		Возврат;	
	КонецЕсли;
	
	//+++ БАО 13.06.2017 №1024  
	//---Если РейсЗакрыт Тогда
	Если baoВызовСервера.РейсЗакрыт(Ссылка) Тогда
	//--- БАО 13.06.2017 №1024	
		Отказ = Истина;
		#Если Клиент Тогда
			Сообщить("Рейс закрыт");
		#КонецЕсли	
		Возврат;
	КонецЕсли;
	
	СуммаДокумента = СтатьиРасчетов.Итог("Сумма");
	
КонецПроцедуры

