
Процедура УстановитьДатуЗапретаРедактированияЗаказов() Экспорт
	Если Не РольДоступна("Админы") Тогда
		Сообщить("Нет прав!!!", СтатусСообщения.ОченьВажное);
		Возврат;
	КонецеСли;	
	Дат = Константы.ЗакрытаяДата.Получить();
	Если ВвестиДату(Дат, "Введите дату запрета...", ЧастиДаты.Дата) Тогда
		Константы.ЗакрытаяДата.Установить(Дат);
		Сообщить("Заказы закрыты по " + Формат(Дат, "ДЛФ=DD"));
	КонецЕСли;	
КонецПроцедуры	


Процедура ОтправитьСМСПростор() Экспорт
	
	//Пар = Константы.ПарольНаОтправкуСМС.Получить();
	Пар = "";
	Если Пар = "" Тогда
		Пар = "lowi4uq09gjn";
	КонецеСли;
	
	ВвПар = "=й-х4ельфэьк";
	
	Если Не ВвестиСтроку(ВвПар, "Введите пароль", 20) Тогда
		Сообщить("Не указан пароль!");
		Возврат;
	КонецеСли;	
	
	Если Пар <> ВвПар Тогда
		Сообщить("Неверный пароль!");
		Возврат;
	КонецеСли;	
	
	
	Зап = Новый Запрос;
	
	Зап.Текст = "ВЫБРАТЬ
	            |	АктивныеШаблоныСМСРассылокСрезПоследних.ШаблонСМСРассылки.Ссылка КАК Шаблон
	            |ИЗ
	            |	РегистрСведений.АктивныеШаблоныСМСРассылок.СрезПоследних КАК АктивныеШаблоныСМСРассылокСрезПоследних
	            |ГДЕ
	            |	АктивныеШаблоныСМСРассылокСрезПоследних.ТипСМСРассылки.Ссылка = ЗНАЧЕНИЕ(справочник.типысмсрассылок.РассылкаОбУехавшихЗаказах)";
	Рез = Зап.Выполнить().Выбрать();			
	
	Если Рез.Следующий() Тогда
		Сендер = Обработки.СМСРассылка.Создать();
		Сендер.ШаблонРассылки = Рез.Шаблон;
		Сендер.Оператор = Справочники.ОператорыСМСРассылки.ProstorSMS;
		Сендер.ДатаСбораДанных = ТекущаяДата();
		Сендер.ПроинизиализироватьОбработку();
		Сендер.ОтправкаСМС();
	КонецеСли;
	
Конецпроцедуры	


Процедура ОбновлениеДанныхПоРейсуИзВероута(ИдТранспорта, ДатаРейса, РаспределительныйЦентр = Неопределено) Экспорт
	Если РаспределительныйЦентр = Неопределено Тогда
		Ф = ПолучитьФорму("Обработка.ВыгрузкаМашинВВероут.Форма.ФормаУправляемая", Неопределено, Неопределено);
	Иначе
		Ф = ПолучитьФорму("Обработка.ВыгрузкаМашинВВероутРаспредЦентры.Форма.ФормаУправляемая", Неопределено, Неопределено);
		Ф.ОпределитьСхемуПланирования();
	КонецеСли;	
	Ф.Объект.Дата = ДатаРейса;
	Ф.Объект.ВидСервера = 1;       
	Ф.Объект.ПропускЗагрузкиЗаказовСДатойДоставкиОтличнойОтДатыРейсов = 1;
	//Ф.ТерминалДоставки = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "ТерминалДоставки");
	Если РаспределительныйЦентр = Неопределено Тогда
		Ф.ЗагрузитьРасписаниеНаСервере(ИдТранспорта);
	Иначе
		Ф.ЗагрузитьРасписаниеНаСервере(ИдТранспорта, РаспределительныйЦентр);
	КонецЕсли;	
Конецпроцедуры	


Функция УстановитьРабочееМесто() Экспорт //Перенесена в ПроцедурыИФункцииСеансаКлиента
	ИмяКомпьютера = ИмяКомпьютера();
	
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	РабочиеМеста.Ссылка КАК РабочееМесто
	            |ИЗ
	            |	Справочник.РабочиеМеста КАК РабочиеМеста
	            |ГДЕ
	            |	РабочиеМеста.ИмяКомпьютера = &ИмяКомпьютера";
	Зап.УстановитьПараметр("ИмяКомпьютера", ИмяКомпьютера);			
	
	Выб = Зап.Выполнить().Выбрать();
	
	РабочееМесто = Неопределено;
	Если Выб.Следующий() Тогда
		РабочееМесто = Выб.РабочееМесто;
	Иначе
		РабочееМестоОб = Справочники.РабочиеМеста.СоздатьЭлемент();
		РабочееМестоОб.Наименование = ИмяКомпьютера;
		РабочееМестоОб.ИмяКомпьютера = ИмяКомпьютера;
		РабочееМестоОб.Записать();
		РабочееМесто = РабочееМестоОб.Ссылка;
	КонецеСли;	
	
	Возврат РабочееМесто;
КонецФункции

Процедура ВнешниеДанныеОткрытьСписокЛогМП() Экспорт
	ОткрытьФорму("ВнешнийИсточникДанных.ВнешнийЛог.Таблица.dbo_LogMAExchange.Форма.ФормаСписка");
Конецпроцедуры	

Процедура ВнешниеДанныеОткрытьСписокВыгрузкаОтчетов() Экспорт
	ОткрытьФорму("ВнешнийИсточникДанных.ВнешнийЛог.Таблица.dbo_UnloadingReports.Форма.ФормаСписка");
Конецпроцедуры	

Процедура ВнешниеДанныеОткрытьСписокЗагруженныхДанных() Экспорт
	ОткрытьФорму("ВнешнийИсточникДанных.ВнешнийЛог.Таблица.dbo_UploadedData.Форма.ФормаСписка");
Конецпроцедуры	

Процедура ВнешниеДанныеОткрытьЛогЗапросовWEB() Экспорт
	ОткрытьФорму("ВнешнийИсточникДанных.ВнешнийЛог.Таблица.dbo_WebServiceRequests.Форма.ФормаСписка");
Конецпроцедуры


Процедура ХранилищеВнешнихДанныхОткрытьТаблицуПрикрепленныхФайлов() Экспорт
	ОткрытьФорму("ВнешнийИсточникДанных.ВнешнееХранилищеДанных.Таблица.dbo_extFiles.Форма.ФормаСписка");
Конецпроцедуры


Процедура ВнешниеДанныеОткрытьЛогСканирования() Экспорт
	ОткрытьФорму("ВнешнийИсточникДанных.ВнешнийЛог.Таблица.dbo_scanLogging.Форма.ФормаСписка");
Конецпроцедуры
