
Перем мДлинаСуток;

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриКопировании(ОбъектКопирования)
	
	Если Не ЭтоГруппа Тогда
		ОсновноеИзображение = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

//Геннадий 04.04.2022 ++
Процедура ПередЗаписью(Отказ)
	Если Не ЭтоГруппа И НЕ ОбменДанными.Загрузка Тогда 
		группаФизЛиц = РаботаСФизЛицамиСервер.ПолучитьГруппуФизическогоЛица(Фамилия);
		Если Не группаФизЛиц = Неопределено Тогда
			ГруппаФизЛиц = группаФизЛиц;
		Иначе
			Сообщить("Внимание!!! Запись карточки невозможна. Не найдена группа физического лица!");
			Отказ = Истина;
		КонецЕсли;
	КонецеСли;
	
КонецПроцедуры
//Геннадий 04.04.2022 --

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

мДлинаСуток = 86400;
