
Процедура Печать(ТабДок, Ссылка) Экспорт
	Макет = Документы.мгРасчетФОТ.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	мгРасчетФОТ.ПериодРегистрации,
	|	мгРасчетФОТ.Сотрудники.(
	|		Сотрудник,
	|		Должность,
	|		Организация,
	|		НачисленоЗаОсновнуюРаботу,
	|		НачисленоПоФиксТарифу,
	|		НачисленоЗаПодъемы,
	|		НачисленоОтпускныхБольничных,
	|		НачисленоНадбавки,
	|		ПодработкаНаСкладе,
	|		МагистральСПБ,
	|		НочнойВодитель,
	|		Премия,
	|		ИтогоНачислено,
	|		ВыполнениеМенее85,
	|		ДисциплинарныеВзыскания,
	|		МатериальныйУщерб,
	|		ШтрафыПДД,
	|		Пропуска,
	|		ИтогоУдержано,
	|		ВыданАвансИЗП,
	|		ВСчётЗП,
	|		ИсполнительныйЛист,
	|		ИтогоВыдано,
	|		КВыдаче,
	|		УказанияДляБухгалтерии
	|	)
	|ИЗ
	|	Документ.мгРасчетФОТ КАК мгРасчетФОТ
	|ГДЕ
	|	мгРасчетФОТ.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСотрудникиШапка = Макет.ПолучитьОбласть("СотрудникиШапка");
	ОбластьСотрудники = Макет.ПолучитьОбласть("Сотрудники");
	ТабДок.Очистить();

	МесяцСтрока = "";
	
	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		//Шапка.Параметры.Заполнить(Выборка);
		МесяцСтрока = Формат(Выборка.ПериодРегистрации, "ДФ='ММММ гггг'");
		Шапка.Параметры.ПериодРегистрации = МесяцСтрока;
		ТабДок.Вывести(Шапка);

		ТабДок.Вывести(ОбластьСотрудникиШапка);
		ВыборкаСотрудники = Выборка.Сотрудники.Выбрать();
		Пока ВыборкаСотрудники.Следующий() Цикл
			ОбластьСотрудники.Параметры.Заполнить(ВыборкаСотрудники);
			ТабДок.Вывести(ОбластьСотрудники, ВыборкаСотрудники.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
КонецПроцедуры   