
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр мгЗарплатаНачисления Расход
	Движения.мгЗарплатаНачисления.Записывать = Истина;
	Движения.мгЗарплатаНачисления.Очистить();
	
	Движения.мгЗарплатаУдержания.Записывать = Истина;
	Движения.мгЗарплатаУдержания.Очистить();
	
	Для Каждого ТекСтрокаСотрудники Из Сотрудники Цикл
		//начисления
		Если ЗначениеЗаполнено(ТекСтрокаСотрудники.НачисленоЗаОсновнуюРаботу) Тогда
			Движение = Движения.мгЗарплатаНачисления.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = КонецМесяца(ПериодРегистрации);
			Движение.Организация = ТекСтрокаСотрудники.Организация;
			Движение.Терминал = Терминал;
			Движение.ВидНачисления = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.НачислениеОсновное");
			Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
			Движение.Тариф = ТекСтрокаСотрудники.НачисленоЗаОсновнуюРаботу;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекСтрокаСотрудники.НачисленоПоФиксТарифу) Тогда
			Движение = Движения.мгЗарплатаНачисления.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = КонецМесяца(ПериодРегистрации);
			Движение.Организация = ТекСтрокаСотрудники.Организация;
			Движение.Терминал = Терминал;
			Движение.ВидНачисления = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.ТарифПоКонтрагенту");
			Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
			Движение.Тариф = ТекСтрокаСотрудники.НачисленоПоФиксТарифу;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекСтрокаСотрудники.НачисленоЗаПодъемы) Тогда
			Движение = Движения.мгЗарплатаНачисления.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = КонецМесяца(ПериодРегистрации);
			Движение.Организация = ТекСтрокаСотрудники.Организация;
			Движение.Терминал = Терминал;
			Движение.ВидНачисления = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.НачислениеЗаПодъем");
			Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
			Движение.Тариф = ТекСтрокаСотрудники.НачисленоЗаПодъемы;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекСтрокаСотрудники.НачисленоНадбавки) Тогда
			Движение = Движения.мгЗарплатаНачисления.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = КонецМесяца(ПериодРегистрации);
			Движение.Организация = ТекСтрокаСотрудники.Организация;
			Движение.Терминал = Терминал;
			Движение.ВидНачисления = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.НадбавкиПоЗаказам");
			Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
			Движение.Тариф = ТекСтрокаСотрудники.НачисленоНадбавки;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекСтрокаСотрудники.ПодработкаНаСкладе) Тогда
			Движение = Движения.мгЗарплатаНачисления.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = КонецМесяца(ПериодРегистрации);
			Движение.Организация = ТекСтрокаСотрудники.Организация;
			Движение.Терминал = Терминал;
			Движение.ВидНачисления = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.ПодработкаНаСкладе");
			Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
			Движение.Тариф = ТекСтрокаСотрудники.ПодработкаНаСкладе;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекСтрокаСотрудники.МагистральСПБ) Тогда
			Движение = Движения.мгЗарплатаНачисления.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = КонецМесяца(ПериодРегистрации);
			Движение.Организация = ТекСтрокаСотрудники.Организация;
			Движение.Терминал = Терминал;
			Движение.ВидНачисления = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.МагистральСПБ");
			Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
			Движение.Тариф = ТекСтрокаСотрудники.МагистральСПБ;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекСтрокаСотрудники.НочнойВодитель) Тогда
			Движение = Движения.мгЗарплатаНачисления.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = КонецМесяца(ПериодРегистрации);
			Движение.Организация = ТекСтрокаСотрудники.Организация;
			Движение.Терминал = Терминал;
			Движение.ВидНачисления = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.НочнойВодитель");
			Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
			Движение.Тариф = ТекСтрокаСотрудники.НочнойВодитель;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекСтрокаСотрудники.Премия) Тогда
			Движение = Движения.мгЗарплатаНачисления.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = КонецМесяца(ПериодРегистрации);
			Движение.Организация = ТекСтрокаСотрудники.Организация;
			Движение.Терминал = Терминал;
			Движение.ВидНачисления = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.Премия");
			Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
			Движение.Тариф = ТекСтрокаСотрудники.Премия;
		КонецЕсли;
		// удержания
		Если ЗначениеЗаполнено(ТекСтрокаСотрудники.НачисленоОтпускныхБольничных) Тогда
			Движение = Движения.мгЗарплатаУдержания.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = КонецМесяца(ПериодРегистрации);
			Движение.Организация = ТекСтрокаСотрудники.Организация;
			Движение.Терминал = Терминал;
			Движение.ВидУдержания = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.ОтпускныеБольничные");
			Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
			Движение.Тариф = ТекСтрокаСотрудники.НачисленоОтпускныхБольничных;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекСтрокаСотрудники.ВыполнениеМенее85) Тогда
			Движение = Движения.мгЗарплатаУдержания.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = КонецМесяца(ПериодРегистрации);
			Движение.Организация = ТекСтрокаСотрудники.Организация;
			Движение.Терминал = Терминал;
			Движение.ВидУдержания = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.Депримирование");
			Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
			Движение.Тариф = ТекСтрокаСотрудники.ВыполнениеМенее85;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекСтрокаСотрудники.ДисциплинарныеВзыскания) Тогда
			Движение = Движения.мгЗарплатаУдержания.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = КонецМесяца(ПериодРегистрации);
			Движение.Организация = ТекСтрокаСотрудники.Организация;
			Движение.Терминал = Терминал;
			Движение.ВидУдержания = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.ДисциплинарныеВзыскания");
			Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
			Движение.Тариф = ТекСтрокаСотрудники.ДисциплинарныеВзыскания;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекСтрокаСотрудники.МатериальныйУщерб) Тогда
			Движение = Движения.мгЗарплатаУдержания.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = КонецМесяца(ПериодРегистрации);
			Движение.Организация = ТекСтрокаСотрудники.Организация;
			Движение.Терминал = Терминал;
			Движение.ВидУдержания = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.МатериальныйУщерб");
			Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
			Движение.Тариф = ТекСтрокаСотрудники.МатериальныйУщерб;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекСтрокаСотрудники.ШтрафыПДД) Тогда
			Движение = Движения.мгЗарплатаУдержания.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = КонецМесяца(ПериодРегистрации);
			Движение.Организация = ТекСтрокаСотрудники.Организация;
			Движение.Терминал = Терминал;
			Движение.ВидУдержания = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.ШтрафыПДД");
			Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
			Движение.Тариф = ТекСтрокаСотрудники.ШтрафыПДД;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекСтрокаСотрудники.Пропуска) Тогда
			Движение = Движения.мгЗарплатаУдержания.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = КонецМесяца(ПериодРегистрации);
			Движение.Организация = ТекСтрокаСотрудники.Организация;
			Движение.Терминал = Терминал;
			Движение.ВидУдержания = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.Пропуска");
			Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
			Движение.Тариф = ТекСтрокаСотрудники.Пропуска;
		КонецЕсли;
		
		//выплаты
		Если ЗначениеЗаполнено(ТекСтрокаСотрудники.ВыданАвансИЗП) Тогда
			Движение = Движения.мгЗарплатаУдержания.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = КонецМесяца(ПериодРегистрации);
			Движение.Организация = ТекСтрокаСотрудники.Организация;
			Движение.Терминал = Терминал;
			Движение.ВидУдержания = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.ВыданАвансИЗП");
			Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
			Движение.Тариф = ТекСтрокаСотрудники.ВыданАвансИЗП;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекСтрокаСотрудники.ВСчётЗП) Тогда
			Движение = Движения.мгЗарплатаУдержания.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = КонецМесяца(ПериодРегистрации);
			Движение.Организация = ТекСтрокаСотрудники.Организация;
			Движение.Терминал = Терминал;
			Движение.ВидУдержания = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.ВСчетЗП");
			Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
			Движение.Тариф = ТекСтрокаСотрудники.ВСчётЗП;
		КонецЕсли;
		Если ТекСтрокаСотрудники.КВыдаче < 0 Тогда
			Движение = Движения.мгЗарплатаУдержания.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = КонецМесяца(ПериодРегистрации);
			Движение.Организация = ТекСтрокаСотрудники.Организация;
			Движение.Терминал = Терминал;
			Движение.ВидУдержания = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.ВСчетЗП");
			Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
			Движение.Тариф = ТекСтрокаСотрудники.КВыдаче;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекСтрокаСотрудники.ИсполнительныйЛист) Тогда
			Движение = Движения.мгЗарплатаУдержания.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = КонецМесяца(ПериодРегистрации);
			Движение.Организация = ТекСтрокаСотрудники.Организация;
			Движение.Терминал = Терминал;
			Движение.ВидУдержания = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.ИсполнительныйЛист");
			Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
			Движение.Тариф = ТекСтрокаСотрудники.ИсполнительныйЛист;
		КонецЕсли;
		
	КонецЦикла;

	
	// регистр мгЗарплатаУдержания Расход
	//Движения.мгЗарплатаУдержания.Записывать = Истина;
	//Движения.мгЗарплатаУдержания.Очистить();
	//Для Каждого ТекСтрокаСотрудники Из Сотрудники Цикл
	//	Движение = Движения.мгЗарплатаУдержания.Добавить();
	//	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//	Движение.Период = КонецМесяца(ПериодРегистрации);
	//	Движение.Организация = Организация;
	//	Движение.Терминал = Терминал;
	//	Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
	//КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
