
&НаСервере
Процедура ЗарегистрироватьИзмененияНаСервере()
	// Вставить содержимое обработчика.
	ПланыОбмена.ЗарегистрироватьИзменения(Объект.Ссылка, Метаданные.Справочники.Номенклатура);
	ПланыОбмена.ЗарегистрироватьИзменения(Объект.Ссылка, Метаданные.Справочники.КассыККМ);
	ПланыОбмена.ЗарегистрироватьИзменения(Объект.Ссылка, Метаданные.Справочники.Организации);
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьИзменения(Команда)
	ЗарегистрироватьИзмененияНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалитьРегистрациюИзмененийНаСервере()
	ПланыОбмена.УдалитьРегистрациюИзменений(Объект.Ссылка, Метаданные.Справочники.Номенклатура);
	ПланыОбмена.УдалитьРегистрациюИзменений(Объект.Ссылка, Метаданные.Справочники.КассыККМ);
	ПланыОбмена.УдалитьРегистрациюИзменений(Объект.Ссылка, Метаданные.Справочники.Организации);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьРегистрациюИзменений(Команда)
	УдалитьРегистрациюИзмененийНаСервере();
КонецПроцедуры
