
&НаКлиенте
Процедура ОК(Команда)
	// Вставить содержимое обработчика.
	Если ТребуемыйКод <> ВведенныйКод Тогда
		Элементы.ДекорацияРезультат.Заголовок = "КОД НЕ ВЕРЕН!";
	Иначе
		Элементы.ДекорацияРезультат.Заголовок = "ВЕРНЫЙ КОД!";
		ЗаписатьВведенныйКИКНаЗаказе();
		Закрыть("ВерныйКод");
	КонецеСли;	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьВведенныйКИКНаЗаказе()
	ОбъектЗаказ = Заказ.ПолучитьОбъект();
	ОбъектЗаказ.ВведенныйКИК = ТребуемыйКод;
	ОбъектЗаказ.Записать(РежимЗаписиДокумента.Запись);
КонецПроцедуры	

&НаКлиенте
Процедура БезКода(Команда)
	// Вставить содержимое обработчика.
	Закрыть("БезКода");
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	// Вставить содержимое обработчика.
	Закрыть();         //"КодНеВведен"
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТребуемыйКод = Параметры.ТребуемыйКод;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры
