
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("ОбщаяФорма.", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	//ВыполнитьОбмен(); ++++++
	
	//ОбщийМодуль.ВыполнитьОбменФоновоеЗадание();
	//Сообщение = Новый СообщениеПользователю();
	//Сообщение.Текст = НСтр("ru = 'Загрузка завершена!'", "ru");
	////Сообщение.Поле  = "Объект.Телефон";
	//Сообщение.Сообщить();
	//Предупреждение("Обмен выполнен!"); ++++++++
	
	ВыполнитьОбменНаСервере();
	Оповестить("АктуализироватьРейс");
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбмен() Экспорт
	МодульОбмен.ВыполнитьОбменНаСервере();
Конецпроцедуры	


Процедура ВыполнитьОбменНаСервере()
	//Если Не ОбработчикФоновыхЗаданий.ПроверкаВыполненияОбменаВФоне() Тогда
	//	ОбменДаннымиССервисом.ВыполнитьОбмен();
	//КонецеСли;
	
	ОбработчикФоновыхЗаданий.ВыполнитьОбменВФоне();
КонецПроцедуры	


