//Функция получает данные из РС НазначениеУслугПозаказам
//получаем данные которые были выгружены из почты и по которым есть реализации, местная доставка и  новаГруз
Функция ПолучитьДанныеИзРС(Контрагент) Экспорт
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |   НазначениеУслугПозаказамСрезПоследних.НомерВнешнегоЗаказа,
        |   НазначениеУслугПозаказамСрезПоследних.Услуга,
        |   НазначениеУслугПозаказамСрезПоследних.Контрагент,
        |   НазначениеУслугПозаказамСрезПоследних.Стоимость
        |ПОМЕСТИТЬ ВТ
        |ИЗ
        |   РегистрСведений.НазначениеУслугПозаказам.СрезПоследних(, ) КАК НазначениеУслугПозаказамСрезПоследних
        |ГДЕ
        |   НазначениеУслугПозаказамСрезПоследних.Статус В(&Статус)
        |   И НазначениеУслугПозаказамСрезПоследних.Контрагент = &Контрагент
        |   И НазначениеУслугПозаказамСрезПоследних.НомерВнешнегоЗаказа <> &НомерВнешнегоЗаказаИсключение
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |   РеализацияТоваровУслуг.Ссылка КАК Заказ,
        |   ВТ.НомерВнешнегоЗаказа,
        |   РеализацияТоваровУслуг.Контрагент КАК Клиент,
        |   РеализацияТоваровУслуг.Телефон,
        |   РеализацияТоваровУслуг.АдресДоставки КАК Адрес,
        |   ВТ.Услуга.Артикул КАК АртикулУслуги,
        |   ВТ.Услуга,
        |   ВТ.Стоимость КАК СтоимостьУслуги,
        |   ЧАС(новаМестнаяДоставка.ВремяПрибытияС) КАК ВремяДоставкиС,
        |   ЧАС(новаМестнаяДоставка.ВремяПрибытияПо) КАК ВремяДоставкиПО,
        |   новаМестнаяДоставка.Дата КАК ДатаДоставки,
        |   новаГруз.Спецификация.(
        |       Товар
        |   )
        |ИЗ
        |   ВТ КАК ВТ
        |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
        |           ВНУТРЕННЕЕ СОЕДИНЕНИЕ БизнесПроцесс.новаМестнаяДоставка КАК новаМестнаяДоставка
        |           ПО РеализацияТоваровУслуг.Номер = новаМестнаяДоставка.Номер
        |           ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.новаГруз КАК новаГруз
        |           ПО РеализацияТоваровУслуг.Номер = новаГруз.Номер
        |       ПО (РеализацияТоваровУслуг.НомерВнешнегоЗаказа = ВТ.НомерВнешнегоЗаказа)";
        
    СписокСтатусов = Новый СписокЗначений;
    СписокСтатусов.Добавить(Перечисления.СтатусыУслугПоЗаказам.ВыгруженаИзПочты);
    СписокСтатусов.Добавить(Перечисления.СтатусыУслугПоЗаказам.ВыгруженаИзАдминки);
    Запрос.УстановитьПараметр("Статус",СписокСтатусов );
    
    Запрос.УстановитьПараметр("Контрагент", Контрагент);
    //Серегин М.В. 06.08.2015 11:04:40 костыль по глючному заказу
    Запрос.УстановитьПараметр("НомерВнешнегоЗаказаИсключение", "40058473");
    //Серегин М.В. 06.08.2015 11:04:45 
    РезультатЗапроса = Запрос.Выполнить().Выгрузить();
    Возврат РезультатЗапроса;
КонецФункции // ПолучитьДанныеИзРС()
