&НаКлиенте
Процедура Отсчет()
	Счетчик = Счетчик + 1;
	Если Счетчик > 60 Тогда
		ПогаситьУведомлениеНаСервере();
		ФлагЗакрытия = Ложь;
		Закрыть();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПогаситьУведомлениеНаСервере()
	ИнформированиеЭкипажейСервер.ПогаситьУведомление(НачалоДня(ТекущаяДата()));
КонецПроцедуры	
 
//// функция преобразования числа во время
//Функция Время(Значение)
//	Если Значение < 60 Тогда
//  		Возврат Строка(Значение) + " сек.";
// 	ИначеЕсли Значение >= 60 и Значение < 60*60 Тогда
//		Возврат Строка(Цел(Значение/60)) + " мин. " + Строка(Значение-Цел(Значение/60)*60) + " сек.";
// 	ИначеЕсли Значение >= 60*60 и Значение < 60*60*24 Тогда 
//		Возврат Строка(Цел(Значение/(60*60))) + " час. " 
//				+  Строка(Цел((Значение - (Цел(Значение/(60*60))*60*60))/60)) + " мин. " 
//				+ Строка(Значение-Цел(Значение/60)*60) + " сек.";
//	КонецЕсли;	
//КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Вставить содержимое обработчика.
	Счетчик = 0;
	ФлагЗакрытия = Истина;
	ПодключитьОбработчикОжидания("Отсчет", 1);	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Отказ = ФлагЗакрытия;
КонецПроцедуры
