
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр НУЭкипажей
	Движения.НУЭкипажей.Записывать = Истина;
	Движения.НУЭкипажей.Очистить();
	Для Каждого ТекСтрокаСтатьиНУ Из СтатьиНУ Цикл
		Движение = Движения.НУЭкипажей.Добавить();
		Движение.Период = ТекСтрокаСтатьиНУ.МесяцРасчета;
		Движение.ФизЛицо = ТекСтрокаСтатьиНУ.ФизЛицо;
		Движение.СтатьяНУ = ТекСтрокаСтатьиНУ.СтатьяНУ;
		Движение.Сумма = ТекСтрокаСтатьиНУ.Сумма;
		Движение.Процент = ТекСтрокаСтатьиНУ.Процент;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
