#Область ПрограммныйИнтерфейс
// Запустить маршрутизацию ЯМ.
// 
// Параметры:
//  ВыбранныйРейс - СправочникСсылка.Рейсы - Выбранный рейс
//  КонтекстВызова - Форма
//  ДанныеРейса - Структура
//  БезусловныйЗапросВариантаВозвращения - Булево - Безусловный запрос варианта возвращения
// 
// Возвращаемое значение:
//  Неопределено, Структура - Запустить маршрутизацию ЯМ:
// * ДанныеТекущейТочки - Неопределено, Структура - :
// ** latitude 
// ** longitude 
// * ВыбранноеВремя - Неопределено - 
// * ФинальныйАдрес - Структура - :
// ** ТипАдреса - Число - 
// ** ШиротаДолгота - Строка - 
Асинх Функция НачатьСборДанныхДляМаршрутизацииЯМАсинх(ВыбранныйРейс, ДанныеРейса, БезусловныйЗапросВариантаВозвращения = Ложь) Экспорт
	ДанныеТекущейТочки = Неопределено;
	ВыбранноеВремя = Неопределено;
	
	Если Не ДанныеРейса.РаспечатанМЛ Тогда
		СписокВремени = СформироватьСписокВремени();
		ВыбранноеВремяЗначение = Ждать СписокВремени.ВыбратьЭлементАсинх("Время выезда");
		Если ВыбранноеВремяЗначение <> Неопределено Тогда
			ВыбранноеВремя = ВыбранноеВремяЗначение.Значение; 
		КонецеСли;	
	Иначе
		ДанныеТекущегоМестоположения = ГеопозиционированиеКлиент.ТекущиеКоординаты();
		Если ДанныеТекущегоМестоположения <> Неопределено Тогда
			ДанныеТекущейТочки = Новый Структура;
			ДанныеТекущейТочки.Вставить("latitude", ДанныеТекущегоМестоположения.Координаты.Широта);
			ДанныеТекущейТочки.Вставить("longitude", ДанныеТекущегоМестоположения.Координаты.Долгота);
		Иначе
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Не могу получить текущие координаты!";
			Сообщение.Сообщить();
			Возврат Неопределено;
		КонецеСли;
	КонецеСли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВыбранныйРейс", ВыбранныйРейс);
	СтруктураПараметров.Вставить("ВыбранноеВремя", ВыбранноеВремя);
	СтруктураПараметров.Вставить("ДанныеТекущейТочки", ДанныеТекущейТочки);
	

	
	//выбор конечной точки и вызов процедуры завершения сбора данных
	Если БезусловныйЗапросВариантаВозвращения Или ДанныеРейса.ТипФинальнойТочкиМаршрута = 0 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаОповещенияВводАдреса", МаршрутизацияКлиент);
		ОткрытьФорму("ОбщаяФорма.ФормаВводаАдреса",СтруктураПараметров,,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	Иначе
		ЗапуститьМаршрутизациюЯМПослеСбораДанных(СтруктураПараметров);		
	КонецеСли;	
КонецФункции

// Обработка оповещения ввод адреса.
// 
// Параметры:
//  Результат  - Структура - Результат
//  ДополнительныеПараметры - Структура - Дополнительные параметры
Процедура ОбработкаОповещенияВводАдреса(Результат, ДополнительныеПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		МаршрутизацияСервер.ЗафиксироватьФинальнуюТочкуРейса(Результат.ФинальнаяТочкаМаршрута, Результат.ВыбранныйРейс);		
		ЗапуститьМаршрутизациюЯМПослеСбораДанных(Результат);		
	Иначе
//		ПараметрыМаршрутизации.Вставить("ТипАдреса", 0);
//		ПараметрыМаршрутизации.Вставить("ДанныеТекущейТочки", Результат.ДанныеТекущейТочки);
//		ЗапуститьМаршрутизациюЯМПослеСбораДанных(ПараметрыМаршрутизации);
		//TODO: здесь было продолжение процесса сбора данных маршрутизации при отмене в форме адреса
	КонецеСли;	
КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//&НаКлиенте
Функция СформироватьСписокВремени()
	СейчасМинут = Минута(ТекущаяДата());
	ОкрМинут = Окр(СейчасМинут + 5, -1);
	СейчасЧасов = Час(ТекущаяДата());
	СейчасДень = День(ТекущаяДата());
	//СейчасМесяц = Месяц(ТекущаяДата());
	
	СписокВыбора = Новый СписокЗначений;
	
	Для Сч = 1 По 18 Цикл
		Если ОкрМинут = 60 Тогда
			СейчасЧасов = СейчасЧасов + 1;
			ОкрМинут = 0;
		КонецеСли;	
		
		Если СейчасЧасов = 24 Тогда
			СейчасДень = СейчасДень + 1;
			СейчасЧасов = 0;
		КонецеСли;	
		
		
		СписокВыбора.Добавить(Дата(Год(ТекущаяДата()), Месяц(ТекущаяДата()), СейчасДень, СейчасЧасов, ОкрМинут, 0), Формат(СейчасЧасов, "ЧЦ=2; ЧН=00; ЧВН=") + ":" + Формат(ОкрМинут, "ЧЦ=2; ЧН=00; ЧВН="));
		ОкрМинут = ОкрМинут + 10;
	КонецЦикла;	
	Возврат СписокВыбора;
КонецФункции

Функция ЗапуститьМаршрутизациюЯМПослеСбораДанных(ПараметрыМаршрутизации)
	Если Не ПараметрыМаршрутизации.Свойство("ФинальнаяТочкаМаршрута") Тогда
		ТипФинальнойТочки = МаршрутизацияСервер.ПолучитьТипАдресаФинальнойТочкиМаршрутаРейса(ПараметрыМаршрутизации.ВыбранныйРейс);
		ФинальнаяТочкаМаршрута = Новый Структура;
		
		ФинальнаяТочкаМаршрута.Вставить("ТипАдреса", ТипФинальнойТочки);
		Если ТипФинальнойТочки = 3 тогда
			ФинальнаяТочкаМаршрута.Вставить("ШиротаДолгота", МаршрутизацияСервер.ПолучитьШиротуИДолготуФинальнойТочкиМаршрутаРейса(ПараметрыМаршрутизации.ВыбранныйРейс));			
		КонецЕсли;
		ПараметрыМаршрутизации.Вставить("ФинальнаяТочкаМаршрута", ФинальнаяТочкаМаршрута);
	КонецеСли;
		
		
	Если ПараметрыМаршрутизации.ФинальнаяТочкаМаршрута.ТипАдреса = 2 Тогда
		ФинальныйАдрес = "Склад";
	ИначеЕсли ПараметрыМаршрутизации.ФинальнаяТочкаМаршрута.ТипАдреса = 3 Тогда	
		ФинальныйАдрес = ПараметрыМаршрутизации.ФинальнаяТочкаМаршрута.ШиротаДолгота;
	КонецЕсли;	
	
	РезультатЗапуска = ЗапуститьМаршрутизациюНаСервере(ПараметрыМаршрутизации.ВыбранноеВремя, ПараметрыМаршрутизации.ДанныеТекущейТочки, ФинальныйАдрес);
	

	Если РезультатЗапуска Тогда
		ПодключитьОбработчикОжидания("ОбработчикОжидания_ПолучитьРезультатМаршрутизации", 3, Ложь);
	КонецЕсли;	

КонецФункции	
#КонецОбласти


