
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидОтчета = Справочники.ВидыОтправляемыхОтчетов.ОтчетАгентаУниверсальный;
	ТипОтправкиОтчетов = Справочники.ТипыОтправкиОтчетов.ОтчетПартнерамПочтойРегламент;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Отказ = Истина;
	
	ПараметрыОткрытия = Новый Структура("ВидОтчета,ТипОтправкиОтчетов", ВидОтчета, ТипОтправкиОтчетов);
	
	ОткрытьФорму("ВнешнийИсточникДанных.ВнешнийЛог.Таблица.dbo_UnloadingReports.Форма.ФормаОтчета", ПараметрыОткрытия,, ВидОтчета);
	
КонецПроцедуры
