
// алгоритм обрабатывает только существующие склады, без добавления новых, пока обновляются только номера телефонов забора
Процедура РегламентОбновлениеДанныхПоСкладамМагазинов() Экспорт
	Подключение = Евген.СоздатьПодключениеКИнтернетМагазину();
	
	ДатаИзмененияСкладовМагазинов = ТекущаяДата();
	ОтборОбновленияЗаказов = Новый Структура;
	ОтборОбновленияЗаказов.Вставить("Ключ", "ПоследняяДатаЗагрузкиСкладовМагазинов");
	Запись = РегистрыСведений.ПараметрыРегламентныхЗаданий.Получить(ОтборОбновленияЗаказов);
	Запись.Свойство("Значение", ДатаИзмененияСкладовМагазинов);
		
	Если ЗначениеЗаполнено(ДатаИзмененияСкладовМагазинов) Тогда
		RS = Евген.ЗапросКИнтернетМагазину("
		|SELECT
		|S.stockId, isnull(S.phoneNumber, '') as phoneNumber, isnull(S.address, '') as address
		//Асеев 17.05.2022 (Задача № 4805)>>>
		|,S.terminalId as stockterminalId
		//Асеев 17.05.2022 (Задача № 4805)<<<
		//Асеев 08.12.2022 (Задача № 4945)>>>
		|,S.contactPersonName as contactPersonName
		//Асеев 08.12.2022 (Задача № 4945)<<<
		//Асеев 20.12.2022 (Задача № 4957)>>>
		|,S.stockName as stockName
		//Асеев 20.12.2022 (Задача № 4957)<<<
		|FROM 
		|ts_stock S (NOLOCK)
		|WHERE
		|	S.modifyDate > '"+Евген.ДатаВSQL(ДатаИзмененияСкладовМагазинов, Ложь)+"'
		|",Подключение);
		//Асеев 17.05.2022 (Задача № 4805)>>>
		//ДанныеСкладов = Евген.СоздатьТаблицу(RS, "stockId_Ч, phoneNumber, address");
		//ДанныеСкладов = Евген.СоздатьТаблицу(RS, "stockId_Ч, phoneNumber, address, stockterminalId_Ч");
		//Асеев 17.05.2022 (Задача № 4805)<<<
		//Асеев 08.12.2022 (Задача № 4945)>>>
		//ДанныеСкладов = Евген.СоздатьТаблицу(RS, "stockId_Ч, phoneNumber, address, stockterminalId_Ч, contactPersonName");
		//Асеев 20.12.2022 (Задача № 4957)>>>
		ДанныеСкладов = Евген.СоздатьТаблицу(RS, "stockId_Ч, phoneNumber, address, stockterminalId_Ч, contactPersonName, stockName");
		//Асеев 20.12.2022 (Задача № 4957)<<<
		//Асеев 08.12.2022 (Задача № 4945)<<<
		
		НТаб = Новый ТаблицаЗначений;
		НТаб.Колонки.Добавить("Ид", Новый ОписаниеТипов("Число"));
		НТаб.Колонки.Добавить("НомерТелефона", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50)));
		НТаб.Колонки.Добавить("Адрес", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(100)));
		//Асеев 17.05.2022 (Задача № 4805)>>>
		НТаб.Колонки.Добавить("КодРегиона", Новый ОписаниеТипов("Число"));
		//Асеев 17.05.2022 (Задача № 4805)<<<
		//Асеев 08.12.2022 (Задача № 4945)>>>
		НТаб.Колонки.Добавить("КонтактнаяИнформация", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(500)));
		//Асеев 08.12.2022 (Задача № 4945)<<<
		//Асеев 20.12.2022 (Задача № 4957)>>>
		НТаб.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50)));
		//Асеев 20.12.2022 (Задача № 4957)<<<

		Для Каждого Тек Из ДанныеСкладов Цикл
			Нов = НТаб.Добавить();
			Нов.ИД = Тек.stockId_Ч;
			Нов.НомерТелефона = Тек.phoneNumber;
			Нов.Адрес = Тек.address;
			//Асеев 17.05.2022 (Задача № 4805)>>>
			Нов.КодРегиона = Тек.stockterminalId_Ч;
			//Асеев 17.05.2022 (Задача № 4805)<<<
			//Асеев 08.12.2022 (Задача № 4945)>>>
			Нов.КонтактнаяИнформация = Тек.contactPersonName;
			//Асеев 08.12.2022 (Задача № 4945)<<<
			//Асеев 20.12.2022 (Задача № 4957)>>>
			Нов.Наименование = Тек.stockName;
			//Асеев 20.12.2022 (Задача № 4957)<<<
		КонецЦикла;	
		
		
		Зап = Новый Запрос;
		Зап.Текст = "ВЫБРАТЬ
		            |	Таб.Ид КАК Ид,
		            |	Таб.НомерТелефона КАК НомерТелефона,
					|	Таб.Адрес КАК Адрес,
					//Асеев 17.05.2022 (Задача № 4805)>>>
					|	Таб.КодРегиона КАК КодРегиона,
					//Асеев 17.05.2022 (Задача № 4805)<<<
					//Асеев 08.12.2022 (Задача № 4945)>>>
					|	Таб.КонтактнаяИнформация КАК КонтактнаяИнформация,
					//Асеев 08.12.2022 (Задача № 4945)<<<
					//Асеев 20.12.2022 (Задача № 4957)>>>
					|	Таб.Наименование КАК Наименование
					//Асеев 20.12.2022 (Задача № 4957)<<<
					|ПОМЕСТИТЬ ВТ_Таб
		            |ИЗ
		            |	&Таб КАК Таб
		            |;
		            |
		            |////////////////////////////////////////////////////////////////////////////////
		            |ВЫБРАТЬ
		            |	ВТ_Таб.Ид КАК Ид,
		            |	ВТ_Таб.НомерТелефона КАК НомерТелефона,
					|	ВТ_Таб.Адрес КАК Адрес,
		            |	СкладыМагазинов.Ссылка КАК Склад,
					//Асеев 17.05.2022 (Задача № 4805)>>>
					|	РегиональныеТерминалы.Ссылка КАК Регион,
					//Асеев 17.05.2022 (Задача № 4805)<<<
					//Асеев 08.12.2022 (Задача № 4945)>>>
					|	ВТ_Таб.КонтактнаяИнформация КАК КонтактнаяИнформация,
					//Асеев 08.12.2022 (Задача № 4945)<<<
					//Асеев 20.12.2022 (Задача № 4957)>>>
					|	ВТ_Таб.Наименование КАК Наименование
					//Асеев 20.12.2022 (Задача № 4957)<<<
		            |ИЗ
		            |	ВТ_Таб КАК ВТ_Таб
		            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СкладыМагазинов КАК СкладыМагазинов
		            |		ПО ВТ_Таб.Ид = СкладыМагазинов.Код
					//Асеев 17.05.2022 (Задача № 4805)>>>
					|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РегиональныеТерминалы КАК РегиональныеТерминалы
					|		ПО ВТ_Таб.КодРегиона = РегиональныеТерминалы.Код
					//Асеев 17.05.2022 (Задача № 4805)<<<
					|";
		Зап.УстановитьПараметр("Таб", НТаб);
		
		Выб = Зап.Выполнить().Выбрать();
		
		Пока Выб.Следующий() Цикл
			//Если Не ЗначениеЗаполнено(Выб.Склад)  Тогда
			//	// По Задача № 3363 убрана проверка заполненности реквизитов
			//	Продолжить;
			//КонецЕсли;	
			
			Склад = Выб.Склад.ПолучитьОбъект();
			Склад.ТелефонныйНомерПриЗабореТовара = Выб.НомерТелефона;
			Склад.Адрес = Выб.Адрес; // Задача № 3363
			//Асеев 17.05.2022 (Задача № 4805)>>>
			Склад.Регион = Выб.Регион;
			//Асеев 17.05.2022 (Задача № 4805)<<<
			//Асеев 08.12.2022 (Задача № 4945)>>>
			Склад.КонтактнаяИнформация = Выб.КонтактнаяИнформация;
			//Асеев 08.12.2022 (Задача № 4945)<<<
			//Асеев 20.12.2022 (Задача № 4957)>>>
			Склад.Наименование = Выб.Наименование;
			//Асеев 20.12.2022 (Задача № 4957)<<<
			Склад.Записать();
			
		КонецЦикла;	
		
		Запись = РегистрыСведений.ПараметрыРегламентныхЗаданий.СоздатьНаборЗаписей();
		Запись.Отбор.Ключ.Установить("ПоследняяДатаЗагрузкиСкладовМагазинов");
		Запись.Прочитать();
		Если Запись.Количество() = 0 Тогда
			НоваяЗапись = Запись.Добавить();
		Иначе
			НоваяЗапись = Запись[0];
		КонецЕсли;
		НоваяЗапись.Ключ = "ПоследняяДатаЗагрузкиСкладовМагазинов";
		НоваяЗапись.Значение = lem.ДатаВСтроку(ТекущаяДата());
		Попытка
			Запись.Записать();
		Исключение
			//ЗаписатьЛог(9, "Ошибка обновления границы загрузки СКЛАДОВ МАГАЗИНОВ. " + ОписаниеОшибки());
		КонецПопытки;
		
	КонецЕсли; 
КонецПроцедуры	