

&НаКлиенте
Процедура УстановитьНастройку(Команда)
	ЗаписатьНастйроки();
КонецПроцедуры

Процедура ЗаписатьНастйроки()
	НовЗап = РегистрыСведений.НастройкиУчетаОбщие.СоздатьМенеджерЗаписи();
	НовЗап.Период = ТекущаяДата();
	НовЗап.ПовышающийКоэффициентТарификацииКилометража = ПовышающийКоэффициентТарификацииКилометража;
	НовЗап.СистемаРаспознаванияАдресов = СистемаРаспознаванияАдресов;
	НовЗап.ТипИнформированияПолучателейЗаказов = ТипИнформированияПолучателейЗаказов;
	НовЗап.МетодикаТарификацииЗаборов = МетодикаТарификацииЗаборов;
	//+Степанов Задача № 3503 на форму добавлен реквизит СистемаРаспознаванияАдресовПриРучнойПривязке
	НовЗап.СистемаРаспознаванияАдресовПриРучнойПривязке = СистемаРаспознаванияАдресовПриРучнойПривязке;
	НовЗап.ПричинаОтказаПереносаПриОтменеЗаказаПартнеромВРейсе = ПричинаОтказаПереносаПриОтменеЗаказаПартнеромВРейсе;
	НовЗап.ПричинаОтказаПереносаПриСменеДатыДоставкиЗаказаПартнеромВРейсе = ПричинаОтказаПереносаПриСменеДатыДоставкиЗаказаПартнеромВРейсе;
	
	НовЗап.ПричинаОтказаПереносаПриВыполненииЗаказаСРанееПеренесеннойДатой = ПричинаОтказаПереносаПриВыполненииЗаказаСРанееПеренесеннойДатой;
	НовЗап.МодельТерминалаAssist = МодельТерминалаAssist;
	НовЗап.ОбъединениеФункционалаЛогистаИКассира = ОбъединениеФункционалаЛогистаИКассира;
	
	НовЗап.НеПечататьБланкиЗаказовПоЗаказамДоставки = НеПечататьБланкиЗаказовПоЗаказамДоставки;
	НовЗап.ПечатьБланковЗаказовКоличествоПозицийВЗаказе = ПечатьБланковЗаказовКоличествоПозицийВЗаказе;
	НовЗап.ПричинаОтказаПереносаПриПереносеДатыДоставкиЗаказаПриЗагрузкеЗаказаИзАдминки = ПричинаОтказаПереносаПриПереносеДатыДоставкиЗаказаПриЗагрузкеЗаказаИзАдминки;
	
	НовЗап.ПричинаОтказаПереносаОтменаПолучателем = ПричинаОтказаПереносаОтменаПолучателем;
	НовЗап.ГруппаКонтрагентовДляЗагрузкиИзБП = ГруппаКонтрагентовДляЗагрузкиИзБП;
	
	НовЗап.Записать(Истина);	
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//+Степанов Задача № 3503 на форму добавлен реквизит СистемаРаспознаванияАдресовПриРучнойПривязке
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НастройкиУчетаОбщиеСрезПоследних.ПовышающийКоэффициентТарификацииКилометража КАК ПовышающийКоэффициентТарификацииКилометража,
	               |	НастройкиУчетаОбщиеСрезПоследних.СистемаРаспознаванияАдресов КАК СистемаРаспознаванияАдресов,
	               |	НастройкиУчетаОбщиеСрезПоследних.ТипИнформированияПолучателейЗаказов КАК ТипИнформированияПолучателейЗаказов,
	               |	НастройкиУчетаОбщиеСрезПоследних.МетодикаТарификацииЗаборов КАК МетодикаТарификацииЗаборов,
	               |	НастройкиУчетаОбщиеСрезПоследних.СистемаРаспознаванияАдресовПриРучнойПривязке КАК СистемаРаспознаванияАдресовПриРучнойПривязке,
	               |	НастройкиУчетаОбщиеСрезПоследних.ПричинаОтказаПереносаПриОтменеЗаказаПартнеромВРейсе КАК ПричинаОтказаПереносаПриОтменеЗаказаПартнеромВРейсе,
	               |	НастройкиУчетаОбщиеСрезПоследних.ПричинаОтказаПереносаПриСменеДатыДоставкиЗаказаПартнеромВРейсе КАК ПричинаОтказаПереносаПриСменеДатыДоставкиЗаказаПартнеромВРейсе,
	               |	НастройкиУчетаОбщиеСрезПоследних.ПричинаОтказаПереносаПриВыполненииЗаказаСРанееПеренесеннойДатой КАК ПричинаОтказаПереносаПриВыполненииЗаказаСРанееПеренесеннойДатой,
	               |	НастройкиУчетаОбщиеСрезПоследних.ПричинаОтказаПереносаОтменаПолучателем КАК ПричинаОтказаПереносаОтменаПолучателем,
	               |	НастройкиУчетаОбщиеСрезПоследних.ОбъединениеФункционалаЛогистаИКассира КАК ОбъединениеФункционалаЛогистаИКассира,
	               |	НастройкиУчетаОбщиеСрезПоследних.МодельТерминалаAssist КАК МодельТерминалаAssist,
	               |	НастройкиУчетаОбщиеСрезПоследних.НеПечататьБланкиЗаказовПоЗаказамДоставки КАК НеПечататьБланкиЗаказовПоЗаказамДоставки,
	               |	НастройкиУчетаОбщиеСрезПоследних.ПечатьБланковЗаказовКоличествоПозицийВЗаказе КАК ПечатьБланковЗаказовКоличествоПозицийВЗаказе,
				   |	НастройкиУчетаОбщиеСрезПоследних.ПричинаОтказаПереносаПриПереносеДатыДоставкиЗаказаПриЗагрузкеЗаказаИзАдминки КАК ПричинаОтказаПереносаПриПереносеДатыДоставкиЗаказаПриЗагрузкеЗаказаИзАдминки,
				   |	НастройкиУчетаОбщиеСрезПоследних.ГруппаКонтрагентовДляЗагрузкиИзБП КАК ГруппаКонтрагентовДляЗагрузкиИзБП
	               |ИЗ
	               |	РегистрСведений.НастройкиУчетаОбщие.СрезПоследних КАК НастройкиУчетаОбщиеСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПовышающийКоэффициентТарификацииКилометража  = Выборка.ПовышающийКоэффициентТарификацииКилометража;
		СистемаРаспознаванияАдресов = Выборка.СистемаРаспознаванияАдресов;
		ТипИнформированияПолучателейЗаказов = Выборка.ТипИнформированияПолучателейЗаказов;
		МетодикаТарификацииЗаборов = Выборка.МетодикаТарификацииЗаборов;
		СистемаРаспознаванияАдресовПриРучнойПривязке = Выборка.СистемаРаспознаванияАдресовПриРучнойПривязке;
		ПричинаОтказаПереносаПриОтменеЗаказаПартнеромВРейсе = Выборка.ПричинаОтказаПереносаПриОтменеЗаказаПартнеромВРейсе;
		ПричинаОтказаПереносаПриСменеДатыДоставкиЗаказаПартнеромВРейсе = Выборка.ПричинаОтказаПереносаПриСменеДатыДоставкиЗаказаПартнеромВРейсе;
		ПричинаОтказаПереносаПриВыполненииЗаказаСРанееПеренесеннойДатой = Выборка.ПричинаОтказаПереносаПриВыполненииЗаказаСРанееПеренесеннойДатой;
		ОбъединениеФункционалаЛогистаИКассира = Выборка.ОбъединениеФункционалаЛогистаИКассира;  
		ПричинаОтказаПереносаОтменаПолучателем = Выборка.ПричинаОтказаПереносаОтменаПолучателем;
		НеПечататьБланкиЗаказовПоЗаказамДоставки = Выборка.НеПечататьБланкиЗаказовПоЗаказамДоставки;
		ПечатьБланковЗаказовКоличествоПозицийВЗаказе = Выборка.ПечатьБланковЗаказовКоличествоПозицийВЗаказе;
		ПричинаОтказаПереносаПриПереносеДатыДоставкиЗаказаПриЗагрузкеЗаказаИзАдминки = Выборка.ПричинаОтказаПереносаПриПереносеДатыДоставкиЗаказаПриЗагрузкеЗаказаИзАдминки;
		МодельТерминалаAssist = Выборка.МодельТерминалаAssist;
		ГруппаКонтрагентовДляЗагрузкиИзБП = Выборка.ГруппаКонтрагентовДляЗагрузкиИзБП;
	КонецЦикла;	
КонецПроцедуры


