
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//ТолькоПросмотр = Истина;
КонецПроцедуры

&НаСервере
Процедура ОбновитьТранзакциюНаСервере()
	// Вставить содержимое обработчика.
	Об = РеквизитФормыВЗначение("Объект", Тип("ДокументОбъект.ДанныеЗаказаВодителя"));
	Об.ОбновлениеТранзакцийРегламент();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТранзакцию(Команда)
	ОбновитьТранзакциюНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьДанныеЗабораНаСервере()
	Об = РеквизитФормыВЗначение("Объект", Тип("ДокументОбъект.ДанныеЗаказаВодителя"));
	Об.ОбновлениеСтатусовЗаборовВАдминке(231);
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьДанныеЗабора(Команда)
	ВыгрузитьДанныеЗабораНаСервере();
КонецПроцедуры
