
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьПредварительная)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьПредварительная(ТабДок, ПараметрКоманды);

	//Асеев 20.05.2022 (Задача № 4809)>>>
	Если Не ТабДок.ВысотаТаблицы Тогда
		Возврат;
	КонецЕсли;
	//Асеев 20.05.2022 (Задача № 4809)<<<
	
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура ПечатьПредварительная(ТабДок, ПараметрКоманды)
	Документы.НаборнаяВедомостьДляВозврата.ПечатьПредварительная(ТабДок, ПараметрКоманды);
КонецПроцедуры
