
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр КонтрольВремени
	Движения.КонтрольВремени.Записывать = Истина;
	Движения.КонтрольВремени.Очистить();
	Движение = Движения.КонтрольВремени.Добавить();
	Движение.Период = Дата;
	Движение.Событие = Событие;
	Движение.Рейс = Рейс;
	Движение.Контрагент = Контрагент;
	Движение.Терминал = Терминал;
	Движение.ОкончаниеСобытия = ОкончаниеСобытия;
	Движение.РабочееМесто = РабочееМесто;
	Движение.Пользователь = Пользователь;
	Движение.ДатаРейсов = ДатаРейсов;
КонецПроцедуры
