&НаКлиенте
Функция СделатьФотоснимок(КачествоФото = 100, ЧерноБелоеФото = Ложь, ОтметкаНаФотоснимке = Ложь) Экспорт   //Документ, Заказ
	#Если МобильноеПриложениеКлиент Тогда
		Если Не СредстваМультимедиа.ПоддерживаетсяФотоснимок(ТипКамерыУстройства.Задняя) Тогда
			Сообщить("Фотосъёмка не поддерживается на данном устройстве!", СтатусСообщения.ОченьВажное);
			Возврат Неопределено;
		КонецеСли;
		
		Если ОтметкаНаФотоснимке Тогда
			ОтметкаФото = Новый ОтметкаНаФотоснимке;
			ОтметкаФото.ОтметкаДаты = Истина;
			ОтметкаФото.Текст = "КС СТРИЖ";
		Иначе
			ОтметкаФото = Неопределено;
		КонецеСли;	
		
		
		Данные = СредстваМультимедиа.СделатьФотоснимок(ТипКамерыУстройства.Задняя, , КачествоФото, ЧерноБелоеФото,, ОтметкаФото);
		Если Данные <> Неопределено Тогда
			Струк = Новый Структура;
			Струк.Вставить("Данные", Данные.ПолучитьДвоичныеДанные());
			Струк.Вставить("РасширениеФайла", Данные.РасширениеФайла);
			Струк.Вставить("ТипСодержимого", Данные.ТипСодержимого);
			
			Возврат Струк;
		Иначе
			Возврат Неопределено;
		КонецеСли;	
	#КонецЕсли
КонецФункции
