
//Асеев 01.09.2020 (Задача № 4179)>>>
Функция ЕстьНесформированнаяПогрузкаВСписке(МассивПогрузок) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Погрузки", МассивПогрузок);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК Поле1
	|ИЗ
	|	Документ.ПогрузкаВАвто КАК ПогрузкаВАвто
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетПогрузкиЗаказовВТранспорт КАК УчетПогрузкиЗаказовВТранспорт
	|		ПО ПогрузкаВАвто.Ссылка = УчетПогрузкиЗаказовВТранспорт.Регистратор
	|ГДЕ
	|	ПогрузкаВАвто.Ссылка В(&Погрузки)
	|	И УчетПогрузкиЗаказовВТранспорт.Регистратор ЕСТЬ NULL";
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции
//Асеев 01.09.2020 (Задача № 4179)<<<
