//&НаСервере
Функция ПолучитьТипАдресаФинальнойТочкиМаршрутаРейса(ВыбранныйРейс) Экспорт
	Возврат ВыбранныйРейс.ТипФинальнойТочкиМаршрута;
КонецФункции


Функция ПолучитьШиротуИДолготуФинальнойТочкиМаршрутаРейса(ВыбранныйРейс) Экспорт
	Возврат СтрЗаменить(СокрЛП(ВыбранныйРейс.ШиротаФинальнойТочкиМаршрута) + ";" + СокрЛП(ВыбранныйРейс.ДолготаФинальнойТочкиМаршрута), ",", ".");
КонецФункции

//&НаСервере
Процедура ЗафиксироватьФинальнуюТочкуРейса(Данные, ВыбранныйРейс) Экспорт
	Рейс = ВыбранныйРейс.ПолучитьОбъект();
	Рейс.ТипФинальнойТочкиМаршрута = Данные.ТипАдреса;
	Рейс.АдресФинальнойТочкиМаршрута = Данные.РаспознанныйАдрес;
	Рейс.ШиротаФинальнойТочкиМаршрута = Данные.Широта;
	Рейс.ДолготаФинальнойТочкиМаршрута = Данные.Долгота;
	Рейс.Записать(РежимЗаписиДокумента.Запись);
КонецПроцедуры

&НаСервере
Функция РаспечатанМЛ(ВыбранныйРейс) Экспорт
	Возврат ВыбранныйРейс.РаспечатанМЛ;
КонецФункции

&НаСервере
Функция НадоЗапрашиватьЯММаршрутизациюПослеФиксацииМаршрута() Экспорт
	Возврат Константы.ЗапрашиватьЯндексМаршрутизациюПослеПостроенияМаршрута.Получить();
КонецФункции

&НаСервере
Функция СобратьДанныеЗаказовДляМаршрутизацииЯМ(ВыбранныйРейс) Экспорт
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	Заказ.Номер КАК Номер,
	            |	Заказ.ПорядокСортировки КАК ПорядокСортировки,
	            |	Заказ.Ссылка КАК Заказ
	            |ИЗ
	            |	Документ.Заказ КАК Заказ
	            |ГДЕ
	            |	Заказ.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.РезультатыДоставки.КДоставке)
	            |	И Заказ.Рейс = &Рейс";
	Зап.УстановитьПараметр("Рейс", ВыбранныйРейс.Ссылка);
	
	МасСтруктур = Новый Массив;
	
	Выб = Зап.Выполнить().Выбрать();
	Пока Выб.Следующий() Цикл
		Струк = Новый Структура;
		Струк.Вставить("strizhId", Выб.Номер);
		Струк.Вставить("routeIndex", Выб.ПорядокСортировки);
		МасСтруктур.Добавить(Струк);
	КонецЦикла;	                      
	
	Возврат МасСтруктур;
КонецФункции

Функция ПолучитьДопПараметрыРейсаЯМаршрутизации(ВыбранныйРейс) Экспорт
	Струк = Новый Структура;
	Струк.Вставить("typeFinalPoint", ВыбранныйРейс.ТипФинальнойТочкиМаршрута);
	Струк.Вставить("addressFinalPoint", ВыбранныйРейс.АдресФинальнойТочкиМаршрута);
	Струк.Вставить("latFinalPoint", ВыбранныйРейс.ШиротаФинальнойТочкиМаршрута);
	Струк.Вставить("longFinalPoint", ВыбранныйРейс.ДолготаФинальнойТочкиМаршрута);
	Возврат Струк;
КонецФункции
