
&НаКлиенте
Процедура ЗакрытьНачисление(Команда)
	
	Если Не Элементы.Список.ТекущаяСтрока = Неопределено Тогда
		докЗакрыт = ЗакрытьДокументДляИзменения(Элементы.Список.ТекущиеДанные.ЗакрытДляРедактирования);
		Элементы.Список.ТекущиеДанные.ЗакрытДляРедактирования 	= докЗакрыт;
		Элементы.ФормаЗакрытьНачисление.Пометка 				= докЗакрыт;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если Не Элемент.ТекущаяСтрока = Неопределено Тогда
		Если Элемент.ТекущаяСтрока.Проведен Тогда
			Элементы.ФормаЗакрытьНачисление.Доступность = Истина;
			Элементы.ФормаЗакрытьНачисление.Пометка 	= Элемент.ТекущиеДанные.ЗакрытДляРедактирования;
		Иначе
			Элементы.ФормаЗакрытьНачисление.Доступность = Ложь;
		КонецЕсли;	
	КонецЕсли;	
		
КонецПроцедуры

&НаСервере
Функция ЗакрытьДокументДляИзменения(ЗакрытьДокумент)

	Отказ = Ложь;
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	
	РСМенеджер = РегистрыСведений.ДокументыЗакрытыеДляИзменения.СоздатьМенеджерЗаписи();
	РСМенеджер.Документ 			= ТекущаяСтрока.Ссылка;
	РСМенеджер.ДокументРегистратор 	= ТекущаяСтрока.Ссылка;
	РСМенеджер.Активность 				= Истина;
	РСМенеджер.ЗакрытДляРедактирования 	= Не ЗакрытьДокумент;//обратное дейстиве, поэтому в параметр НЕ
	РСМенеджер.Период 					= ТекущаяДата();
	РСМенеджер.Пользователь 			= ПараметрыСеанса.ТекущийПользователь;
	РСМенеджер.Записать();
	Возврат РСМенеджер.ЗакрытДляРедактирования;
	
КонецФункции