
Процедура ПередЗаписью(Отказ)
	// Вставить содержимое обработчика.
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	            |	зпИсходныеДанныеРасчетаЗППоРейсам.Период КАК Период
	            |ИЗ
	            |	РегистрСведений.зпИсходныеДанныеРасчетаЗППоРейсам КАК зпИсходныеДанныеРасчетаЗППоРейсам
	            |ГДЕ
	            |	зпИсходныеДанныеРасчетаЗППоРейсам.СпособРасчетаПроцентаВыполняемости = &СпособРасчетаПроцентаВыполняемости";
	Зап.УстановитьПараметр("СпособРасчетаПроцентаВыполняемости", Ссылка);
	
	Если Не Зап.Выполнить().Пустой() Тогда
		Отказ = Истина;
		Сообщить("По данному способу выполнения существуюжт записи в расчете ЗП!");
	КонецЕсли;	
КонецПроцедуры
