Перем ДеревоСтраниц Экспорт;
Перем соИнтерфейсыСтраниц;



Процедура ПодключитьИнтерфейс(Страница, Контейнер, Форма, Панель) Экспорт
	
	Страница.Форма = Форма;
	Страница.Панель = Панель;
	Страница.Контейнер = Контейнер;
	
	Страница.Контейнер.Видимость = Ложь;
	
	Интерфейс = ПолучитьФорму(Страница.Имя, ЭтотОбъект, Новый УникальныйИдентификатор());
	Интерфейс.Страница = Страница;
	соИнтерфейсыСтраниц.Вставить(Страница.Имя, Интерфейс);
	
	Интерфейс.ПодключитьИнтерфейс();
	
	Если Страница.ИмеетСтандартныеКнопки Тогда
		Интерфейс.ОтменитьИзменениеНастройки();
	КонецЕсли;

КонецПроцедуры

Процедура ОтменитьИзменениеНастройки(Страница) Экспорт
	соИнтерфейсыСтраниц[Страница.Имя].ОтменитьИзменениеНастройки();
КонецПроцедуры

Процедура ПрименитьНастройку(Страница, Отказ) Экспорт
	соИнтерфейсыСтраниц[Страница.Имя].ПрименитьНастройку(Отказ);
КонецПроцедуры

Процедура УстановитьНастройкуПоУмолчанию(Страница) Экспорт
	соИнтерфейсыСтраниц[Страница.Имя].УстановитьНастройкуПоУмолчанию();
КонецПроцедуры

Процедура ПоказатьСправку(Страница) Экспорт
	#Если Клиент Тогда
	ОткрытьСправку(Метаданные().Формы[Страница.Имя]);
	#КонецЕсли
КонецПроцедуры

ДеревоСтраниц = Новый ДеревоЗначений;
ДеревоСтраниц.Колонки.Добавить("Представление");
ДеревоСтраниц.Колонки.Добавить("Имя");
ДеревоСтраниц.Колонки.Добавить("ИмеетИнтерфейс", Новый ОписаниеТипов("Булево"));
ДеревоСтраниц.Колонки.Добавить("ИмеетСтандартныеКнопки", Новый ОписаниеТипов("Булево"));
ДеревоСтраниц.Колонки.Добавить("НеОтображатьВНастройке", Новый ОписаниеТипов("Булево"));
ДеревоСтраниц.Колонки.Добавить("ОтображатьВПомощникеНачалаРаботы", Новый ОписаниеТипов("Булево"));
ДеревоСтраниц.Колонки.Добавить("Форма");
ДеревоСтраниц.Колонки.Добавить("Панель");
ДеревоСтраниц.Колонки.Добавить("Контейнер");
ДеревоСтраниц.Колонки.Добавить("ОбъектСправки");

стрНастройки = ДеревоСтраниц.Строки.Добавить();
стрНастройки.Представление = "Интеграция";

стрНастройка = стрНастройки.Строки.Добавить();
стрНастройка.Представление = "Документы-основания доставки";
стрНастройка.Имя = "ДокументыОснованияДоставки";
стрНастройка.ИмеетИнтерфейс = Истина;
стрНастройка.ИмеетСтандартныеКнопки = Истина;
стрНастройка.НеОтображатьВНастройке = Ложь;
стрНастройка.ОтображатьВПомощникеНачалаРаботы = Истина;

соИнтерфейсыСтраниц = Новый Соответствие;

Интерфейсы = ДеревоСтраниц.Строки.НайтиСтроки(Новый Структура("ИмеетИнтерфейс", Истина), Истина);
Для Каждого стрНастройка Из Интерфейсы Цикл
	стрНастройка.ОбъектСправки = Метаданные().Формы[стрНастройка.Имя];
КонецЦикла;

