
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ
	Движения.мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.Записывать = Истина;
	Движения.мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.Очистить();
	Для Каждого ТекСтрокаСоответствиеСотрудников Из СоответствиеСотрудников Цикл
		Движение = Движения.мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.Добавить();
		Движение.ИсточникДанныхДляРасчетаФОТ = ИсточникДанныхДляРасчетаФОТ;
		Движение.Сотрудник = ТекСтрокаСоответствиеСотрудников.ФИОСотрудника;
		Движение.ТабельныйНомерВИсточнике = ТекСтрокаСоответствиеСотрудников.ТабельныйНомерВИсточнике;
		Движение.Организация = Организация;
	КонецЦикла;
КонецПроцедуры
