
Функция routesDataPOST(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	
	//Асеев 04.06.2021 (Задача № 4551)>>>
	ИмяМетода = Запрос.ПараметрыURL.Получить("ИмяМетода");
	ТекстЗапроса = Запрос.ПолучитьТелоКакСтроку();
	
	//СтруктураОтвета = Новый Структура;
	
	Если ИмяМетода = "getRouteData" Тогда
		МассивЗначенийДат = Новый Массив;
		МассивЗначенийДат.Добавить("routeDate");
		
		ВходныеДанные = МаршрутизацияЗаказовСервер.ДанныеJSONВСтруктуру(ТекстЗапроса, МассивЗначенийДат);
		ОтветМетода = МаршрутизацияЗаказовСервер.ПолучитьДанныеОРейсе(ВходныеДанные);
		СтрокаJSON = МаршрутизацияЗаказовСервер.СформироватьСтрокуJSON(ОтветМетода);
		//Асеев 04.06.2021 (Задача № 4551)<<<
	//Асеев 16.02.2022 (Задача № 4741)>>>
	ИначеЕсли ИмяМетода = "getFiscalDataForOrder" Тогда
		
		ВходныеДанные = МаршрутизацияЗаказовСервер.ДанныеJSONВСтруктуру(ТекстЗапроса);
		ОтветМетода = МаршрутизацияЗаказовСервер.ПолучитьФискальныеДанныеДляЗаказа(ВходныеДанные);
		СтрокаJSON = МаршрутизацияЗаказовСервер.СформироватьСтрокуJSON(ОтветМетода);
		//Асеев 16.02.2022 (Задача № 4741)<<<
	//Асеев 01.03.2022 (Задача № 4751)>>>
	ИначеЕсли ИмяМетода = "getHLNetMonet" Тогда
		
		ВходныеДанные = МаршрутизацияЗаказовСервер.ДанныеJSONВСтруктуру(ТекстЗапроса);
		ОтветМетода = МаршрутизацияЗаказовСервер.ПолучитьГиперссылкуНетМонет(ВходныеДанные);
		СтрокаJSON = МаршрутизацияЗаказовСервер.СформироватьСтрокуJSON(ОтветМетода);
		//Асеев 01.03.2022 (Задача № 4751)<<<
	//Асеев 02.03.2022 (Задача № 4753)>>>
	//ИначеЕсли ИмяМетода = "requeryToComm" Тогда
	//	
	//	ВходныеДанные = МаршрутизацияЗаказовСервер.ДанныеJSONВСтруктуру(ТекстЗапроса);
	//	ОтветМетода = МаршрутизацияЗаказовСервер.ЗафиксироватьЗапросНаСвязьОтПолучателя(ВходныеДанные);
	//	СтрокаJSON = МаршрутизацияЗаказовСервер.СформироватьСтрокуJSON(ОтветМетода);
		//Асеев 02.03.2022 (Задача № 4753)<<<
	//Асеев 08.04.2022 (Задача № 4777)>>>
	ИначеЕсли ИмяМетода = "getCIC" Тогда
		
		ВходныеДанные = МаршрутизацияЗаказовСервер.ДанныеJSONВСтруктуру(ТекстЗапроса);
		ОтветМетода = МаршрутизацияЗаказовСервер.ПолучитьКодИдентификацииКлиента(ВходныеДанные);
		СтрокаJSON = МаршрутизацияЗаказовСервер.СформироватьСтрокуJSON(ОтветМетода);
		//Асеев 08.04.2022 (Задача № 4777)<<<
	КонецЕсли;
	
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON);
	
	
	Возврат Ответ;
КонецФункции
