
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Тариф = мгДоработки.ПолучитьТекущийТариф(Объект.ДатаОкончанияПоездки, ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.МагистральСПБ"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВодительПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Водитель) Тогда
		ДанныеСотрудника = мгДоработки.ПолучитьОрганизациюСотрудника(Объект.Водитель);
		Если ДанныеСотрудника.Количество() = 0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Сотрудник не принят ни в одну организацию";
			Сообщение.Сообщить();
		ИначеЕсли ДанныеСотрудника.Количество() > 1 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Сотрудник принят в несколько организаций, необходимо выбрать организацию сотрудника";
			Сообщение.Сообщить();
		Иначе
			Объект.мгОрганизация = ДанныеСотрудника[0].Организация;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.мгОтветственный = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойОтветственный");
КонецПроцедуры
