
Перем соТекущиеФормы;
Перем КСЛ;

Процедура ПодключитьКСЛ()
	#Если Клиент Тогда
		КСЛ = новаСерверКСЛ.Подключиться(новаКонтекст);
	#Иначе
		КСЛ = новаСерверКСЛ.Подключиться();
	#КонецЕсли
КонецПроцедуры


Функция TryOpen(СсылкаКСЛ) Экспорт
	ПодключитьКСЛ();
	СсылкаПрокси = КСЛ.Wrap(СсылкаКСЛ);
	
	ТипОбъекта = СсылкаПрокси.ТипОбъекта();
	Если ТипОбъекта = "УТЛ.Мониторинг.ТранспортСсылка" Тогда
		#Если Клиент Тогда
		ОткрытьЗначение(Справочники.новаТранспорт.ПолучитьСсылку(Новый УникальныйИдентификатор(СсылкаПрокси.Ид)));
		Возврат Истина;
		#КонецЕсли
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

Процедура CreateForm(Форма) Экспорт
	ФормаОкна = ПолучитьФорму("ФормаОкнаУТЛ",, Новый УникальныйИдентификатор());
	ФормаОкна.ИмяСохраненияПоложенияОкна = Форма.ТипСодержимого;
	ФормаОкна.Форма = Форма;
	ФормаОкна.Диспетчер = ЭтотОбъект;
	
	соТекущиеФормы.Вставить(Форма, ФормаОкна);
	
	ФормаОкна.Открыть();
	ФормаОкна.Активизировать();
КонецПроцедуры

Процедура DeleteForm(Форма) Экспорт
	ФормаОкна = соТекущиеФормы[Форма];
	ФормаОкна.Закрыть();
КонецПроцедуры

Процедура ActivateForm(Форма) Экспорт
	ФормаОкна = соТекущиеФормы[Форма];
	
	ФормаОкна.Открыть();
	ФормаОкна.Активизировать();
КонецПроцедуры

Процедура Dispose() Экспорт
	Для Каждого ЭлФорма Из соТекущиеФормы Цикл
		Если ЭлФорма.Значение.Открыта() Тогда
			ЭлФорма.Значение.Закрыть();
		Иначе
			ЭлФорма.Значение.Dispose();
		КонецЕсли;
	КонецЦикла;
	
	соТекущиеФормы.Очистить();
КонецПроцедуры

Процедура УдалитьФорму(Форма) Экспорт
	Форма.Dispose();
	соТекущиеФормы.Удалить(Форма.Форма);
КонецПроцедуры


соТекущиеФормы = Новый Соответствие;