
&НаСервере
Функция ПолучитьКвитанциюНаСервере(Заказ)
	
	Рез = oz_РаботаССервисом.ReportGet(Заказ, 1,, Истина); 
	
	Если Рез.Код = 0 Тогда	
		Возврат Рез.ReportData;		
	КонецЕсли;
	
	Возврат Неопределено;	
	
КонецФункции

&НаКлиенте
Процедура ПолучитьКвитанцию(Команда)
	
	ТекДанные = Элементы.Заказы.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		//НомерОтправления = СокрЛП(ТекДанные.Заказ.НомерВнешнегоЗаказа);
		ДвоичныеДанные = ПолучитьКвитанциюНаСервере(ТекДанные.Заказ);
		
		Если ДвоичныеДанные = Неопределено Тогда
			ПоказатьПредупреждение(,"Нет удалось получить квитанцию по заказу " + ТекДанные.Заказ, 30);
			Возврат;
		КонецЕсли;
		
		ПутьКФайлу = КаталогВременныхФайлов() +  "\" + Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd") + "_Квитанция_" + СокрЛП(ТекДанные.Заказ.Номер) + ".pdf";
		
		ДвоичныеДанные.Записать(ПутьКФайлу);
		ЗапуститьПриложение(ПутьКФайлу);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьТоварныйЧек(Команда)
	
	ТекДанные = Элементы.Заказы.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		//НомерОтправления = СокрЛП(ТекДанные.Заказ.НомерВнешнегоЗаказа);
		ДвоичныеДанные = ПолучитьТоварныйЧекНаСервере(ТекДанные.Заказ);
		
		Если ДвоичныеДанные = Неопределено Тогда
			ПоказатьПредупреждение(,"Нет удалось получить товарный чек по заказу " + ТекДанные.Заказ, 30);
			Возврат;
		КонецЕсли;
		
		ПутьКФайлу = КаталогВременныхФайлов() +  "\" + Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd") + "_ТоварныйЧек_" + СокрЛП(ТекДанные.Заказ.Номер) + ".pdf";
		
		ДвоичныеДанные.Записать(ПутьКФайлу);
		ЗапуститьПриложение(ПутьКФайлу);
	КонецЕсли;

КонецПроцедуры


Функция ПолучитьТоварныйЧекНаСервере(Заказ)
	
	
	
	Рез = oz_РаботаССервисом.ReportGet(Заказ, 1, "SAPostingCashMemo", Истина); 
	
	Если Рез.Код = 0 Тогда	
		Возврат Рез.ReportData;		
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции // ()


// Якурнов 05.10.2018 11:47:13
&НаКлиенте
Процедура ФактическийПриходЗаказовНаСкладПриИзменении(Элемент)
КонецПроцедуры

