Функция ПроверитьСтатусыНаНевыгруженностьВЦБ(ДатаПроверки) Экспорт
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	ДанныеЗаказаВодителяИзменения.Ссылка.Ссылка КАК Данные,
	            |	ДанныеЗаказаВодителяИзменения.Ссылка.Реализация КАК Заказ
	            |ИЗ
	            |	Документ.ДанныеЗаказаВодителя.Изменения КАК ДанныеЗаказаВодителяИзменения
	            |ГДЕ
	            |	ДанныеЗаказаВодителяИзменения.Узел = &Узел
	            |	И ДанныеЗаказаВодителяИзменения.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон";
	Зап.УстановитьПараметр("ДатаНач", НачалоДня(ДатаПроверки));
	Зап.УстановитьПараметр("ДатаКон", КонецДня(ДатаПроверки));
	Зап.УстановитьПараметр("Узел", Константы.УзелПланаОбмена.Получить());
	
	Рез = Зап.Выполнить();
	
	Возврат Рез.Пустой();
КонецФункции	

Функция ПроверитьНаличиеНевыгруженныхТранзакцийAssist(ДатаПроверки) Экспорт
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	ТранзакцииAssistИзменения.Заказ КАК Заказ
	            |ИЗ
	            |	РегистрСведений.ТранзакцииAssist.Изменения КАК ТранзакцииAssistИзменения
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТранзакцииAssist КАК ТранзакцииAssist
	            |		ПО ТранзакцииAssistИзменения.Период = ТранзакцииAssist.Период
	            |			И ТранзакцииAssistИзменения.Заказ = ТранзакцииAssist.Заказ
	            |			И (ТранзакцииAssist.Оплачен = ИСТИНА)
	            |ГДЕ
	            |	ТранзакцииAssistИзменения.Узел = &Узел
	            |	И ТранзакцииAssistИзменения.Период МЕЖДУ &ДатаНач И &ДатаКон";
	Зап.УстановитьПараметр("ДатаНач", НачалоДня(ДатаПроверки));
	Зап.УстановитьПараметр("ДатаКон", КонецДня(ДатаПроверки));
	Зап.УстановитьПараметр("Узел", Константы.УзелПланаОбмена.Получить());
	
	Рез = Зап.Выполнить();
	
	Возврат Рез.Пустой();
КонецФункции	