
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр СформированныеЭкипажи
	Движения.СформированныеЭкипажи.Записывать = Истина;
	Движения.СформированныеЭкипажи.Очистить();
	
	Для Каждого ТекСтрокаЭкипажи Из Экипажи Цикл
		Движение = Движения.СформированныеЭкипажи.Добавить();
		Движение.Период = Дата;
		Движение.Регион = Регион;
		Движение.Транспорт = ТекСтрокаЭкипажи.Транспорт;
		Движение.Водитель = ТекСтрокаЭкипажи.Водитель;
		Движение.Экспедитор = ТекСтрокаЭкипажи.Экспедитор;
		Движение.Пользователь = Пользователь;
	КонецЦикла;

КонецПроцедуры
