
&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если Объект.Ссылка.Пустая() Тогда
		
		ЗаполнитьТЧ();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыПоказателейКатегорийЗаказовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ВидыПоказателейКатегорийЗаказовПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОповеститьОВыборе(Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧ()
	
	Для Каждого видПоказателя Из Перечисления.зпВидыПоказателейКатегорийЗаказов Цикл
		
		строкаТЧ = Объект.ВидыПоказателейКатегорийЗаказов.Добавить();
		строкаТЧ.ВидПоказателяКатегорийЗаказов = видПоказателя;
		
	КонецЦикла;
	
КонецПроцедуры