
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТарифРасчетаЗП = Запись.ТарифРасчетаЗП;
	
	СхемаБрейковОтработанныхДней = ТарифРасчетаЗП.СхемаБрейковОтработанныхДней;
	СхемаБрейковПроцентаВыполненияЗаказов = ТарифРасчетаЗП.СхемаБрейковПроцентаВыполненияЗаказов;
	СхемаБрейковПробегаПоРейсу = ТарифРасчетаЗП.СхемаБрейковПробегаПоРейсу;
	
	ВидМинимальнойСтавкиПриИзмененииНаСервере(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ВидМинимальнойСтавкиПриИзмененииНаСервере(Изменение = Истина)
	
	Если Запись.ВидМинимальнойСтавки = Перечисления.зпВидыМинимальныхСтавок.ЗаДень Тогда
		Если Изменение Тогда
			Запись.БрейкОтработанныхДней = Неопределено;
		КонецЕсли;
		Элементы.БрейкОтработанныхДней.Доступность = Ложь;
		Элементы.ВидДня.Доступность = Истина;
	ИначеЕсли Запись.ВидМинимальнойСтавки = Перечисления.зпВидыМинимальныхСтавок.ЗаМесяц Тогда
		Если Изменение Тогда
			Запись.ВидДня = Неопределено;
		КонецЕсли;
		Элементы.ВидДня.Доступность = Ложь;
		Элементы.БрейкОтработанныхДней.Доступность = Истина;
	Иначе
		Если Изменение Тогда
			Запись.БрейкОтработанныхДней = Неопределено;
			Запись.ВидДня = Неопределено;
		КонецЕсли;
		Элементы.БрейкОтработанныхДней.Доступность = Ложь;
		Элементы.ВидДня.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидМинимальнойСтавкиПриИзменении(Элемент)
	ВидМинимальнойСтавкиПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Запись.Должность.Пустая() Тогда
		Запись.Должность = Запись.Роль;
	КонецЕсли;
	
КонецПроцедуры
