
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.Количество() Тогда
				
		// Определение терминала обработки
		Попытка
			
			ТекТерминал = ПараметрыСеанса.ТерминалДоставки;
				
			Если НЕ ЗначениеЗаполнено(ТекТерминал) Тогда
			
				РегистраторСсылка = ЭтотОбъект.Отбор.Регистратор.Значение;	
				
				Если ТипЗнч(РегистраторСсылка) = Тип("ДокументСсылка.ФактическийПриходЗаказовНаСклад") Тогда		
					ТекТерминал = РегистраторСсылка.ТерминалПриема;					
				ИначеЕсли ТипЗнч(РегистраторСсылка) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда			
					ТекТерминал = РегистраторСсылка.Склад.ТерминалДоставки;
				ИначеЕсли ТипЗнч(РегистраторСсылка) = Тип("ДокументСсылка.новаОтчетВодителя") Тогда				
					ТекТерминал = РегистраторСсылка.ТерминалДоставки;				
				ИначеЕсли ТипЗнч(РегистраторСсылка) = Тип("ДокументСсылка.ЗакрытиеЗаказов") Тогда				
					ТекТерминал = РегистраторСсылка.ТерминалДоставки;				
				ИначеЕсли ТипЗнч(РегистраторСсылка) = Тип("ДокументСсылка.ЗагрузкаСТСД") Тогда				
					ТекТерминал = РегистраторСсылка.ТерминалПриема;				
				ИначеЕсли ТипЗнч(РегистраторСсылка) = Тип("ДокументСсылка.ВозвратЗаказовОтВодителя") Тогда				
					ТекТерминал = РегистраторСсылка.ТерминалДоставки;				
				ИначеЕсли ТипЗнч(РегистраторСсылка) = Тип("ДокументСсылка.ДанныеЗаказаСамовывоза") Тогда				
					Если ЗначениеЗаполнено(РегистраторСсылка.Реализация) Тогда		
						ТекТерминал = РегистраторСсылка.Реализация.ТерминалДоставки;			
					КонецЕсли;						
				ИначеЕсли ТипЗнч(РегистраторСсылка) = Тип("ДокументСсылка.ПриходЗаказовНаСклад") Тогда				
					ТекТерминал = РегистраторСсылка.ТерминалПриема;				
				ИначеЕсли ТипЗнч(РегистраторСсылка) = Тип("ДокументСсылка.НаборнаяВедомостьДляВозврата") Тогда				
					ТекТерминал = РегистраторСсылка.ТерминалДоставки;				
				ИначеЕсли ТипЗнч(РегистраторСсылка) = Тип("ДокументСсылка.УстановкаСтатусовСкладскогоУчета") Тогда				
					ТекТерминал = РегистраторСсылка.ТерминалОбработки;							
				ИначеЕсли ТипЗнч(РегистраторСсылка) = Тип("ДокументСсылка.АктРасхожденияПоПриходу") Тогда				
					Если ЗначениеЗаполнено(РегистраторСсылка.ФактическийПриходЗаказов) Тогда			
						ТекТерминал = РегистраторСсылка.ФактическийПриходЗаказов.ТерминалПриема;			
					КонецЕсли;						
				ИначеЕсли ТипЗнч(РегистраторСсылка) = Тип("ДокументСсылка.ГрупповаяУстановкаСтатусовСкладскогоУчета") Тогда				
					Если ЗначениеЗаполнено(РегистраторСсылка.Основание) Тогда		
						ТекТерминал = РегистраторСсылка.Основание.Склад.ТерминалДоставки;			
					КонецЕсли;						
				ИначеЕсли ТипЗнч(РегистраторСсылка) = Тип("ДокументСсылка.ВнутреннееПеремещениеЗаказов") Тогда			
					ТекТерминал = РегистраторСсылка.ТерминалОтправки;					
				Иначе					
					ТекТерминал = Справочники.РегиональныеТерминалы.ПустаяСсылка();			
				КонецЕсли;
			
			КонецЕсли;
				
		Исключение	
			ТекТерминал = Справочники.РегиональныеТерминалы.ПустаяСсылка();
		КонецПопытки;
	
		
		// Модификация записей
		Если ЗначениеЗаполнено(ТекТерминал) Тогда			
			
			Для каждого Запись Из ЭтотОбъект Цикл			
				Если НЕ ЗначениеЗаполнено(Запись.ТерминалОбработки) Тогда		
					Запись.ТерминалОбработки = ТекТерминал;			
				КонецЕсли;			
			КонецЦикла;		
			
		КонецЕсли;	
		
		
	КонецЕсли;
			
	
КонецПроцедуры
