
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТекущаяСхемаЛогистическихБрейков = МаршрутизацияЗаказовСервер.ОпределитьАктуальнуюСхемуЛогистическихБрейков();
	ОбновитьВидимостьЭлементов();
	
	Если Не РольДоступна("Админы") Тогда
		ТолькоПросмотр = Истина;
	КонецеСли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьЭлементов()
	Если Объект.ИспользоватьИнтервалДоставкиС Тогда
		Элементы.ИнтервалДоставкиС.Видимость = Истина;
	Иначе
		Элементы.ИнтервалДоставкиС.Видимость = Ложь;
	КонецЕсли;
	
	Если Объект.ИспользоватьЛогистическиеБрейки Тогда
		Элементы.ГруппаЛБ.Видимость = Истина;
	Иначе
		Элементы.ГруппаЛБ.Видимость = Ложь;
	КонецЕсли;
	
	Если Объект.ИспользоватьГруппыПолигоновМаршрутизации Тогда
		Элементы.ГруппаПМ.Видимость = Истина;
	Иначе
		Элементы.ГруппаПМ.Видимость = Ложь;
	КонецЕсли;
	
	//+Степанов Задача № 2620 
	Если Объект.ИспользоватьИнтервалДоставкиПо Тогда
		Элементы.ИнтервалДоставкиПо.Видимость = Истина;
	Иначе
		Элементы.ИнтервалДоставкиПо.Видимость = Ложь;
	КонецЕсли;	
	//-Степанов Задача № 2620
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьИнтервалДоставкиСПриИзменении(Элемент)
	ОбновитьВидимостьЭлементов()
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьЛогистическиеБрейкиПриИзменении(Элемент)
	ОбновитьВидимостьЭлементов()
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьГруппыПолигоновМаршрутизацииПриИзменении(Элемент)
	ОбновитьВидимостьЭлементов()
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьИнтервалДоставкиПоПриИзменении(Элемент)
	ОбновитьВидимостьЭлементов();
КонецПроцедуры
