
Функция ЗафиксироватьДанныеВРСAssist(ДанныеКФиксации) Экспорт
	ТекПериод = ТекущаяДата();
	
	Наб = РегистрыСведений.ТранзакцииAssist.СоздатьНаборЗаписей();
	Наб.Отбор.Период.Установить(ТекПериод);
	Наб.Отбор.Заказ.Установить(ДанныеКФиксации.Заказ);
	
	НовЗапись = Наб.Добавить();
	
	ЗаполнитьЗначенияСвойств(НовЗапись, ДанныеКФиксации);
	
	НовЗапись.Период = ТекПериод;
	
	Наб.Записать(Ложь);
	
	Возврат Истина;
КонецФункции	

Функция ПреобразованиеДатыAssist(СтрокаДатыAssist) Экспорт	
	СтрокаДаты = Сред(СтрокаДатыAssist, 7, 4) + 
		Сред(СтрокаДатыAssist, 4, 2) +
		Лев(СтрокаДатыAssist, 2) +
		Сред(СтрокаДатыAssist, 12, 2) +
		Сред(СтрокаДатыAssist, 15, 2) +
		Прав(СтрокаДатыAssist, 2);
		
		
	Возврат Дата(СтрокаДаты);
КонецФункции	

Функция ПолучитьДанныеAssistПоОрганизации(Организация, ИнтернетМагазин = Неопределено) Экспорт
	Если ИнтернетМагазин <> Неопределено Тогда
		Зап = Новый Запрос;
		Зап.Текст = "ВЫБРАТЬ
		|	ИнтернетМагазиныНастройкиAssistПоТерминалам.MerchantId КАК MerchantId,
		|	ИнтернетМагазиныНастройкиAssistПоТерминалам.login КАК login,
		|	ИнтернетМагазиныНастройкиAssistПоТерминалам.password КАК password
		|ИЗ
		|	Справочник.ИнтернетМагазины.НастройкиAssistПоТерминалам КАК ИнтернетМагазиныНастройкиAssistПоТерминалам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.ТекущийРегион КАК ТекущийРегион
		|		ПО ИнтернетМагазиныНастройкиAssistПоТерминалам.РегионДоставки.Ссылка = ТекущийРегион.Значение.Ссылка
		|ГДЕ
		|	ИнтернетМагазиныНастройкиAssistПоТерминалам.Ссылка = &ИнтернетМагазин";
		
		Зап.УстановитьПараметр("ИнтернетМагазин", ИнтернетМагазин);
		Рез = Зап.Выполнить().Выбрать();
		
		Если Не Рез.Следующий() Тогда
			//Возврат Неопределено;
		Иначе
			Струк = Новый Структура;
			Струк.Вставить("MerchantId", Рез.MerchantId); 
			Струк.Вставить("login", Рез.login);  
			Струк.Вставить("password", Рез.password);
			Возврат Струк;
		КонецеСли;	
	КонецЕсли;
	
	
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	|	ОрганизацииНастройкиAssistПоТерминалам.MerchantId КАК MerchantId,
	|	ОрганизацииНастройкиAssistПоТерминалам.login КАК login,
	|	ОрганизацииНастройкиAssistПоТерминалам.password КАК password
	|ИЗ
	|	Справочник.Организации.НастройкиAssistПоТерминалам КАК ОрганизацииНастройкиAssistПоТерминалам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.ТекущийРегион КАК ТекущийРегион
	|		ПО ОрганизацииНастройкиAssistПоТерминалам.РегионДоставки.Ссылка = ТекущийРегион.Значение.Ссылка
	|ГДЕ
	|	ОрганизацииНастройкиAssistПоТерминалам.Ссылка = &Организация";
	
	Зап.УстановитьПараметр("Организация", Организация);
	
	Рез = Зап.Выполнить().Выбрать();
	
	Если Не Рез.Следующий() Тогда
		Возврат Неопределено;
	Иначе
		Струк = Новый Структура;
		Струк.Вставить("MerchantId", Рез.MerchantId); 
		Струк.Вставить("login", Рез.login);  
		Струк.Вставить("password", Рез.password);
		Возврат Струк;
	КонецеСли;	
КонецФункции	