
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Для Каждого видПоказателя Из Перечисления.зпВидыПоказателейКатегорийЗаказов Цикл
			
			строкаТЧ = Объект.ВидыПоказателейКатегорийЗаказов.Добавить();
			строкаТЧ.ВидПоказателяКатегорийЗаказов = видПоказателя;
			
		КонецЦикла;
		
	Иначе	
		
		Элементы.ГрФорма.ТолькоПросмотр = Истина;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		Сообщить("Внимание!!! Ошибка записи, введите наименование!");
		Отказ = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ТипЗаказа) Тогда
		Сообщить("Внимание!!! Ошибка записи, введите тип заказа!");
		Отказ = Истина;
	КонецЕсли;
	
	Для Каждого строкаТЧ Из Объект.ВидыПоказателейКатегорийЗаказов Цикл
		
		Если строкаТЧ.ВидПоказателяДоступен 
			И строкаТЧ.ВидПоказателяКатегорийЗаказов  = Перечисления.зпВидыПоказателейКатегорийЗаказов.ЗначениеРеквизитаЗаказа 
			И Не ЗначениеЗаполнено(строкаТЧ.ИмяРеквизита) Тогда
			Сообщить("Внимание!!! Ошибка записи, введите имя реквизита в табличной части!");
			Отказ = Истина;	
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры
