&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыСпискаМетодовAPI();
	
КонецПроцедуры

&НаСервере
Процедура ПараметрыСпискаМетодовAPI(API = Неопределено)
	
	СписокМетодовAPI.Параметры.УстановитьЗначениеПараметра("ПоAPI" , НЕ API = Неопределено);
	СписокМетодовAPI.Параметры.УстановитьЗначениеПараметра("API" , API);
	
КонецПроцедуры	

&НаКлиенте
Процедура СписокAPIПриАктивизацииСтроки(Элемент)	
	
	ТекущиеДанные = Элементы.СписокAPI.ТекущиеДанные;
	Если Не ТекущиеДанные = неопределено Тогда		
		ПараметрыСпискаМетодовAPI(ТекущиеДанные.Ссылка)
	КонецЕсли;

КонецПроцедуры

