
//**** Обработчики событий объекта ****//

//Установка коэффициента опытности по умолчанию
//
Процедура ПередЗаписью(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	Если КоэффициентОпытности = 0 Тогда
		КоэффициентОпытности = 1;		
	КонецЕсли;
	
КонецПроцедуры

//Синхронизация с КСЛ
//
Процедура ПриЗаписи(Отказ)
			
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	//Попытка
	//	новаОбменКСЛ.СохранитьВодителя(ЭтотОбъект);
	//Исключение
	//	#Если Клиент Тогда			
	//		новаОбщиеПроцедуры.СообщитьПользователюОбОшибке("ВнутренняОшибкаСервера", ОписаниеОшибки());
	//	#КонецЕсли
	//	Отказ = Истина;
	//КонецПопытки;
		
КонецПроцедуры

//Синхронизация с КСЛ
//
Процедура ПередУдалением(Отказ)
	
	Попытка
		новаОбменКСЛ.УдалитьВодителя(ЭтотОбъект);
	Исключение
		#Если Клиент Тогда			
			новаОбщиеПроцедуры.СообщитьПользователюОбОшибке("ВнутренняОшибкаСервера", ОписаниеОшибки());
		#КонецЕсли
		Отказ = Истина;
	КонецПопытки;
	
КонецПроцедуры
	
	