
Процедура ОбработкаПроведения(Отказ, Режим)
    //{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
    // Данный фрагмент построен конструктором.
    // При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

    // регистр СтатусыСкладскогоУчета
    Движения.СтатусыСкладскогоУчета.Записывать = Истина;
    Движения.СтатусыСкладскогоУчета.Очистить();
    Для Каждого ТекСтрокаЗаказы Из Заказы Цикл
        Движение = Движения.СтатусыСкладскогоУчета.Добавить();
        Движение.Период = Дата;
        Движение.Заказ = ТекСтрокаЗаказы.Заказ;
        Движение.СтатусСкладскогоУчета = СтатусСкладскогоУчета;
        Движение.ТипЗаказа = ТекСтрокаЗаказы.ТипЗаказа;
    КонецЦикла;

    //}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
