
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	ПараметрыСеанса.ИдентификаторПриложения = Константы.ИдентификаторПриложения.Получить();
	ПараметрыСеанса.ТестоваяСреда = Константы.ТестоваяСреда.Получить();
	ПараметрыСеанса.ТекущийРегион = Константы.ТекущийРегион.Получить();
	ПараметрыСеанса.ВремяНачалаНовогоОперативногоДня = Константы.ВремяНачалаНовогоОперативногоДня.Получить();
	ПараметрыСеанса.УзелПланаОбменаССерверомСканирования = Константы.УзелПланаОбменаССерверомСканирования.Получить();
	ПараметрыСеанса.ПериодАвтообмена = Константы.ПериодАвтообмена.Получить();
	ПараметрыСеанса.НомерТСД = Константы.НомерТСД.Получить();
	ПараметрыСеанса.ГоризонтальныйИнтерфейс = Константы.ГоризонтальныйИнтерфейс.Получить();
КонецПроцедуры
