
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	//Если НЕ РольДоступна("Админы") И НЕ РольДоступна("ЗаведующийСкладом") Тогда
	//	
	//	Элементы.Код.Видимость = Ложь;
	//	Элементы.Наименование.Видимость = Ложь;
	//	Элементы.Владелец.Видимость = Ложь;
	//	Элементы.ИдентификаторНаправления.Видимость = Ложь;
	//	Элементы.СкладПоУмолчанию.Видимость = Ложь;
	//	
	//КонецЕсли;	
	//
	//Если НЕ РольДоступна("Админы") Тогда
	//
	//	Элементы.ИдентификаторНаправления.Доступность = Ложь;
	//
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ РольДоступна("Админы") И НЕ РольДоступна("ЗаведующийСкладом") Тогда
		
		Элементы.Код.Видимость = Ложь;
		Элементы.Наименование.Видимость = Ложь;
		Элементы.Владелец.Видимость = Ложь;
		Элементы.ИдентификаторНаправления.Видимость = Ложь;
		Элементы.СкладПоУмолчанию.Видимость = Ложь;
		
	КонецЕсли;	
	
	Если НЕ РольДоступна("Админы") Тогда
	
		Элементы.ИдентификаторНаправления.Доступность = Ложь;
	
	КонецЕсли;

	
КонецПроцедуры
