
&НаКлиенте
Процедура ВодителиПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Элементы.Водители.ТекущиеДанные.КоличествоСтавок = 1;
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
	// Миго-групп ШушлебинДА {
	// 05.06.2017 Изменен алгоритм получения тарифа
	//было
	////Серегин М.В. 29.04.2015 13:26:41 добавил провекру на ЭтоНовый(), незачем менять тариф в уже созданом докумнет
	//Если Параметры.Ключ.Пустая() Тогда
	//    З = РегистрыСведений.ТарифыНочныхСменВодителей.ПолучитьПоследнее(КонецДня(ТекущаяДата()));
	//    Объект.Тариф = З.Тариф;
	//КонецЕсли;
	//стало
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Тариф = мгДоработки.ПолучитьТекущийТариф(Объект.Дата, ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.НочнойВодитель"));
	КонецЕсли;
	//} ШушлебинДА
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцСтрокаПриИзменении(Элемент)
	
	РаботаСДиалогами.ДатаКакМесяцПодобратьДатуПоТексту(МесяцСтрока, Объект.ПериодРегистрации);
	МесяцСтрока = РаботаСДиалогами.ДатаКакМесяцПредставление(Объект.ПериодРегистрации);
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцСтрокаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	Объект.ПериодРегистрации = ДобавитьМесяц(Объект.ПериодРегистрации, Направление);
	МесяцСтрока = РаботаСДиалогами.ДатаКакМесяцПредставление(Объект.ПериодРегистрации);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ПериодРегистрации = НачалоМесяца(Объект.Дата);
	КонецЕсли;
	МесяцСтрока = РаботаСДиалогами.ДатаКакМесяцПредставление(Объект.ПериодРегистрации);
КонецПроцедуры

&НаКлиенте
Процедура ВодителиВодительПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Водители.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.Водитель) Тогда
		ДанныеСотрудника = мгДоработки.ПолучитьОрганизациюСотрудника(ТекущиеДанные.Водитель);
		Если ДанныеСотрудника.Количество() = 0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Сотрудник не принят ни в одну организацию";
			Сообщение.Сообщить();
		ИначеЕсли ДанныеСотрудника.Количество() > 1 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Сотрудник принят в несколько организаций, необходимо выбрать организацию сотрудника";
			Сообщение.Сообщить();
		Иначе
			ТекущиеДанные.мгОрганизация = ДанныеСотрудника[0].Организация;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.мгОтветственный = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойОтветственный");
КонецПроцедуры
