&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЧтениеПараметровРСВзаимосвязьПричинВозвратаOZON()
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если НЕ ЗначениеЗаполнено(oz_ПричиныВозврата) Тогда
		Отказ = Истина;
		Сообщить("Не заполнена ПричиныВозвратаОзон!", СтатусСообщения.ОченьВажное);
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Объект.СторонаПретензии) Тогда
		Отказ = Истина;
		Сообщить("Не заполнена сторона претензии причины!", СтатусСообщения.ОченьВажное);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЧтениеПараметровРСВзаимосвязьПричинВозвратаOZON()

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВзаимосвязьПричинВозвратаOZON.ПричинаВозвратаOZON КАК ПричинаВозвратаOZON,
	                      |	ВзаимосвязьПричинВозвратаOZON.ПричинаВозвратаУТЛ КАК ПричинаВозвратаУТЛ
	                      |ИЗ
	                      |	РегистрСведений.ВзаимосвязьПричинВозвратаOZON КАК ВзаимосвязьПричинВозвратаOZON
	                      |ГДЕ
	                      |	ВзаимосвязьПричинВозвратаOZON.ПричинаВозвратаУТЛ = &ПричинаВозвратаУТЛ");
	Запрос.УстановитьПараметр("ПричинаВозвратаУТЛ", Объект.Ссылка);
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда				
		oz_ПричиныВозврата = Рез.ПричинаВозвратаOZON;
		СтароеЗначениеПричиныOZON = oz_ПричиныВозврата;
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура ЗаписьПараметровРСВзаимосвязьПричинВозвратаOZON()

	ТекВр = ТекущаяДата();
	
	Набор = РегистрыСведений.ВзаимосвязьПричинВозвратаOZON.СоздатьНаборЗаписей();
	Набор.Отбор.ПричинаВозвратаУТЛ.Установить(Объект.Ссылка);
	Набор.Прочитать();
	
	НЗапись = Набор.Добавить();
	НЗапись.ПричинаВозвратаУТЛ = Объект.Ссылка;
	НЗапись.ПричинаВозвратаOZON = oz_ПричиныВозврата;
	НЗапись.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	
	Набор.Записать();	
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(oz_ПричиныВозврата) И СтароеЗначениеПричиныOZON <> oz_ПричиныВозврата Тогда
		ЗаписьПараметровРСВзаимосвязьПричинВозвратаOZON()
	КонецЕсли;	
КонецПроцедуры





