
Процедура ОбработкаПроведения(Отказ, Режим)	
	
	//+Степанов
	Если Не ПроверитьЗаполнение() Тогда 
		Отказ = Истина;
	КонецЕсли;
	//-Степанов
	
	// МАС - 10.01.2018 - для нового механизма --->> 
	Если НЕ НовыйМеханизм Тогда
		// <<--- МАС 
		
		// регистр СтатусыСкладскогоУчета
		Движения.СтатусыСкладскогоУчета.Записывать = Истина;
		Движения.СтатусыСкладскогоУчета.Очистить();		
		
		Для Каждого ТекСтрокаЗаказы Из Заказы Цикл
			//Серегин М.В. 30.07.2015 10:25:49 добавил пометку не возвратного заказа, чтобы товароведы могли вручную отмечать заказы,
			//которые не должны попадать в наборную ведомость
			Если ТекСтрокаЗаказы.ПометкаНеВозвратныйЗаказ Тогда
				Движение = Движения.СтатусыСкладскогоУчета.Добавить();
				Движение.Период = Дата;
				Движение.Заказ = ТекСтрокаЗаказы.Заказ;
				Движение.СтатусСкладскогоУчета = Справочники.СтатусыСкладскогоУчета.ЗаказНеВозвратный;
				//+Степанов
				Движение.ТерминалОбработки = ТерминалДоставки;
				//-Степанов
				Если НЕ ЗначениеЗаполнено(ТекСтрокаЗаказы.ТипЗаказа) Тогда
					Движение.ТипЗаказа = Перечисления.ТипыЗаказов.Доставка;        
				Иначе
					Движение.ТипЗаказа = ТекСтрокаЗаказы.ТипЗаказа;
				КонецЕсли;
			Иначе    
				Если ТекСтрокаЗаказы.ЗаказНайден Тогда
					Движение = Движения.СтатусыСкладскогоУчета.Добавить();
					Движение.Период = Дата;
					//+Степанов
					Движение.ТерминалОбработки = ТерминалДоставки;
					//-Степанов
					Движение.Заказ = ТекСтрокаЗаказы.Заказ;
					Движение.СтатусСкладскогоУчета = ТекСтрокаЗаказы.ТекущийСтатус;
					Если НЕ ЗначениеЗаполнено(ТекСтрокаЗаказы.ТипЗаказа) Тогда
						Движение.ТипЗаказа = Перечисления.ТипыЗаказов.Доставка;        
					Иначе
						Движение.ТипЗаказа = ТекСтрокаЗаказы.ТипЗаказа;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		//ОбновитьСтатусыВАдминке();
		
		// МАС - 10.01.2018 - для нового механизма --->>
	Иначе
		Движения.СтатусыСкладскогоУчета.Записывать = Истина;
		Движения.СтатусыСкладскогоУчета.Очистить();
		
		Для Каждого ТекСтрокаЗаказы Из Заказы Цикл
			
			Если ТекСтрокаЗаказы.ПометкаНеВозвратныйЗаказ Тогда
				Движение = Движения.СтатусыСкладскогоУчета.Добавить();
				Движение.Период = Дата;
				Движение.Заказ = ТекСтрокаЗаказы.Заказ;
				//+Степанов
				Движение.ТерминалОбработки = ТерминалДоставки;
				//-Степанов
				Движение.СтатусСкладскогоУчета = Справочники.СтатусыСкладскогоУчета.ЗаказНеВозвратный;
				Если НЕ ЗначениеЗаполнено(ТекСтрокаЗаказы.ТипЗаказа) Тогда
					Движение.ТипЗаказа = Перечисления.ТипыЗаказов.Доставка;        
				Иначе
					Движение.ТипЗаказа = ТекСтрокаЗаказы.ТипЗаказа;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	// <<--- МАС
	
КонецПроцедуры

Процедура ОбновитьСтатусыВАдминке() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|   НаборнаяВедомостьДляВозвратаЗаказы.Заказ КАК Заказ,
	|   ВЫБОР
	|       КОГДА новаЗаданияРейсов.Рейс ЕСТЬ NULL 
	|           ТОГДА ""411""
	|       ИНАЧЕ ""311""
	|   КОНЕЦ КАК СтатусАдминки
	|ИЗ
	|   Документ.НаборнаяВедомостьДляВозврата.Заказы КАК НаборнаяВедомостьДляВозвратаЗаказы
	|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.новаЗаданияРейсов КАК новаЗаданияРейсов
	|       ПО НаборнаяВедомостьДляВозвратаЗаказы.Заказ.Номер = новаЗаданияРейсов.Доставка.Номер
	|ГДЕ
	|   НаборнаяВедомостьДляВозвратаЗаказы.ЗаказНайден
	|   И НаборнаяВедомостьДляВозвратаЗаказы.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|   НаборнаяВедомостьДляВозвратаЗаказы.Заказ,
	|   ВЫБОР
	|       КОГДА новаЗаданияРейсов.Рейс ЕСТЬ NULL 
	|           ТОГДА ""411""
	|       ИНАЧЕ ""311""
	|   КОНЕЦ
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивСтатусов = Неопределено;// Задача № 2813
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		////Админка+
		//Подкл = Евген.СоздатьПодключениеКИнтернетМагазину();
		//СтрЗапроса = "EXEC import_setOrderStatusIDFrom1C " + Формат(Сокрлп(ВыборкаДетальныеЗаписи.Заказ.Номер), "ЧГ=") + ","+ВыборкаДетальныеЗаписи.СтатусАдминки+",'Подготовка возврата'";
		
		РаботаСоСтатусамиЗаказовСервер.СохранитьСтатус(ВыборкаДетальныеЗаписи.Заказ, ВыборкаДетальныеЗаписи.СтатусАдминки, Ссылка,,ТерминалДоставки);
		// Задача № 3027 //lem.СохранитьСтатус(ВыборкаДетальныеЗаписи.Заказ, ВыборкаДетальныеЗаписи.СтатусАдминки, Ссылка);
		//Евген.ЗапросКИнтернетМагазину(СтрЗапроса, Подкл);
		////Админка-
		
		ДопПараметрыСтатуса = mas.ДобавитьДополнительныйПараметрСтатуса("ProcessingTerminal", Число(ТерминалДоставки.Код)); // Задача № 3027
		
		// Задача № 2813
		МассивСтатусов = mas.ДобавитьПараметрыЗаказаДляУстановкиСтатуса(ВыборкаДетальныеЗаписи.Заказ.Номер, 
		ВыборкаДетальныеЗаписи.СтатусАдминки, 
		"Подготовка возврата",
		,
		,
		МассивСтатусов,
		ДопПараметрыСтатуса); 
		
	КонецЦикла;
	
	СтруктураВозврата = mas.ОтправитьМассивСтатусовЗаказов(МассивСтатусов);// Задача № 2813
	
КонецПроцедуры


Процедура СоздатьНаОсновании() Экспорт
	
	//Для заполнения возвратов     
	мСтруктураПараметровВзаиморасчетов = Новый Структура;
	мСтруктураПараметровВзаиморасчетов.Вставить("СтруктураТабличныхЧастей", Новый Структура("Товары"));
	мСтруктураПараметровВзаиморасчетов.Вставить("Направление", "Поступление");
	мСтруктураПараметровВзаиморасчетов.Вставить("ЕстьЗаказыВТабличныхЧастях", Ложь);
	мСтруктураПараметровВзаиморасчетов.Вставить("ИмяЗаказаВТабличныхЧастях");
	мСтруктураПараметровВзаиморасчетов.Вставить("ЭтоВозврат", Истина);
	мСтруктураПараметровВзаиморасчетов.Вставить("Дата",);
	
	//+++++Серегин М.В. 05.10.2015 15:54:05 костыль 
	Если ЗначениеЗаполнено(ИнтернетМагазин) Тогда 
		МассивКонтрагентов = Новый Массив;
		МассивКонтрагентов.Добавить(ИнтернетМагазин);
	Иначе
		МассивКонтрагентов = ПолучитьКонтрагентов().ВыгрузитьКолонку("Контрагент");
	КонецЕсли;
	
	
	Для каждого Стр Из МассивКонтрагентов Цикл
		
		ДокументВозвратПоставщику = Документы.ВозвратТоваровПоставщику.СоздатьДокумент();
		ЗаполнитьДокументВозвратПоставщику(ДокументВозвратПоставщику,ЭтотОбъект.Ссылка,Стр, мСтруктураПараметровВзаиморасчетов);
		// Михушкин - 05.04.2016 - Заполнение ТЧ Экземпляры документа Возврат товаров поставщику --->> 
		Если СокрЛП(Стр.Код) = "Shop_612" Тогда	
			oz_СформироватьТЧЭкземпляры(ДокументВозвратПоставщику);
		КонецЕсли;
		// <<--- Михушкин 
		Форма = ДокументВозвратПоставщику.ПолучитьФорму("ФормаДокумента");
		Форма.Открыть();	
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДокументВозвратПоставщику(ДокументОбъект,Основание,Контрагент,мСтруктураПараметровВзаиморасчетов)
	
	ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ДокументОбъект, Основание);
	ДокументОбъект.Сделка = Основание;
	ДокументОбъект.Дата = ТекущаяДата();
	ДокументОбъект.Контрагент = Контрагент;
	ДокументОбъект.ДоговорКонтрагента = Контрагент.ОсновнойДоговорКонтрагента;
	
	ДокументОбъект.ТерминалОбработки = Основание.ТерминалДоставки; // Задача № 3045
	
	//Найдем склад текущего пользовотеля
	ТекушийПользователь = глЗначениеПеременной("глТекущийПользователь");
	ДокументОбъект.Склад = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекушийПользователь, "ОсновнойСклад");
	ДокументОбъект.СкладМагазина = Основание.СкладМагазина;
	Если ДокументОбъект.Склад = Неопределено Тогда 
		ДокументОбъект.Склад = Справочники.Склады.ПустаяСсылка();
	КонецЕсли;
	
	//Асеев 20.05.2022 (Задача № 4809)>>>
	ДокументОбъект.ТипВозврата = Основание.ТипВозврата;
	Если ДокументОбъект.ТипВозврата = Справочники.ТипыВозврата.ВнесистемныйВозврат Тогда
		
		ДокументОбъект.ВнесистемныйВозврат.Загрузить(Основание.ВнесистемныйВозврат.Выгрузить());
		
	Иначе
	//Асеев 20.05.2022 (Задача № 4809)<<<
		
		ТаблицаТовары = ПолучитьДанныеПоТоварам( Контрагент);
		Для Каждого ТекСтрокаТовары Из ТаблицаТовары Цикл
			НайденнаяСтрока = Основание.Заказы.Найти(ТекСтрокаТовары.ЗаказРеализация,"Заказ");
			Если ЗначениеЗаполнено(НайденнаяСтрока) Тогда 
				Если НайденнаяСтрока.ЗаказНайден Тогда			
					НоваяСтрока = ДокументОбъект.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекСтрокаТовары);
					НоваяСтрока.Склад = ДокументОбъект.Склад;
					НоваяСтрока.ВнешнийНомерЗаказа = НайденнаяСтрока.Заказ.НомерВнешнегоЗаказа;
					НоваяСтрока.Качество = Справочники.Качество.Новый;
					НоваяСтрока.ТипЗаказа = НайденнаяСтрока.ТипЗаказа;
					НоваяСтрока.КоличествоМестТовара = НайденнаяСтрока.КоличествоМестТовара;				
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		//Серегин М.В. 15.05.2015 11:48:37	
		
		УправлениеВзаиморасчетами.ДополнитьСтруктуруПараметровДляЗаполненияТаблицыДокументовРасчетов(ДокументОбъект, мСтруктураПараметровВзаиморасчетов);
		мСтруктураПараметровВзаиморасчетов.Дата = ТекущаяДата();
		УправлениеВзаиморасчетами.ЗаполнитьТаблицуДокументовРасчетовСКонтрагентом(ДокументОбъект, мСтруктураПараметровВзаиморасчетов);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьНаличиеДоговоров() Экспорт
	
	//+++++Серегин М.В. 05.10.2015 15:54:05 костыль 
	Если ЗначениеЗаполнено(ИнтернетМагазин) Тогда 
		МассивКонтрагентов = Новый Массив;
		МассивКонтрагентов.Добавить(ИнтернетМагазин);
	Иначе
		МассивКонтрагентов = ПолучитьКонтрагентов().ВыгрузитьКолонку("Контрагент");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|   Контрагенты.Наименование
	|ИЗ
	|   Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|   Контрагенты.ОсновнойДоговорКонтрагента = &ОсновнойДоговорКонтрагента
	|   И Контрагенты.Ссылка В(&МассивКонтрагентов)";
	
	Запрос.УстановитьПараметр("ОсновнойДоговорКонтрагента", Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
	Запрос.УстановитьПараметр("МассивКонтрагентов", МассивКонтрагентов);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СтрНетдоговоров = "";
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрНетдоговоров = СтрНетдоговоров+ВыборкаДетальныеЗаписи.Наименование+"; "; 
	КонецЦикла;
	Возврат СтрНетдоговоров;
	
	
КонецФункции // ПроверитьНаличиеДоговоров()


Функция ПолучитьКонтрагентов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|   НаборнаяВедомостьДляВозвратаЗаказы.Контрагент
	|ИЗ
	|   Документ.НаборнаяВедомостьДляВозврата.Заказы КАК НаборнаяВедомостьДляВозвратаЗаказы
	|ГДЕ
	|   НаборнаяВедомостьДляВозвратаЗаказы.Ссылка = &Ссылка
	|   И НаборнаяВедомостьДляВозвратаЗаказы.ЗаказНайден
	|
	|СГРУППИРОВАТЬ ПО
	|   НаборнаяВедомостьДляВозвратаЗаказы.Контрагент";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
	
КонецФункции

Функция ПолучитьДанныеПоТоварам (Контрагент)
	Запрос = Новый Запрос;
	//+Степанов Задача № 3963 В запрос добавлен код маркировки.
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	НаборнаяВедомостьДляВозвратаТовары.Ссылка КАК Ссылка,
	//|	НаборнаяВедомостьДляВозвратаТовары.НомерСтроки КАК НомерСтроки,
	//|	НаборнаяВедомостьДляВозвратаТовары.ЗаказРеализация КАК ЗаказРеализация,
	//|	НаборнаяВедомостьДляВозвратаТовары.Номенклатура КАК Номенклатура,
	//|	НаборнаяВедомостьДляВозвратаТовары.Количество КАК Количество,
	//|	НаборнаяВедомостьДляВозвратаТовары.КоличествоМест КАК КоличествоМест,
	//|	НаборнаяВедомостьДляВозвратаТовары.Цена КАК Цена,
	//|	НаборнаяВедомостьДляВозвратаТовары.Сумма КАК Сумма,
	//|	НаборнаяВедомостьДляВозвратаТовары.СтатусСкладскогоУчета КАК СтатусСкладскогоУчета,
	//|	НаборнаяВедомостьДляВозвратаТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	//|	НаборнаяВедомостьДляВозвратаТовары.ЕдиницаИзмеренияМест КАК ЕдиницаИзмеренияМест,
	//|	НаборнаяВедомостьДляВозвратаТовары.Коэффициент КАК Коэффициент,
	//|	НаборнаяВедомостьДляВозвратаТовары.СтавкаНДС КАК СтавкаНДС,
	//|	НаборнаяВедомостьДляВозвратаТовары.СуммаНДС КАК СуммаНДС,
	//|	НаборнаяВедомостьДляВозвратаТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	//|	НаборнаяВедомостьДляВозвратаТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	//|	НаборнаяВедомостьДляВозвратаТовары.ДокументПоступления КАК ДокументПоступления,
	//|	НаборнаяВедомостьДляВозвратаТовары.Заказ КАК Заказ,
	//|	НаборнаяВедомостьДляВозвратаТовары.Качество КАК Качество,
	//|	НаборнаяВедомостьДляВозвратаТовары.УдалитьПроект КАК УдалитьПроект,
	//|	НаборнаяВедомостьДляВозвратаТовары.Склад КАК Склад,
	//|	НаборнаяВедомостьДляВозвратаТовары.КлючСвязи КАК КлючСвязи,
	//|	НаборнаяВедомостьДляВозвратаТовары.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя,
	//|	НаборнаяВедомостьДляВозвратаТовары.ПричинаВозврата КАК ПричинаВозврата,
	//|	НаборнаяВедомостьДляВозвратаТовары.СтатусДоставки КАК СтатусДоставки,
	//|	НаборнаяВедомостьДляВозвратаТовары.ВнешнийНомерЗаказа КАК ВнешнийНомерЗаказа,
	//|	НаборнаяВедомостьДляВозвратаТовары.Вес КАК Вес,
	//|	НаборнаяВедомостьДляВозвратаТовары.НеНайденНаТСД КАК НеНайденНаТСД,
	//|	НаборнаяВедомостьДляВозвратаТовары.ТипЗаказа КАК ТипЗаказа,
	//|	НаборнаяВедомостьДляВозвратаТовары.ДатаДоставки КАК ДатаДоставки,
	//|	НаборнаяВедомостьДляВозвратаТовары.ЗакрытиеЗаказов КАК ЗакрытиеЗаказов,
	//|	НаборнаяВедомостьДляВозвратаТовары.КоличествоМестТовара КАК КоличествоМестТовара,
	//|	НаборнаяВедомостьДляВозвратаТовары.СкладМагазина КАК СкладМагазина,
	//|	НаборнаяВедомостьДляВозвратаТовары.Контрагент КАК Контрагент,
	////+++ БАО 10.10.2017 №1942 	
	//|	НаборнаяВедомостьДляВозвратаТовары.ШтрихкодНоменклатуры КАК ШтрихкодНоменклатуры
	////--- БАО 10.10.2017 №1942 	
	//|ИЗ
	//|	Документ.НаборнаяВедомостьДляВозврата.Товары КАК НаборнаяВедомостьДляВозвратаТовары
	//|ГДЕ
	//|	ИСТИНА
	//|	И НаборнаяВедомостьДляВозвратаТовары.Контрагент = &Контрагент
	//|	И НаборнаяВедомостьДляВозвратаТовары.Ссылка = &Ссылка";
	////+++++Серегин М.В. 05.10.2015 15:52:43 костыль
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НаборнаяВедомостьДляВозвратаТовары.Ссылка КАК Ссылка,
	|	НаборнаяВедомостьДляВозвратаТовары.НомерСтроки КАК НомерСтроки,
	|	НаборнаяВедомостьДляВозвратаТовары.ЗаказРеализация КАК ЗаказРеализация,
	|	НаборнаяВедомостьДляВозвратаТовары.Номенклатура КАК Номенклатура,
	|	НаборнаяВедомостьДляВозвратаТовары.Количество КАК Количество,
	|	НаборнаяВедомостьДляВозвратаТовары.КоличествоМест КАК КоличествоМест,
	|	НаборнаяВедомостьДляВозвратаТовары.Цена КАК Цена,
	|	НаборнаяВедомостьДляВозвратаТовары.Сумма КАК Сумма,
	|	НаборнаяВедомостьДляВозвратаТовары.СтатусСкладскогоУчета КАК СтатусСкладскогоУчета,
	|	НаборнаяВедомостьДляВозвратаТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	НаборнаяВедомостьДляВозвратаТовары.ЕдиницаИзмеренияМест КАК ЕдиницаИзмеренияМест,
	|	НаборнаяВедомостьДляВозвратаТовары.Коэффициент КАК Коэффициент,
	|	НаборнаяВедомостьДляВозвратаТовары.СтавкаНДС КАК СтавкаНДС,
	|	НаборнаяВедомостьДляВозвратаТовары.СуммаНДС КАК СуммаНДС,
	|	НаборнаяВедомостьДляВозвратаТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	НаборнаяВедомостьДляВозвратаТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	НаборнаяВедомостьДляВозвратаТовары.ДокументПоступления КАК ДокументПоступления,
	|	НаборнаяВедомостьДляВозвратаТовары.Заказ КАК Заказ,
	|	НаборнаяВедомостьДляВозвратаТовары.Качество КАК Качество,
	|	НаборнаяВедомостьДляВозвратаТовары.УдалитьПроект КАК УдалитьПроект,
	|	НаборнаяВедомостьДляВозвратаТовары.Склад КАК Склад,
	|	НаборнаяВедомостьДляВозвратаТовары.КлючСвязи КАК КлючСвязи,
	|	НаборнаяВедомостьДляВозвратаТовары.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя,
	|	НаборнаяВедомостьДляВозвратаТовары.ПричинаВозврата КАК ПричинаВозврата,
	|	НаборнаяВедомостьДляВозвратаТовары.СтатусДоставки КАК СтатусДоставки,
	|	НаборнаяВедомостьДляВозвратаТовары.ВнешнийНомерЗаказа КАК ВнешнийНомерЗаказа,
	|	НаборнаяВедомостьДляВозвратаТовары.Вес КАК Вес,
	|	НаборнаяВедомостьДляВозвратаТовары.НеНайденНаТСД КАК НеНайденНаТСД,
	|	НаборнаяВедомостьДляВозвратаТовары.ТипЗаказа КАК ТипЗаказа,
	|	НаборнаяВедомостьДляВозвратаТовары.ДатаДоставки КАК ДатаДоставки,
	|	НаборнаяВедомостьДляВозвратаТовары.ЗакрытиеЗаказов КАК ЗакрытиеЗаказов,
	|	НаборнаяВедомостьДляВозвратаТовары.КоличествоМестТовара КАК КоличествоМестТовара,
	|	НаборнаяВедомостьДляВозвратаТовары.СкладМагазина КАК СкладМагазина,
	|	НаборнаяВедомостьДляВозвратаТовары.Контрагент КАК Контрагент,
	|	НаборнаяВедомостьДляВозвратаТовары.ШтрихкодНоменклатуры КАК ШтрихкодНоменклатуры,
	|	НаборнаяВедомостьДляВозвратаТовары.КодМаркировки КАК КодМаркировки
	|ИЗ
	|	Документ.НаборнаяВедомостьДляВозврата.Товары КАК НаборнаяВедомостьДляВозвратаТовары
	|ГДЕ
	|	ИСТИНА
	|	И НаборнаяВедомостьДляВозвратаТовары.Контрагент = &Контрагент
	|	И НаборнаяВедомостьДляВозвратаТовары.Ссылка = &Ссылка";
	//+++++Серегин М.В. 05.10.2015 15:52:43 костыль    
	//-Степанов Задача № 3963
	
	
	Если ЗначениеЗаполнено(ИнтернетМагазин) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И НаборнаяВедомостьДляВозвратаТовары.Контрагент = &Контрагент","");
	КонецЕсли;
	//-----Серегин М.В. 05.10.2015 15:53:48 
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ()


Процедура oz_СформироватьТЧЭкземпляры(ДокументОбъект)
	
	// тут заполняем ТЧ отказными экземплярами Озон
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	oz_ОтказныеЭкземплярыТоваров.Ссылка,
	|	oz_ОтказныеЭкземплярыТоваров.Заказ,
	|	oz_ОтказныеЭкземплярыТоваров.Номенклатура
	|ИЗ
	|	Документ.НаборнаяВедомостьДляВозврата.Заказы КАК НаборнаяВедомостьДляВозвратаЗаказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.oz_ОтказныеЭкземплярыТоваров КАК oz_ОтказныеЭкземплярыТоваров
	|		ПО НаборнаяВедомостьДляВозвратаЗаказы.Заказ = oz_ОтказныеЭкземплярыТоваров.Заказ
	|ГДЕ
	|	НаборнаяВедомостьДляВозвратаЗаказы.Ссылка = &Ссылка");	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);	
	Рез = Запрос.Выполнить().Выбрать();
	
	Пока Рез.Следующий() Цикл
		Нстр = ДокументОбъект.Экземпляры.Добавить();
		Нстр.Экземпляр = Рез.Ссылка;		
	КонецЦикла;
	
	
КонецПроцедуры

//+++ БАО 22.08.2017 №1730
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	

	Если ЭтоНовый() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВзаимосвязьДокументов.Документ1 КАК ЗагрузкаСТСД,
		|	ВзаимосвязьДокументов.Документ2 КАК НаборнаяВедомость,
		|	ВЫРАЗИТЬ(ВзаимосвязьДокументов.Документ1 КАК Документ.ЗагрузкаСТСД).ТерминалПриема КАК ТерминалПриема
		|ИЗ
		|	РегистрСведений.ВзаимосвязьДокументов КАК ВзаимосвязьДокументов
		|ГДЕ
		|	ВзаимосвязьДокументов.Документ2 = &Ссылка
		|	И ВзаимосвязьДокументов.Документ1 ССЫЛКА Документ.ЗагрузкаСТСД
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗагрузкаСТСД УБЫВ
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			ТерминалДоставки = Выборка.ТерминалПриема;
			
		КонецЕсли;	
		
		//+Степанов
		Если Не ЗначениеЗаполнено(ТерминалДоставки) Тогда 
			Если ЗначениеЗаполнено(ПараметрыСеанса.ТерминалДоставки) Тогда
				ТерминалДоставки = ПараметрыСеанса.ТерминалДоставки;
			Иначе	
				ТерминалДоставки = Справочники.РегиональныеТерминалы.МоскваСтриж;
			КонецЕсли;	
		КонецЕсли;	
		//-Степанов
		
	КонецЕсли;
	
КонецПроцедуры
//--- БАО 22.08.2017 №1730


// МАС - 12.10.2017 - № --->> 
&НаСервере
Процедура ЗаполнитьСерверМ(ДанныеВыборки, ПроверкаНаТСД = Истина) Экспорт
	
	ПричинаНеВыполнения = Справочники.ПричиныНеВыполненияДоставки.ПустаяСсылка();
	
	СписокЗаказовБезМест = "";
	
	Для каждого Стр Из ДанныеВыборки Цикл
		
		Если Стр.ТипЗаказа <> Перечисления.ТипыЗаказов.Возврат И ПроверкаНаТСД Тогда
			//Если НЕ ЕстьНаТСД(Стр.Заказ) Тогда
			Если НЕ Стр.ЕстьНаТСД Тогда		
				Продолжить;
			КонецЕсли;
		КонецЕсли; 
		
		//// МАС - 07.02.2018 - костыль для заказов без мест (но с ШК по местам) --->> 
		//Если ШКПоМестам И НЕ Вскрытые Тогда	
		//	ВыборкаМестПоШК = Справочники.МестаПоЗаказам.Выбрать(,, Новый Структура("Заказ", Стр.Заказ));
		//	Если НЕ ВыборкаМестПоШК.Следующий() Тогда
		//		СписокЗаказовБезМест = СписокЗаказовБезМест + Символы.ПС + Стр.Заказ.Номер;
		//		Продолжить;	
		//	КонецЕсли;	
		//КонецЕсли;
		//// <<--- МАС 
		
		Если НЕ ВЗаказеТолькоУслугиПоЗаказам(Стр.Заказ.Номер) Тогда 
			
			//ПричинаНеВыполнения = Справочники.ПричиныНеВыполненияДоставки.ПустаяСсылка();
			//Таблица  = smv.ПолучитьТекущееСостояниеЗаказа(Стр.Заказ);
			//Для каждого СтрТаблицы Из Таблица Цикл
			//    ПричинаНеВыполнения = СтрТаблицы.ПричинаНеВыполнения;    
			//КонецЦикла;
			
			
			Если Стр.ТипЗаказа = Перечисления.ТипыЗаказов.Возврат Тогда
				ЭтоВозврат = Истина;
			Иначе
				ЭтоВозврат = Ложь;
			КонецЕсли;
			
			
			КонтрагентТопДеливери = Справочники.Контрагенты.НайтиПоКоду("Shop_222");
			СкладТопДеливери = Справочники.СкладыМагазинов.НайтиПоКоду("7");
			
			// МАС - 15.03.2018 - Обмены и возвраты здесь предполагались исключительно как Возврат2 (вскрытые)  --->> 
			//Если Стр.ТекущийСтатус = Справочники.СтатусыСкладскогоУчета.Возврат1 Тогда 
			Если Стр.ТипЗаказа = Перечисления.ТипыЗаказов.Обмен ИЛИ Стр.ТипЗаказа = Перечисления.ТипыЗаказов.Возврат Тогда
				Если Стр.РезультатДоставки = Справочники.новаРезультатМестнойДоставки.Выполнена или Стр.РезультатДоставки = Справочники.новаРезультатМестнойДоставки.ВыполненаЧастично Тогда
					ДанныеВыборкиТовары = ПолучитьДанныеТоварыВозвратОбмен(Стр.Заказ,КонтрагентТопДеливери,СкладТопДеливери, Истина);
				Иначе	
					ДанныеВыборкиТовары = ПолучитьДанныеТоварыВозвратОбмен(Стр.Заказ,КонтрагентТопДеливери,СкладТопДеливери, Ложь);
				КонецеСли;	
			ИначеЕсли Стр.ТекущийСтатус = Справочники.СтатусыСкладскогоУчета.Возврат1 Тогда
				// <<--- МАС          
				ДанныеВыборкиТовары = ПолучитьДанныеТоварыВозврат1(Стр.Заказ,ЭтоВозврат,КонтрагентТопДеливери,СкладТопДеливери);
				
			ИначеЕсли ПричинаНеВыполнения = Справочники.ПричиныНеВыполненияДоставки.ОтказКлиентаСЗаездом Тогда
				ДанныеВыборкиТовары = ПолучитьДанныеТоварыВозврат1(Стр.Заказ,ЭтоВозврат,КонтрагентТопДеливери,СкладТопДеливери);
				
			ИначеЕсли Стр.ТекущийСтатус = Справочники.СтатусыСкладскогоУчета.Возврат2 И 
				(Стр.ТипЗаказа = Перечисления.ТипыЗаказов.Обмен ИЛИ Стр.ТипЗаказа = Перечисления.ТипыЗаказов.Возврат) Тогда
				Если Стр.РезультатДоставки = Справочники.новаРезультатМестнойДоставки.Выполнена или Стр.РезультатДоставки = Справочники.новаРезультатМестнойДоставки.ВыполненаЧастично Тогда
					ДанныеВыборкиТовары = ПолучитьДанныеТоварыВозвратОбмен(Стр.Заказ,КонтрагентТопДеливери,СкладТопДеливери, Истина);
				Иначе	
					ДанныеВыборкиТовары = ПолучитьДанныеТоварыВозвратОбмен(Стр.Заказ,КонтрагентТопДеливери,СкладТопДеливери, Ложь);
				КонецеСли;	
				
			Иначе
				ДанныеВыборкиТовары = ПолучитьДанныеТоварыВозврат2(Стр.Заказ,ЭтоВозврат,КонтрагентТопДеливери,СкладТопДеливери);
			КонецЕсли;
			
			Для каждого СтрТовары Из ДанныеВыборкиТовары Цикл
				СтрокаТовары = Товары.Добавить();
				//СтрокаТовары.ЗаказРеализация = Стр.Заказ;
				СтрокаТовары.Контрагент = Стр.Контрагент;
				СтрокаТовары.СтатусСкладскогоУчета = Стр.ТекущийСтатус;
				Если БизнесПроцессы.новаМестнаяДоставка.НайтиПоНомеру(Стр.Заказ.Номер).Пустая() Тогда 
					СтрокаТовары.ТипЗаказа = Перечисления.ТипыЗаказов.Самовывоз;
				Иначе
					СтрокаТовары.ТипЗаказа = Перечисления.ТипыЗаказов.Доставка;
				КонецЕсли;
				ЗаполнитьЗначенияСвойств(СтрокаТовары,СтрТовары);
				СтрокаТовары.ЗаказРеализация = Стр.Заказ;
			КонецЦикла;
			
			Если Товары.Количество()> 0 Тогда
				НайденыеСтроки = Товары.НайтиСтроки(Новый Структура("ЗаказРеализация",Стр.Заказ));
				Если НайденыеСтроки.Количество()>0 Тогда
					Строка = Заказы.Добавить();
					ЗаполнитьЗначенияСвойств(Строка,Стр);
					Строка.СкладМагазина = СкладМагазина;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	//Если СписокЗаказовБезМест <> "" Тогда		
	//	Сообщить("Следующие заказы не были включены в документ по причине отсутствия ШК по местам: " + Символы.ПС + СписокЗаказовБезМест);	           				
	//КонецЕсли;
	
КонецПроцедуры


Функция ВЗаказеТолькоУслугиПоЗаказам(Номер)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|   ВозвратТоваровОтПокупателяТовары.Ссылка.Номер,
	|   ВозвратТоваровОтПокупателяТовары.Номенклатура,
	|   ВЫБОР
	|       КОГДА УслугиПоЗаказам.Ссылка ЕСТЬ NULL 
	|           ТОГДА ЛОЖЬ
	|       ИНАЧЕ ИСТИНА
	|   КОНЕЦ КАК ЭтоУслугаПоЗаказам
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|   Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
	|       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УслугиПоЗаказам КАК УслугиПоЗаказам
	|       ПО ВозвратТоваровОтПокупателяТовары.Номенклатура.Артикул = УслугиПоЗаказам.Артикул
	|           И (НЕ УслугиПоЗаказам.ПометкаУдаления)
	|ГДЕ
	|   ВозвратТоваровОтПокупателяТовары.Ссылка.Номер = &Номер
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|   РеализацияТоваровУслугТовары.Ссылка.Номер,
	|   РеализацияТоваровУслугТовары.Номенклатура,
	|   ВЫБОР
	|       КОГДА УслугиПоЗаказам.Ссылка ЕСТЬ NULL 
	|           ТОГДА ЛОЖЬ
	|       ИНАЧЕ ИСТИНА
	|   КОНЕЦ
	|ИЗ
	|   Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УслугиПоЗаказам КАК УслугиПоЗаказам
	|       ПО РеализацияТоваровУслугТовары.Номенклатура.Артикул = УслугиПоЗаказам.Артикул
	|           И (НЕ УслугиПоЗаказам.ПометкаУдаления)
	|ГДЕ
	|   РеализацияТоваровУслугТовары.Ссылка.Номер = &Номер
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|   РеализацияТоваровУслугУслуги.Ссылка.Номер,
	|   РеализацияТоваровУслугУслуги.Номенклатура,
	|   ВЫБОР
	|       КОГДА УслугиПоЗаказам.Ссылка ЕСТЬ NULL 
	|           ТОГДА ЛОЖЬ
	|       ИНАЧЕ ИСТИНА
	|   КОНЕЦ
	|ИЗ
	|   Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	|       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УслугиПоЗаказам КАК УслугиПоЗаказам
	|       ПО РеализацияТоваровУслугУслуги.Номенклатура.Артикул = УслугиПоЗаказам.Артикул
	|           И (НЕ УслугиПоЗаказам.ПометкаУдаления)
	|ГДЕ
	|   РеализацияТоваровУслугУслуги.Ссылка.Номер = &Номер
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|   РеализацияТоваровУслугПодарочныеПозиции.Ссылка.Номер,
	|   РеализацияТоваровУслугПодарочныеПозиции.Номенклатура,
	|   ВЫБОР
	|       КОГДА УслугиПоЗаказам.Ссылка ЕСТЬ NULL 
	|           ТОГДА ЛОЖЬ
	|       ИНАЧЕ ИСТИНА
	|   КОНЕЦ
	|ИЗ
	|   Документ.РеализацияТоваровУслуг.ПодарочныеПозиции КАК РеализацияТоваровУслугПодарочныеПозиции
	|       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УслугиПоЗаказам КАК УслугиПоЗаказам
	|       ПО РеализацияТоваровУслугПодарочныеПозиции.Номенклатура.Артикул = УслугиПоЗаказам.Артикул
	|           И (НЕ УслугиПоЗаказам.ПометкаУдаления)
	|ГДЕ
	|   РеализацияТоваровУслугПодарочныеПозиции.Ссылка.Номер = &Номер
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|   ПоступлениеТоваровУслугТовары.Ссылка.Номер,
	|   ПоступлениеТоваровУслугТовары.Номенклатура,
	|   ВЫБОР
	|       КОГДА УслугиПоЗаказам.Ссылка ЕСТЬ NULL 
	|           ТОГДА ЛОЖЬ
	|       ИНАЧЕ ИСТИНА
	|   КОНЕЦ
	|ИЗ
	|   Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УслугиПоЗаказам КАК УслугиПоЗаказам
	|       ПО ПоступлениеТоваровУслугТовары.Номенклатура.Артикул = УслугиПоЗаказам.Артикул
	|           И (НЕ УслугиПоЗаказам.ПометкаУдаления)
	|ГДЕ
	|   ПоступлениеТоваровУслугТовары.Ссылка.Номер = &Номер
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|   ПоступлениеТоваровУслугУслуги.Ссылка.Номер,
	|   ПоступлениеТоваровУслугУслуги.Номенклатура,
	|   ВЫБОР
	|       КОГДА УслугиПоЗаказам.Ссылка ЕСТЬ NULL 
	|           ТОГДА ЛОЖЬ
	|       ИНАЧЕ ИСТИНА
	|   КОНЕЦ
	|ИЗ
	|   Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	|       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УслугиПоЗаказам КАК УслугиПоЗаказам
	|       ПО ПоступлениеТоваровУслугУслуги.Номенклатура.Артикул = УслугиПоЗаказам.Артикул
	|           И (НЕ УслугиПоЗаказам.ПометкаУдаления)
	|ГДЕ
	|   ПоступлениеТоваровУслугУслуги.Ссылка.Номер = &Номер
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|   ПоступлениеТоваровУслугПодарочныеПозиции.Ссылка.Номер,
	|   ПоступлениеТоваровУслугПодарочныеПозиции.Номенклатура,
	|   ВЫБОР
	|       КОГДА УслугиПоЗаказам.Ссылка ЕСТЬ NULL 
	|           ТОГДА ЛОЖЬ
	|       ИНАЧЕ ИСТИНА
	|   КОНЕЦ
	|ИЗ
	|   Документ.ПоступлениеТоваровУслуг.ПодарочныеПозиции КАК ПоступлениеТоваровУслугПодарочныеПозиции
	|       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УслугиПоЗаказам КАК УслугиПоЗаказам
	|       ПО ПоступлениеТоваровУслугПодарочныеПозиции.Номенклатура.Артикул = УслугиПоЗаказам.Артикул
	|           И (НЕ УслугиПоЗаказам.ПометкаУдаления)
	|ГДЕ
	|   ПоступлениеТоваровУслугПодарочныеПозиции.Ссылка.Номер = &Номер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|   ВТ.Номер КАК Номер,
	|   ВТ.Номенклатура,
	|   МАКСИМУМ(ВТ.ЭтоУслугаПоЗаказам) КАК ЭтоУслугаПоЗаказам
	|ИЗ
	|   ВТ КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|   ВТ.Номер,
	|   ВТ.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|   Номер
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Номер", Номер);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	ЕстьНоменклатура = РезультатЗапроса.Найти(Ложь,"ЭтоУслугаПоЗаказам");
	Если ЕстьНоменклатура = Неопределено Тогда
		Возврат Истина; //только услуги
	Иначе
		Возврат Ложь; //есть номенклатура
	КонецЕсли;
	
КонецФункции // ()


Функция ЕстьНаТСД(Заказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|   РеализацияТоваровУслуг.Ссылка
	|ИЗ
	|   Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|   РеализацияТоваровУслуг.Ссылка = &Ссылка
	|   И РеализацияТоваровУслуг.Ссылка В
	|           (ВЫБРАТЬ
	|               РеализацияТоваровУслуг.Ссылка
	|           ИЗ
	|               Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|                   ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗагрузкаСТСД.Штрихкоды КАК ЗагрузкаСТСДШтрихкоды
	|                   ПО
	|                       РеализацияТоваровУслуг.Ссылка.Номер = ЗагрузкаСТСДШтрихкоды.Штрихкод
	|           ГДЕ
	|               ЗагрузкаСТСДШтрихкоды.Ссылка.ТипЗагрузкиТСД В (&ТипЗагрузкиТСД)
	|               И РеализацияТоваровУслуг.Ссылка = &Ссылка
	|       
	|           ОБЪЕДИНИТЬ ВСЕ
	|       
	|           ВЫБРАТЬ
	|               РеализацияТоваровУслуг.Ссылка
	|           ИЗ
	|               Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|                   ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗагрузкаСТСД.Штрихкоды КАК ЗагрузкаСТСДШтрихкоды
	|                   ПО
	|                       РеализацияТоваровУслуг.Ссылка.НомерВнешнегоЗаказа = ЗагрузкаСТСДШтрихкоды.Штрихкод
	|           ГДЕ
	|               ЗагрузкаСТСДШтрихкоды.Ссылка.ТипЗагрузкиТСД В (&ТипЗагрузкиТСД)
	|               И РеализацияТоваровУслуг.Ссылка = &Ссылка
	|       
	|           ОБЪЕДИНИТЬ ВСЕ
	|       
	|           ВЫБРАТЬ
	|               РеализацияТоваровУслуг.Ссылка
	|           ИЗ
	|               Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|                   ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗагрузкаСТСД.Штрихкоды КАК ЗагрузкаСТСДШтрихкоды
	|                   ПО
	|                       РеализацияТоваровУслуг.Ссылка = ЗагрузкаСТСДШтрихкоды.Заказ
	|           ГДЕ
	|               ЗагрузкаСТСДШтрихкоды.Ссылка.ТипЗагрузкиТСД В (&ТипЗагрузкиТСД)
	|               И РеализацияТоваровУслуг.Ссылка = &Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", Заказ);
	ТипыЗагрузки = Новый СписокЗначений;
	ТипыЗагрузки.Добавить(Перечисления.ТипыЗагрузкиТСД.ПриходWiFi);
	ТипыЗагрузки.Добавить(Перечисления.ТипыЗагрузкиТСД.ПриходWiFiVeeRoute);
	ТипыЗагрузки.Добавить(Перечисления.ТипыЗагрузкиТСД.ПриходWiFiVeeRouteСВесом);
	Запрос.УстановитьПараметр("ТипЗагрузкиТСД",ТипыЗагрузки);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции // ЕстьНаТСД()


Функция ПолучитьДанныеТоварыВозврат1(РеализацияТоваровУслугСсылка,ЭтоВозврат,КонтрагентТопДеливери,СкладТопДеливери)
	
	Запрос = Новый Запрос;
	//+Степанов Задача № 3963 Добавлен код маркировки
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ПоступлениеТоваровУслугТовары.НомерСтроки КАК НомерСтроки,
	//|	ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	//|	ПоступлениеТоваровУслугТовары.Количество КАК Количество,
	//|	ПоступлениеТоваровУслугТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	//|	ПоступлениеТоваровУслугТовары.ЕдиницаИзмеренияМест КАК ЕдиницаИзмеренияМест,
	//|	ПоступлениеТоваровУслугТовары.Коэффициент КАК Коэффициент,
	//|	ПоступлениеТоваровУслугТовары.Цена КАК Цена,
	//|	ПоступлениеТоваровУслугТовары.Сумма КАК Сумма,
	//|	ПоступлениеТоваровУслугТовары.СтавкаНДС КАК СтавкаНДС,
	//|	ПоступлениеТоваровУслугТовары.СуммаНДС КАК СуммаНДС,
	//|	ПоступлениеТоваровУслугТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	//|	ПоступлениеТоваровУслугТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	//|	ПоступлениеТоваровУслугТовары.Склад КАК Склад,
	//|	ПоступлениеТоваровУслугТовары.ПриходныйОрдер КАК ПриходныйОрдер,
	//|	ПоступлениеТоваровУслугТовары.КлючСвязи КАК КлючСвязи,
	//|	ПоступлениеТоваровУслугТовары.Ссылка.НомерВходящегоДокументаЭлектронногоОбмена КАК ВнешнийНомерЗаказа,
	//|	ПоступлениеТоваровУслугТовары.Ссылка.Дата КАК ДатаДоставки,
	//|	ПоступлениеТоваровУслугТовары.КоличествоМест КАК КоличествоМест,
	//|	ПоступлениеТоваровУслугТовары.Ссылка КАК ДокументПоступления,
	//|	ВЫБОР
	//|		КОГДА ПоступлениеТоваровУслугТовары.СкладМагазина = ЗНАЧЕНИЕ(Справочник.СкладыМагазинов.ПустаяСсылка)
	//|				И ПоступлениеТоваровУслугТовары.Ссылка.Контрагент = &ТопДеливери
	//|			ТОГДА &СкладТопДеливери
	//|		ИНАЧЕ ПоступлениеТоваровУслугТовары.СкладМагазина
	//|	КОНЕЦ КАК СкладМагазина,
	//|	ПоступлениеТоваровУслугТовары.ШтрихкодНоменклатуры КАК ШтрихкодНоменклатуры
	//|ПОМЕСТИТЬ ВТ_Итог
	//|ИЗ
	//|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	//|ГДЕ
	//|	ПоступлениеТоваровУслугТовары.Ссылка.Номер = &Номер
	//|	И НЕ &ЭтоВозврат
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ПоступлениеТоваровУслугПодарочныеПозиции.НомерСтроки,
	//|	ПоступлениеТоваровУслугПодарочныеПозиции.Номенклатура,
	//|	ПоступлениеТоваровУслугПодарочныеПозиции.Количество,
	//|	ПоступлениеТоваровУслугПодарочныеПозиции.ЕдиницаИзмерения,
	//|	ПоступлениеТоваровУслугПодарочныеПозиции.ЕдиницаИзмеренияМест,
	//|	ПоступлениеТоваровУслугПодарочныеПозиции.Коэффициент,
	//|	ПоступлениеТоваровУслугПодарочныеПозиции.Цена,
	//|	ПоступлениеТоваровУслугПодарочныеПозиции.Сумма,
	//|	ПоступлениеТоваровУслугПодарочныеПозиции.СтавкаНДС,
	//|	ПоступлениеТоваровУслугПодарочныеПозиции.СуммаНДС,
	//|	ПоступлениеТоваровУслугПодарочныеПозиции.ХарактеристикаНоменклатуры,
	//|	ПоступлениеТоваровУслугПодарочныеПозиции.СерияНоменклатуры,
	//|	ПоступлениеТоваровУслугПодарочныеПозиции.Склад,
	//|	ПоступлениеТоваровУслугПодарочныеПозиции.ПриходныйОрдер,
	//|	ПоступлениеТоваровУслугПодарочныеПозиции.КлючСвязи,
	//|	ПоступлениеТоваровУслугПодарочныеПозиции.Ссылка.НомерВходящегоДокументаЭлектронногоОбмена,
	//|	ПоступлениеТоваровУслугПодарочныеПозиции.Ссылка.Дата,
	//|	ПоступлениеТоваровУслугПодарочныеПозиции.КоличествоМест,
	//|	ПоступлениеТоваровУслугПодарочныеПозиции.Ссылка,
	//|	ВЫБОР
	//|		КОГДА ПоступлениеТоваровУслугПодарочныеПозиции.СкладМагазина = ЗНАЧЕНИЕ(Справочник.СкладыМагазинов.ПустаяСсылка)
	//|				И ПоступлениеТоваровУслугПодарочныеПозиции.Ссылка.Контрагент = &ТопДеливери
	//|			ТОГДА &СкладТопДеливери
	//|		ИНАЧЕ ПоступлениеТоваровУслугПодарочныеПозиции.СкладМагазина
	//|	КОНЕЦ,
	//|	ПоступлениеТоваровУслугПодарочныеПозиции.ШтрихкодНоменклатуры
	//|ИЗ
	//|	Документ.ПоступлениеТоваровУслуг.ПодарочныеПозиции КАК ПоступлениеТоваровУслугПодарочныеПозиции
	//|ГДЕ
	//|	ПоступлениеТоваровУслугПодарочныеПозиции.Ссылка.Номер = &Номер
	//|	И НЕ &ЭтоВозврат
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ВозвратТоваровОтПокупателяТовары.НомерСтроки,
	//|	ВозвратТоваровОтПокупателяТовары.Номенклатура,
	//|	ВозвратТоваровОтПокупателяТовары.Количество,
	//|	ВозвратТоваровОтПокупателяТовары.ЕдиницаИзмерения,
	//|	ВозвратТоваровОтПокупателяТовары.ЕдиницаИзмеренияМест,
	//|	ВозвратТоваровОтПокупателяТовары.Коэффициент,
	//|	ВозвратТоваровОтПокупателяТовары.Цена,
	//|	ВозвратТоваровОтПокупателяТовары.Сумма,
	//|	ВозвратТоваровОтПокупателяТовары.СтавкаНДС,
	//|	ВозвратТоваровОтПокупателяТовары.СуммаНДС,
	//|	ВозвратТоваровОтПокупателяТовары.ХарактеристикаНоменклатуры,
	//|	ВозвратТоваровОтПокупателяТовары.СерияНоменклатуры,
	//|	ВозвратТоваровОтПокупателяТовары.Склад,
	//|	ВозвратТоваровОтПокупателяТовары.ПриходныйОрдер,
	//|	ВозвратТоваровОтПокупателяТовары.КлючСвязи,
	//|	ВозвратТоваровОтПокупателяТовары.Ссылка.НомерВходящегоДокументаЭлектронногоОбмена,
	//|	ВозвратТоваровОтПокупателяТовары.Ссылка.Дата,
	//|	ВозвратТоваровОтПокупателяТовары.КоличествоМест,
	//|	ПоступлениеТоваровУслуг.Ссылка,
	//|	ВЫБОР
	//|		КОГДА ВозвратТоваровОтПокупателяТовары.СкладМагазина = ЗНАЧЕНИЕ(Справочник.СкладыМагазинов.ПустаяСсылка)
	//|				И ВозвратТоваровОтПокупателяТовары.Ссылка.Контрагент = &ТопДеливери
	//|			ТОГДА &СкладТопДеливери
	//|		ИНАЧЕ ВозвратТоваровОтПокупателяТовары.СкладМагазина
	//|	КОНЕЦ,
	//|	ВозвратТоваровОтПокупателяТовары.ШтрихкодНоменклатуры
	//|ИЗ
	//|	Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	//|		ПО ВозвратТоваровОтПокупателяТовары.Ссылка.Номер = ПоступлениеТоваровУслуг.Номер
	//|ГДЕ
	//|	ВозвратТоваровОтПокупателяТовары.Ссылка.Номер = &Номер
	//|	И &ЭтоВозврат
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_Итог.НомерСтроки КАК НомерСтроки,
	//|	ВТ_Итог.Номенклатура КАК Номенклатура,
	//|	ВТ_Итог.Количество КАК Количество,
	//|	ВТ_Итог.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	//|	ВТ_Итог.ЕдиницаИзмеренияМест КАК ЕдиницаИзмеренияМест,
	//|	ВТ_Итог.Коэффициент КАК Коэффициент,
	//|	ВТ_Итог.Цена КАК Цена,
	//|	ВТ_Итог.Сумма КАК Сумма,
	//|	ВТ_Итог.СтавкаНДС КАК СтавкаНДС,
	//|	ВТ_Итог.СуммаНДС КАК СуммаНДС,
	//|	ВТ_Итог.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	//|	ВТ_Итог.СерияНоменклатуры КАК СерияНоменклатуры,
	//|	ВТ_Итог.Склад КАК Склад,
	//|	ВТ_Итог.ПриходныйОрдер КАК ПриходныйОрдер,
	//|	ВТ_Итог.КлючСвязи КАК КлючСвязи,
	//|	ВТ_Итог.ВнешнийНомерЗаказа КАК ВнешнийНомерЗаказа,
	//|	ВТ_Итог.ДатаДоставки КАК ДатаДоставки,
	//|	ВТ_Итог.КоличествоМест КАК КоличествоМест,
	//|	ВТ_Итог.ДокументПоступления КАК ДокументПоступления,
	//|	ВТ_Итог.СкладМагазина КАК СкладМагазина,
	//|	МАКСИМУМ(ЗакрытиеЗаказовЗаказы.Ссылка) КАК ЗакрытиеЗаказов,
	//|	ВТ_Итог.ШтрихкодНоменклатуры КАК ШтрихкодНоменклатуры
	//|ИЗ
	//|	ВТ_Итог КАК ВТ_Итог
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗакрытиеЗаказов.Заказы КАК ЗакрытиеЗаказовЗаказы
	//|		ПО (ЗакрытиеЗаказовЗаказы.Закрыть
	//|				ИЛИ ЗакрытиеЗаказовЗаказы.Отклонить)
	//|			И (&Номер = ВЫРАЗИТЬ(ЗакрытиеЗаказовЗаказы.Реализация КАК Документ.РеализацияТоваровУслуг).Номер)
	//|ГДЕ
	//|	ИСТИНА
	//|	И ВТ_Итог.СкладМагазина = &СкладМагазина
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТ_Итог.НомерСтроки,
	//|	ВТ_Итог.Номенклатура,
	//|	ВТ_Итог.Количество,
	//|	ВТ_Итог.ЕдиницаИзмерения,
	//|	ВТ_Итог.ЕдиницаИзмеренияМест,
	//|	ВТ_Итог.Коэффициент,
	//|	ВТ_Итог.Цена,
	//|	ВТ_Итог.Сумма,
	//|	ВТ_Итог.СтавкаНДС,
	//|	ВТ_Итог.СуммаНДС,
	//|	ВТ_Итог.ХарактеристикаНоменклатуры,
	//|	ВТ_Итог.СерияНоменклатуры,
	//|	ВТ_Итог.Склад,
	//|	ВТ_Итог.ПриходныйОрдер,
	//|	ВТ_Итог.КлючСвязи,
	//|	ВТ_Итог.ВнешнийНомерЗаказа,
	//|	ВТ_Итог.ДатаДоставки,
	//|	ВТ_Итог.КоличествоМест,
	//|	ВТ_Итог.ДокументПоступления,
	//|	ВТ_Итог.СкладМагазина,
	//|	ВТ_Итог.ШтрихкодНоменклатуры";
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслугТовары.НомерСтроки КАК НомерСтроки,
	|	ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	ПоступлениеТоваровУслугТовары.Количество КАК Количество,
	|	ПоступлениеТоваровУслугТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ПоступлениеТоваровУслугТовары.ЕдиницаИзмеренияМест КАК ЕдиницаИзмеренияМест,
	|	ПоступлениеТоваровУслугТовары.Коэффициент КАК Коэффициент,
	|	ПоступлениеТоваровУслугТовары.Цена КАК Цена,
	|	ПоступлениеТоваровУслугТовары.Сумма КАК Сумма,
	|	ПоступлениеТоваровУслугТовары.СтавкаНДС КАК СтавкаНДС,
	|	ПоступлениеТоваровУслугТовары.СуммаНДС КАК СуммаНДС,
	|	ПоступлениеТоваровУслугТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ПоступлениеТоваровУслугТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ПоступлениеТоваровУслугТовары.Склад КАК Склад,
	|	ПоступлениеТоваровУслугТовары.ПриходныйОрдер КАК ПриходныйОрдер,
	|	ПоступлениеТоваровУслугТовары.КлючСвязи КАК КлючСвязи,
	|	ПоступлениеТоваровУслугТовары.Ссылка.НомерВходящегоДокументаЭлектронногоОбмена КАК ВнешнийНомерЗаказа,
	|	ПоступлениеТоваровУслугТовары.Ссылка.Дата КАК ДатаДоставки,
	|	ПоступлениеТоваровУслугТовары.КоличествоМест КАК КоличествоМест,
	|	ПоступлениеТоваровУслугТовары.Ссылка КАК ДокументПоступления,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслугТовары.СкладМагазина = ЗНАЧЕНИЕ(Справочник.СкладыМагазинов.ПустаяСсылка)
	|				И ПоступлениеТоваровУслугТовары.Ссылка.Контрагент = &ТопДеливери
	|			ТОГДА &СкладТопДеливери
	|		ИНАЧЕ ПоступлениеТоваровУслугТовары.СкладМагазина
	|	КОНЕЦ КАК СкладМагазина,
	|	ПоступлениеТоваровУслугТовары.ШтрихкодНоменклатуры КАК ШтрихкодНоменклатуры,
	|	ПоступлениеТоваровУслугТовары.КодМаркировки КАК КодМаркировки
	|ПОМЕСТИТЬ ВТ_Итог
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.Ссылка.Номер = &Номер
	|	И НЕ &ЭтоВозврат
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслугПодарочныеПозиции.НомерСтроки,
	|	ПоступлениеТоваровУслугПодарочныеПозиции.Номенклатура,
	|	ПоступлениеТоваровУслугПодарочныеПозиции.Количество,
	|	ПоступлениеТоваровУслугПодарочныеПозиции.ЕдиницаИзмерения,
	|	ПоступлениеТоваровУслугПодарочныеПозиции.ЕдиницаИзмеренияМест,
	|	ПоступлениеТоваровУслугПодарочныеПозиции.Коэффициент,
	|	ПоступлениеТоваровУслугПодарочныеПозиции.Цена,
	|	ПоступлениеТоваровУслугПодарочныеПозиции.Сумма,
	|	ПоступлениеТоваровУслугПодарочныеПозиции.СтавкаНДС,
	|	ПоступлениеТоваровУслугПодарочныеПозиции.СуммаНДС,
	|	ПоступлениеТоваровУслугПодарочныеПозиции.ХарактеристикаНоменклатуры,
	|	ПоступлениеТоваровУслугПодарочныеПозиции.СерияНоменклатуры,
	|	ПоступлениеТоваровУслугПодарочныеПозиции.Склад,
	|	ПоступлениеТоваровУслугПодарочныеПозиции.ПриходныйОрдер,
	|	ПоступлениеТоваровУслугПодарочныеПозиции.КлючСвязи,
	|	ПоступлениеТоваровУслугПодарочныеПозиции.Ссылка.НомерВходящегоДокументаЭлектронногоОбмена,
	|	ПоступлениеТоваровУслугПодарочныеПозиции.Ссылка.Дата,
	|	ПоступлениеТоваровУслугПодарочныеПозиции.КоличествоМест,
	|	ПоступлениеТоваровУслугПодарочныеПозиции.Ссылка,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслугПодарочныеПозиции.СкладМагазина = ЗНАЧЕНИЕ(Справочник.СкладыМагазинов.ПустаяСсылка)
	|				И ПоступлениеТоваровУслугПодарочныеПозиции.Ссылка.Контрагент = &ТопДеливери
	|			ТОГДА &СкладТопДеливери
	|		ИНАЧЕ ПоступлениеТоваровУслугПодарочныеПозиции.СкладМагазина
	|	КОНЕЦ,
	|	ПоступлениеТоваровУслугПодарочныеПозиции.ШтрихкодНоменклатуры,
	|	ПоступлениеТоваровУслугПодарочныеПозиции.КодМаркировки
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.ПодарочныеПозиции КАК ПоступлениеТоваровУслугПодарочныеПозиции
	|ГДЕ
	|	ПоступлениеТоваровУслугПодарочныеПозиции.Ссылка.Номер = &Номер
	|	И НЕ &ЭтоВозврат
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратТоваровОтПокупателяТовары.НомерСтроки,
	|	ВозвратТоваровОтПокупателяТовары.Номенклатура,
	|	ВозвратТоваровОтПокупателяТовары.Количество,
	|	ВозвратТоваровОтПокупателяТовары.ЕдиницаИзмерения,
	|	ВозвратТоваровОтПокупателяТовары.ЕдиницаИзмеренияМест,
	|	ВозвратТоваровОтПокупателяТовары.Коэффициент,
	|	ВозвратТоваровОтПокупателяТовары.Цена,
	|	ВозвратТоваровОтПокупателяТовары.Сумма,
	|	ВозвратТоваровОтПокупателяТовары.СтавкаНДС,
	|	ВозвратТоваровОтПокупателяТовары.СуммаНДС,
	|	ВозвратТоваровОтПокупателяТовары.ХарактеристикаНоменклатуры,
	|	ВозвратТоваровОтПокупателяТовары.СерияНоменклатуры,
	|	ВозвратТоваровОтПокупателяТовары.Склад,
	|	ВозвратТоваровОтПокупателяТовары.ПриходныйОрдер,
	|	ВозвратТоваровОтПокупателяТовары.КлючСвязи,
	|	ВозвратТоваровОтПокупателяТовары.Ссылка.НомерВходящегоДокументаЭлектронногоОбмена,
	|	ВозвратТоваровОтПокупателяТовары.Ссылка.Дата,
	|	ВозвратТоваровОтПокупателяТовары.КоличествоМест,
	|	ПоступлениеТоваровУслуг.Ссылка,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровОтПокупателяТовары.СкладМагазина = ЗНАЧЕНИЕ(Справочник.СкладыМагазинов.ПустаяСсылка)
	|				И ВозвратТоваровОтПокупателяТовары.Ссылка.Контрагент = &ТопДеливери
	|			ТОГДА &СкладТопДеливери
	|		ИНАЧЕ ВозвратТоваровОтПокупателяТовары.СкладМагазина
	|	КОНЕЦ,
	|	ВозвратТоваровОтПокупателяТовары.ШтрихкодНоменклатуры,
	|	ВозвратТоваровОтПокупателяТовары.КодМаркировки
	|ИЗ
	|	Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|		ПО ВозвратТоваровОтПокупателяТовары.Ссылка.Номер = ПоступлениеТоваровУслуг.Номер
	|ГДЕ
	|	ВозвратТоваровОтПокупателяТовары.Ссылка.Номер = &Номер
	|	И &ЭтоВозврат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Итог.НомерСтроки КАК НомерСтроки,
	|	ВТ_Итог.Номенклатура КАК Номенклатура,
	|	ВТ_Итог.Количество КАК Количество,
	|	ВТ_Итог.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТ_Итог.ЕдиницаИзмеренияМест КАК ЕдиницаИзмеренияМест,
	|	ВТ_Итог.Коэффициент КАК Коэффициент,
	|	ВТ_Итог.Цена КАК Цена,
	|	ВТ_Итог.Сумма КАК Сумма,
	|	ВТ_Итог.СтавкаНДС КАК СтавкаНДС,
	|	ВТ_Итог.СуммаНДС КАК СуммаНДС,
	|	ВТ_Итог.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_Итог.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ВТ_Итог.Склад КАК Склад,
	|	ВТ_Итог.ПриходныйОрдер КАК ПриходныйОрдер,
	|	ВТ_Итог.КлючСвязи КАК КлючСвязи,
	|	ВТ_Итог.ВнешнийНомерЗаказа КАК ВнешнийНомерЗаказа,
	|	ВТ_Итог.ДатаДоставки КАК ДатаДоставки,
	|	ВТ_Итог.КоличествоМест КАК КоличествоМест,
	|	ВТ_Итог.ДокументПоступления КАК ДокументПоступления,
	|	ВТ_Итог.СкладМагазина КАК СкладМагазина,
	|	МАКСИМУМ(ЗакрытиеЗаказовЗаказы.Ссылка) КАК ЗакрытиеЗаказов,
	|	ВТ_Итог.ШтрихкодНоменклатуры КАК ШтрихкодНоменклатуры,
	|	ВТ_Итог.КодМаркировки КАК КодМаркировки
	|ИЗ
	|	ВТ_Итог КАК ВТ_Итог
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗакрытиеЗаказов.Заказы КАК ЗакрытиеЗаказовЗаказы
	|		ПО (ЗакрытиеЗаказовЗаказы.Закрыть
	|				ИЛИ ЗакрытиеЗаказовЗаказы.Отклонить)
	|			И (&Номер = ВЫРАЗИТЬ(ЗакрытиеЗаказовЗаказы.Реализация КАК Документ.РеализацияТоваровУслуг).Номер)
	|ГДЕ
	|	ИСТИНА
	|	И ВТ_Итог.СкладМагазина = &СкладМагазина
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Итог.НомерСтроки,
	|	ВТ_Итог.Номенклатура,
	|	ВТ_Итог.Количество,
	|	ВТ_Итог.ЕдиницаИзмерения,
	|	ВТ_Итог.ЕдиницаИзмеренияМест,
	|	ВТ_Итог.Коэффициент,
	|	ВТ_Итог.Цена,
	|	ВТ_Итог.Сумма,
	|	ВТ_Итог.СтавкаНДС,
	|	ВТ_Итог.СуммаНДС,
	|	ВТ_Итог.ХарактеристикаНоменклатуры,
	|	ВТ_Итог.СерияНоменклатуры,
	|	ВТ_Итог.Склад,
	|	ВТ_Итог.ПриходныйОрдер,
	|	ВТ_Итог.КлючСвязи,
	|	ВТ_Итог.ВнешнийНомерЗаказа,
	|	ВТ_Итог.ДатаДоставки,
	|	ВТ_Итог.КоличествоМест,
	|	ВТ_Итог.ДокументПоступления,
	|	ВТ_Итог.СкладМагазина,
	|	ВТ_Итог.ШтрихкодНоменклатуры,
	|	ВТ_Итог.КодМаркировки";
	//-Степанов Задача № 3963
	
	Запрос.УстановитьПараметр("Номер", РеализацияТоваровУслугСсылка.Номер);
	Запрос.УстановитьПараметр("ЭтоВозврат", ЭтоВозврат);
	Запрос.УстановитьПараметр("СкладМагазина", СкладМагазина);
	Запрос.УстановитьПараметр("ТопДеливери",КонтрагентТопДеливери);
	Запрос.УстановитьПараметр("СкладТопДеливери",СкладТопДеливери);
	
	Если НЕ ЗначениеЗаполнено(СкладМагазина) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И ВТ_Итог.СкладМагазина = &СкладМагазина","");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Возврат РезультатЗапроса;
	
КонецФункции // ()

&НаСервере
Функция ПолучитьДанныеТоварыВозврат2(РеализацияТоваровУслугСсылка,ЭтоВозврат,КонтрагентТопДеливери,СкладТопДеливери)
	
	Запрос = Новый Запрос;
	//+Степанов Задача № 3963 Добавлен код маркировки
	//Асеев 02.09.2020 (Задача № 4189)>>>
	//- в запросе КодМаркировки брать из данных регистра
	//- связывание с Документ.ПоступлениеТоваровУслуг.Товары надо выполнять после свертки ТЧ Товары ПТУ
	//- связывание с Документ.ВозвратТоваровОтПокупателя.Товары надо выполнлять после свертки ТЧ Товары Возврата
	//- во все связи по Номенклатуре с ТЧ ПТУ добавить связь по КодуМаркировки
	//- во все связи по Номенклатуре с ТЧ Возврата связь по КодуМаркировки пока не добавляется
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеЧастичныхЗаказовОстатки.Заказ КАК Заказ,
	|	ДанныеЧастичныхЗаказовОстатки.Номенклатура КАК Номенклатура,
	|	ДанныеЧастичныхЗаказовОстатки.КодМаркировки КАК КодМаркировки,
	|	ДанныеЧастичныхЗаказовОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ДанныеЧастичныхЗаказовОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ПОМЕСТИТЬ ДанныеЧастичныхЗаказовОстатки
	|ИЗ
	|	РегистрНакопления.ДанныеЧастичныхЗаказов.Остатки(&Период, Заказ = &Заказ) КАК ДанныеЧастичныхЗаказовОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	СУММА(ВложенныйЗапрос.Количество) КАК Количество,
	|	СУММА(ВложенныйЗапрос.КоличествоМест) КАК КоличествоМест,
	|	МАКСИМУМ(ВложенныйЗапрос.Цена) КАК Цена,
	|	МАКСИМУМ(ВложенныйЗапрос.ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
	|	МАКСИМУМ(ВложенныйЗапрос.ЕдиницаИзмеренияМест) КАК ЕдиницаИзмеренияМест,
	|	МАКСИМУМ(ВложенныйЗапрос.Коэффициент) КАК Коэффициент,
	|	МАКСИМУМ(ВложенныйЗапрос.СтавкаНДС) КАК СтавкаНДС,
	|	СУММА(ВложенныйЗапрос.СуммаНДС) КАК СуммаНДС,
	|	МАКСИМУМ(ВложенныйЗапрос.ХарактеристикаНоменклатуры) КАК ХарактеристикаНоменклатуры,
	|	МАКСИМУМ(ВложенныйЗапрос.СерияНоменклатуры) КАК СерияНоменклатуры,
	|	МАКСИМУМ(ВложенныйЗапрос.Склад) КАК Склад,
	|	МАКСИМУМ(ВложенныйЗапрос.КлючСвязи) КАК КлючСвязи,
	|	ВложенныйЗапрос.ДатаДоставки КАК ДатаДоставки,
	|	ВложенныйЗапрос.ДокументПоступления КАК ДокументПоступления,
	|	ВложенныйЗапрос.СкладМагазина КАК СкладМагазина,
	|	МАКСИМУМ(ВложенныйЗапрос.ШтрихкодНоменклатуры) КАК ШтрихкодНоменклатуры,
	|	ВложенныйЗапрос.КодМаркировки КАК КодМаркировки
	|ПОМЕСТИТЬ ПоступлениеТоваровУслугТовары
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|		ПоступлениеТоваровУслугТовары.Количество КАК Количество,
	|		ПоступлениеТоваровУслугТовары.КоличествоМест КАК КоличествоМест,
	|		ПоступлениеТоваровУслугТовары.Цена КАК Цена,
	|		ПоступлениеТоваровУслугТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		ПоступлениеТоваровУслугТовары.ЕдиницаИзмеренияМест КАК ЕдиницаИзмеренияМест,
	|		ПоступлениеТоваровУслугТовары.Коэффициент КАК Коэффициент,
	|		ПоступлениеТоваровУслугТовары.СтавкаНДС КАК СтавкаНДС,
	|		ПоступлениеТоваровУслугТовары.СуммаНДС КАК СуммаНДС,
	|		ПоступлениеТоваровУслугТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		ПоступлениеТоваровУслугТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	|		ПоступлениеТоваровУслугТовары.Склад КАК Склад,
	|		ПоступлениеТоваровУслугТовары.КлючСвязи КАК КлючСвязи,
	|		ПоступлениеТоваровУслуг.Дата КАК ДатаДоставки,
	|		ПоступлениеТоваровУслугТовары.Ссылка КАК ДокументПоступления,
	|		ВЫБОР
	|			КОГДА ПоступлениеТоваровУслугТовары.СкладМагазина = ЗНАЧЕНИЕ(Справочник.СкладыМагазинов.ПустаяСсылка)
	|					И ПоступлениеТоваровУслуг.Контрагент = &ТопДеливери
	|				ТОГДА &СкладТопДеливери
	|			ИНАЧЕ ПоступлениеТоваровУслугТовары.СкладМагазина
	|		КОНЕЦ КАК СкладМагазина,
	|		ПоступлениеТоваровУслугТовары.ШтрихкодНоменклатуры КАК ШтрихкодНоменклатуры,
	|		ПоступлениеТоваровУслугТовары.КодМаркировки КАК КодМаркировки
	|	ИЗ
	|		Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|			ПО (ПоступлениеТоваровУслуг.Номер = &Номер)
	|				И ПоступлениеТоваровУслугТовары.Ссылка = ПоступлениеТоваровУслуг.Ссылка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеЧастичныхЗаказовОстатки КАК ДанныеЧастичныхЗаказовОстатки
	|			ПО ПоступлениеТоваровУслугТовары.Номенклатура = ДанныеЧастичныхЗаказовОстатки.Номенклатура
	|				И ((ВЫРАЗИТЬ(ПоступлениеТоваровУслугТовары.КодМаркировки КАК СТРОКА(50))) = (ВЫРАЗИТЬ(ДанныеЧастичныхЗаказовОстатки.КодМаркировки КАК СТРОКА(50))))
	|	ГДЕ
	|		НЕ &ЭтоВозврат
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПоступлениеТоваровУслугПодарочныеПозиции.Номенклатура,
	|		ПоступлениеТоваровУслугПодарочныеПозиции.Количество,
	|		ПоступлениеТоваровУслугПодарочныеПозиции.КоличествоМест,
	|		ПоступлениеТоваровУслугПодарочныеПозиции.Цена,
	|		ПоступлениеТоваровУслугПодарочныеПозиции.ЕдиницаИзмерения,
	|		ПоступлениеТоваровУслугПодарочныеПозиции.ЕдиницаИзмеренияМест,
	|		ПоступлениеТоваровУслугПодарочныеПозиции.Коэффициент,
	|		ПоступлениеТоваровУслугПодарочныеПозиции.СтавкаНДС,
	|		ПоступлениеТоваровУслугПодарочныеПозиции.СуммаНДС,
	|		ПоступлениеТоваровУслугПодарочныеПозиции.ХарактеристикаНоменклатуры,
	|		ПоступлениеТоваровУслугПодарочныеПозиции.СерияНоменклатуры,
	|		ПоступлениеТоваровУслугПодарочныеПозиции.Склад,
	|		ПоступлениеТоваровУслугПодарочныеПозиции.КлючСвязи,
	|		ПоступлениеТоваровУслуг.Дата,
	|		ПоступлениеТоваровУслугПодарочныеПозиции.Ссылка,
	|		ВЫБОР
	|			КОГДА ПоступлениеТоваровУслугПодарочныеПозиции.СкладМагазина = ЗНАЧЕНИЕ(Справочник.СкладыМагазинов.ПустаяСсылка)
	|					И ПоступлениеТоваровУслуг.Контрагент = &ТопДеливери
	|				ТОГДА &СкладТопДеливери
	|			ИНАЧЕ ПоступлениеТоваровУслугПодарочныеПозиции.СкладМагазина
	|		КОНЕЦ,
	|		ПоступлениеТоваровУслугПодарочныеПозиции.ШтрихкодНоменклатуры,
	|		ПоступлениеТоваровУслугПодарочныеПозиции.КодМаркировки
	|	ИЗ
	|		Документ.ПоступлениеТоваровУслуг.ПодарочныеПозиции КАК ПоступлениеТоваровУслугПодарочныеПозиции
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|			ПО (ПоступлениеТоваровУслуг.Номер = &Номер)
	|				И ПоступлениеТоваровУслугПодарочныеПозиции.Ссылка = ПоступлениеТоваровУслуг.Ссылка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеЧастичныхЗаказовОстатки КАК ДанныеЧастичныхЗаказовОстатки
	|			ПО ПоступлениеТоваровУслугПодарочныеПозиции.Номенклатура = ДанныеЧастичныхЗаказовОстатки.Номенклатура
	|				И ((ВЫРАЗИТЬ(ПоступлениеТоваровУслугПодарочныеПозиции.КодМаркировки КАК СТРОКА(50))) = (ВЫРАЗИТЬ(ДанныеЧастичныхЗаказовОстатки.КодМаркировки КАК СТРОКА(50))))
	|	ГДЕ
	|		НЕ &ЭтоВозврат) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.ДатаДоставки,
	|	ВложенныйЗапрос.КодМаркировки,
	|	ВложенныйЗапрос.ДокументПоступления,
	|	ВложенныйЗапрос.СкладМагазина
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВозвратТоваровОтПокупателяТовары.Номенклатура КАК Номенклатура,
	|	СУММА(ВозвратТоваровОтПокупателяТовары.Количество) КАК Количество,
	|	СУММА(ВозвратТоваровОтПокупателяТовары.КоличествоМест) КАК КоличествоМест,
	|	МАКСИМУМ(ВозвратТоваровОтПокупателяТовары.Цена) КАК Цена,
	|	МАКСИМУМ(ВозвратТоваровОтПокупателяТовары.ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
	|	МАКСИМУМ(ВозвратТоваровОтПокупателяТовары.ЕдиницаИзмеренияМест) КАК ЕдиницаИзмеренияМест,
	|	МАКСИМУМ(ВозвратТоваровОтПокупателяТовары.Коэффициент) КАК Коэффициент,
	|	МАКСИМУМ(ВозвратТоваровОтПокупателяТовары.СтавкаНДС) КАК СтавкаНДС,
	|	СУММА(ВозвратТоваровОтПокупателяТовары.СуммаНДС) КАК СуммаНДС,
	|	МАКСИМУМ(ВозвратТоваровОтПокупателяТовары.ХарактеристикаНоменклатуры) КАК ХарактеристикаНоменклатуры,
	|	МАКСИМУМ(ВозвратТоваровОтПокупателяТовары.СерияНоменклатуры) КАК СерияНоменклатуры,
	|	МАКСИМУМ(ВозвратТоваровОтПокупателяТовары.Склад) КАК Склад,
	|	МАКСИМУМ(ВозвратТоваровОтПокупателяТовары.КлючСвязи) КАК КлючСвязи,
	|	ВозвратТоваровОтПокупателя.Дата КАК ДатаДоставки,
	|	ПоступлениеТоваровУслуг.Ссылка КАК ДокументПоступления,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровОтПокупателяТовары.СкладМагазина = ЗНАЧЕНИЕ(Справочник.СкладыМагазинов.ПустаяСсылка)
	|				И ВозвратТоваровОтПокупателя.Контрагент = &ТопДеливери
	|			ТОГДА &СкладТопДеливери
	|		ИНАЧЕ ВозвратТоваровОтПокупателяТовары.СкладМагазина
	|	КОНЕЦ КАК СкладМагазина,
	|	МАКСИМУМ(ВозвратТоваровОтПокупателяТовары.ШтрихкодНоменклатуры) КАК ШтрихкодНоменклатуры,
	|	МАКСИМУМ(ВозвратТоваровОтПокупателяТовары.КодМаркировки) КАК КодМаркировки
	|ПОМЕСТИТЬ ВозвратТоваровОтПокупателяТовары
	|ИЗ
	|	Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|			ПО (ПоступлениеТоваровУслуг.Номер = &Номер)
	|		ПО (ВозвратТоваровОтПокупателя.Номер = &Номер)
	|			И ВозвратТоваровОтПокупателяТовары.Ссылка = ВозвратТоваровОтПокупателя.Ссылка
	|ГДЕ
	|	&ЭтоВозврат
	|
	|СГРУППИРОВАТЬ ПО
	|	ВозвратТоваровОтПокупателяТовары.Номенклатура,
	|	ВозвратТоваровОтПокупателя.Дата,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровОтПокупателяТовары.СкладМагазина = ЗНАЧЕНИЕ(Справочник.СкладыМагазинов.ПустаяСсылка)
	|				И ВозвратТоваровОтПокупателя.Контрагент = &ТопДеливери
	|			ТОГДА &СкладТопДеливери
	|		ИНАЧЕ ВозвратТоваровОтПокупателяТовары.СкладМагазина
	|	КОНЕЦ,
	|	ПоступлениеТоваровУслуг.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеЧастичныхЗаказовОстатки.Заказ КАК ЗаказРеализация,
	|	ДанныеЧастичныхЗаказовОстатки.Номенклатура КАК Номенклатура,
	|	ДанныеЧастичныхЗаказовОстатки.КодМаркировки КАК КодМаркировки,
	|	ДанныеЧастичныхЗаказовОстатки.СуммаОстаток КАК Сумма,
	|	ДанныеЧастичныхЗаказовОстатки.КоличествоОстаток КАК Количество,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПоступлениеТоваровУслугТовары.Количество, 0) <> 0
	|			ТОГДА ПоступлениеТоваровУслугТовары.КоличествоМест / ПоступлениеТоваровУслугТовары.Количество * ДанныеЧастичныхЗаказовОстатки.КоличествоОстаток
	|		ИНАЧЕ ПоступлениеТоваровУслугТовары.КоличествоМест
	|	КОНЕЦ КАК КоличествоМест,
	|	ПоступлениеТоваровУслугТовары.Цена КАК Цена,
	|	ПоступлениеТоваровУслугТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ПоступлениеТоваровУслугТовары.ЕдиницаИзмеренияМест КАК ЕдиницаИзмеренияМест,
	|	ПоступлениеТоваровУслугТовары.Коэффициент КАК Коэффициент,
	|	ПоступлениеТоваровУслугТовары.СтавкаНДС КАК СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПоступлениеТоваровУслугТовары.Количество, 0) <> 0
	|			ТОГДА ПоступлениеТоваровУслугТовары.СуммаНДС / ПоступлениеТоваровУслугТовары.Количество * ДанныеЧастичныхЗаказовОстатки.КоличествоОстаток
	|		ИНАЧЕ ПоступлениеТоваровУслугТовары.СуммаНДС
	|	КОНЕЦ КАК СуммаНДС,
	|	ПоступлениеТоваровУслугТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ПоступлениеТоваровУслугТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ПоступлениеТоваровУслугТовары.Склад КАК Склад,
	|	ПоступлениеТоваровУслугТовары.КлючСвязи КАК КлючСвязи,
	|	ПоступлениеТоваровУслугТовары.ДатаДоставки КАК ДатаДоставки,
	|	ПоступлениеТоваровУслугТовары.ДокументПоступления КАК ДокументПоступления,
	|	ПоступлениеТоваровУслугТовары.СкладМагазина КАК СкладМагазина,
	|	ПоступлениеТоваровУслугТовары.ШтрихкодНоменклатуры КАК ШтрихкодНоменклатуры
	|ПОМЕСТИТЬ ВТ_Итог
	|ИЗ
	|	ДанныеЧастичныхЗаказовОстатки КАК ДанныеЧастичныхЗаказовОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПоступлениеТоваровУслугТовары КАК ПоступлениеТоваровУслугТовары
	|		ПО ДанныеЧастичныхЗаказовОстатки.Номенклатура = ПоступлениеТоваровУслугТовары.Номенклатура
	|			И ((ВЫРАЗИТЬ(ДанныеЧастичныхЗаказовОстатки.КодМаркировки КАК СТРОКА(50))) = (ВЫРАЗИТЬ(ПоступлениеТоваровУслугТовары.КодМаркировки КАК СТРОКА(50))))
	|ГДЕ
	|	НЕ &ЭтоВозврат
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеЧастичныхЗаказовОстатки_Возвраты.Заказ,
	|	ДанныеЧастичныхЗаказовОстатки_Возвраты.Номенклатура,
	|	ВозвратТоваровОтПокупателяТовары.КодМаркировки,
	|	ДанныеЧастичныхЗаказовОстатки_Возвраты.СуммаОстаток,
	|	ДанныеЧастичныхЗаказовОстатки_Возвраты.КоличествоОстаток,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВозвратТоваровОтПокупателяТовары.Количество, 0) <> 0
	|			ТОГДА ВозвратТоваровОтПокупателяТовары.КоличествоМест / ВозвратТоваровОтПокупателяТовары.Количество * ДанныеЧастичныхЗаказовОстатки_Возвраты.КоличествоОстаток
	|		ИНАЧЕ ВозвратТоваровОтПокупателяТовары.КоличествоМест
	|	КОНЕЦ,
	|	ВозвратТоваровОтПокупателяТовары.Цена,
	|	ВозвратТоваровОтПокупателяТовары.ЕдиницаИзмерения,
	|	ВозвратТоваровОтПокупателяТовары.ЕдиницаИзмеренияМест,
	|	ВозвратТоваровОтПокупателяТовары.Коэффициент,
	|	ВозвратТоваровОтПокупателяТовары.СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВозвратТоваровОтПокупателяТовары.Количество, 0) <> 0
	|			ТОГДА ВозвратТоваровОтПокупателяТовары.СуммаНДС / ВозвратТоваровОтПокупателяТовары.Количество * ДанныеЧастичныхЗаказовОстатки_Возвраты.КоличествоОстаток
	|		ИНАЧЕ ВозвратТоваровОтПокупателяТовары.СуммаНДС
	|	КОНЕЦ,
	|	ВозвратТоваровОтПокупателяТовары.ХарактеристикаНоменклатуры,
	|	ВозвратТоваровОтПокупателяТовары.СерияНоменклатуры,
	|	ВозвратТоваровОтПокупателяТовары.Склад,
	|	ВозвратТоваровОтПокупателяТовары.КлючСвязи,
	|	ВозвратТоваровОтПокупателяТовары.ДатаДоставки,
	|	ВозвратТоваровОтПокупателяТовары.ДокументПоступления,
	|	ВозвратТоваровОтПокупателяТовары.СкладМагазина,
	|	ВозвратТоваровОтПокупателяТовары.ШтрихкодНоменклатуры
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДанныеЧастичныхЗаказовОстатки.Заказ КАК Заказ,
	|		ДанныеЧастичныхЗаказовОстатки.Номенклатура КАК Номенклатура,
	|		СУММА(ДанныеЧастичныхЗаказовОстатки.СуммаОстаток) КАК СуммаОстаток,
	|		СУММА(ДанныеЧастичныхЗаказовОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|	ИЗ
	|		ДанныеЧастичныхЗаказовОстатки КАК ДанныеЧастичныхЗаказовОстатки
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ДанныеЧастичныхЗаказовОстатки.Заказ,
	|		ДанныеЧастичныхЗаказовОстатки.Номенклатура) КАК ДанныеЧастичныхЗаказовОстатки_Возвраты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВозвратТоваровОтПокупателяТовары КАК ВозвратТоваровОтПокупателяТовары
	|		ПО ДанныеЧастичныхЗаказовОстатки_Возвраты.Номенклатура = ВозвратТоваровОтПокупателяТовары.Номенклатура
	|ГДЕ
	|	&ЭтоВозврат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Итог.ЗаказРеализация КАК ЗаказРеализация,
	|	ВТ_Итог.Номенклатура КАК Номенклатура,
	|	ВТ_Итог.Сумма КАК Сумма,
	|	ВТ_Итог.Количество КАК Количество,
	|	ВТ_Итог.КоличествоМест КАК КоличествоМест,
	|	ВТ_Итог.Цена КАК Цена,
	|	ВТ_Итог.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТ_Итог.ЕдиницаИзмеренияМест КАК ЕдиницаИзмеренияМест,
	|	ВТ_Итог.Коэффициент КАК Коэффициент,
	|	ВТ_Итог.СтавкаНДС КАК СтавкаНДС,
	|	ВТ_Итог.СуммаНДС КАК СуммаНДС,
	|	ВТ_Итог.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_Итог.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ВТ_Итог.Склад КАК Склад,
	|	ВТ_Итог.КлючСвязи КАК КлючСвязи,
	|	ВТ_Итог.ДатаДоставки КАК ДатаДоставки,
	|	ВТ_Итог.ДокументПоступления КАК ДокументПоступления,
	|	ВТ_Итог.СкладМагазина КАК СкладМагазина,
	|	МАКСИМУМ(ЗакрытиеЗаказовЗаказы.Ссылка) КАК ЗакрытиеЗаказов,
	|	ВТ_Итог.ШтрихкодНоменклатуры КАК ШтрихкодНоменклатуры,
	|	ВТ_Итог.КодМаркировки КАК КодМаркировки
	|ИЗ
	|	ВТ_Итог КАК ВТ_Итог
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗакрытиеЗаказов.Заказы КАК ЗакрытиеЗаказовЗаказы
	|		ПО (ЗакрытиеЗаказовЗаказы.Закрыть
	|				ИЛИ ЗакрытиеЗаказовЗаказы.Отклонить)
	|			И ВТ_Итог.ЗаказРеализация = ЗакрытиеЗаказовЗаказы.Реализация
	|ГДЕ
	|	ИСТИНА
	|	И ВТ_Итог.СкладМагазина = &СкладМагазина
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Итог.ЗаказРеализация,
	|	ВТ_Итог.Номенклатура,
	|	ВТ_Итог.ЕдиницаИзмерения,
	|	ВТ_Итог.ЕдиницаИзмеренияМест,
	|	ВТ_Итог.СтавкаНДС,
	|	ВТ_Итог.ХарактеристикаНоменклатуры,
	|	ВТ_Итог.СерияНоменклатуры,
	|	ВТ_Итог.Склад,
	|	ВТ_Итог.ДатаДоставки,
	|	ВТ_Итог.ДокументПоступления,
	|	ВТ_Итог.СкладМагазина,
	|	ВТ_Итог.Сумма,
	|	ВТ_Итог.Количество,
	|	ВТ_Итог.КоличествоМест,
	|	ВТ_Итог.Цена,
	|	ВТ_Итог.Коэффициент,
	|	ВТ_Итог.СуммаНДС,
	|	ВТ_Итог.КлючСвязи,
	|	ВТ_Итог.ШтрихкодНоменклатуры,
	|	ВТ_Итог.КодМаркировки";
	Запрос.УстановитьПараметр("Номер", ОбщегоНазначения.ПолучитьРеквизитОбъекта(РеализацияТоваровУслугСсылка, "Номер"));
	//Асеев 02.09.2020 (Задача № 4189)<<<
	//-Степанов Задача № 3963
	
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Запрос.УстановитьПараметр("Заказ", РеализацияТоваровУслугСсылка);
	Запрос.УстановитьПараметр("ЭтоВозврат", ЭтоВозврат);
	Запрос.УстановитьПараметр("СкладМагазина", СкладМагазина);
	Запрос.УстановитьПараметр("ТопДеливери",КонтрагентТопДеливери);
	Запрос.УстановитьПараметр("СкладТопДеливери",СкладТопДеливери);
	
	Если НЕ ЗначениеЗаполнено(СкладМагазина) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И ВТ_Итог.СкладМагазина = &СкладМагазина","");
	КонецЕсли;
	
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	//Причина:
	//    860134 
	//Документ отчет водителя сделал движение Возврат2 (т.к. отказ с заездом у нас это Возврат2), при заполнении Наборной ведомости алгоритм смотрит на 
	//Возврат2 (это частичка) и ищет в РН ДанныеЧастичныхЗаказов, там ничего нет соответственно в наборную ведомость ничего не попадает.
	//А идет по алгоритму частички, потому что документ ПриходДС сделал движения со статусом ОтказКлиентаБезЗаезда (был бы изначальный ОтказКлиентаСЗаездом, 
	//все заполнилось бы, т.к. пошло бы по алгоритму полного возврата). Поменяли статус видимо руками.
	//Поэтому проверяем результат на пустоту и если он пустой, тогда делаем запрос по полному возврату.
	Если РезультатЗапроса.Количество()> 0 Тогда
		Возврат РезультатЗапроса;
	Иначе
		Возврат ПолучитьДанныеТоварыВозврат1(РеализацияТоваровУслугСсылка,ЭтоВозврат,КонтрагентТопДеливери,СкладТопДеливери);
	КонецЕсли;
	
КонецФункции // ()

&НаСервере
Функция ПолучитьДанныеТоварыВозвратОбмен(РеализацияТоваровУслугСсылка,КонтрагентТопДеливери,СкладТопДеливери, ЗаказВыполнен = Истина)
	
	//если заказ выполнен - берем возврат/обмен из возврата, если заказ не выполнен - из реализации. Запросы в общем идентичны, различаются лишь Возврат<->Реализация
	
	
	
	Запрос = Новый Запрос;
	
	Если ЗаказВыполнен Тогда
		//+Степанов Задача № 3963 В запрос добавлен код маркировки
		//Асеев 02.09.2020 (Задача № 4189)>>>
		//- в запросе КодМаркировки брать из данных регистра
		//- связывание с Документ.ПоступлениеТоваровУслуг.Товары надо выполнять после свертки ТЧ Товары ПТУ
		//- во все связи по Номенклатуре с ТЧ ПТУ добавить связь по КодуМаркировки
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеЧастичныхЗаказовОстатки.Заказ КАК Заказ,
		|	ДанныеЧастичныхЗаказовОстатки.Номенклатура КАК Номенклатура,
		|	ДанныеЧастичныхЗаказовОстатки.КодМаркировки КАК КодМаркировки,
		|	ДанныеЧастичныхЗаказовОстатки.СуммаОстаток КАК СуммаОстаток,
		|	ДанныеЧастичныхЗаказовОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ПОМЕСТИТЬ ДанныеЧастичныхЗаказовОстатки
		|ИЗ
		|	РегистрНакопления.ДанныеЧастичныхЗаказов.Остатки(&Период, Заказ = &Заказ) КАК ДанныеЧастичныхЗаказовОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
		|	СУММА(ПоступлениеТоваровУслугТовары.Количество) КАК Количество,
		|	СУММА(ПоступлениеТоваровУслугТовары.КоличествоМест) КАК КоличествоМест,
		|	МАКСИМУМ(ПоступлениеТоваровУслугТовары.Цена) КАК Цена,
		|	МАКСИМУМ(ПоступлениеТоваровУслугТовары.ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
		|	МАКСИМУМ(ПоступлениеТоваровУслугТовары.ЕдиницаИзмеренияМест) КАК ЕдиницаИзмеренияМест,
		|	МАКСИМУМ(ПоступлениеТоваровУслугТовары.Коэффициент) КАК Коэффициент,
		|	МАКСИМУМ(ПоступлениеТоваровУслугТовары.СтавкаНДС) КАК СтавкаНДС,
		|	СУММА(ПоступлениеТоваровУслугТовары.СуммаНДС) КАК СуммаНДС,
		|	МАКСИМУМ(ПоступлениеТоваровУслугТовары.ХарактеристикаНоменклатуры) КАК ХарактеристикаНоменклатуры,
		|	МАКСИМУМ(ПоступлениеТоваровУслугТовары.СерияНоменклатуры) КАК СерияНоменклатуры,
		|	МАКСИМУМ(ПоступлениеТоваровУслугТовары.Склад) КАК Склад,
		|	МАКСИМУМ(ПоступлениеТоваровУслугТовары.КлючСвязи) КАК КлючСвязи,
		|	ПоступлениеТоваровУслуг.Дата КАК ДатаДоставки,
		|	ПоступлениеТоваровУслугТовары.Ссылка КАК ДокументПоступления,
		|	ВЫБОР
		|		КОГДА ПоступлениеТоваровУслугТовары.СкладМагазина = ЗНАЧЕНИЕ(Справочник.СкладыМагазинов.ПустаяСсылка)
		|				И ПоступлениеТоваровУслуг.Контрагент = &ТопДеливери
		|			ТОГДА &СкладТопДеливери
		|		ИНАЧЕ ПоступлениеТоваровУслугТовары.СкладМагазина
		|	КОНЕЦ КАК СкладМагазина,
		|	МАКСИМУМ(ПоступлениеТоваровУслугТовары.ШтрихкодНоменклатуры) КАК ШтрихкодНоменклатуры,
		|	ПоступлениеТоваровУслугТовары.КодМаркировки КАК КодМаркировки
		|ПОМЕСТИТЬ ПоступлениеТоваровУслугТовары
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|		ПО (ПоступлениеТоваровУслуг.Номер = &Номер)
		|			И ПоступлениеТоваровУслугТовары.Ссылка = ПоступлениеТоваровУслуг.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеЧастичныхЗаказовОстатки КАК ДанныеЧастичныхЗаказовОстатки
		|		ПО ПоступлениеТоваровУслугТовары.Номенклатура = ДанныеЧастичныхЗаказовОстатки.Номенклатура
		|			И ВЫРАЗИТЬ(ПоступлениеТоваровУслугТовары.КодМаркировки КАК СТРОКА(50)) = ВЫРАЗИТЬ(ДанныеЧастичныхЗаказовОстатки.КодМаркировки КАК СТРОКА(50))
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступлениеТоваровУслугТовары.Номенклатура,
		|	ПоступлениеТоваровУслугТовары.КодМаркировки,
		|	ПоступлениеТоваровУслуг.Дата,
		|	ПоступлениеТоваровУслугТовары.Ссылка,
		|	ВЫБОР
		|		КОГДА ПоступлениеТоваровУслугТовары.СкладМагазина = ЗНАЧЕНИЕ(Справочник.СкладыМагазинов.ПустаяСсылка)
		|				И ПоступлениеТоваровУслуг.Контрагент = &ТопДеливери
		|			ТОГДА &СкладТопДеливери
		|		ИНАЧЕ ПоступлениеТоваровУслугТовары.СкладМагазина
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&Заказ КАК ЗаказРеализация,
		|	ВозвратТоваровОтПокупателяТовары.Номенклатура КАК Номенклатура,
		|	ВозвратТоваровОтПокупателяТовары.КодМаркировки КАК КодМаркировки,
		|	ВозвратТоваровОтПокупателяТовары.Сумма КАК Сумма,
		|	ВозвратТоваровОтПокупателяТовары.Количество КАК Количество,
		|	ВозвратТоваровОтПокупателяТовары.КоличествоМест КАК КоличествоМест,
		|	ВозвратТоваровОтПокупателяТовары.Цена КАК Цена,
		|	ВозвратТоваровОтПокупателяТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВозвратТоваровОтПокупателяТовары.ЕдиницаИзмеренияМест КАК ЕдиницаИзмеренияМест,
		|	ВозвратТоваровОтПокупателяТовары.Коэффициент КАК Коэффициент,
		|	ВозвратТоваровОтПокупателяТовары.СтавкаНДС КАК СтавкаНДС,
		|	ВозвратТоваровОтПокупателяТовары.СуммаНДС КАК СуммаНДС,
		|	ВозвратТоваровОтПокупателяТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВозвратТоваровОтПокупателяТовары.СерияНоменклатуры КАК СерияНоменклатуры,
		|	ВозвратТоваровОтПокупателяТовары.Склад КАК Склад,
		|	ВозвратТоваровОтПокупателяТовары.КлючСвязи КАК КлючСвязи,
		|	ВозвратТоваровОтПокупателя.Дата КАК ДатаДоставки,
		|	ПоступлениеТоваровУслуг.Ссылка КАК ДокументПоступления,
		|	ВозвратТоваровОтПокупателя.НомерВнешнегоЗаказа КАК ВнешнийНомерЗаказа,
		|	ВЫБОР
		|		КОГДА ВозвратТоваровОтПокупателяТовары.СкладМагазина = ЗНАЧЕНИЕ(Справочник.СкладыМагазинов.ПустаяСсылка)
		|				И ВозвратТоваровОтПокупателя.Контрагент = &ТопДеливери
		|			ТОГДА &СкладТопДеливери
		|		ИНАЧЕ ВозвратТоваровОтПокупателяТовары.СкладМагазина
		|	КОНЕЦ КАК СкладМагазина,
		|	ВозвратТоваровОтПокупателяТовары.ШтрихкодНоменклатуры КАК ШтрихкодНоменклатуры
		|ПОМЕСТИТЬ ВТ_Итог
		|ИЗ
		|	Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|		ПО (ПоступлениеТоваровУслуг.Номер = &Номер)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя
		|		ПО (ВозвратТоваровОтПокупателя.Номер = &Номер)
		|			И ВозвратТоваровОтПокупателяТовары.Ссылка = ВозвратТоваровОтПокупателя.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеЧастичныхЗаказовОстатки.Заказ,
		|	ДанныеЧастичныхЗаказовОстатки.Номенклатура,
		|	ДанныеЧастичныхЗаказовОстатки.КодМаркировки,
		|	ДанныеЧастичныхЗаказовОстатки.СуммаОстаток,
		|	ДанныеЧастичныхЗаказовОстатки.КоличествоОстаток,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ПоступлениеТоваровУслугТовары.Количество, 0) <> 0
		|			ТОГДА ПоступлениеТоваровУслугТовары.КоличествоМест / ПоступлениеТоваровУслугТовары.Количество * ДанныеЧастичныхЗаказовОстатки.КоличествоОстаток
		|		ИНАЧЕ ПоступлениеТоваровУслугТовары.КоличествоМест
		|	КОНЕЦ,
		|	ПоступлениеТоваровУслугТовары.Цена,
		|	ПоступлениеТоваровУслугТовары.ЕдиницаИзмерения,
		|	ПоступлениеТоваровУслугТовары.ЕдиницаИзмеренияМест,
		|	ПоступлениеТоваровУслугТовары.Коэффициент,
		|	ПоступлениеТоваровУслугТовары.СтавкаНДС,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ПоступлениеТоваровУслугТовары.Количество, 0) <> 0
		|			ТОГДА ПоступлениеТоваровУслугТовары.СуммаНДС / ПоступлениеТоваровУслугТовары.Количество * ДанныеЧастичныхЗаказовОстатки.КоличествоОстаток
		|		ИНАЧЕ ПоступлениеТоваровУслугТовары.СуммаНДС
		|	КОНЕЦ,
		|	ПоступлениеТоваровУслугТовары.ХарактеристикаНоменклатуры,
		|	ПоступлениеТоваровУслугТовары.СерияНоменклатуры,
		|	ПоступлениеТоваровУслугТовары.Склад,
		|	ПоступлениеТоваровУслугТовары.КлючСвязи,
		|	РеализацияТоваровУслуг.Дата,
		|	ПоступлениеТоваровУслугТовары.ДокументПоступления,
		|	РеализацияТоваровУслуг.НомерВнешнегоЗаказа,
		|	ПоступлениеТоваровУслугТовары.СкладМагазина,
		|	ПоступлениеТоваровУслугТовары.ШтрихкодНоменклатуры
		|ИЗ
		|	ДанныеЧастичныхЗаказовОстатки КАК ДанныеЧастичныхЗаказовОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПоступлениеТоваровУслугТовары КАК ПоступлениеТоваровУслугТовары
		|		ПО ДанныеЧастичныхЗаказовОстатки.Номенклатура = ПоступлениеТоваровУслугТовары.Номенклатура
		|			И ВЫРАЗИТЬ(ДанныеЧастичныхЗаказовОстатки.КодМаркировки КАК СТРОКА(50)) = ВЫРАЗИТЬ(ПоступлениеТоваровУслугТовары.КодМаркировки КАК СТРОКА(50))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО (РеализацияТоваровУслуг.Ссылка = &Заказ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Итог.ЗаказРеализация КАК ЗаказРеализация,
		|	ВТ_Итог.Номенклатура КАК Номенклатура,
		|	ВТ_Итог.Сумма КАК Сумма,
		|	ВТ_Итог.Количество КАК Количество,
		|	ВТ_Итог.КоличествоМест КАК КоличествоМест,
		|	ВТ_Итог.Цена КАК Цена,
		|	ВТ_Итог.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВТ_Итог.ЕдиницаИзмеренияМест КАК ЕдиницаИзмеренияМест,
		|	ВТ_Итог.Коэффициент КАК Коэффициент,
		|	ВТ_Итог.СтавкаНДС КАК СтавкаНДС,
		|	ВТ_Итог.СуммаНДС КАК СуммаНДС,
		|	ВТ_Итог.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_Итог.СерияНоменклатуры КАК СерияНоменклатуры,
		|	ВТ_Итог.Склад КАК Склад,
		|	ВТ_Итог.КлючСвязи КАК КлючСвязи,
		|	ВТ_Итог.ДатаДоставки КАК ДатаДоставки,
		|	ВТ_Итог.ДокументПоступления КАК ДокументПоступления,
		|	ВТ_Итог.ВнешнийНомерЗаказа КАК ВнешнийНомерЗаказа,
		|	ВТ_Итог.СкладМагазина КАК СкладМагазина,
		|	МАКСИМУМ(ЗакрытиеЗаказовЗаказы.Ссылка) КАК ЗакрытиеЗаказов,
		|	ВТ_Итог.ШтрихкодНоменклатуры КАК ШтрихкодНоменклатуры,
		|	ВТ_Итог.КодМаркировки КАК КодМаркировки
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗакрытиеЗаказов.Заказы КАК ЗакрытиеЗаказовЗаказы
		|		ПО (ЗакрытиеЗаказовЗаказы.Закрыть
		|				ИЛИ ЗакрытиеЗаказовЗаказы.Отклонить)
		|			И ВТ_Итог.ЗаказРеализация = ЗакрытиеЗаказовЗаказы.Реализация
		|ГДЕ
		|	ИСТИНА
		|	И ВТ_Итог.СкладМагазина = &СкладМагазина
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Итог.ЗаказРеализация,
		|	ВТ_Итог.Номенклатура,
		|	ВТ_Итог.ЕдиницаИзмерения,
		|	ВТ_Итог.ЕдиницаИзмеренияМест,
		|	ВТ_Итог.СтавкаНДС,
		|	ВТ_Итог.ХарактеристикаНоменклатуры,
		|	ВТ_Итог.СерияНоменклатуры,
		|	ВТ_Итог.Склад,
		|	ВТ_Итог.ДатаДоставки,
		|	ВТ_Итог.ДокументПоступления,
		|	ВТ_Итог.СкладМагазина,
		|	ВТ_Итог.ВнешнийНомерЗаказа,
		|	ВТ_Итог.Сумма,
		|	ВТ_Итог.Количество,
		|	ВТ_Итог.КоличествоМест,
		|	ВТ_Итог.Цена,
		|	ВТ_Итог.Коэффициент,
		|	ВТ_Итог.СуммаНДС,
		|	ВТ_Итог.КлючСвязи,
		|	ВТ_Итог.ШтрихкодНоменклатуры,
		|	ВТ_Итог.КодМаркировки";
	ИначеЕсли Не ЗаказВыполнен Тогда
		//+Степанов Задача № 3963 В запрос добавлен код маркировки
		//Асеев 02.09.2020 (Задача № 4189)>>>
		//- в запросе КодМаркировки брать из данных регистра
		//- связывание с Документ.ПоступлениеТоваровУслуг.Товары надо выполнлять после свертки ТЧ Товары ПТУ
		//- во все связи по Номенклатуре с ТЧ ПТУ добавить связь по КодуМаркировки
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеЧастичныхЗаказовОстатки.Заказ КАК Заказ,
		|	ДанныеЧастичныхЗаказовОстатки.Номенклатура КАК Номенклатура,
		|	ДанныеЧастичныхЗаказовОстатки.КодМаркировки КАК КодМаркировки,
		|	ДанныеЧастичныхЗаказовОстатки.СуммаОстаток КАК СуммаОстаток,
		|	ДанныеЧастичныхЗаказовОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ПОМЕСТИТЬ ДанныеЧастичныхЗаказовОстатки
		|ИЗ
		|	РегистрНакопления.ДанныеЧастичныхЗаказов.Остатки(&Период, Заказ = &Заказ) КАК ДанныеЧастичныхЗаказовОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
		|	СУММА(ПоступлениеТоваровУслугТовары.Количество) КАК Количество,
		|	СУММА(ПоступлениеТоваровУслугТовары.КоличествоМест) КАК КоличествоМест,
		|	МАКСИМУМ(ПоступлениеТоваровУслугТовары.Цена) КАК Цена,
		|	МАКСИМУМ(ПоступлениеТоваровУслугТовары.ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
		|	МАКСИМУМ(ПоступлениеТоваровУслугТовары.ЕдиницаИзмеренияМест) КАК ЕдиницаИзмеренияМест,
		|	МАКСИМУМ(ПоступлениеТоваровУслугТовары.Коэффициент) КАК Коэффициент,
		|	МАКСИМУМ(ПоступлениеТоваровУслугТовары.СтавкаНДС) КАК СтавкаНДС,
		|	СУММА(ПоступлениеТоваровУслугТовары.СуммаНДС) КАК СуммаНДС,
		|	МАКСИМУМ(ПоступлениеТоваровУслугТовары.ХарактеристикаНоменклатуры) КАК ХарактеристикаНоменклатуры,
		|	МАКСИМУМ(ПоступлениеТоваровУслугТовары.СерияНоменклатуры) КАК СерияНоменклатуры,
		|	МАКСИМУМ(ПоступлениеТоваровУслугТовары.Склад) КАК Склад,
		|	МАКСИМУМ(ПоступлениеТоваровУслугТовары.КлючСвязи) КАК КлючСвязи,
		|	ПоступлениеТоваровУслуг.Дата КАК ДатаДоставки,
		|	ПоступлениеТоваровУслугТовары.Ссылка КАК ДокументПоступления,
		|	ВЫБОР
		|		КОГДА ПоступлениеТоваровУслугТовары.СкладМагазина = ЗНАЧЕНИЕ(Справочник.СкладыМагазинов.ПустаяСсылка)
		|				И ПоступлениеТоваровУслуг.Контрагент = &ТопДеливери
		|			ТОГДА &СкладТопДеливери
		|		ИНАЧЕ ПоступлениеТоваровУслугТовары.СкладМагазина
		|	КОНЕЦ КАК СкладМагазина,
		|	МАКСИМУМ(ПоступлениеТоваровУслугТовары.ШтрихкодНоменклатуры) КАК ШтрихкодНоменклатуры,
		|	ПоступлениеТоваровУслугТовары.КодМаркировки КАК КодМаркировки
		|ПОМЕСТИТЬ ПоступлениеТоваровУслугТовары
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|		ПО (ПоступлениеТоваровУслуг.Номер = &Номер)
		|			И ПоступлениеТоваровУслугТовары.Ссылка = ПоступлениеТоваровУслуг.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеЧастичныхЗаказовОстатки КАК ДанныеЧастичныхЗаказовОстатки
		|		ПО ПоступлениеТоваровУслугТовары.Номенклатура = ДанныеЧастичныхЗаказовОстатки.Номенклатура
		|			И ВЫРАЗИТЬ(ПоступлениеТоваровУслугТовары.КодМаркировки КАК СТРОКА(50)) = ВЫРАЗИТЬ(ДанныеЧастичныхЗаказовОстатки.КодМаркировки КАК СТРОКА(50))
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступлениеТоваровУслугТовары.Номенклатура,
		|	ПоступлениеТоваровУслугТовары.КодМаркировки,
		|	ПоступлениеТоваровУслуг.Дата,
		|	ПоступлениеТоваровУслугТовары.Ссылка,
		|	ВЫБОР
		|		КОГДА ПоступлениеТоваровУслугТовары.СкладМагазина = ЗНАЧЕНИЕ(Справочник.СкладыМагазинов.ПустаяСсылка)
		|				И ПоступлениеТоваровУслуг.Контрагент = &ТопДеливери
		|			ТОГДА &СкладТопДеливери
		|		ИНАЧЕ ПоступлениеТоваровУслугТовары.СкладМагазина
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&Заказ КАК ЗаказРеализация,
		|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
		|	РеализацияТоваровУслугТовары.КодМаркировки КАК КодМаркировки,
		|	РеализацияТоваровУслугТовары.Сумма КАК Сумма,
		|	РеализацияТоваровУслугТовары.Количество КАК Количество,
		|	РеализацияТоваровУслугТовары.КоличествоМест КАК КоличествоМест,
		|	РеализацияТоваровУслугТовары.Цена КАК Цена,
		|	РеализацияТоваровУслугТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	РеализацияТоваровУслугТовары.ЕдиницаИзмеренияМест КАК ЕдиницаИзмеренияМест,
		|	РеализацияТоваровУслугТовары.Коэффициент КАК Коэффициент,
		|	РеализацияТоваровУслугТовары.СтавкаНДС КАК СтавкаНДС,
		|	РеализацияТоваровУслугТовары.СуммаНДС КАК СуммаНДС,
		|	РеализацияТоваровУслугТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	РеализацияТоваровУслугТовары.СерияНоменклатуры КАК СерияНоменклатуры,
		|	РеализацияТоваровУслугТовары.Склад КАК Склад,
		|	РеализацияТоваровУслугТовары.КлючСвязи КАК КлючСвязи,
		|	РеализацияТоваровУслуг.Дата КАК ДатаДоставки,
		|	ПоступлениеТоваровУслуг.Ссылка КАК ДокументПоступления,
		|	РеализацияТоваровУслуг.НомерВнешнегоЗаказа КАК ВнешнийНомерЗаказа,
		|	ВЫБОР
		|		КОГДА РеализацияТоваровУслугТовары.СкладМагазина = ЗНАЧЕНИЕ(Справочник.СкладыМагазинов.ПустаяСсылка)
		|				И РеализацияТоваровУслуг.Контрагент = &ТопДеливери
		|			ТОГДА &СкладТопДеливери
		|		ИНАЧЕ РеализацияТоваровУслугТовары.СкладМагазина
		|	КОНЕЦ КАК СкладМагазина,
		|	РеализацияТоваровУслугТовары.ШтрихкодНоменклатуры КАК ШтрихкодНоменклатуры
		|ПОМЕСТИТЬ ВТ_Итог
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО (РеализацияТоваровУслуг.Ссылка = &Заказ)
		|			И (РеализацияТоваровУслугТовары.Ссылка = &Заказ)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|		ПО (ПоступлениеТоваровУслуг.Номер = &Номер)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Заказ КАК ЗаказРеализация,
		|	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура КАК Номенклатура,
		|	РеализацияТоваровУслугПодарочныеПозиции.КодМаркировки КАК КодМаркировки,
		|	РеализацияТоваровУслугПодарочныеПозиции.Сумма КАК Сумма,
		|	РеализацияТоваровУслугПодарочныеПозиции.Количество КАК Количество,
		|	РеализацияТоваровУслугПодарочныеПозиции.КоличествоМест КАК КоличествоМест,
		|	РеализацияТоваровУслугПодарочныеПозиции.Цена КАК Цена,
		|	РеализацияТоваровУслугПодарочныеПозиции.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	РеализацияТоваровУслугПодарочныеПозиции.ЕдиницаИзмеренияМест КАК ЕдиницаИзмеренияМест,
		|	РеализацияТоваровУслугПодарочныеПозиции.Коэффициент КАК Коэффициент,
		|	РеализацияТоваровУслугПодарочныеПозиции.СтавкаНДС КАК СтавкаНДС,
		|	РеализацияТоваровУслугПодарочныеПозиции.СуммаНДС КАК СуммаНДС,
		|	РеализацияТоваровУслугПодарочныеПозиции.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	РеализацияТоваровУслугПодарочныеПозиции.СерияНоменклатуры КАК СерияНоменклатуры,
		|	РеализацияТоваровУслугПодарочныеПозиции.Склад КАК Склад,
		|	РеализацияТоваровУслугПодарочныеПозиции.КлючСвязи КАК КлючСвязи,
		|	РеализацияТоваровУслуг.Дата КАК ДатаДоставки,
		|	ПоступлениеТоваровУслуг.Ссылка КАК ДокументПоступления,
		|	РеализацияТоваровУслуг.НомерВнешнегоЗаказа КАК ВнешнийНомерЗаказа,
		|	ВЫБОР
		|		КОГДА РеализацияТоваровУслугПодарочныеПозиции.СкладМагазина = ЗНАЧЕНИЕ(Справочник.СкладыМагазинов.ПустаяСсылка)
		|				И РеализацияТоваровУслуг.Контрагент = &ТопДеливери
		|			ТОГДА &СкладТопДеливери
		|		ИНАЧЕ РеализацияТоваровУслугПодарочныеПозиции.СкладМагазина
		|	КОНЕЦ КАК СкладМагазина,
		|	РеализацияТоваровУслугПодарочныеПозиции.ШтрихкодНоменклатуры КАК ШтрихкодНоменклатуры
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.ПодарочныеПозиции КАК РеализацияТоваровУслугПодарочныеПозиции
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО (РеализацияТоваровУслуг.Ссылка = &Заказ)
		|			И (РеализацияТоваровУслугПодарочныеПозиции.Ссылка = &Заказ)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|		ПО (ПоступлениеТоваровУслуг.Номер = &Номер)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеЧастичныхЗаказовОстатки.Заказ,
		|	ДанныеЧастичныхЗаказовОстатки.Номенклатура,
		|	ДанныеЧастичныхЗаказовОстатки.КодМаркировки,
		|	ДанныеЧастичныхЗаказовОстатки.СуммаОстаток,
		|	ДанныеЧастичныхЗаказовОстатки.КоличествоОстаток,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ПоступлениеТоваровУслугТовары.Количество, 0) <> 0
		|			ТОГДА ПоступлениеТоваровУслугТовары.КоличествоМест / ПоступлениеТоваровУслугТовары.Количество * ДанныеЧастичныхЗаказовОстатки.КоличествоОстаток
		|		ИНАЧЕ ПоступлениеТоваровУслугТовары.КоличествоМест
		|	КОНЕЦ,
		|	ПоступлениеТоваровУслугТовары.Цена,
		|	ПоступлениеТоваровУслугТовары.ЕдиницаИзмерения,
		|	ПоступлениеТоваровУслугТовары.ЕдиницаИзмеренияМест,
		|	ПоступлениеТоваровУслугТовары.Коэффициент,
		|	ПоступлениеТоваровУслугТовары.СтавкаНДС,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ПоступлениеТоваровУслугТовары.Количество, 0) <> 0
		|			ТОГДА ПоступлениеТоваровУслугТовары.СуммаНДС / ПоступлениеТоваровУслугТовары.Количество * ДанныеЧастичныхЗаказовОстатки.КоличествоОстаток
		|		ИНАЧЕ ПоступлениеТоваровУслугТовары.СуммаНДС
		|	КОНЕЦ,
		|	ПоступлениеТоваровУслугТовары.ХарактеристикаНоменклатуры,
		|	ПоступлениеТоваровУслугТовары.СерияНоменклатуры,
		|	ПоступлениеТоваровУслугТовары.Склад,
		|	ПоступлениеТоваровУслугТовары.КлючСвязи,
		|	РеализацияТоваровУслуг.Дата,
		|	ПоступлениеТоваровУслугТовары.ДокументПоступления,
		|	РеализацияТоваровУслуг.НомерВнешнегоЗаказа,
		|	ПоступлениеТоваровУслугТовары.СкладМагазина,
		|	ПоступлениеТоваровУслугТовары.ШтрихкодНоменклатуры
		|ИЗ
		|	ДанныеЧастичныхЗаказовОстатки КАК ДанныеЧастичныхЗаказовОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПоступлениеТоваровУслугТовары КАК ПоступлениеТоваровУслугТовары
		|		ПО ДанныеЧастичныхЗаказовОстатки.Номенклатура = ПоступлениеТоваровУслугТовары.Номенклатура
		|			И ВЫРАЗИТЬ(ДанныеЧастичныхЗаказовОстатки.КодМаркировки КАК СТРОКА(50)) = ВЫРАЗИТЬ(ПоступлениеТоваровУслугТовары.КодМаркировки КАК СТРОКА(50))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО (РеализацияТоваровУслуг.Ссылка = &Заказ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Итог.ЗаказРеализация КАК ЗаказРеализация,
		|	ВТ_Итог.Номенклатура КАК Номенклатура,
		|	ВТ_Итог.Сумма КАК Сумма,
		|	ВТ_Итог.Количество КАК Количество,
		|	ВТ_Итог.КоличествоМест КАК КоличествоМест,
		|	ВТ_Итог.Цена КАК Цена,
		|	ВТ_Итог.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВТ_Итог.ЕдиницаИзмеренияМест КАК ЕдиницаИзмеренияМест,
		|	ВТ_Итог.Коэффициент КАК Коэффициент,
		|	ВТ_Итог.СтавкаНДС КАК СтавкаНДС,
		|	ВТ_Итог.СуммаНДС КАК СуммаНДС,
		|	ВТ_Итог.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_Итог.СерияНоменклатуры КАК СерияНоменклатуры,
		|	ВТ_Итог.Склад КАК Склад,
		|	ВТ_Итог.КлючСвязи КАК КлючСвязи,
		|	ВТ_Итог.ДатаДоставки КАК ДатаДоставки,
		|	ВТ_Итог.ДокументПоступления КАК ДокументПоступления,
		|	ВТ_Итог.ВнешнийНомерЗаказа КАК ВнешнийНомерЗаказа,
		|	ВТ_Итог.СкладМагазина КАК СкладМагазина,
		|	МАКСИМУМ(ЗакрытиеЗаказовЗаказы.Ссылка) КАК ЗакрытиеЗаказов,
		|	ВТ_Итог.ШтрихкодНоменклатуры КАК ШтрихкодНоменклатуры,
		|	ВТ_Итог.КодМаркировки КАК КодМаркировки
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗакрытиеЗаказов.Заказы КАК ЗакрытиеЗаказовЗаказы
		|		ПО (ЗакрытиеЗаказовЗаказы.Закрыть
		|				ИЛИ ЗакрытиеЗаказовЗаказы.Отклонить)
		|			И ВТ_Итог.ЗаказРеализация = ЗакрытиеЗаказовЗаказы.Реализация
		|ГДЕ
		|	ИСТИНА
		|	И ВТ_Итог.СкладМагазина = &СкладМагазина
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Итог.ЗаказРеализация,
		|	ВТ_Итог.Номенклатура,
		|	ВТ_Итог.ЕдиницаИзмерения,
		|	ВТ_Итог.ЕдиницаИзмеренияМест,
		|	ВТ_Итог.СтавкаНДС,
		|	ВТ_Итог.ХарактеристикаНоменклатуры,
		|	ВТ_Итог.СерияНоменклатуры,
		|	ВТ_Итог.Склад,
		|	ВТ_Итог.ДатаДоставки,
		|	ВТ_Итог.ДокументПоступления,
		|	ВТ_Итог.СкладМагазина,
		|	ВТ_Итог.ВнешнийНомерЗаказа,
		|	ВТ_Итог.Сумма,
		|	ВТ_Итог.Количество,
		|	ВТ_Итог.КоличествоМест,
		|	ВТ_Итог.Цена,
		|	ВТ_Итог.Коэффициент,
		|	ВТ_Итог.СуммаНДС,
		|	ВТ_Итог.КлючСвязи,
		|	ВТ_Итог.ШтрихкодНоменклатуры,
		|	ВТ_Итог.КодМаркировки";	
		//Асеев 02.09.2020 (Задача № 4189)<<<
		//-Степанов Задача № 3963
	КонецеСли;
	
	//Асеев 02.09.2020 (Задача № 4189)>>>
	//Запрос.УстановитьПараметр("Номер", РеализацияТоваровУслугСсылка.Номер);
	Запрос.УстановитьПараметр("Заказ", РеализацияТоваровУслугСсылка);
	Запрос.УстановитьПараметр("Номер", ОбщегоНазначения.ПолучитьРеквизитОбъекта(РеализацияТоваровУслугСсылка, "Номер"));
	//Асеев 02.09.2020 (Задача № 4189)<<<
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Запрос.УстановитьПараметр("СкладМагазина", СкладМагазина);
	Запрос.УстановитьПараметр("ТопДеливери",КонтрагентТопДеливери);
	Запрос.УстановитьПараметр("СкладТопДеливери",СкладТопДеливери);
	
	Если НЕ ЗначениеЗаполнено(СкладМагазина) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И ВТ_Итог.СкладМагазина = &СкладМагазина","");
	КонецЕсли;   
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Возврат РезультатЗапроса;
	
КонецФункции // ()
// <<--- МАС 


Функция СоздатьНаОснованииИВернуть() Экспорт
	
	//Для заполнения возвратов     
	мСтруктураПараметровВзаиморасчетов = Новый Структура;
	мСтруктураПараметровВзаиморасчетов.Вставить("СтруктураТабличныхЧастей", Новый Структура("Товары"));
	мСтруктураПараметровВзаиморасчетов.Вставить("Направление", "Поступление");
	мСтруктураПараметровВзаиморасчетов.Вставить("ЕстьЗаказыВТабличныхЧастях", Ложь);
	мСтруктураПараметровВзаиморасчетов.Вставить("ИмяЗаказаВТабличныхЧастях");
	мСтруктураПараметровВзаиморасчетов.Вставить("ЭтоВозврат", Истина);
	мСтруктураПараметровВзаиморасчетов.Вставить("Дата",);
	
	//+++++Серегин М.В. 05.10.2015 15:54:05 костыль 
	Если ЗначениеЗаполнено(ИнтернетМагазин) Тогда 
		МассивКонтрагентов = Новый Массив;
		МассивКонтрагентов.Добавить(ИнтернетМагазин);
	Иначе
		МассивКонтрагентов = ПолучитьКонтрагентов().ВыгрузитьКолонку("Контрагент");
	КонецЕсли;
	
	МассивДоков = Новый Массив;
	
	Для каждого Стр Из МассивКонтрагентов Цикл		
		ДокументВозвратПоставщику = Документы.ВозвратТоваровПоставщику.СоздатьДокумент();
		ЗаполнитьДокументВозвратПоставщику(ДокументВозвратПоставщику,ЭтотОбъект.Ссылка,Стр, мСтруктураПараметровВзаиморасчетов);
		// Михушкин - 05.04.2016 - Заполнение ТЧ Экземпляры документа Возврат товаров поставщику --->> 
		Если СокрЛП(Стр.Код) = "Shop_612" Тогда	
			oz_СформироватьТЧЭкземпляры(ДокументВозвратПоставщику);
		КонецЕсли;
		// <<--- Михушкин		
		// МАС - 25.12.2017 - № --->> 
		ДокументВозвратПоставщику.СтатусВозврата = ПредопределенноеЗначение("Справочник.СтатусыСкладскогоУчета.ПодготовленКВозврату");
		// <<--- МАС 	
		
		// МАС - 26.02.2018 -  --->> 		
		ДокументВозвратПоставщику.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		// <<--- МАС 	
		
		// МАС - 12.03.2018 - № --->> 
		ДокументВозвратПоставщику.Склад = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "ОсновнойСклад");
		// <<--- МАС 
		
		// МАС - 13.04.2018 - № --->> 
		Если ДокументВозвратПоставщику.СкладМагазина.Пустая() Тогда	
			ЗапросСклад = Новый Запрос("ВЫБРАТЬ
			|	СкладыМагазинов.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.СкладыМагазинов КАК СкладыМагазинов
			|ГДЕ
			|	СкладыМагазинов.Владелец = &Владелец
			|	И СкладыМагазинов.НеИспользуется = ЛОЖЬ
			|	И СкладыМагазинов.ПометкаУдаления = ЛОЖЬ");
			ЗапросСклад.УстановитьПараметр("Владелец", ДокументВозвратПоставщику.Контрагент);
			РезСклад = ЗапросСклад.Выполнить().Выбрать();			
			Если РезСклад.Следующий() Тогда		
				ДокументВозвратПоставщику.СкладМагазина = РезСклад.Ссылка;				
			КонецЕсли;			
		КонецЕсли;		
		// <<--- МАС 		
		
		ДокументВозвратПоставщику.Записать(РежимЗаписиДокумента.Запись);	
		МассивДоков.Добавить(ДокументВозвратПоставщику.Ссылка);		
	КонецЦикла;
	
	Возврат МассивДоков;
	
	
КонецФункции
// <<--- МАС 


// МАС - 14.12.2017 - № --->> 
Процедура ЗаполнитьШтрихкоды(МассивЗаказов) Экспорт	
	
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//                      |	ШтрихкодыЗаказов.Штрихкод КАК Штрихкод,
	//                      |	NULL КАК ШКТовара,
	//                      |	ШтрихкодыЗаказов.Заказ КАК Заказ,
	//                      |	NULL КАК Товар,
	//                      |	NULL КАК МестоЗаказа
	//                      |ИЗ
	//                      |	РегистрСведений.ШтрихкодыЗаказов КАК ШтрихкодыЗаказов
	//                      |ГДЕ
	//                      |	ШтрихкодыЗаказов.Заказ В(&МассивЗаказов)
	//                      |
	//                      |СГРУППИРОВАТЬ ПО
	//                      |	ШтрихкодыЗаказов.Штрихкод,
	//                      |	ШтрихкодыЗаказов.Заказ
	//                      |
	//                      |ОБЪЕДИНИТЬ ВСЕ
	//                      |
	//                      |ВЫБРАТЬ
	//                      |	РеализацияТоваровУслугТовары.ШтрихкодНоменклатуры.Код,
	//                      |	РеализацияТоваровУслугТовары.ШтрихкодНоменклатуры,
	//                      |	РеализацияТоваровУслугТовары.Ссылка,
	//                      |	РеализацияТоваровУслугТовары.Номенклатура,
	//                      |	NULL
	//                      |ИЗ
	//                      |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	//                      |ГДЕ
	//                      |	РеализацияТоваровУслугТовары.Ссылка В(&МассивЗаказов)
	//                      |
	//                      |СГРУППИРОВАТЬ ПО
	//                      |	РеализацияТоваровУслугТовары.ШтрихкодНоменклатуры,
	//                      |	РеализацияТоваровУслугТовары.ШтрихкодНоменклатуры.Код,
	//                      |	РеализацияТоваровУслугТовары.Номенклатура,
	//                      |	РеализацияТоваровУслугТовары.Ссылка
	//                      |
	//                      |ОБЪЕДИНИТЬ ВСЕ
	//                      |
	//                      |ВЫБРАТЬ
	//                      |	МестаПоЗаказам.Штрихкод,
	//                      |	NULL,
	//                      |	МестаПоЗаказам.Заказ,
	//                      |	NULL,
	//                      |	МестаПоЗаказам.Ссылка
	//                      |ИЗ
	//                      |	Справочник.МестаПоЗаказам КАК МестаПоЗаказам
	//                      |ГДЕ
	//                      |	МестаПоЗаказам.Заказ В(&МассивЗаказов)
	//                      |
	//                      |СГРУППИРОВАТЬ ПО
	//                      |	МестаПоЗаказам.Штрихкод,
	//                      |	МестаПоЗаказам.Заказ,
	//                      |	МестаПоЗаказам.Ссылка");
	//Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
	//РезТЗ = Запрос.Выполнить().Выгрузить();
	
	
	
	
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//                      |	МестаПоЗаказам.Ссылка КАК Ссылка,
	//                      |	МестаПоЗаказам.Заказ КАК Заказ,
	//                      |	МестаПоЗаказам.Штрихкод КАК Штрихкод
	//                      |ПОМЕСТИТЬ ВТ
	//                      |ИЗ
	//                      |	Справочник.МестаПоЗаказам КАК МестаПоЗаказам
	//                      |ГДЕ
	//                      |	МестаПоЗаказам.Заказ В(&МассивЗаказов)
	//                      |
	//                      |СГРУППИРОВАТЬ ПО
	//                      |	МестаПоЗаказам.Ссылка,
	//                      |	МестаПоЗаказам.Заказ,
	//                      |	МестаПоЗаказам.Штрихкод
	//                      |;
	//                      |
	//                      |////////////////////////////////////////////////////////////////////////////////
	//                      |ВЫБРАТЬ
	//                      |	ШтрихкодыЗаказов.Штрихкод КАК Штрихкод,
	//                      |	NULL КАК ШКТовара,
	//                      |	ШтрихкодыЗаказов.Заказ КАК Заказ,
	//                      |	NULL КАК Товар,
	//                      |	NULL КАК МестоЗаказа
	//                      |ИЗ
	//                      |	РегистрСведений.ШтрихкодыЗаказов КАК ШтрихкодыЗаказов
	//                      |ГДЕ
	//                      |	ШтрихкодыЗаказов.Заказ В(&МассивЗаказов)
	//                      |	И НЕ ШтрихкодыЗаказов.Штрихкод В
	//                      |				(ВЫБРАТЬ
	//                      |					ВТ.Штрихкод
	//                      |				ИЗ
	//                      |					ВТ КАК ВТ)
	//                      |
	//                      |СГРУППИРОВАТЬ ПО
	//                      |	ШтрихкодыЗаказов.Заказ,
	//                      |	ШтрихкодыЗаказов.Штрихкод
	//                      |
	//                      |ОБЪЕДИНИТЬ ВСЕ
	//                      |
	//                      |ВЫБРАТЬ
	//                      |	РеализацияТоваровУслугТовары.ШтрихкодНоменклатуры.Код,
	//                      |	РеализацияТоваровУслугТовары.ШтрихкодНоменклатуры,
	//                      |	РеализацияТоваровУслугТовары.Ссылка,
	//                      |	РеализацияТоваровУслугТовары.Номенклатура,
	//                      |	NULL
	//                      |ИЗ
	//                      |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	//                      |ГДЕ
	//                      |	РеализацияТоваровУслугТовары.Ссылка В(&МассивЗаказов)
	//                      |
	//                      |СГРУППИРОВАТЬ ПО
	//                      |	РеализацияТоваровУслугТовары.ШтрихкодНоменклатуры,
	//                      |	РеализацияТоваровУслугТовары.ШтрихкодНоменклатуры.Код,
	//                      |	РеализацияТоваровУслугТовары.Номенклатура,
	//                      |	РеализацияТоваровУслугТовары.Ссылка
	//                      |
	//                      |ОБЪЕДИНИТЬ ВСЕ
	//                      |
	//                      |ВЫБРАТЬ
	//                      |	МестаПоЗаказам.Штрихкод,
	//                      |	NULL,
	//                      |	МестаПоЗаказам.Заказ,
	//                      |	NULL,
	//                      |	МестаПоЗаказам.Ссылка
	//                      |ИЗ
	//                      |	Справочник.МестаПоЗаказам КАК МестаПоЗаказам
	//                      |ГДЕ
	//                      |	МестаПоЗаказам.Заказ В(&МассивЗаказов)
	//                      |
	//                      |СГРУППИРОВАТЬ ПО
	//                      |	МестаПоЗаказам.Штрихкод,
	//                      |	МестаПоЗаказам.Заказ,
	//                      |	МестаПоЗаказам.Ссылка");
	//Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
	//РезТЗ = Запрос.Выполнить().Выгрузить();
	
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	МестаПоЗаказам.Ссылка КАК Ссылка,
	|	МестаПоЗаказам.Заказ КАК Заказ,
	|	МестаПоЗаказам.Штрихкод КАК Штрихкод
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Справочник.МестаПоЗаказам КАК МестаПоЗаказам
	|ГДЕ
	|	МестаПоЗаказам.Заказ В(&МассивЗаказов)
	|
	|СГРУППИРОВАТЬ ПО
	|	МестаПоЗаказам.Ссылка,
	|	МестаПоЗаказам.Заказ,
	|	МестаПоЗаказам.Штрихкод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШтрихкодыЗаказов.Штрихкод КАК Штрихкод,
	|	NULL КАК ШКТовара,
	|	ШтрихкодыЗаказов.Заказ КАК Заказ,
	|	NULL КАК Товар,
	|	NULL КАК МестоЗаказа
	|ИЗ
	|	РегистрСведений.ШтрихкодыЗаказов КАК ШтрихкодыЗаказов
	|ГДЕ
	|	ШтрихкодыЗаказов.Заказ В(&МассивЗаказов)
	|	И НЕ ШтрихкодыЗаказов.Штрихкод В
	|				(ВЫБРАТЬ
	|					ВТ.Штрихкод
	|				ИЗ
	|					ВТ КАК ВТ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ШтрихкодыЗаказов.Заказ,
	|	ШтрихкодыЗаказов.Штрихкод
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.ШтрихкодНоменклатуры.Код,
	|	РеализацияТоваровУслугТовары.ШтрихкодНоменклатуры,
	|	РеализацияТоваровУслугТовары.Ссылка,
	|	РеализацияТоваровУслугТовары.Номенклатура,
	|	NULL
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка В(&МассивЗаказов)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслугТовары.ШтрихкодНоменклатуры,
	|	РеализацияТоваровУслугТовары.ШтрихкодНоменклатуры.Код,
	|	РеализацияТоваровУслугТовары.Номенклатура,
	|	РеализацияТоваровУслугТовары.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МестаПоЗаказам.Штрихкод,
	|	NULL,
	|	МестаПоЗаказам.Заказ,
	|	NULL,
	|	МестаПоЗаказам.Ссылка
	|ИЗ
	|	Справочник.МестаПоЗаказам КАК МестаПоЗаказам
	|ГДЕ
	|	МестаПоЗаказам.Заказ В(&МассивЗаказов)
	|
	|СГРУППИРОВАТЬ ПО
	|	МестаПоЗаказам.Штрихкод,
	|	МестаПоЗаказам.Заказ,
	|	МестаПоЗаказам.Ссылка");
	Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
	РезТЗ = Запрос.Выполнить().Выгрузить();
	
	
	// типа костыль, но неплохой
	ТоварыТЗ = ЭтотОбъект.Товары.Выгрузить();
	//ТоварыТЗ.Свернуть("ЗаказРеализация,Номенклатура,ШтрихкодНоменклатуры");			
	//CeHbKA #4075 08.07.2020
	ТоварыТЗ.Свернуть("ЗаказРеализация,Номенклатура,ШтрихкодНоменклатуры,КодМаркировки");			
	
	Для каждого Стр Из ТоварыТЗ Цикл	
		НСтр = РезТЗ.Добавить();	
		НСтр.ШКТовара = Стр.ШтрихкодНоменклатуры;
		НСтр.Штрихкод = Стр.ШтрихкодНоменклатуры.Код;
		НСтр.Заказ    = Стр.ЗаказРеализация;   
		НСтр.Товар    = Стр.Номенклатура;		
		
		//CeHbKA #4075 08.07.2020
		Если ЗначениеЗаполнено(Стр.КодМаркировки) Тогда
			НСтр2 = РезТЗ.Добавить();	
			НСтр2.Штрихкод = Стр.КодМаркировки;
			НСтр2.Заказ    = Стр.ЗаказРеализация;   
			НСтр2.Товар    = Стр.Номенклатура;		
			
			МассивСтрокТЗ = РезТЗ.НайтиСтроки(Новый Структура("Штрихкод", Стр.ШтрихкодНоменклатуры.Код));
			
			Для каждого СтрокаТЗ Из МассивСтрокТЗ Цикл
				
				Если ЗначениеЗаполнено(СтрокаТЗ.МестоЗаказа) Тогда
					НСтр2.МестоЗаказа = СтрокаТЗ.МестоЗаказа;
				КонецЕсли; 
				
			КонецЦикла; 
			
		КонецЕсли; 
		//CeHbKA #4075 08.07.2020
	
	КонецЦикла;
		
	Штрихкоды.Загрузить(РезТЗ);
	
КонецПроцедуры


Процедура ЗаполнитьМестаПоЗаказам(МассивЗаказов) Экспорт
	
	//Геннадий #4135 13.08.2020 ->
	//добавлено условие НеАктуальные = Ложь
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	МестаПоЗаказам.Ссылка КАК МестоЗаказа,
	                      |	МестаПоЗаказам.Штрихкод КАК Штрихкод,
	                      |	МестаПоЗаказам.Заказ КАК Заказ
	                      |ИЗ
	                      |	Справочник.МестаПоЗаказам КАК МестаПоЗаказам
	                      |ГДЕ
	                      |	МестаПоЗаказам.Заказ В(&МассивЗаказов)
	                      |	И НЕ МестаПоЗаказам.НеАктуальное
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	МестаПоЗаказам.Ссылка,
	                      |	МестаПоЗаказам.Штрихкод,
	                      |	МестаПоЗаказам.Заказ");
	//Геннадий #4135 13.08.2020 <-
	Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
	
	РезТЗ = Запрос.Выполнить().Выгрузить();
	
	МестаПоЗаказам.Загрузить(РезТЗ);
		
КонецПроцедуры


// <<--- МАС

//+Степанов
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	ПроверяемыеРеквизиты.Добавить("ТерминалДоставки");
КонецПроцедуры



