
&НаСервере
Процедура СформироватьЛинейкуШтрихкодовНаСервере(Код)
	may.ЗаписатьЛинейкуШтрихкодов(Справочники.ЛинейкиИзмеренияГабаритов.НайтиПоКоду(Код));
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЛинейкуШтрихкодов(Команда)
	Если Элементы.Список.ТекущиеДанные.Код <> Неопределено Тогда
		Ответ = Вопрос("Записать линейку Штрихкодов?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			СформироватьЛинейкуШтрихкодовНаСервере(Элементы.Список.ТекущиеДанные.Код);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	Если Элементы.Список.ТекущиеДанные.Код <> Неопределено Тогда
		Табл = may.СформироватьПечатьЛинейкиШК(Справочники.ЛинейкиИзмеренияГабаритов.НайтиПоКоду(Элементы.Список.ТекущиеДанные.Код));
		Табл.АвтоМасштаб = Истина;
		Табл.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		Табл.Показать();
	КонецЕсли;
КонецПроцедуры
