Процедура ВыбратьЭкипажДляРейса(Рейс, ДатаПланирования, Транспорт, ТекущийВодитель, ТекущийЭкспедитор, ФормаВладелец, ЭлементФормыДляОбновления = Неопределено) Экспорт
	Фрм = ПолучитьФорму("Документ.Рейс.Форма.ФормаВыбораТранспорта", Новый Структура("РежимВыбора, ДатаРейса, Транспорт", Истина, КонецДня(ДатаПланирования), Транспорт), ФормаВладелец);
	Струк = Фрм.ОткрытьМодально();
	Если ЗначениеЗаполнено(Струк) Тогда
		
		ВыбТранспорт = Струк.Транспорт;
		ВыбВодитель = Струк.Водитель;
		ВыбЭкспедитор = Струк.Экспедитор;
		ВыбРейс = Струк.Рейс;
		ПоменятьМестами = Струк.ПоменятьМестами;
		
		ТекущийТранспорт = Транспорт;
		
		//ТекущийТранспорт = Элементы.Список.ТекущиеДанные.ПривязанныйТранспорт;
		//ТекущийВодитель = Элементы.Список.ТекущиеДанные.ПривязанныйВодитель;
		//ТекущийЭкспедитор = Элементы.Список.ТекущиеДанные.ПривязанныйЭкспедитор;
		
		//+++ БАО 09.08.2017 №1606
		Если ЗначениеЗаполнено(ВыбТранспорт) И ЗначениеЗаполнено(Рейс) Тогда
			
			Струк = Новый Структура;
			Струк.Вставить("Транспорт", ВыбТранспорт);
			
			Попытка
				
				ПараметрыТранспорта = МаршрутизацияЗаказовСервер.ПрочитатьДополнительныеПараметрыТранспорта(ВыбТранспорт);
				
				Если ПараметрыТранспорта = Неопределено Тогда
					УдаленноеЗакрытиеРейсов = Ложь;
				Иначе	
					УдаленноеЗакрытиеРейсов = ПараметрыТранспорта.УдаленноеЗакрытие;
				КонецеСли;	
				
				//РейсОбъект = Рейс.ПолучитьОбъект();
				//РейсОбъект.УдаленноеЗакрытиеРейса = УдаленноеЗакрытиеРейсов;
				//РейсОбъект.Записать();
				МаршрутизацияЗаказовСервер.УстановитьДляРейсаПризнакУдаленногоЗакрытия(Рейс, УдаленноеЗакрытиеРейсов);
				Если ЭлементФормыДляОбновления <> Неопределено Тогда
					ЭлементФормыДляОбновления.Обновить();
				КонецЕсли;	
				
			Исключение
				
				Сообщить("Ошибка установки реквизита Удаленное закрытие рейса. Действие отменено. Попробуйте еще раз.");
				Возврат;
				
			КонецПопытки;	
			
		КонецЕсли;
		
		
		Если ЗначениеЗаполнено(ВыбТранспорт) Тогда
			КолПопыток = 1;
			ПривязкаВыполнена = Ложь;
			Пока КолПопыток < 4 Цикл		
				Попытка
					МаршрутизацияЗаказовСервер.ПривязатьДанныеПоРейсуКЗаборамНаСервере(Рейс, ВыбТранспорт, ВыбВодитель, ВыбЭкспедитор);
					МаршрутизацияЗаказовСервер.ПривязатьМашинунаСервере(Рейс, ВыбТранспорт, ВыбВодитель, ВыбЭкспедитор);
					КолПопыток = 4;
					ПривязкаВыполнена = Истина;
					Продолжить;	
				Исключение
					КолПопыток = КолПопыток + 1;
				КонецПопытки;
			КонецЦикла;	
			
			Если НЕ ПривязкаВыполнена Тогда	
				Сообщить("Привязка не выполнена!");			
			КонецЕсли;			
			Если ЭлементФормыДляОбновления <> Неопределено Тогда
				ЭлементФормыДляОбновления.Обновить();
			КонецЕсли;	
		КонецеСли;
		
		
		
		Если ПоменятьМестами Тогда
			КолПопыток = 1;
			ПривязкаВыполнена = Ложь;
			Пока КолПопыток < 4 Цикл		
				Попытка
					МаршрутизацияЗаказовСервер.ПривязатьДанныеПоРейсуКЗаборамНаСервере(ВыбРейс,ТекущийТранспорт,ТекущийВодитель,ТекущийЭкспедитор);
					МаршрутизацияЗаказовСервер.ПривязатьМашинунаСервере(ВыбРейс,ТекущийТранспорт,ТекущийВодитель,ТекущийЭкспедитор);
					КолПопыток = 4;
					ПривязкаВыполнена = Истина;
					Продолжить;	
				Исключение
					КолПопыток = КолПопыток + 1;
				КонецПопытки;
			КонецЦикла;
			
			Если НЕ ПривязкаВыполнена Тогда	
				Сообщить("Привязка не выполнена!");			
			КонецЕсли;	
			Если ЭлементФормыДляОбновления <> Неопределено Тогда
				ЭлементФормыДляОбновления.Обновить();
			КонецЕсли;	
		КонецЕсли;
		
	КонецеСли;	
КонецПроцедуры	

Процедура ВыбратьЭкипажДляРейсаТест(Рейс, ДатаПланирования, Транспорт, ТекущийВодитель, ТекущийЭкспедитор, ФормаВладелец, ЭлементФормыДляОбновления = Неопределено) Экспорт
	Фрм = ПолучитьФорму("Документ.РейсТест.Форма.ФормаВыбораТранспорта", Новый Структура("РежимВыбора, ДатаРейса, Транспорт", Истина, КонецДня(ДатаПланирования), Транспорт), ФормаВладелец);
	Струк = Фрм.ОткрытьМодально();
	Если ЗначениеЗаполнено(Струк) Тогда
		
		ВыбТранспорт = Струк.Транспорт;
		ВыбВодитель = Струк.Водитель;
		ВыбЭкспедитор = Струк.Экспедитор;
		ВыбРейс = Струк.Рейс;
		ПоменятьМестами = Струк.ПоменятьМестами;
		
		ТекущийТранспорт = Транспорт;
		
		//ТекущийТранспорт = Элементы.Список.ТекущиеДанные.ПривязанныйТранспорт;
		//ТекущийВодитель = Элементы.Список.ТекущиеДанные.ПривязанныйВодитель;
		//ТекущийЭкспедитор = Элементы.Список.ТекущиеДанные.ПривязанныйЭкспедитор;
		
		//+++ БАО 09.08.2017 №1606
		Если ЗначениеЗаполнено(ВыбТранспорт) И ЗначениеЗаполнено(Рейс) Тогда
			
			Струк = Новый Структура;
			Струк.Вставить("Транспорт", ВыбТранспорт);
			
			Попытка
				
				ПараметрыТранспорта = МаршрутизацияЗаказовСервер.ПрочитатьДополнительныеПараметрыТранспорта(ВыбТранспорт);
				
				Если ПараметрыТранспорта = Неопределено Тогда
					УдаленноеЗакрытиеРейсов = Ложь;
				Иначе	
					УдаленноеЗакрытиеРейсов = ПараметрыТранспорта.УдаленноеЗакрытие;
				КонецеСли;	
				
				//РейсОбъект = Рейс.ПолучитьОбъект();
				//РейсОбъект.УдаленноеЗакрытиеРейса = УдаленноеЗакрытиеРейсов;
				//РейсОбъект.Записать();
				МаршрутизацияЗаказовСервер.УстановитьДляРейсаПризнакУдаленногоЗакрытия(Рейс, УдаленноеЗакрытиеРейсов);
				Если ЭлементФормыДляОбновления <> Неопределено Тогда
					ЭлементФормыДляОбновления.Обновить();
				КонецЕсли;	
				
			Исключение
				Ош = ОписаниеОшибки();
				Сообщить("Ошибка установки реквизита Удаленное закрытие рейса. Действие отменено. Попробуйте еще раз.");
				Возврат;
				
			КонецПопытки;	
			
		КонецЕсли;
		
		
		Если ЗначениеЗаполнено(ВыбТранспорт) Тогда
			КолПопыток = 1;
			ПривязкаВыполнена = Ложь;
			Пока КолПопыток < 4 Цикл		
				Попытка
					МаршрутизацияЗаказовСервер.ПривязатьДанныеПоРейсуКЗаборамНаСервереТест(Рейс, ВыбТранспорт, ВыбВодитель, ВыбЭкспедитор);
					МаршрутизацияЗаказовСервер.ПривязатьМашинунаСервереТест(Рейс, ВыбТранспорт, ВыбВодитель, ВыбЭкспедитор);
					КолПопыток = 4;
					ПривязкаВыполнена = Истина;
					Продолжить;	
				Исключение
					КолПопыток = КолПопыток + 1;
				КонецПопытки;
			КонецЦикла;	
			
			Если НЕ ПривязкаВыполнена Тогда	
				Сообщить("Привязка не выполнена!");			
			КонецЕсли;			
			Если ЭлементФормыДляОбновления <> Неопределено Тогда
				ЭлементФормыДляОбновления.Обновить();
			КонецЕсли;	
		КонецеСли;
		
		
		
		Если ПоменятьМестами Тогда
			КолПопыток = 1;
			ПривязкаВыполнена = Ложь;
			Пока КолПопыток < 4 Цикл		
				Попытка
					МаршрутизацияЗаказовСервер.ПривязатьДанныеПоРейсуКЗаборамНаСервереТест(ВыбРейс,ТекущийТранспорт,ТекущийВодитель,ТекущийЭкспедитор);
					МаршрутизацияЗаказовСервер.ПривязатьМашинунаСервереТест(ВыбРейс,ТекущийТранспорт,ТекущийВодитель,ТекущийЭкспедитор);
					КолПопыток = 4;
					ПривязкаВыполнена = Истина;
					Продолжить;	
				Исключение
					КолПопыток = КолПопыток + 1;
				КонецПопытки;
			КонецЦикла;
			
			Если НЕ ПривязкаВыполнена Тогда	
				Сообщить("Привязка не выполнена!");			
			КонецЕсли;	
			Если ЭлементФормыДляОбновления <> Неопределено Тогда
				ЭлементФормыДляОбновления.Обновить();
			КонецЕсли;	
		КонецЕсли;
		
	КонецеСли;	
КонецПроцедуры	

