//+++ БАО 25.05.2017 №894

Функция ВернутьМассивАдресатовПоСобытию(СобытиеСУведомлением, Терминал = Неопределено) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АдресаАбонентовПолученияУведомлений.АдресEmail КАК АдресEmail
	               |ИЗ
	               |	РегистрСведений.АдресаАбонентовПолученияУведомлений КАК АдресаАбонентовПолученияУведомлений
	               |ГДЕ
	               |	АдресаАбонентовПолученияУведомлений.ВидСобытия = &ВидСобытия
	               |	И &УсловиеТерминал";
	
	Запрос.УстановитьПараметр("ВидСобытия", СобытиеСУведомлением);
	
	// МАС - 30.10.2017 - № --->> 
	Если Терминал = Неопределено Тогда	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеТерминал", "ИСТИНА");		
	Иначе	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеТерминал", "АдресаАбонентовПолученияУведомлений.Терминал = &Терминал");
	    Запрос.УстановитьПараметр("Терминал", Терминал);
	КонецЕсли;
	// <<--- МАС 
		
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("АдресEmail");
	
КонецФункции	

Процедура ОбработкаСобытийИУведомлений_ПроведениеДокумента(Ссылка, Отказ) Экспорт 
	
	Если Отказ Тогда
			
		Возврат;
			
	КонецЕсли;

	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.новаОтчетВодителя") Тогда
		
	//+++ БАО 24.05.2017 №894 
			
		//( Объект.Задания.ЗаказыВозвращеныНаСклад Равно "Ложь" И Объект.Задания.РезультатДоставки Не В списке "Справочник.новаРезультатМестнойДоставки.Выполнена; Справочник.новаРезультатМестнойДоставки.ВыполненаЧастично"
				//И Объект.Задания.Стоимость Больше "0")
		//( Объект.Задания.ЗаказыВозвращеныНаСклад Равно "Истина" И Объект.Задания.РезультатДоставки Равно "Справочник.новаРезультатМестнойДоставки.Выполнена" И Объект.Задания.Стоимость Больше "0" )
		Мас = ВернутьМассивАдресатовПоСобытию(Перечисления.ВидыСобытийУведомленияАбонентов.Проведение_ОтчетВодителя);
		Если Мас.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;	
			
			
		ТемаПисьма = "Не корректное закрытие логистом по рейсу " + Ссылка.Транспорт.НомерГосударственнойРегистрации;
		ТекстПисьма = "";
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	новаОтчетВодителяЗадания.Задание.Номер КАК ЗаданиеНомер,
		               |	1 КАК ВидСтроки
		               |ИЗ
		               |	Документ.новаОтчетВодителя.Задания КАК новаОтчетВодителяЗадания
		               |ГДЕ
		               |	новаОтчетВодителяЗадания.Ссылка = &Ссылка
		               |	И новаОтчетВодителяЗадания.ЗаказыВозвращеныНаСклад = ЛОЖЬ
		               |	И новаОтчетВодителяЗадания.РезультатДоставки <> ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.Выполнена)
		               |	И новаОтчетВодителяЗадания.РезультатДоставки <> ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.ВыполненаЧастично)
		               |	И новаОтчетВодителяЗадания.Стоимость > 0
		               |	И (новаОтчетВодителяЗадания.ТипВозвратногоЗаказа ЕСТЬ NULL
		               |			ИЛИ новаОтчетВодителяЗадания.ТипВозвратногоЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыВозвратныхЗаказов.ПустаяСсылка))
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	новаОтчетВодителяЗадания.Задание.Номер,
		               |	2
		               |ИЗ
		               |	Документ.новаОтчетВодителя.Задания КАК новаОтчетВодителяЗадания
		               |ГДЕ
		               |	новаОтчетВодителяЗадания.Ссылка = &Ссылка
		               |	И новаОтчетВодителяЗадания.ЗаказыВозвращеныНаСклад = ИСТИНА
		               |	И новаОтчетВодителяЗадания.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.Выполнена)
		               |	И новаОтчетВодителяЗадания.Стоимость > 0
		               |	И (новаОтчетВодителяЗадания.ТипВозвратногоЗаказа ЕСТЬ NULL
		               |			ИЛИ новаОтчетВодителяЗадания.ТипВозвратногоЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыВозвратныхЗаказов.ПустаяСсылка))";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Сч = 1;
		
		Пока Выборка.Следующий() Цикл
			
			
			Если Выборка.ВидСтроки = 1 Тогда
				Пояснение = "(Не принят на склад, Не Выполнен)";
			Иначе 
				Пояснение = "(Принят на склад, Выполнен)";
			КонецЕсли;	
		
			ТекстПисьма = ТекстПисьма + Сч + ". Заказ №" + СокрЛП(Выборка.ЗаданиеНомер) + " " + Пояснение + ", " + Символы.ПС;   
			
			Сч = Сч + 1;
			
		КонецЦикла;
		
		Если ТекстПисьма <> "" Тогда
			
			ТекстПисьма = Лев(ТекстПисьма, СтрДлина(ТекстПисьма) - 3);
		
			lem.ОтправитьСообщение(Мас, ТемаПисьма, ТекстПисьма);
			
		КонецЕсли;	
		
	//--- БАО 24.05.2017 №894 
		
	КонецЕсли;	
	
КонецПроцедуры
//--- БАО 25.05.2017 №894