&НаКлиенте
Функция ЗапуститьМаршрутизациюЯМ(ВыбранныйРейс, БезусловныйЗапросВариантаВозвращения = Ложь) Экспорт
	ДанныеТекущейТочки = Неопределено;
	ВыбранноеВремя = Неопределено;
	СтрукФинАдреса = Новый Структура;
	
	Если Не МаршрутизацияСервер.РаспечатанМЛ(ВыбранныйРейс) Тогда
		СписокВремени = СформироватьСписокВремени();
		ВыбранноеВремя = СписокВремени.ВыбратьЭлемент("Время выезда");
		Если ВыбранноеВремя = Неопределено Тогда
			Возврат Неопределено;
		КонецеСли;	
		
		////выбор конечной точки
		//Если БезусловныйЗапросВариантаВозвращения Или МаршрутизацияСервер.ПолучитьТипАдресаФинальнойТочкиМаршрутаРейса(ВыбранныйРейс) = 0 Тогда
		//	ФормаВводаАдреса = ПолучитьФорму("ОбщаяФорма.ФормаВводаАдреса");
		//	Результат = ФормаВводаАдреса.ОткрытьМодально();
		//	Если Результат <> Неопределено Тогда
		//		МаршрутизацияСервер.ЗафиксироватьФинальнуюТочкуРейса(Результат, ВыбранныйРейс);
		//		СтрукФинАдреса.Вставить("ТипАдреса", Результат.ТипАдреса);
		//		СтрукФинАдреса.Вставить("ШиротаДолгота", СтрЗаменить(СокРЛП(Результат.Широта) + ";" + СокрЛП(Результат.Долгота), ",", "."));
		//	Иначе
		//		СтрукФинАдреса.Вставить("ТипАдреса", 0);
		//	КонецеСли;	
		//Иначе
		//	ТипФинальнойТочки = МаршрутизацияСервер.ПолучитьТипАдресаФинальнойТочкиМаршрутаРейса(ВыбранныйРейс);
		//	СтрукФинАдреса.Вставить("ТипАдреса", ТипФинальнойТочки);
		//	Если ТипФинальнойТочки = 3 тогда
		//		СтрукФинАдреса.Вставить("ШиротаДолгота", МаршрутизацияСервер.ПолучитьШиротуИДолготуФинальнойТочкиМаршрутаРейса(ВыбранныйРейс));			
		//	КонецЕсли;	
		//КонецеСли;	
	Иначе
		//ТипФинальнойТочки = МаршрутизацияСервер.ПолучитьТипАдресаФинальнойТочкиМаршрутаРейса(ВыбранныйРейс);
		//СтрукФинАдреса.Вставить("ТипАдреса", ТипФинальнойТочки);
		//Если ТипФинальнойТочки = 3 тогда
		//	СтрукФинАдреса.Вставить("ШиротаДолгота", МаршрутизацияСервер.ПолучитьШиротуИДолготуФинальнойТочкиМаршрутаРейса(ВыбранныйРейс));			
		//КонецЕсли;	
		
		ДанныеМ = ОбщегоНазначенияКлиент.ТекущиеКоординаты();
		
		
		Если ДанныеМ <> Неопределено Тогда
			ДанныеТекущейТочки = Новый Структура;
			ДанныеТекущейТочки.Вставить("latitude", ДанныеМ.Координаты.Широта);
			ДанныеТекущейТочки.Вставить("longitude", ДанныеМ.Координаты.Долгота);
			//Сообщить("Широта: " + Строка(ДанныеМ.Координаты.Широта) + ", долгота: " + ДанныеМ.Координаты.Долгота);
		Иначе
			Сообщить("Не могу получить текущие координаты!");
			Возврат Неопределено;
		КонецеСли;
		
			//ДанныеТекущейТочки = Новый Структура;
			//ДанныеТекущейТочки.Вставить("latitude", 55.782061);
			//ДанныеТекущейТочки.Вставить("longitude", 37.570858);
	КонецеСли;
	
	
	//выбор конечной точки
	Если БезусловныйЗапросВариантаВозвращения Или МаршрутизацияСервер.ПолучитьТипАдресаФинальнойТочкиМаршрутаРейса(ВыбранныйРейс) = 0 Тогда
		ФормаВводаАдреса = ПолучитьФорму("ОбщаяФорма.ФормаВводаАдреса");
		Результат = ФормаВводаАдреса.ОткрытьМодально();
		Если Результат <> Неопределено Тогда
			МаршрутизацияСервер.ЗафиксироватьФинальнуюТочкуРейса(Результат, ВыбранныйРейс);
			СтрукФинАдреса.Вставить("ТипАдреса", Результат.ТипАдреса);
			СтрукФинАдреса.Вставить("ШиротаДолгота", СтрЗаменить(СокРЛП(Результат.Широта) + ";" + СокрЛП(Результат.Долгота), ",", "."));
		Иначе
			СтрукФинАдреса.Вставить("ТипАдреса", 0);
		КонецеСли;	
	Иначе
		ТипФинальнойТочки = МаршрутизацияСервер.ПолучитьТипАдресаФинальнойТочкиМаршрутаРейса(ВыбранныйРейс);
		СтрукФинАдреса.Вставить("ТипАдреса", ТипФинальнойТочки);
		Если ТипФинальнойТочки = 3 тогда
			СтрукФинАдреса.Вставить("ШиротаДолгота", МаршрутизацияСервер.ПолучитьШиротуИДолготуФинальнойТочкиМаршрутаРейса(ВыбранныйРейс));			
		КонецЕсли;	
	КонецеСли;	
	
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ДанныеТекущейТочки", ДанныеТекущейТочки);
	Если ВыбранноеВремя <> Неопределено Тогда
		СтруктураВозврата.Вставить("ВыбранноеВремя", ВыбранноеВремя.Значение);
	Иначе	
		СтруктураВозврата.Вставить("ВыбранноеВремя", Неопределено);
	КонецеСли;	
	
	СтруктураВозврата.Вставить("ФинальныйАдрес", СтрукФинАдреса);
	
	Возврат СтруктураВозврата;
КонецФункции



//&НаКлиенте
Функция СформироватьСписокВремени()
	СейчасМинут = Минута(ТекущаяДата());
	ОкрМинут = Окр(СейчасМинут + 5, -1);
	СейчасЧасов = Час(ТекущаяДата());
	СейчасДень = День(ТекущаяДата());
	//СейчасМесяц = Месяц(ТекущаяДата());
	
	СписокВыбора = Новый СписокЗначений;
	
	Для Сч = 1 По 18 Цикл
		Если ОкрМинут = 60 Тогда
			СейчасЧасов = СейчасЧасов + 1;
			ОкрМинут = 0;
		КонецеСли;	
		
		Если СейчасЧасов = 24 Тогда
			СейчасДень = СейчасДень + 1;
			СейчасЧасов = 0;
		КонецеСли;	
		
		//ДеньКонцаМесяца = День(КонецМеся);
		
		СписокВыбора.Добавить(Дата(Год(ТекущаяДата()), Месяц(ТекущаяДата()), СейчасДень, СейчасЧасов, ОкрМинут, 0), Формат(СейчасЧасов, "ЧЦ=2; ЧН=00; ЧВН=") + ":" + Формат(ОкрМинут, "ЧЦ=2; ЧН=00; ЧВН="));
		ОкрМинут = ОкрМинут + 10;
	КонецЦикла;	
	Возврат СписокВыбора;
КонецФункции



