Функция ЕстьНепогашенноеУведомление() Экспорт
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	УведомленияЭкипажуСрезПоследних.Период КАК Период
	            |ИЗ
	            |	РегистрСведений.УведомленияЭкипажу.СрезПоследних(, Транспорт = &ВыбТранспорт) КАК УведомленияЭкипажуСрезПоследних
	            |ГДЕ
	            |	УведомленияЭкипажуСрезПоследних.ДатаУведомления = &ДатаУведомления
	            |	И УведомленияЭкипажуСрезПоследних.ТипУведомления = ЗНАЧЕНИЕ(Перечисление.ТипыУведомленийЭкипажу.НастройкаТелефона)
	            |	И УведомленияЭкипажуСрезПоследних.УведомлениеПоказано = ЛОЖЬ";
	Зап.УстановитьПараметр("ДатаУведомления", НачалоДня(ТекущаяДата()));
	Зап.УстановитьПараметр("ВыбТранспорт", Константы.Транспорт.Получить());
	
	Возврат Не Зап.Выполнить().Пустой();
КонецФункции

Функция ПогаситьУведомление(ДатаУведомления) Экспорт
	Наб = РегистрыСведений.УведомленияЭкипажу.СоздатьНаборЗаписей();
	
	ТекВр = ТекущаяДата();
	Транспорт = Константы.Транспорт.Получить();
	
	Наб.Отбор.Период.Установить(ТекВр);
	Наб.Отбор.Транспорт.Установить(Транспорт);
	
	Нов = Наб.Добавить();
	
	Нов.Период = ТекВр;
	Нов.Транспорт = Транспорт;
	Нов.ДатаУведомления = НачалоДня(ДатаУведомления);
	Нов.УведомлениеПоказано = Истина;
	Нов.ТипУведомления = Перечисления.ТипыУведомленийЭкипажу.НастройкаТелефона;
	
	Наб.Записать();
КонецФункции	