Функция Печать(Таб, НачПериода, КонПериода, Контрагент) Экспорт
	Таб.Очистить();
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	МИНИМУМ(ПлатежноеПоручениеИсходящееТаблицаДатОплат.Ссылка.Дата) КАК Дата,
	            |	ГОД(ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки) КАК ГодДоставки,
	            |	МЕСЯЦ(ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки) КАК МесяцДоставки,
	            |	ДЕНЬ(ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки) КАК ДеньДоставки
	            |ПОМЕСТИТЬ ВТОплаты
	            |ИЗ
	            |	Документ.ПлатежноеПоручениеИсходящее.ТаблицаДатОплат КАК ПлатежноеПоручениеИсходящееТаблицаДатОплат
	            |ГДЕ
	            |	ПлатежноеПоручениеИсходящееТаблицаДатОплат.Ссылка.Проведен = ИСТИНА
	            |	И ПлатежноеПоручениеИсходящееТаблицаДатОплат.Ссылка.Контрагент = &Контрагент
	            |	И ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки МЕЖДУ &НачПериода И &КонПериода
	            |
	            |СГРУППИРОВАТЬ ПО
	            |	ГОД(ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки),
	            |	МЕСЯЦ(ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки),
	            |	ДЕНЬ(ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки)
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	ЗакрытыеЗаказы.ИнтернетМагазин,
	            |	ЗакрытыеЗаказы.Реализация,
	            |	ЗакрытыеЗаказы.Реализация.Номер КАК НомерЗаказа,
	            |	ЗакрытыеЗаказы.Реализация.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
	            |	ЗакрытыеЗаказы.Период КАК ДатаДоставки,
	            |	ЗакрытыеЗаказы.ТипЗаказа КАК ВидРабот,
	            |	ЗакрытыеЗаказы.Доставка.ДатаСоздания КАК ДатаЗабора,
	            |	ЗакрытыеЗаказы.СуммаОценочная КАК СтоимостьГруза,
	            |	ЗакрытыеЗаказы.СуммаЧастичногоВозврата КАК СтоимостьВозврата,
	            |	ЗакрытыеЗаказы.УслугиСД + ЗакрытыеЗаказы.БанковскаяКомиссия + ЗакрытыеЗаказы.КассовоеОбслуживание КАК АгентскоеВознаграждение,
	            |	ВЫБОР
	            |		КОГДА ЗакрытыеЗаказы.ТипОплаты = ЗНАЧЕНИЕ(Справочник.ТипыОплат.Наличные) Или  ЗакрытыеЗаказы.ТипОплаты = ЗНАЧЕНИЕ(Справочник.ТипыОплат.ВКредит)
	            |			ТОГДА ЗакрытыеЗаказы.ОплаченоКлиентовНал
	            |		ИНАЧЕ 0
	            |	КОНЕЦ КАК СуммаПолученнаяОтПокупателей,
	            |	ЗакрытыеЗаказы.СуммаДоставкиДоМКАД + ЗакрытыеЗаказы.СуммаДоставкиЗаМКАД КАК СтоимостьДоставки,
	            |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПеречисления,
	            |	ЗакрытыеЗаказы.СтатусЗаказа КАК СтатусДоставки,
	            |	ГОД(ЗакрытыеЗаказы.Период) КАК ГодДоставки,
	            |	МЕСЯЦ(ЗакрытыеЗаказы.Период) КАК МесяцДоставки,
	            |	ДЕНЬ(ЗакрытыеЗаказы.Период) КАК ДеньДоставки
	            |ПОМЕСТИТЬ ВТДоставки
	            |ИЗ
	            |	РегистрНакопления.ЗакрытыеЗаказы КАК ЗакрытыеЗаказы
	            |ГДЕ
	            |	ЗакрытыеЗаказы.Период МЕЖДУ &НачПериода И &КонПериода
	            |	И ЗакрытыеЗаказы.ИнтернетМагазин = &Контрагент
	            |	И ЗакрытыеЗаказы.ТипЗаказа = &Доставка
	            |	И ЗакрытыеЗаказы.СтатусИнтернетМагазина <> ЗНАЧЕНИЕ(Справочник.СтатусЗаказаИнтернетМагазина.ЗаказОтклонен)
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	ВТДоставки.ИнтернетМагазин,
	            |	ВТДоставки.Реализация,
	            |	ВТДоставки.НомерЗаказа,
	            |	ВТДоставки.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
	            |	НАЧАЛОПЕРИОДА(ВТДоставки.ДатаДоставки, ДЕНЬ) КАК ДатаДоставки,
	            |	ВТДоставки.ВидРабот,
	            |	ВТДоставки.ДатаЗабора,
	            |	ВТДоставки.СтоимостьГруза,
	            |	ВТДоставки.СтоимостьВозврата,
	            |	ВТДоставки.АгентскоеВознаграждение,
	            |	ВТДоставки.СуммаПолученнаяОтПокупателей,
	            |	ВТДоставки.СтоимостьДоставки,
	            |	ВТДоставки.СтатусДоставки,
	            |	ВТОплаты.Дата КАК ДатаПеречисления
	            |ИЗ
	            |	ВТДоставки КАК ВТДоставки
	            |		ЛЕВОЕ СОЕДИНЕНИЕ ВТОплаты КАК ВТОплаты
	            |		ПО ВТДоставки.ГодДоставки = ВТОплаты.ГодДоставки
	            |			И ВТДоставки.МесяцДоставки = ВТОплаты.МесяцДоставки
	            |			И ВТДоставки.ДеньДоставки = ВТОплаты.ДеньДоставки
	            |
	            |УПОРЯДОЧИТЬ ПО
	            |	ДатаДоставки,
	            |	НомерВнешнегоЗаказа
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |УНИЧТОЖИТЬ ВТОплаты
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |УНИЧТОЖИТЬ ВТДоставки";
	Зап.УстановитьПараметр("НачПериода", НачалоДня(НачПериода));			
	Зап.УстановитьПараметр("КонПериода", КонецДня(КонПериода));
	Зап.УстановитьПараметр("Контрагент", Контрагент);
	Зап.УстановитьПараметр("Доставка", Перечисления.ТипыЗаказов.Доставка);
	
	Рез = Зап.Выполнить().Выгрузить();
	
	
	Мак = ПолучитьМакет("Макет");
	
	ОблШ = Мак.ПолучитьОбласть("Шапка");
	ОблС = Мак.ПолучитьОбласть("Строка");
	
	Таб.Вывести(ОблШ);
	
	НПП = 1;
	
	ИтСумПол = 0;	
	
	Для Каждого Тек Из Рез Цикл
		ЗаполнитьЗначенияСвойств(ОблС.Параметры, Тек);
		
		Если Тек.СуммаПолученнаяОтПокупателей = 0 Тогда
			ОблС.параметры.ДатаПеречисления = "";
		КонецеСли;	
		
		ОблС.Параметры.НПП = НПП;
		ОблС.Параметры.НЗ = СокрЛП(Тек.НомерВнешнегоЗаказа);    // "д" + СокрЛП(Тек.НомерЗаказа) + "/" + 
		Таб.Вывести(ОблС);
		НПП = НПП + 1;
		
		ИтСумПол = ИтСумПол + Тек.СуммаПолученнаяОтПокупателей;
		
		
	КонецЦикла;	
	
	ОблП = мак.ПолучитьОбласть("Подвал");
	
	ОблП.Параметры.ИтСумПол = ИтСумПол;
	//ОблП.Параметры.ИтСумПолНДС = Окр(ИтСумПол - ИтСумПол/1.18, 2);
	
	Таб.Вывести(ОблП);
КонецФункции	