Процедура ПечатьПоДоставке(Таб, Доставка, МасНом, МасДос, ТабСверки, РазборПоКопиям) Экспорт
	
	ЗапВес003 = Новый Запрос;
	ЗапВес003.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	                  |	Накладная003Заказы.Вес
	                  |ИЗ
	                  |	Документ.Накладная003.Заказы КАК Накладная003Заказы
	                  |ГДЕ
	                  |	Накладная003Заказы.Заказ.Номер = &Номер
	                  |
	                  |УПОРЯДОЧИТЬ ПО
	                  |	Накладная003Заказы.Ссылка.Дата УБЫВ";
	ЗапВес003.УстановитьПараметр("Номер", СокрЛП(Доставка.Номер));				  
	ТабВес003 = ЗапВес003.Выполнить().Выгрузить();				  
	
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	новаЗаданияРейсов.Доставка,
	            |	МАКСИМУМ(новаЗаданияРейсов.Рейс.Дата) КАК ДатаРейса
	            |ПОМЕСТИТЬ ПоследниеРейсы
	            |ИЗ
	            |	РегистрСведений.новаЗаданияРейсов КАК новаЗаданияРейсов
	            |ГДЕ
	            |	новаЗаданияРейсов.Рейс.РейсОтменен = ЛОЖЬ
	            |	И новаЗаданияРейсов.Доставка.Номер = &МасНом
	            |
	            |СГРУППИРОВАТЬ ПО
	            |	новаЗаданияРейсов.Доставка
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	новаЗаданияРейсов.Рейс.Ссылка КАК Рейс,
	            |	ПоследниеРейсы.Доставка.Ссылка КАК Доставка,
	            |	новаЗаданияРейсов.Рейс.Транспорт.Ссылка КАК Транспорт,
	            |	новаЗаданияРейсов.Рейс.Водитель.Ссылка КАК Водитель,
	            |	новаЗаданияРейсов.Рейс.Экспедитор.Ссылка КАК Экспедитор
	            |ПОМЕСТИТЬ ВТРейсы
	            |ИЗ
	            |	РегистрСведений.новаЗаданияРейсов КАК новаЗаданияРейсов
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоследниеРейсы КАК ПоследниеРейсы
	            |		ПО новаЗаданияРейсов.Рейс.Дата = ПоследниеРейсы.ДатаРейса
	            |			И новаЗаданияРейсов.Доставка.Ссылка = ПоследниеРейсы.Доставка.Ссылка
	            |
	            |СГРУППИРОВАТЬ ПО
	            |	ПоследниеРейсы.Доставка.Ссылка,
	            |	новаЗаданияРейсов.Рейс.Ссылка,
	            |	новаЗаданияРейсов.Рейс.Транспорт.Ссылка,
	            |	новаЗаданияРейсов.Рейс.Водитель.Ссылка,
	            |	новаЗаданияРейсов.Рейс.Экспедитор.Ссылка
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	РеализацияТоваровУслугТовары.НомерСтроки,
	            |	РеализацияТоваровУслугТовары.Номенклатура.Код,
	            |	РеализацияТоваровУслугТовары.Номенклатура,
	            |	РеализацияТоваровУслугТовары.Количество КАК Количество,
	            |	РеализацияТоваровУслугТовары.Цена,
	            |	СУММА(РеализацияТоваровУслугТовары.Сумма) КАК Сумма,
	            |	РеализацияТоваровУслугТовары.Ссылка.Номер КАК НомерДоставки,
	            |	РеализацияТоваровУслугТовары.Номенклатура.Артикул КАК Артикул,
	            |	РеализацияТоваровУслугТовары.Вес * РеализацияТоваровУслугТовары.Количество КАК Вес
	            |ПОМЕСТИТЬ ТоварыДоставки
	            |ИЗ
	            |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	            |ГДЕ
	            |	РеализацияТоваровУслугТовары.Ссылка.Номер = &МасНом
	            |
	            |СГРУППИРОВАТЬ ПО
	            |	РеализацияТоваровУслугТовары.Номенклатура,
	            |	РеализацияТоваровУслугТовары.Ссылка.Номер,
	            |	РеализацияТоваровУслугТовары.НомерСтроки,
	            |	РеализацияТоваровУслугТовары.Номенклатура.Код,
	            |	РеализацияТоваровУслугТовары.Номенклатура.Артикул,
	            |	РеализацияТоваровУслугТовары.Цена,
	            |	РеализацияТоваровУслугТовары.Количество,
	            |	РеализацияТоваровУслугТовары.Вес * РеализацияТоваровУслугТовары.Количество
	            |
	            |ОБЪЕДИНИТЬ ВСЕ
	            |
	            |ВЫБРАТЬ
	            |	ВозвратТоваровОтПокупателяТовары.НомерСтроки,
	            |	ВозвратТоваровОтПокупателяТовары.Номенклатура.Код,
	            |	ВозвратТоваровОтПокупателяТовары.Номенклатура,
	            |	-ВозвратТоваровОтПокупателяТовары.Количество,
	            |	ВозвратТоваровОтПокупателяТовары.Цена,
	            |	СУММА(-ВозвратТоваровОтПокупателяТовары.Сумма),
	            |	ВозвратТоваровОтПокупателяТовары.Ссылка.Номер,
	            |	ВозвратТоваровОтПокупателяТовары.Номенклатура.Артикул,
	            |	0
	            |ИЗ
	            |	Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
	            |ГДЕ
	            |	ВозвратТоваровОтПокупателяТовары.Ссылка.Номер = &МасНом
	            |
	            |СГРУППИРОВАТЬ ПО
	            |	ВозвратТоваровОтПокупателяТовары.НомерСтроки,
	            |	ВозвратТоваровОтПокупателяТовары.Номенклатура.Код,
	            |	ВозвратТоваровОтПокупателяТовары.Номенклатура,
	            |	ВозвратТоваровОтПокупателяТовары.Цена,
	            |	ВозвратТоваровОтПокупателяТовары.Ссылка.Номер,
	            |	ВозвратТоваровОтПокупателяТовары.Номенклатура.Артикул,
	            |	-ВозвратТоваровОтПокупателяТовары.Количество
	            |
	            |ОБЪЕДИНИТЬ ВСЕ
	            |
	            |ВЫБРАТЬ
	            |	РеализацияТоваровУслугПодарочныеПозиции.НомерСтроки,
	            |	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура.Код,
	            |	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура,
	            |	РеализацияТоваровУслугПодарочныеПозиции.Количество,
	            |	РеализацияТоваровУслугПодарочныеПозиции.Цена,
	            |	СУММА(РеализацияТоваровУслугПодарочныеПозиции.Сумма),
	            |	РеализацияТоваровУслугПодарочныеПозиции.Ссылка.Номер,
	            |	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура.Артикул,
	            |	РеализацияТоваровУслугПодарочныеПозиции.Вес * РеализацияТоваровУслугПодарочныеПозиции.Количество
	            |ИЗ
	            |	Документ.РеализацияТоваровУслуг.ПодарочныеПозиции КАК РеализацияТоваровУслугПодарочныеПозиции
	            |ГДЕ
	            |	РеализацияТоваровУслугПодарочныеПозиции.Ссылка.Номер = &МасНом
	            |
	            |СГРУППИРОВАТЬ ПО
	            |	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура,
	            |	РеализацияТоваровУслугПодарочныеПозиции.Ссылка.Номер,
	            |	РеализацияТоваровУслугПодарочныеПозиции.НомерСтроки,
	            |	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура.Код,
	            |	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура.Артикул,
	            |	РеализацияТоваровУслугПодарочныеПозиции.Цена,
	            |	РеализацияТоваровУслугПодарочныеПозиции.Количество,
	            |	РеализацияТоваровУслугПодарочныеПозиции.Вес * РеализацияТоваровУслугПодарочныеПозиции.Количество
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	РеализацияТоваровУслуг.Ссылка.Номер КАК Номер,
	            |	РеализацияТоваровУслуг.Ссылка.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
	            |	новаМестнаяДоставка.Менеджер,
	            |	новаМестнаяДоставка.Дата КАК ДатаЗаказа,
	            |	новаМестнаяДоставка.ВремяПрибытияС,
	            |	новаМестнаяДоставка.ВремяПрибытияПо,
	            |	новаМестнаяДоставка.Адрес КАК Адрес,
	            |	новаМестнаяДоставка.Телефон,
	            |	РеализацияТоваровУслуг.Ссылка.Контрагент.Наименование КАК Покупатель,
	            |	новаМестнаяДоставка.Комментарий КАК Комментарий,
	            |	РеализацияТоваровУслуг.Ссылка.ВладелецТовара.НаименованиеПолное КАК ВладелецТовара,
	            |	РеализацияТоваровУслуг.Ссылка.ТипОплаты КАК ТипОплаты,
	            |	РеализацияТоваровУслуг.Ссылка.ВладелецТовара.Ссылка КАК ВС,
	            |	новаМестнаяДоставка.СтоимостьДоставкиДоМКАД,
	            |	новаМестнаяДоставка.СтоимостьДоставкиЗаМКАД,
	            |	РеализацияТоваровУслуг.Ссылка.ВладелецТовара.jurPerson КАК jurPerson,
	            |	новаМестнаяДоставка.Оплачен,
	            |	ЕСТЬNULL(Контрагенты.ТранспортнаяКомпания, ЛОЖЬ) КАК Тр,
	            |	Контрагенты.ТипОплатыТК.Наименование КАК ТипОплатыТК,
	            |	Контрагенты.Ссылка КАК Грузополучатель,
	            |	новаМестнаяДоставка.КомментарийКАдресуДоставки,
	            |	Контрагенты.ПечататьШтрихкоды,
	            |	новаМестнаяДоставка.КоличествоМест,
	            |	РеализацияТоваровУслуг.Ссылка.ВладелецТовара.Код КАК КодК,
	            |	новаМестнаяДоставка.ДатаСоздания,
	            |	РеализацияТоваровУслуг.ВладелецТовара.РеквизитыНаБЗ КАК РеквизитыНаБЗ,
	            |	РеализацияТоваровУслуг.ВладелецТовара.ТелефонИнтернетМагазина КАК ТелефонИнтернетМагазина,
	            |	РеализацияТоваровУслуг.ВладелецТовара.ЗаголовокИнтернетМагазина КАК ЗаголовокИнтернетМагазина,
	            |	новаМестнаяДоставка.Ссылка КАК МД,
	            |	РеализацияТоваровУслуг.ВладелецТовара.Приоритет,
	            |	новаМестнаяДоставка.ТочкаПрибытия.Адрес.Наименование КАК АдресИсходный,
	            |	РеализацияТоваровУслуг.ПредоплатаПоКредиту,
	            |	РеализацияТоваровУслуг.ТарифнаяСетка,
	            |	Контрагенты.Родитель.ОсновнойМагазин КАК ОсновнойМагазин,
	            |	РеализацияТоваровУслуг.ИнтернетМагазинЯндекса
	            |ПОМЕСТИТЬ ВТДоставки
	            |ИЗ
	            |	БизнесПроцесс.новаМестнаяДоставка КАК новаМестнаяДоставка
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	            |		ПО новаМестнаяДоставка.Номер = РеализацияТоваровУслуг.Ссылка.Номер
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.новаСоответствиеКонтрагентов КАК новаСоответствиеКонтрагентов
	            |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	            |			ПО новаСоответствиеКонтрагентов.Контрагент.Ссылка = Контрагенты.Ссылка
	            |		ПО новаМестнаяДоставка.Грузополучатель.Ссылка = новаСоответствиеКонтрагентов.новаКонтрагент.Ссылка
	            |ГДЕ
	            |	новаМестнаяДоставка.Номер = &МасНом
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	ВТДоставки.Номер КАК Номер,
	            |	ВТДоставки.НомерВнешнегоЗаказа,
	            |	ВТДоставки.Менеджер,
	            |	ВТДоставки.ДатаЗаказа,
	            |	ВТДоставки.ВремяПрибытияС,
	            |	ВТДоставки.ВремяПрибытияПо,
	            |	ВТДоставки.Адрес,
	            |	ВТДоставки.Телефон,
	            |	ВТДоставки.Покупатель,
	            |	ВТДоставки.Комментарий,
	            |	ВТДоставки.ВладелецТовара,
	            |	ВТДоставки.ТипОплаты,
	            |	ВТДоставки.ВС,
	            |	ВТДоставки.СтоимостьДоставкиДоМКАД,
	            |	ВТДоставки.СтоимостьДоставкиЗаМКАД,
	            |	ВТДоставки.jurPerson,
	            |	ВТДоставки.Оплачен,
	            |	ВТДоставки.Тр,
	            |	ВТДоставки.ТипОплатыТК,
	            |	ВТДоставки.Грузополучатель,
	            |	ВТДоставки.КомментарийКАдресуДоставки,
	            |	ВТДоставки.ПечататьШтрихкоды,
	            |	ВТДоставки.КоличествоМест,
	            |	ВТДоставки.КодК,
	            |	ВТДоставки.ДатаСоздания,
	            |	ТоварыДоставки.НомерСтроки КАК НомерСтроки,
	            |	ТоварыДоставки.НоменклатураКод КАК К,
	            |	ТоварыДоставки.Номенклатура,
	            |	ТоварыДоставки.Количество,
	            |	ТоварыДоставки.Цена,
	            |	ТоварыДоставки.Сумма,
	            |	ТоварыДоставки.НомерДоставки,
	            |	ТоварыДоставки.Артикул КАК КА,
	            |	ВТДоставки.ТелефонИнтернетМагазина,
	            |	ВТДоставки.ЗаголовокИнтернетМагазина,
	            |	ВТДоставки.РеквизитыНаБЗ,
	            |	ТоварыДоставки.Вес,
	            |	ВТДоставки.МД,
	            |	ВТДоставки.ВладелецТовараПриоритет КАК ВладелецТовараПриоритет,
	            |	ВТДоставки.АдресИсходный,
	            |	ВТДоставки.ПредоплатаПоКредиту,
	            |	ТипыОплат.Ссылка КАК ТипОплатыСпр,
	            |	ЕСТЬNULL(ВТРейсы.Рейс.Транспорт.НомерЛог, ""-"") КАК НомерЛогСтарый,
	            |	ЕСТЬNULL(ВТРейсы.Рейс.Транспорт.НомерГосударственнойРегистрации, ""-"") КАК РегНомер,
	            |	ВЫБОР
	            |		КОГДА ВТДоставки.ТарифнаяСетка.Код = 2
	            |			ТОГДА ИСТИНА
	            |		ИНАЧЕ ЛОЖЬ
	            |	КОНЕЦ КАК ВыделяемИнтервал,
	            |	ВТДоставки.ОсновнойМагазин,
	            |	ЕСТЬNULL(ВТДоставки.ИнтернетМагазинЯндекса, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК ИнтернетМагазинЯндекса,
	            |	ЕСТЬNULL(ДополнительныеПараметрыЗаказа.КОплатеКлиентом, 0) КАК КОплатеКлиентом,
	            |	ЕСТЬNULL(Рейс_.НомерПалетты, ""-"") КАК НомерЛог
	            |ИЗ
	            |	ТоварыДоставки КАК ТоварыДоставки
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДоставки КАК ВТДоставки
	            |			ЛЕВОЕ СОЕДИНЕНИЕ ВТРейсы КАК ВТРейсы
	            |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.Рейс КАК Рейс_
	            |				ПО ВТРейсы.Рейс = Рейс_.РейсМестнойДоставки
	            |			ПО ВТДоставки.Номер = ВТРейсы.Доставка.Номер
	            |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
	            |			ПО ВТДоставки.Номер = ДополнительныеПараметрыЗаказа.Заказ.Номер
	            |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТипыОплат КАК ТипыОплат
	            |			ПО ВТДоставки.ТипОплаты = ТипыОплат.Код
	            |		ПО ТоварыДоставки.НомерДоставки = ВТДоставки.Номер
	            |
	            |УПОРЯДОЧИТЬ ПО
	            |	ВладелецТовараПриоритет,
	            |	Номер,
	            |	НомерСтроки
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |УНИЧТОЖИТЬ ТоварыДоставки
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |УНИЧТОЖИТЬ ВТДоставки";
	Зап.УстановитьПараметр("ВыбДоставка", Доставка);
	Зап.УстановитьПараметр("МасНом", СокрЛП(Доставка.Номер));
	//Зап.УстановитьПараметр("МасВыбДоставка", МасДос);
	
	
	Мак = ПолучитьМакет("Макет");
	
	ОблШ1 = Мак.ПолучитьОбласть("Шапка1");
	ОблШ1_Интервал = Мак.ПолучитьОбласть("Шапка1_Интервал");
    //Серегин М.В. 07.08.2015 11:05:27 
    ОблШ1_Компик = Мак.ПолучитьОбласть("Шапка1_Компик");
    //Серегин М.В. 07.08.2015 11:05:28 
	ОблШЛ = Мак.ПолучитьОбласть("ШапкаЛого");        
	ОблШЛН = Мак.ПолучитьОбласть("ШапкаЛогоНазвания");        
	ОблШИ = Мак.ПолучитьОбласть("ШапкаИндезит");        
	ОблШ2 = Мак.ПолучитьОбласть("Шапка2");
    //Серегин М.В. 07.08.2015 11:07:09 
	ОблШ2_Компик = Мак.ПолучитьОбласть("Шапка2_Компик");
    //Серегин М.В. 07.08.2015 11:07:10 
	
	ОблСтр = Мак.ПолучитьОбласть("Строка");
	
	ОблП1 = Мак.ПолучитьОбласть("Подвал1");
    //Серегин М.В. 07.08.2015 12:49:26 
	ОблП1_Компик = Мак.ПолучитьОбласть("ИтогоКомпик");
    //Серегин М.В. 07.08.2015 12:49:27 
	ОблП2 = Мак.ПолучитьОбласть("Подвал2");
	ОблП2_ДжейТи    = Мак.ПолучитьОбласть("ПодвалДжейТи");// Костя
	ОблП2_АвтоИКС24 = Мак.ПолучитьОбласть("ПодвалАвтоИКС24");// Костя 280915
	ОблП2_КлиматКомфортShopdroneB2btools = Мак.ПолучитьОбласть("ПодвалКлиматКомфортShopdroneB2btools");// Костя 301015
	ОблП_П = Мак.ПолучитьОбласть("Подвал2_Пуфетта");
	ОблП_Е = Мак.ПолучитьОбласть("Подвал2_Enter");
    //Серегин М.В. 07.08.2015 11:07:35  
    ОблП2_Я = Мак.ПолучитьОбласть("Подвал2_Яндекс");
    ОблП2_Компик = Мак.ПолучитьОбласть("Подвал2_Компик");
    //Серегин М.В. 07.08.2015 11:07:38  
	
	ОблП_I = Мак.ПолучитьОбласть("ПодвалIndesit");
	
	ОблП_БезП = Мак.ПолучитьОбласть("ПодвалБезПодъёма");
	
	
	
	Рез1 = Зап.Выполнить();
	Если Рез1.Пустой() Тогда
		Сообщить("По заказу № " + СокрЛП(Доставка.Номер) + " нет данных!");
		Возврат;
	КонецЕСли;	
		
	Рез = Рез1.Выбрать();   // ОбходРезультатаЗапроса.ПоГруппировкам
	Нач = Истина;
	ИтСум = 0;
	СтоимостьДоставкиДоМКАД = 0;
	СтоимостьДоставкиЗаМКАД = 0;
	
	Оплачен = Ложь;
	КолСтр = 0;
	ИтВес = 0;
	КолМест = 0;
	ПечататьШтрихкод = Ложь;
	
	НПП = 1;
	//Пока Дост.Следующий() Цикл
	//	Рез = Дост.Выбрать();
    Пока Рез.Следующий() Цикл
        
			Если Нач Тогда
				Если Рез.ПечататьШтрихкоды Тогда
					ПечататьШтрихкод = Истина;
					колМест = Рез.КоличествоМест;
				КонецеСли;	
				
				Ном = "д" + СокрЛП(Рез.Номер) + "/" + СокрЛП(Рез.НомерВнешнегоЗаказа);
				ДатаЗ = Формат(Рез.ДатаСоздания, "ДЛФ=DD");
				ДатаВремяДоставки = Формат(Рез.ВремяПрибытияС, "ДЛФ=D") + " с " + Формат(Рез.ВремяПрибытияС, "ДФ=ЧЧ:мм") + " до " + Формат(Рез.ВремяПрибытияПо, "ДФ=ЧЧ:мм");
				
				Струк = Новый Структура;
				Струк.Вставить("Доставка", рез.МД);
				
				Най = РегистрыСведений.СостоянияЗаказов.ПолучитьПоследнее(ТекущаяДата(), Струк);
				
				Если ЗначениеЗаполнено(Най) Тогда
					если Най.ПричинаНевыполнения = Справочники.ПричиныНеВыполненияДоставки.ПереносДоставки Тогда
						ЗапД = Новый Запрос;
						ЗапД.Текст = "ВЫБРАТЬ
						             |	ДатыДоставок.Период КАК Период,
						             |	ДатыДоставок.ДатаДоставки
						             |ИЗ
						             |	РегистрСведений.ДатыДоставок КАК ДатыДоставок
						             |ГДЕ
						             |	ДатыДоставок.Доставка.Ссылка = &Доставка
						             |
						             |УПОРЯДОЧИТЬ ПО
						             |	Период УБЫВ";
						ЗапД.УстановитьПараметр("Доставка", Рез.МД);
						РезД = ЗапД.Выполнить().Выгрузить();
						
						Д_Д = Неопределено;
						Если РезД.Количество() >= 2 Тогда
							Д_Д = РезД[1].ДатаДоставки;
						ИначеЕСли РезД.Количество() = 1 Тогда
							Д_Д = РезД[0].Период;
						КонецЕсли;	
						
						Если Д_Д <> Неопределено Тогда
							ДатаВремяДоставки = ДатаВремяДоставки + " (ПЕРЕНОС С " + Формат(Д_Д, "ДЛФ=DD") + ")";
						Иначе	
							ДатаВремяДоставки = ДатаВремяДоставки + " (ПЕРЕНОС)";
						КонецЕСли;	
					КонецЕСли;	
				КонецЕсли;	
				
				Менед = "Менеджер заказа: " + СокрЛП(Рез.Менеджер);
				
                Если Рез.ВыделяемИнтервал Тогда
                    ОблШ1 = ОблШ1_Интервал;
                КонецеСли;	
				
				ОблШ1.Параметры.НомерЗаказа = "Заказ № " + Ном;
				ОблШ1.Параметры.ДатаЗаказа1 = "от " + Формат(Рез.ДатаСоздания, "ДЛФ=DD");           //ДатаЗ
				ОблШ1.Параметры.ДатаВремяДоставки = ДатаВремяДоставки;
				ОблШ1.Параметры.МенеджерЗаказа = Менед;
                
                //Серегин М.В. 07.08.2015 12:36:30 
                Если СокрЛП(Рез.КодК) = "Shop_338" Тогда
                    ОблШ2=ОблШ2_Компик;
                    ОблШ2.Параметры.ДатаЗаказа2 = "Дата: " + Формат(Рез.ВремяПрибытияС, "ДФ=dd-MM-yyyy; ДЛФ=D");
                Иначе
                    ОблШ2.Параметры.ДатаЗаказа2 = "Дата: " + Формат(Рез.ВремяПрибытияС, "ДЛФ=D");
                КонецЕсли;
                //Серегин М.В. 07.08.2015 12:36:32 
                
				ОблШ2.Параметры.НомерТоварногоЧека = "ТОВАРНЫЙ ЧЕК № " + Ном;
                
				//ОблШ2.Параметры.СтрокаПродавецАгент = "Продавец: " + Рез.ВладелецТовара + "; Агент: ООО ""МС Логистик""";
				
				//СтрЕслиМолИНал = "Продавец: ООО ""Канкорд"",  Агент: ООО ""Альфа-Групп""";
				//
				//Если СокрЛП(Рез.КодК) = "Shop_59" И Рез.ТипОплаты = 1 Тогда
				//	ОблШ2.Параметры.СтрокаПродавецАгент = СтрЕслиМолИНал;
				//Иначе
				
				
				СтрукРБЗ = Новый Структура;
				
				Если Не ЗначениеЗаполнено(Рез.ВС.Родитель.ОсновнойМагазин) Тогда
					СтрукРБЗ.Вставить("Контрагент", Рез.ВС);
				Иначе
					СтрукРБЗ.Вставить("Контрагент", Рез.ВС.Родитель.основнойМагазин);
				КонецеСли;	
				
				СтрукРБЗ.Вставить("ТипОплаты", Справочники.ТипыОплат.НайтиПоКоду(Рез.ТипОплаты));
                
                ////Серегин М.В. 11.08.2015 17:10:14 старый код
                ////Серегин М.В. 22.07.2015 18:52:09 новое условие на яндекс 
                //Если СокрЛП(Рез.КодК) = "Shop_248" И ЗначениеЗаполнено(Рез.ИнтернетМагазинЯндекса) тогда
                //Серегин М.В. 11.08.2015 17:10:21 новый
                Если СокрЛП(Рез.КодК) = "Shop_248" Или СокрЛП(Рез.КодК) = "Shop_601" Или СокрЛП(Рез.КодК) = "Shop_752" тогда
                    Если ЗначениеЗаполнено(Рез.ИнтернетМагазинЯндекса) Тогда
                        ОблШ2.Параметры.СтрокаПродавецАгент = "Продавец: "+Рез.ИнтернетМагазинЯндекса.Наименование;//+", Агент: АО ""СТРИЖ-Логистик"""; //+++ Костя 031115 Закоментил 
                    Иначе
                       Реализация = Документы.РеализацияТоваровУслуг.НайтиПоНомеру(Рез.Номер);
                       ОблШ2.Параметры.СтрокаПродавецАгент = "Продавец: "+Реализация.ИнтернетМагазинЯндекса.Наименование;//+", Агент: АО ""СТРИЖ-Логистик"""; //+++ Костя 031115 Закоментил 
                    КонецЕсли;
                //Серегин М.В. 07.08.2015 12:43:29     
                ИначеЕсли СокрЛП(Рез.КодК) = "Shop_338" Тогда
                    ОблШ2.Параметры.СтрокаПродавецАгент = "Продавец: "+Рез.ЗаголовокИнтернетМагазина+", Агент: АО ""СТРИЖ-Логистик""";
                //Серегин М.В. 07.08.2015 12:43:36 
                Иначе    
                    найСтрБЗ = РегистрыСведений.АгентыБланкаЗаказа.ПолучитьПоследнее(ТекущаяДата(), СтрукРБЗ);
                    
                    Если ЗначениеЗаполнено(НайСтрБЗ.СтрокаВБланк) Тогда
                        ОблШ2.Параметры.СтрокаПродавецАгент = НайСтрБЗ.СтрокаВБланк;
                    Иначе	
                        Если Не ЗначениеЗаполнено(Рез.ВС.Родитель.ОсновнойМагазин) Тогда
                            ОблШ2.Параметры.СтрокаПродавецАгент = Рез.РеквизитыНаБЗ;
                        Иначе
                            ОблШ2.Параметры.СтрокаПродавецАгент = Рез.ВС.Родитель.ОсновнойМагазин.РеквизитыНаБЗ;
                        КонецеСли;	
                    КонецЕСли;	
                    
                КонецЕсли;
					
				
				
				
				//КонецеСли;	
				
				Стр = Новый Структура;
				Стр.Вставить("Контрагент", Рез.ВС);
				Выб = РегистрыСведений.ЛоготипыКонтрагентов.Выбрать(Стр);
				Если СокрЛП(Рез.КодК) = "Shop_229" Тогда
					ОблШИ.Параметры.Телефон = Рез.ТелефонИнтернетМагазина;
					ОблШИ.Рисунки.barcode3.Объект.barcode = "37" + Формат((Число(Рез.Номер)), "ЧЦ=10; ЧВН=; ЧГ=");
					Если Рез.ВыделяемИнтервал Тогда
						ОблШИ.Параметры.СрочнаяДоставка = "СРОЧНАЯ ДОСТАВКА";
					Иначе
						ОблШИ.Параметры.СрочнаяДоставка = "";
					КонецеСли;	
					Таб.Вывести(ОблШИ);						
				Иначе
					Попытка
						Если Выб.Следующий() Тогда
							ОблШЛН.Рисунки.Лого_1.Картинка = Выб.ЛоготипЛевый.Получить();
							ОблШЛН.Рисунки.Лого_2.Картинка = Выб.ЛоготипПравый.Получить();
							
							Если Не ЗначениеЗаполнено(ОблШЛН.Рисунки.Лого_1.Картинка) Тогда
								ОблШЛН.Рисунки.Лого_1.ВыводитьНаПечать = Ложь;
								ОблШЛН.Параметры.Назв = Рез.ЗаголовокИнтернетМагазина;
							КонецЕСли;	
							
							Если Не ЗначениеЗаполнено(ОблШЛН.Рисунки.Лого_2.Картинка) Тогда
								ОблШЛН.Рисунки.Лого_2.ВыводитьНаПечать = Ложь;
								ОблШЛН.Параметры.Телефон = Рез.ТелефонИнтернетМагазина;
							КонецЕСли;	
							
							ОблШЛН.Рисунки.barcode2.Объект.barcode = "37" + Формат((Число(Рез.Номер)), "ЧЦ=10; ЧВН=; ЧГ="); 
							
							Если Рез.ВыделяемИнтервал Тогда
								ОблШЛН.Параметры.СрочнаяДоставка = "СРОЧНАЯ ДОСТАВКА";
							Иначе
								ОблШЛН.Параметры.СрочнаяДоставка = "";
							КонецеСли;	
							
							Таб.Вывести(ОблШЛН);
						Иначе
							ОблШЛН.Рисунки.Лого_1.ВыводитьНаПечать = Ложь;
							ОблШЛН.Рисунки.Лого_2.ВыводитьНаПечать = Ложь;
                            
                            //+++++Серегин М.В. 17.09.2015 15:33:48 
                            Если Рез.КодК = "Shop_248 " Или Рез.КодК = "Shop_601 " Или Рез.КодК = "Shop_752 " Тогда 
                                ОблШЛН.Параметры.Назв = "YD";    
                            Иначе
                                ОблШЛН.Параметры.Назв = Рез.ЗаголовокИнтернетМагазина;
                            КонецЕсли;
                            //-----Серегин М.В. 17.09.2015 15:33:49 
							ОблШЛН.Параметры.Телефон = Рез.ТелефонИнтернетМагазина;
							ОблШЛН.Рисунки.barcode2.Объект.barcode = "37" + Формат((Число(Рез.Номер)), "ЧЦ=10; ЧВН=; ЧГ=");
							Если Рез.ВыделяемИнтервал Тогда
								ОблШЛН.Параметры.СрочнаяДоставка = "СРОЧНАЯ ДОСТАВКА";
							Иначе
								ОблШЛН.Параметры.СрочнаяДоставка = "";
							КонецеСли;	
							Таб.Вывести(ОблШЛН);
						КонецеСли;	
					исключение
					КонецПОпытки;
				КонецеСли;
				СтрОплата = "";
				Если Рез.ТипОплаты = 1 Тогда
					СтрОплата = "Оплата наличными";
				ИначеЕсли Рез.ТипОплаты = 2 Тогда
					СтрОплата = "В кредит";
				ИначеЕсли Рез.ТипОплаты = 3 Тогда
					СтрОплата = "Оплата картой";
				ИначеЕсли Рез.ТипОплаты = 4 Тогда
					СтрОплата = "Безналичный расчет";
				ИначеЕсли Рез.ТипОплаты = 5 Тогда
					СтрОплата = "Оплата по терминалу";
				ИначеЕсли Рез.ТипОплаты = 6 Тогда
					СтрОплата = "Яндекс Деньги";
				ИначеЕсли Рез.ТипОплаты = 7 Тогда
					СтрОплата = "Оплачено в магазине";
				КонецеСли;
				
				
				Если СтоимостьДоставкиДоМКАД = 0 Тогда
					СтоимостьДоставкиДоМКАД = Рез.СтоимостьДоставкиДоМКАД;
				КонецеСли;	
				
				Если СтоимостьДоставкиЗаМКАД = 0 Тогда
					СтоимостьДоставкиЗаМКАД = Рез.СтоимостьДоставкиЗаМКАД;
				КонецеСли;	
				
				Если Рез.Тр Тогда
					СтрОплата = Рез.ТипОплатыТК;
				КонецеСли;	
                
                
                ОблШ2.Параметры.ТипОплаты = СтрОплата;
                //Серегин М.В. 07.08.2015 12:38:21 
                Если СокрЛП(Рез.КодК) = "Shop_338" Тогда
                Иначе
                    ОблШ2.Параметры.НомерЛог = Рез.НомерЛог;
                КонецЕсли;
                //Серегин М.В. 07.08.2015 12:38:23 
                
                
				
				Таб.Вывести(ОблШ1);
				
				если Рез.ТР Тогда
					СтрОплата = Рез.ТипОплатыТК;
					ОблСтрТК = Мак.ПолучитьОбласть("ТК");
					ОблСтрТК.Параметры.АдресДоставкиТК = УправлениеКонтактнойИнформацией.ПолучитьАдресИзКонтактнойИнформации(Рез.Грузополучатель, "АдресТранспортнойКомпании");
					Таб.Вывести(ОблСтрТК);				
				КонецеСли;
                
                //Серегин М.В. 07.08.2015 12:18:23 
                Если СокрЛП(Рез.КодК) = "Shop_338" Тогда
                    ОблШ1_Компик.Параметры.АдресДоставки = Рез.Адрес;
                    ОблШ1_Компик.Параметры.Телефон = Рез.Телефон;
                    ОблШ1_Компик.Параметры.Покупатель = Рез.Покупатель;
                    Таб.Вывести(ОблШ1_Компик);
                Иначе
                    ОблШ11 = Мак.ПолучитьОбласть("Шапка1_2");
                    
                    ОблШ11.Параметры.АдресДоставки = Рез.Адрес;
                    ОблШ11.Параметры.ИсходныйАдрес = Рез.АдресИсходный;
                    ОблШ11.Параметры.Телефон = Рез.Телефон;
                    ОблШ11.Параметры.Покупатель = Рез.Покупатель;
                    ОблШ11.Параметры.КоммАдрес = Рез.КомментарийКАдресуДоставки;
                    
                    Таб.Вывести(ОблШ11);
                КонецЕсли;
                //Серегин М.В. 07.08.2015 12:21:32 
				
				Если ЗначениеЗаполнено(Рез.jurPerson) Тогда
					ОблЮ = Мак.ПолучитьОбласть("Юрик");
					ОблЮ.параметры.Юрик = СокрЛП(Рез.jurPerson);
					Таб.Вывести(ОблЮ);
				КонецеСли;	
				
				ОблШ2.Параметры.Комментарий = СтрЗаменить(Рез.Комментарий, "Яндекс.Доставка:", "");
				Таб.Вывести(ОблШ2);
				Нач = Ложь;
			КонецеСли;
			
			ОблСтр.параметры.Заполнить(рез);
			Если ЗначениеЗаполнено(СокрЛП(Рез.КА)) Тогда
				ОблСтр.параметры.Id_Код = СокрЛП(Рез.К) + "/" + СокрЛП(Рез.КА);
			Иначе
				ОблСтр.параметры.Id_Код = СокрЛП(Рез.К) + "/нет";
			КонецеСли;	
			
			ОблСтр.Параметры.НомерСтроки = НПП;
			Таб.Вывести(ОблСтр);
			ИтСум = ИтСум + Рез.Сумма;
			КолСтр = КолСтр + 1;
			Оплачен = Рез.Оплачен;
			
			Если ЗначениеЗаполнено(Рез.Вес) Тогда
				В = рез.Вес;
			Иначе
				В = 0;
			КонецеСли;	
			ИтВес = ИтВес + В;
			
			
			
			НПП = НПП + 1;
		КонецциКЛА;		
		
		Если ТабСверки <> Неопределено Тогда
			НайСв = ТабСверки.Найти(Число(Доставка.Номер));
			Если НайСв <> Неопределено Тогда
				Если НайСв.orderSumUSD_all_Ч <> ИтСум Тогда
					#Если Клиент Тогда
						Сообщить("По доставке № " + СокрЛП(Доставка.Номер) + " несовпадение сумм в 1с и админке! Разница = " + Формат(НайСв.orderSumUSD_all_Ч- ИтСум, "ЧДЦ=2"), СтатусСообщения.ОченьВажное);
					#КонецЕСли	
				КонецЕсли;	
			Иначе
				#Если Клиент Тогда
					Сообщить("По доставке № " + СокрЛП(Доставка.Номер) + " не обнаружено данных в админке!", СтатусСообщения.ОченьВажное);
				#КонецЕСли	
			КонецеСли;	
		КонецеСли;	
		
		КолСтр = КолСтр + 1;
		Если СтоимостьДоставкиДоМКАД <> 0 Тогда
			ОблСтр.Параметры.НомерСтроки = КолСтр;
			ОблСтр.Параметры.ID_Код = "";
			ОблСтр.Параметры.Номенклатура = "Доставка";
			ОблСтр.Параметры.Количество = 1;
			ОблСтр.Параметры.Цена = СтоимостьДоставкиДоМКАД;
			ОблСтр.Параметры.Сумма = СтоимостьДоставкиДоМКАД;
			
			Таб.Вывести(ОблСтр);
			ИтСум = ИтСум + СтоимостьДоставкиДоМКАД;
			КолСтр = КолСтр + 1;
		КонецеСли;	
		
		
		Если СтоимостьДоставкиЗаМКАД <> 0 Тогда
			ОблСтр.Параметры.НомерСтроки = КолСтр;
			ОблСтр.Параметры.ID_Код = "";
			ОблСтр.Параметры.Номенклатура = "Доставка за МКАД";
			ОблСтр.Параметры.Количество = 1;
			ОблСтр.Параметры.Цена = СтоимостьДоставкиЗаМКАД;
			ОблСтр.Параметры.Сумма = СтоимостьДоставкиЗаМКАД;
			
			Таб.Вывести(ОблСтр);
			ИтСум = ИтСум + СтоимостьДоставкиЗаМКАД;
			КолСтр = КолСтр + 1;
		КонецеСли;	
		
        //Серегин М.В. 07.08.2015 12:49:15 
        Если СокрЛП(Рез.КодК) = "Shop_338" Тогда
            ОблП1_Компик.Параметры.ИтСумма = ИтСум;
            ОблП1_Компик.Параметры.СтрокаРасшифровка1 = "Всего наименований "+ (КолСтр-1)+", на сумму "+ИтСум+" руб.";
            ОблП1_Компик.Параметры.СтрокаРасшифровка2 = "Всего получено(прописью): "+ЧислоПрописью(ИтСум,"Л = ru_RU; ДП = Истина","рубль,рубля,рублей,м,копейка,копейки,копеек,ж");
            Таб.Вывести(ОблП1_Компик);
        Иначе
            ОблП1.Параметры.ИтСумма = ИтСум;
            
            Если ТабВес003.Количество() = 0 Тогда		
                ОблП1.Параметры.СумВес = ИтВес;
            Иначе
                ОблП1.Параметры.СумВес = ТабВес003[0].Вес;
            КонецЕсли;
            
            Если ЗначениеЗаполнено(итВес) Тогда
                ОблП1.Параметры.ндВес = "Суммарный вес:"
            Иначе	
                ОблП1.Параметры.ндВес = "";
            КонецеСли;	
            Таб.Вывести(ОблП1);
        КонецЕсли;
        //Серегин М.В. 07.08.2015 12:50:44 
        
		Если Оплачен Тогда
			ОблОпл = Мак.ПолучитьОбласть("Оплачено");
			ОблОпл.Параметры.СумОпл = ИтСум;
			Таб.Вывести(ОблОпл);
        КонецеСли;
        
        //Серегин М.В. 26.08.2015 18:04:18 
        Если Документы.РеализацияТоваровУслуг.НайтиПоНомеру(Рез.Номер).УчитыватьИтогоКОплате Тогда//+++++Серегин М.В. 18.02.2016 12:18:05 было СокрЛП(Рез.КодК) = "Shop_248"  Тогда   
			ОблИтогоКОплате = Мак.ПолучитьОбласть("ИтогоКОплате");
			ОблИтогоКОплате.Параметры.СумОпл = Рез.КОплатеКлиентом;
			Таб.Вывести(ОблИтогоКОплате);
        КонецЕсли;
        //Серегин М.В. 26.08.2015 18:04:20 
		
		Если Рез.ТипОплатыСпр = Справочники.ТипыОплат.ВКредит Тогда
			ОблОплК = Мак.ПолучитьОбласть("Кредит");
			ОблОплК.Параметры.СумКр = Рез.ПредоплатаПоКредиту;
			ОблОплК.Параметры.СумКОплате = ИтСум - Рез.ПредоплатаПоКредиту;
			Таб.Вывести(ОблОплК);
		КонецеСли;	
			
		
		
		Если СокрЛП(Рез.КодК) = "Shop_208" Или СокрЛП(Рез.КодК) = "Shop_214" Или СокрЛП(Рез.КодК) = "Shop_240" Тогда
			ОблП_П.Параметры.ТекДата = Формат(ТекущаяДата(), "ДЛФ=DT");
			Таб.Вывести(ОблП_П);
		ИначеЕсли СокрЛП(Рез.КодК) = "Shop_226" Тогда
			ОблП_Е.Параметры.ТекДата = Формат(ТекущаяДата(), "ДЛФ=DT");
			Таб.Вывести(ОблП_Е);
		ИначеЕсли СокрЛП(Рез.КодК) = "Shop_228" Тогда
			ОблП_БезП.Параметры.ТекДата = Формат(ТекущаяДата(), "ДЛФ=DT");
			Таб.Вывести(ОблП_БезП);
		ИначеЕсли СокрЛП(Рез.КодК) = "Shop_229" Тогда
			ОблП_I.Параметры.ТекДата = Формат(ТекущаяДата(), "ДЛФ=DT");
			Таб.Вывести(ОблП_I);
            //Серегин М.В. 25.06.2015 12:58:42 
		ИначеЕсли СокрЛП(Рез.КодК) = "Shop_248" Или СокрЛП(Рез.КодК) = "Shop_601" Или СокрЛП(Рез.КодК) = "Shop_752" Тогда
			ОблП2_Я.Параметры.ТекДата = Формат(ТекущаяДата(), "ДЛФ=DT");
			Таб.Вывести(ОблП2_Я);
            //Серегин М.В. 25.06.2015 12:58:44 
        ИначеЕсли СокрЛП(Рез.КодК) = "Shop_338" Тогда
			Таб.Вывести(ОблП2_Компик);
        //Серегин М.В. 07.08.2015 13:01:19
        ИначеЕсли СокрЛП(Рез.КодК) = "Shop_375" Тогда
			Таб.Вывести(ОблП2_ДжейТи);
		ИначеЕсли СокрЛП(Рез.КодК) = "Shop_388" Тогда // Костя 280915
			Таб.Вывести(ОблП2_АвтоИКС24);			
		ИначеЕсли СокрЛП(Рез.КодК) = "Shop_401" Тогда // Костя
			Таб.Вывести(ОблП2_КлиматКомфортShopdroneB2btools);
		ИначеЕсли СокрЛП(Рез.КодК) = "Shop_431" Тогда // Костя
			Таб.Вывести(ОблП2_КлиматКомфортShopdroneB2btools);
		ИначеЕсли СокрЛП(Рез.КодК) = "Shop_432" Тогда // Костя
			Таб.Вывести(ОблП2_КлиматКомфортShopdroneB2btools);
		ИначеЕсли СокрЛП(Рез.КодК) = "Shop_435" Тогда // Костя
			Таб.Вывести(ОблП2_КлиматКомфортShopdroneB2btools);
		ИначеЕсли СокрЛП(Рез.КодК) = "Shop_436" Тогда // Костя
			Таб.Вывести(ОблП2_КлиматКомфортShopdroneB2btools); // UFEELGOOD // Костя 121115
		ИначеЕсли СокрЛП(Рез.КодК) = "Shop_437" Тогда 
			Таб.Вывести(ОблП2_КлиматКомфортShopdroneB2btools); // COUGAR // Костя 121115
		ИначеЕсли СокрЛП(Рез.КодК) = "Shop_438" Тогда 
			Таб.Вывести(ОблП2_КлиматКомфортShopdroneB2btools); // AXIOMUS // Костя 121115			
		Иначе
			//+++ Костя 181115
			// Если у контрагента заданы варианты таблиц подъёмов - выводить их 
			ЗапросВариантыПодьемов = Новый Запрос(
			"ВЫБРАТЬ
			|	ПодъёмыНаБланкахЗаказа.НомерПункта КАК НомерПункта,
			|	ПодъёмыНаБланкахЗаказа.Наименование,
			|	ПодъёмыНаБланкахЗаказа.СтоимостьПодъема
			|ИЗ
			|	РегистрСведений.ПодъёмыНаБланкахЗаказа КАК ПодъёмыНаБланкахЗаказа
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВариантыТаблицыПодъемовВБланкахЗаказов.СрезПоследних КАК ВариантыТаблицыПодъемовВБланкахЗаказовСрезПоследних
			|		ПО ПодъёмыНаБланкахЗаказа.ВариантТаблицыПодъемов = ВариантыТаблицыПодъемовВБланкахЗаказовСрезПоследних.ВариантТаблицыПодъемов
			|ГДЕ
			|	ВариантыТаблицыПодъемовВБланкахЗаказовСрезПоследних.Контрагент.Код = &КодКонтрагента
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерПункта");
			ЗапросВариантыПодьемов.УстановитьПараметр("КодКонтрагента", Рез.КодК);
			Подьемы = ЗапросВариантыПодьемов.Выполнить().Выгрузить();
			Если Подьемы.Количество() > 0 Тогда
				МакетПодьемы = ПолучитьМакет("Подъем");
				// Шапка
				ОбластьПодьемШапка = МакетПодьемы.ПолучитьОбласть("ПодьемШапка");
				Таб.Вывести(ОбластьПодьемШапка);
				// Строки
				ОбластьПодьемПункт = МакетПодьемы.ПолучитьОбласть("ПодьемПункт");
				Для Каждого Стр Из Подьемы Цикл
					ОбластьПодьемПункт.Параметры.НаименованиеПункта = Строка(Стр.НомерПункта)+". " + Стр.Наименование;
					ОбластьПодьемПункт.Параметры.СтоимостьПодьема = ?(Стр.СтоимостьПодъема=0,"", Строка(Стр.СтоимостьПодъема) +  " руб/этаж");
					Таб.Вывести(ОбластьПодьемПункт);
				КонецЦикла;
				// Подвал
				ОбластьПодьемПодвал = МакетПодьемы.ПолучитьОбласть("ПодьемПодвал");
				ОбластьПодьемПодвал.Параметры.ТекДата = Формат(ТекущаяДата(), "ДЛФ=DT");
				Таб.Вывести(ОбластьПодьемПодвал);
				
			Иначе
				Если СокрЛП(Рез.КодК) <> "Shop_428" И СокрЛП(Рез.КодК) <> "Shop_181" И СокрЛП(Рез.КодК) <> "Shop_227" Тогда 
					ОблП2.Параметры.Пд = "Промо карточку Яндекс.Такси получил";
				Иначе
					ОблП2.Параметры.Пд = "";
				КонецеСли;	
				ОблП2.Параметры.ТекДата = Формат(ТекущаяДата(), "ДЛФ=DT");
				Таб.Вывести(ОблП2);
			КонецЕсли;
			//
		КонецеСли;	
		
		
		
		
		Попытка
		если ПечататьШтрихкод Тогда
			Таб.ВывестиГоризонтальныйРазделительСтраниц();
			
			Для Сч = 1 По КолМест Цикл
				ТабШтр = Мак.ПолучитьОбласть("Штрихкод");
				табШтр.Параметры.ндЗаказ = Ном;
				табШтр.Параметры.СтрокаМест = Строка(Сч) + "/" + Строка(КолМест);
				ТабШтр.Рисунки.barcode.Объект.barcode = СокрЛП(Рез.НомерВнешнегоЗаказа) + "R" + Формат(Сч, "ЧЦ=3; ЧВН=");
				таб.Вывести(ТабШтр);
			КонецЦикла;	
		КонецеСли;	
	Исключение
		КонецПопытки;
	
	
	
	
	Таб.ТолькоПросмотр = Истина;
	
	Таб.ПолеСлева = 3;
	Таб.ПолеСправа = 3;
	Таб.ПолеСнизу = 3;
	Таб.ПолеСверху = 3;
	Таб.разборПоКопиям = РазборПоКопиям;
	Таб.АвтоМасштаб = Истина;
КонецПроцедуры	

Процедура ПечатьПоДоставкеСамовывоз(Таб, Доставка, МасНом, МасДос, ТабСверки, РазборПоКопиям) Экспорт
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
                |   РеализацияТоваровУслугТовары.НомерСтроки,
                |   РеализацияТоваровУслугТовары.Номенклатура.Код,
                |   РеализацияТоваровУслугТовары.Номенклатура,
                |   РеализацияТоваровУслугТовары.Количество КАК Количество,
                |   РеализацияТоваровУслугТовары.Цена,
                |   СУММА(РеализацияТоваровУслугТовары.Сумма) КАК Сумма,
                |   РеализацияТоваровУслугТовары.Ссылка.Номер КАК НомерДоставки,
                |   РеализацияТоваровУслугТовары.Номенклатура.Артикул КАК Артикул,
                |   РеализацияТоваровУслугТовары.Вес * РеализацияТоваровУслугТовары.Количество КАК Вес
                |ПОМЕСТИТЬ ТоварыДоставки
                |ИЗ
                |   Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
                |ГДЕ
                |   РеализацияТоваровУслугТовары.Ссылка.Номер = &МасНом
                |
                |СГРУППИРОВАТЬ ПО
                |   РеализацияТоваровУслугТовары.Номенклатура,
                |   РеализацияТоваровУслугТовары.Ссылка.Номер,
                |   РеализацияТоваровУслугТовары.НомерСтроки,
                |   РеализацияТоваровУслугТовары.Номенклатура.Код,
                |   РеализацияТоваровУслугТовары.Номенклатура.Артикул,
                |   РеализацияТоваровУслугТовары.Цена,
                |   РеализацияТоваровУслугТовары.Количество,
                |   РеализацияТоваровУслугТовары.Вес * РеализацияТоваровУслугТовары.Количество
                |
                |ОБЪЕДИНИТЬ ВСЕ
                |
                |ВЫБРАТЬ
                |   ВозвратТоваровОтПокупателяТовары.НомерСтроки,
                |   ВозвратТоваровОтПокупателяТовары.Номенклатура.Код,
                |   ВозвратТоваровОтПокупателяТовары.Номенклатура,
                |   -ВозвратТоваровОтПокупателяТовары.Количество,
                |   ВозвратТоваровОтПокупателяТовары.Цена,
                |   СУММА(-ВозвратТоваровОтПокупателяТовары.Сумма),
                |   ВозвратТоваровОтПокупателяТовары.Ссылка.Номер,
                |   ВозвратТоваровОтПокупателяТовары.Номенклатура.Артикул,
                |   0
                |ИЗ
                |   Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
                |ГДЕ
                |   ВозвратТоваровОтПокупателяТовары.Ссылка.Номер = &МасНом
                |
                |СГРУППИРОВАТЬ ПО
                |   ВозвратТоваровОтПокупателяТовары.НомерСтроки,
                |   ВозвратТоваровОтПокупателяТовары.Номенклатура.Код,
                |   ВозвратТоваровОтПокупателяТовары.Номенклатура,
                |   ВозвратТоваровОтПокупателяТовары.Цена,
                |   ВозвратТоваровОтПокупателяТовары.Ссылка.Номер,
                |   ВозвратТоваровОтПокупателяТовары.Номенклатура.Артикул,
                |   -ВозвратТоваровОтПокупателяТовары.Количество
                |
                |ОБЪЕДИНИТЬ ВСЕ
                |
                |ВЫБРАТЬ
                |   РеализацияТоваровУслугПодарочныеПозиции.НомерСтроки,
                |   РеализацияТоваровУслугПодарочныеПозиции.Номенклатура.Код,
                |   РеализацияТоваровУслугПодарочныеПозиции.Номенклатура,
                |   РеализацияТоваровУслугПодарочныеПозиции.Количество,
                |   РеализацияТоваровУслугПодарочныеПозиции.Цена,
                |   СУММА(РеализацияТоваровУслугПодарочныеПозиции.Сумма),
                |   РеализацияТоваровУслугПодарочныеПозиции.Ссылка.Номер,
                |   РеализацияТоваровУслугПодарочныеПозиции.Номенклатура.Артикул,
                |   РеализацияТоваровУслугПодарочныеПозиции.Вес * РеализацияТоваровУслугПодарочныеПозиции.Количество
                |ИЗ
                |   Документ.РеализацияТоваровУслуг.ПодарочныеПозиции КАК РеализацияТоваровУслугПодарочныеПозиции
                |ГДЕ
                |   РеализацияТоваровУслугПодарочныеПозиции.Ссылка.Номер = &МасНом
                |
                |СГРУППИРОВАТЬ ПО
                |   РеализацияТоваровУслугПодарочныеПозиции.Номенклатура,
                |   РеализацияТоваровУслугПодарочныеПозиции.Ссылка.Номер,
                |   РеализацияТоваровУслугПодарочныеПозиции.НомерСтроки,
                |   РеализацияТоваровУслугПодарочныеПозиции.Номенклатура.Код,
                |   РеализацияТоваровУслугПодарочныеПозиции.Номенклатура.Артикул,
                |   РеализацияТоваровУслугПодарочныеПозиции.Цена,
                |   РеализацияТоваровУслугПодарочныеПозиции.Количество,
                |   РеализацияТоваровУслугПодарочныеПозиции.Вес * РеализацияТоваровУслугПодарочныеПозиции.Количество
                |
                |ОБЪЕДИНИТЬ ВСЕ
                |
                |ВЫБРАТЬ
                |   ВозвратТоваровОтПокупателяТовары.НомерСтроки,
                |   ВозвратТоваровОтПокупателяТовары.Номенклатура.Код,
                |   ВозвратТоваровОтПокупателяТовары.Номенклатура,
                |   ВозвратТоваровОтПокупателяТовары.Количество,
                |   ВозвратТоваровОтПокупателяТовары.Цена,
                |   СУММА(ВозвратТоваровОтПокупателяТовары.Сумма),
                |   ВозвратТоваровОтПокупателяТовары.Ссылка.Номер,
                |   ВозвратТоваровОтПокупателяТовары.Номенклатура.Артикул,
                |   0
                |ИЗ
                |   Документ.РеализацияТоваровУслуг.Услуги КАК ВозвратТоваровОтПокупателяТовары
                |ГДЕ
                |   ВозвратТоваровОтПокупателяТовары.Ссылка.Номер = &МасНом
                |
                |СГРУППИРОВАТЬ ПО
                |   ВозвратТоваровОтПокупателяТовары.Номенклатура,
                |   ВозвратТоваровОтПокупателяТовары.Ссылка.Номер,
                |   ВозвратТоваровОтПокупателяТовары.НомерСтроки,
                |   ВозвратТоваровОтПокупателяТовары.Номенклатура.Код,
                |   ВозвратТоваровОтПокупателяТовары.Номенклатура.Артикул,
                |   ВозвратТоваровОтПокупателяТовары.Цена,
                |   ВозвратТоваровОтПокупателяТовары.Количество
                |;
                |
                |////////////////////////////////////////////////////////////////////////////////
                |ВЫБРАТЬ
                |   РеализацияТоваровУслуг.Ссылка.Номер КАК Номер,
                |   РеализацияТоваровУслуг.Ссылка.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
                |   """" КАК Менеджер,
                |   РеализацияТоваровУслуг.Дата КАК ДатаЗаказа,
                |   РеализацияТоваровУслуг.Дата КАК ВремяПрибытияС,
                |   РеализацияТоваровУслуг.Дата КАК ВремяПрибытияПо,
                |   """" КАК Адрес,
                |   РеализацияТоваровУслуг.Телефон КАК Телефон,
                |   РеализацияТоваровУслуг.Ссылка.Контрагент.Наименование КАК Покупатель,
                |   РеализацияТоваровУслуг.Комментарий КАК Комментарий,
                |   РеализацияТоваровУслуг.Ссылка.ВладелецТовара.НаименованиеПолное КАК ВладелецТовара,
                |   РеализацияТоваровУслуг.Ссылка.ТипОплаты КАК ТипОплаты,
                |   РеализацияТоваровУслуг.Ссылка.ВладелецТовара.Ссылка КАК ВС,
                |   0 КАК СтоимостьДоставкиДоМКАД,
                |   0 КАК СтоимостьДоставкиЗаМКАД,
                |   РеализацияТоваровУслуг.Ссылка.ВладелецТовара.jurPerson КАК jurPerson,
                |   ИСТИНА КАК Оплачен,
                |   ЕСТЬNULL(РеализацияТоваровУслуг.Ссылка.ВладелецТовара.ТранспортнаяКомпания, ЛОЖЬ) КАК Тр,
                |   РеализацияТоваровУслуг.Ссылка.ВладелецТовара.Наименование КАК ТипОплатыТК,
                |   РеализацияТоваровУслуг.Ссылка.ВладелецТовара.Ссылка КАК Грузополучатель,
                |   """" КАК КомментарийКАдресуДоставки,
                |   РеализацияТоваровУслуг.Ссылка.ВладелецТовара.ПечататьШтрихкоды КАК ПечататьШтрихкоды,
                |   1 КАК КоличествоМест,
                |   РеализацияТоваровУслуг.Ссылка.ВладелецТовара.Код КАК КодК,
                |   РеализацияТоваровУслуг.Дата КАК ДатаСоздания,
                |   РеализацияТоваровУслуг.ВладелецТовара.РеквизитыНаБЗ КАК РеквизитыНаБЗ,
                |   РеализацияТоваровУслуг.ВладелецТовара.ТелефонИнтернетМагазина КАК ТелефонИнтернетМагазина,
                |   РеализацияТоваровУслуг.ВладелецТовара.ЗаголовокИнтернетМагазина КАК ЗаголовокИнтернетМагазина,
                |   РеализацияТоваровУслуг.ПредоплатаПоКредиту
                |ПОМЕСТИТЬ ВТДоставки
                |ИЗ
                |   Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
                |;
                |
                |////////////////////////////////////////////////////////////////////////////////
                |ВЫБРАТЬ
                |   ТоварыДоставки.НомерСтроки КАК НомерСтроки,
                |   ТоварыДоставки.НоменклатураКод КАК К,
                |   ТоварыДоставки.Номенклатура,
                |   ТоварыДоставки.Количество,
                |   ТоварыДоставки.Цена,
                |   ТоварыДоставки.Сумма,
                |   ТоварыДоставки.НомерДоставки,
                |   ТоварыДоставки.Артикул КАК КА,
                |   ТоварыДоставки.Вес,
                |   ВТДоставки.Номер,
                |   ВТДоставки.НомерВнешнегоЗаказа,
                |   ВТДоставки.Менеджер,
                |   ВТДоставки.ДатаЗаказа,
                |   ВТДоставки.Адрес,
                |   ВТДоставки.Телефон,
                |   ВТДоставки.Покупатель,
                |   ВТДоставки.Комментарий,
                |   ВТДоставки.ВладелецТовара,
                |   ВТДоставки.ТипОплаты,
                |   ВТДоставки.ВС,
                |   ВТДоставки.СтоимостьДоставкиДоМКАД,
                |   ВТДоставки.СтоимостьДоставкиЗаМКАД,
                |   ВТДоставки.jurPerson,
                |   ВТДоставки.Оплачен,
                |   ВТДоставки.Тр,
                |   ВТДоставки.ТипОплатыТК,
                |   ВТДоставки.Грузополучатель,
                |   ВТДоставки.КомментарийКАдресуДоставки,
                |   ВТДоставки.ПечататьШтрихкоды,
                |   ВТДоставки.КоличествоМест,
                |   ВТДоставки.КодК,
                |   ВТДоставки.ДатаСоздания,
                |   ВТДоставки.РеквизитыНаБЗ,
                |   ВТДоставки.ТелефонИнтернетМагазина,
                |   ВТДоставки.ЗаголовокИнтернетМагазина,
                |   ВТДоставки.ВремяПрибытияС,
                |   ВТДоставки.ВремяПрибытияПо,
                |   ВТДоставки.Телефон КАК Телефон1,
                |   ВТДоставки.ПредоплатаПоКредиту,
                |   ТипыОплат.Ссылка КАК ТипОплатыСпр,
                |   ЕСТЬNULL(ДополнительныеПараметрыЗаказа.КОплатеКлиентом, 0) КАК КОплатеКлиентом
                |ИЗ
                |   ТоварыДоставки КАК ТоварыДоставки
                |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДоставки КАК ВТДоставки
                |           ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТипыОплат КАК ТипыОплат
                |           ПО ВТДоставки.ТипОплаты = ТипыОплат.Код
                |           ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
                |           ПО ВТДоставки.Номер = ДополнительныеПараметрыЗаказа.Заказ.Номер
                |       ПО ТоварыДоставки.НомерДоставки = ВТДоставки.Номер
                |
                |УПОРЯДОЧИТЬ ПО
                |   ВТДоставки.ВС.Приоритет,
                |   НомерСтроки
                |;
                |
                |////////////////////////////////////////////////////////////////////////////////
                |УНИЧТОЖИТЬ ТоварыДоставки
                |;
                |
                |////////////////////////////////////////////////////////////////////////////////
                |УНИЧТОЖИТЬ ВТДоставки";
	Зап.УстановитьПараметр("ВыбДоставка", Доставка);
	Зап.УстановитьПараметр("МасНом", СокрЛП(Доставка.Номер));
	//Зап.УстановитьПараметр("МасВыбДоставка", МасДос);
	
	
	Мак = ПолучитьМакет("Макет");
	
	ОблШ1 = Мак.ПолучитьОбласть("Шапка1");
	ОблШЛ = Мак.ПолучитьОбласть("ШапкаЛого");        
	ОблШЛН = Мак.ПолучитьОбласть("ШапкаЛогоНазвания");        
	ОблШИ = Мак.ПолучитьОбласть("ШапкаИндезит");        
	ОблШ2 = Мак.ПолучитьОбласть("Шапка2");
    //Серегин М.В. 07.08.2015 11:05:27 
    ОблШ1_Компик = Мак.ПолучитьОбласть("Шапка1_Компик");
	ОблШ2_Компик = Мак.ПолучитьОбласть("Шапка2_Компик");
	ОблП1_Компик = Мак.ПолучитьОбласть("ИтогоКомпик");
    ОблП2_Компик = Мак.ПолучитьОбласть("Подвал2_КомпикСамовывоз");
    //Серегин М.В. 07.08.2015 11:07:38  
    
	ОблСтр = Мак.ПолучитьОбласть("Строка");
	
	ОблП1 = Мак.ПолучитьОбласть("Подвал1");
	ОблП2 = Мак.ПолучитьОбласть("Подвал2Самовывоз");
	ОблП_П = Мак.ПолучитьОбласть("Подвал2_ПуфеттаСамовывоз");
	ОблП_Е = Мак.ПолучитьОбласть("Подвал2_EnterСамовывоз");
	ОблП_БезП = Мак.ПолучитьОбласть("ПодвалБезПодъёма");
	ОблП_I = Мак.ПолучитьОбласть("ПодвалIndesitСамовывоз");
	
	
	
	Рез1 = Зап.Выполнить();
	Если Рез1.Пустой() Тогда
		Сообщить("По заказу № " + СокрЛП(Доставка.Номер) + " нет данных!");
		Возврат;
	КонецЕСли;	
		
	Рез = Рез1.Выбрать();   // ОбходРезультатаЗапроса.ПоГруппировкам
	Нач = Истина;
	ИтСум = 0;
	СтоимостьДоставкиДоМКАД = 0;
	СтоимостьДоставкиЗаМКАД = 0;
	
	Оплачен = Ложь;
	КолСтр = 0;
	ИтВес = 0;
	КолМест = 0;
	ПечататьШтрихкод = Ложь;
	
	НПП = 1;
	//Пока Дост.Следующий() Цикл
	//	Рез = Дост.Выбрать();
		Пока Рез.Следующий() Цикл
			Если Нач Тогда
				Если Рез.ПечататьШтрихкоды Тогда
					ПечататьШтрихкод = Истина;
					колМест = Рез.КоличествоМест;
				КонецеСли;	
				
				Ном = "д" + СокрЛП(Рез.Номер) + "/" + СокрЛП(Рез.НомерВнешнегоЗаказа);
				ДатаЗ = Формат(Рез.ДатаСоздания, "ДЛФ=DD");
				ДатаВремяДоставки = Формат(Рез.ВремяПрибытияС, "ДЛФ=D") + " с " + Формат(Рез.ВремяПрибытияС, "ДФ=ЧЧ:мм") + " до " + Формат(Рез.ВремяПрибытияПо, "ДФ=ЧЧ:мм");
				Менед = "Менеджер заказа: " + СокрЛП(Рез.Менеджер);
				
				ОблШ1.Параметры.НомерЗаказа = "Заказ № " + Ном;
				ОблШ1.Параметры.ДатаЗаказа1 = "от " + Формат(Рез.ДатаСоздания, "ДЛФ=DD");           //ДатаЗ
				ОблШ1.Параметры.ДатаВремяДоставки = ДатаВремяДоставки;
				ОблШ1.Параметры.МенеджерЗаказа = Менед;
				
                
                //Серегин М.В. 07.08.2015 12:36:30 
                Если СокрЛП(Рез.КодК) = "Shop_338" Тогда
                    ОблШ2=ОблШ2_Компик;
                    ОблШ2.Параметры.ДатаЗаказа2 = "Дата: " + Формат(Рез.ВремяПрибытияС, "ДФ=dd-MM-yyyy; ДЛФ=D");
                    
                Иначе
                    ОблШ2.Параметры.ДатаЗаказа2 = "Дата: " + Формат(Рез.ВремяПрибытияС, "ДЛФ=D");
                КонецЕсли;
				ОблШ2.Параметры.НомерТоварногоЧека = "ТОВАРНЫЙ ЧЕК № " + Ном;
                //Серегин М.В. 07.08.2015 14:17:08 
                
				//ОблШ2.Параметры.СтрокаПродавецАгент = "Продавец: " + Рез.ВладелецТовара + "; Агент: ООО ""МС Логистик""";
				
				//СтрЕслиМолИНал = "Продавец: ООО ""Канкорд"",  Агент: ООО ""Альфа-Групп""";
				//
				//Если СокрЛП(Рез.КодК) = "Shop_59" И Рез.ТипОплаты = 1 Тогда
				//	ОблШ2.Параметры.СтрокаПродавецАгент = СтрЕслиМолИНал;
				//Иначе
					СтрукРБЗ = Новый Структура;
					СтрукРБЗ.Вставить("Контрагент", Рез.ВС);
					СтрукРБЗ.Вставить("ТипОплаты", Справочники.ТипыОплат.НайтиПоКоду(Рез.ТипОплаты));
                    
                    
                    ////Серегин М.В. 11.08.2015 17:10:14 старый код
                    ////Серегин М.В. 22.07.2015 18:52:09 новое условие на яндекс 
                    //Если СокрЛП(Рез.КодК) = "Shop_248" И ЗначениеЗаполнено(Рез.ИнтернетМагазинЯндекса) тогда
                    //Серегин М.В. 11.08.2015 17:10:21 новый
                    Если СокрЛП(Рез.КодК) = "Shop_248" Или СокрЛП(Рез.КодК) = "Shop_601" Или СокрЛП(Рез.КодК) = "Shop_752" тогда
                       Реализация = Документы.РеализацияТоваровУслуг.НайтиПоНомеру(Рез.Номер);
                       ОблШ2.Параметры.СтрокаПродавецАгент = "Продавец: "+Реализация.ИнтернетМагазинЯндекса.Наименование+", Агент: АО ""СТРИЖ-Логистик""";//+", Агент: АО ""СТРИЖ-Логистик"""; //+++ Костя 031115 Закоментил 
                        //ОблШ2.Параметры.СтрокаПродавецАгент = "Продавец: "+Рез.ИнтернетМагазинЯндекса.НаименованиеПолное+", Агент: АО ""СТРИЖ-Логистик""";				 
                        //Серегин М.В. 07.08.2015 12:43:29     
                    ИначеЕсли СокрЛП(Рез.КодК) = "Shop_338" Тогда
                        ОблШ2.Параметры.СтрокаПродавецАгент = "Продавец: "+Рез.ЗаголовокИнтернетМагазина+", Агент: АО ""СТРИЖ-Логистик""";
                        //Серегин М.В. 07.08.2015 12:43:36 
                    Иначе    
                        найСтрБЗ = РегистрыСведений.АгентыБланкаЗаказа.ПолучитьПоследнее(ТекущаяДата(), СтрукРБЗ);
                        
                        Если ЗначениеЗаполнено(НайСтрБЗ.СтрокаВБланк) Тогда
                            ОблШ2.Параметры.СтрокаПродавецАгент = НайСтрБЗ.СтрокаВБланк;
                        Иначе	
                            ОблШ2.Параметры.СтрокаПродавецАгент = Рез.РеквизитыНаБЗ;
                        КонецЕСли;	
                        //КонецеСли;
                    КонецЕсли;
                    
				Стр = Новый Структура;
				Стр.Вставить("Контрагент", Рез.ВС);
				Выб = РегистрыСведений.ЛоготипыКонтрагентов.Выбрать(Стр);
				
				Если СокрЛП(Рез.КодК) = "Shop_229" Тогда
					ОблШИ.Параметры.Телефон = Рез.ТелефонИнтернетМагазина;
					ОблШИ.Рисунки.barcode3.Объект.barcode = "37" + Формат((Число(Рез.Номер)), "ЧЦ=10; ЧВН=; ЧГ=");
					Таб.Вывести(ОблШИ);						
				Иначе
					
					Попытка
						Если Выб.Следующий() Тогда
							ОблШЛН.Рисунки.Лого_1.Картинка = Выб.ЛоготипЛевый.Получить();
							ОблШЛН.Рисунки.Лого_2.Картинка = Выб.ЛоготипПравый.Получить();
							
							Если Не ЗначениеЗаполнено(ОблШЛН.Рисунки.Лого_1.Картинка) Тогда
								ОблШЛН.Рисунки.Лого_1.ВыводитьНаПечать = Ложь;
								ОблШЛН.Параметры.Назв = Рез.ЗаголовокИнтернетМагазина;
							КонецЕСли;	
							
							Если Не ЗначениеЗаполнено(ОблШЛН.Рисунки.Лого_2.Картинка) Тогда
								ОблШЛН.Рисунки.Лого_2.ВыводитьНаПечать = Ложь;
								ОблШЛН.Параметры.Телефон = Рез.ТелефонИнтернетМагазина;
							КонецЕСли;	
							
							ОблШЛН.Рисунки.barcode2.Объект.barcode = "37" + Формат((Число(Рез.Номер)), "ЧЦ=10; ЧВН=; ЧГ="); 
							Таб.Вывести(ОблШЛН);
						Иначе
							ОблШЛН.Рисунки.Лого_1.ВыводитьНаПечать = Ложь;
							ОблШЛН.Рисунки.Лого_2.ВыводитьНаПечать = Ложь;
							
							ОблШЛН.Параметры.Назв = Рез.ЗаголовокИнтернетМагазина;
							ОблШЛН.Параметры.Телефон = Рез.ТелефонИнтернетМагазина;
							ОблШЛН.Рисунки.barcode2.Объект.barcode = "37" + Формат((Число(Рез.Номер)), "ЧЦ=10; ЧВН=; ЧГ=");
							Таб.Вывести(ОблШЛН);
						КонецеСли;	
					Исключение
					КонецПопытки;
				КонецеСли;
				СтрОплата = "";
				Если Рез.ТипОплаты = 1 Тогда
					СтрОплата = "Оплата наличными";
				ИначеЕсли Рез.ТипОплаты = 2 Тогда
					СтрОплата = "В кредит";
				ИначеЕсли Рез.ТипОплаты = 3 Тогда
					СтрОплата = "Оплата картой";
				ИначеЕсли Рез.ТипОплаты = 4 Тогда
					СтрОплата = "Безналичный расчет";
				ИначеЕсли Рез.ТипОплаты = 5 Тогда
					СтрОплата = "Оплата по терминалу";
				ИначеЕсли Рез.ТипОплаты = 6 Тогда
					СтрОплата = "Яндекс Деньги";
				ИначеЕсли Рез.ТипОплаты = 7 Тогда
					СтрОплата = "Оплачено в магазине";
				КонецеСли;
				
				
				Если СтоимостьДоставкиДоМКАД = 0 Тогда
					СтоимостьДоставкиДоМКАД = Рез.СтоимостьДоставкиДоМКАД;
				КонецеСли;	
				
				Если СтоимостьДоставкиЗаМКАД = 0 Тогда
					СтоимостьДоставкиЗаМКАД = Рез.СтоимостьДоставкиЗаМКАД;
				КонецеСли;	
				
				Если Рез.Тр Тогда
					СтрОплата = Рез.ТипОплатыТК;
				КонецеСли;	
					
				
				ОблШ2.Параметры.ТипОплаты = СтрОплата;
				
				Таб.Вывести(ОблШ1);
				
				если Рез.ТР Тогда
					СтрОплата = Рез.ТипОплатыТК;
					ОблСтрТК = Мак.ПолучитьОбласть("ТК");
					ОблСтрТК.Параметры.АдресДоставкиТК = УправлениеКонтактнойИнформацией.ПолучитьАдресИзКонтактнойИнформации(Рез.Грузополучатель, "АдресТранспортнойКомпании");
					Таб.Вывести(ОблСтрТК);				
				КонецеСли;
                
                //Серегин М.В. 07.08.2015 12:18:23 
                Если СокрЛП(Рез.КодК) = "Shop_338" Тогда
                    ОблШ1_Компик.Параметры.АдресДоставки = "Самовывоз";
                    ОблШ1_Компик.Параметры.Телефон = Рез.Телефон;
                    ОблШ1_Компик.Параметры.Покупатель = Рез.Покупатель;
                    Таб.Вывести(ОблШ1_Компик);
                Иначе
                    ОблШ11 = Мак.ПолучитьОбласть("Шапка1_1");
                    
                    ОблШ11.Параметры.АдресДоставки = "Самовывоз";
                    ОблШ11.Параметры.Телефон = Рез.Телефон;
                    ОблШ11.Параметры.Покупатель = Рез.Покупатель;
                    ОблШ11.Параметры.КоммАдрес = Рез.КомментарийКАдресуДоставки;
				    Таб.Вывести(ОблШ11);
                КонецЕсли;
                //Серегин М.В. 07.08.2015 14:18:40 
				
				
				
				Если ЗначениеЗаполнено(Рез.jurPerson) Тогда
					ОблЮ = Мак.ПолучитьОбласть("Юрик");
					ОблЮ.параметры.Юрик = СокрЛП(Рез.jurPerson);
					Таб.Вывести(ОблЮ);
				КонецеСли;	
				
				ОблШ2.Параметры.Комментарий = Рез.Комментарий;
				Таб.Вывести(ОблШ2);
				Нач = Ложь;
			КонецеСли;
			
			ОблСтр.параметры.Заполнить(рез);
			Если ЗначениеЗаполнено(СокрЛП(Рез.КА)) Тогда
				ОблСтр.параметры.Id_Код = СокрЛП(Рез.К) + "/" + СокрЛП(Рез.КА);
			Иначе
				ОблСтр.параметры.Id_Код = СокрЛП(Рез.К) + "/нет";
			КонецеСли;	
			
			ОблСтр.Параметры.НомерСтроки = НПП;
			Таб.Вывести(ОблСтр);
			ИтСум = ИтСум + Рез.Сумма;
			КолСтр = КолСтр + 1;
			Оплачен = Рез.Оплачен;
			Если ЗначениеЗаполнено(Рез.Вес) Тогда
				В = рез.Вес;
			Иначе
				В = 0;
			КонецеСли;	
			ИтВес = ИтВес + В;
			
			
			
			НПП = НПП + 1;
		КонецциКЛА;		
		
		Если ТабСверки <> Неопределено Тогда
			НайСв = ТабСверки.Найти(Число(Доставка.Номер));
			Если НайСв <> Неопределено Тогда
				Если НайСв.orderSumUSD_all_Ч <> ИтСум Тогда
					#Если Клиент Тогда
						Сообщить("По доставке № " + СокрЛП(Доставка.Номер) + " несовпадение сумм в 1с и админке! Разница = " + Формат(НайСв.orderSumUSD_all_Ч- ИтСум, "ЧДЦ=2"), СтатусСообщения.ОченьВажное);
					#КонецЕСли	
				КонецЕсли;	
			Иначе
				#Если Клиент Тогда
					Сообщить("По доставке № " + СокрЛП(Доставка.Номер) + " не обнаружено данных в админке!", СтатусСообщения.ОченьВажное);
				#КонецЕСли	
			КонецеСли;	
		КонецеСли;	
		
		КолСтр = КолСтр + 1;
		Если СтоимостьДоставкиДоМКАД <> 0 Тогда
			ОблСтр.Параметры.НомерСтроки = КолСтр;
			ОблСтр.Параметры.ID_Код = "";
			ОблСтр.Параметры.Номенклатура = "Доставка";
			ОблСтр.Параметры.Количество = 1;
			ОблСтр.Параметры.Цена = СтоимостьДоставкиДоМКАД;
			ОблСтр.Параметры.Сумма = СтоимостьДоставкиДоМКАД;
			
			Таб.Вывести(ОблСтр);
			ИтСум = ИтСум + СтоимостьДоставкиДоМКАД;
			КолСтр = КолСтр + 1;
		КонецеСли;	
		
		
		Если СтоимостьДоставкиЗаМКАД <> 0 Тогда
			ОблСтр.Параметры.НомерСтроки = КолСтр;
			ОблСтр.Параметры.ID_Код = "";
			ОблСтр.Параметры.Номенклатура = "Доставка за МКАД";
			ОблСтр.Параметры.Количество = 1;
			ОблСтр.Параметры.Цена = СтоимостьДоставкиЗаМКАД;
			ОблСтр.Параметры.Сумма = СтоимостьДоставкиЗаМКАД;
			
			Таб.Вывести(ОблСтр);
			ИтСум = ИтСум + СтоимостьДоставкиЗаМКАД;
			КолСтр = КолСтр + 1;
		КонецеСли;	
		
        
        //Серегин М.В. 07.08.2015 12:49:15 
        Если СокрЛП(Рез.КодК) = "Shop_338" Тогда
            ОблП1_Компик.Параметры.ИтСумма = ИтСум;
            ОблП1_Компик.Параметры.СтрокаРасшифровка1 = "Всего наименований "+ (КолСтр-1)+", на сумму "+ИтСум+" руб.";
            ОблП1_Компик.Параметры.СтрокаРасшифровка2 = "Всего получено(прописью): "+ЧислоПрописью(ИтСум,"Л = ru_RU; ДП = Истина","рубль,рубля,рублей,м,копейка,копейки,копеек,ж");
            Таб.Вывести(ОблП1_Компик);
        Иначе
            ОблП1.Параметры.ИтСумма = ИтСум;
            ОблП1.Параметры.СумВес = ИтВес;
            Если ЗначениеЗаполнено(итВес) Тогда
                ОблП1.Параметры.ндВес = "Суммарный вес:"
            Иначе	
                ОблП1.Параметры.ндВес = "";
            КонецеСли;	
            Таб.Вывести(ОблП1);
        КонецЕсли;
        //Серегин М.В. 07.08.2015 14:21:21 
		
		//Если Оплачен Тогда
		//	ОблОпл = Мак.ПолучитьОбласть("Оплачено");
		//	ОблОпл.Параметры.СумОпл = ИтСум;
		//	Таб.Вывести(ОблОпл);
		//КонецеСли;
        
        //Серегин М.В. 26.08.2015 18:04:18 
        Если СокрЛП(Рез.КодК) = "Shop_248" Или СокрЛП(Рез.КодК) = "Shop_601" Или СокрЛП(Рез.КодК) = "Shop_752" Тогда   
			ОблИтогоКОплате = Мак.ПолучитьОбласть("ИтогоКОплате");
			
			// МАС - 29.06.2017 - №1210 --->> 
			//ОблИтогоКОплате.Параметры.СумОпл = Рез.КОплатеКлиентом;
			ОблИтогоКОплате.Параметры.СумОпл = ИтСум;
			// <<--- МАС 
			
			Таб.Вывести(ОблИтогоКОплате);
        КонецЕсли;
        //Серегин М.В. 26.08.2015 18:04:20 
        
		
		Если Рез.ТипОплатыСпр = Справочники.ТипыОплат.ВКредит Тогда
			ОблОплК = Мак.ПолучитьОбласть("Кредит");
			ОблОплК.Параметры.СумКр = Рез.ПредоплатаПоКредиту;
			ОблОплК.Параметры.СумКОплате = ИтСум - Рез.ПредоплатаПоКредиту;
			Таб.Вывести(ОблОплК);
		КонецеСли;	
		
		Если СокрЛП(Рез.КодК) = "Shop_208" Или СокрЛП(Рез.КодК) = "Shop_214" Или СокрЛП(Рез.КодК) = "Shop_240" Тогда
			Таб.Вывести(ОблП_П);
		ИначеЕсли СокрЛП(Рез.КодК) = "Shop_226" Тогда
			Таб.Вывести(ОблП_Е);	
		ИначеЕсли СокрЛП(Рез.КодК) = "Shop_228" Тогда
			Таб.Вывести(ОблП_БезП);
		ИначеЕсли СокрЛП(Рез.КодК) = "Shop_229" Тогда
			Таб.Вывести(ОблП_I);
			//Серегин М.В. 25.06.2015 12:58:44 
		ИначеЕсли СокрЛП(Рез.КодК) = "Shop_338" Тогда
			Таб.Вывести(ОблП2_Компик);
			//Серегин М.В. 07.08.2015 13:01:19 
		Иначе
			Если СокрЛП(Рез.КодК) <> "Shop_428" И СокрЛП(Рез.КодК) <> "Shop_181"  И СокрЛП(Рез.КодК) <> "Shop_227" Тогда 
				ОблП2.Параметры.Пд = "Промо карточку Яндекс.Такси получил";
			Иначе
				ОблП2.Параметры.Пд = "";
			КонецеСли;	
			
			Таб.Вывести(ОблП2);
		КонецеСли;	
		
		//таб.ВывестиГоризонтальныйРазделительСтраниц();
		//	Попытка
		//	если ПечататьШтрихкод Тогда
		//		Таб.ВывестиГоризонтальныйРазделительСтраниц();
		//		
		//		Для Сч = 1 По КолМест Цикл
		//			ТабШтр = Мак.ПолучитьОбласть("Штрихкод");
		//			табШтр.Параметры.ндЗаказ = Ном;
		//			табШтр.Параметры.СтрокаМест = Строка(Сч) + "/" + Строка(КолМест);
		//			ТабШтр.Рисунки.barcode.Объект.barcode = СокрЛП(Рез.НомерВнешнегоЗаказа) + "R" + Формат(Сч, "ЧЦ=3; ЧВН=");
		//			таб.Вывести(ТабШтр);
		//		КонецЦикла;	
		//	КонецеСли;	
		//Исключение
		//	КонецПопытки;
		//КонецЦикла;
		
	
	
	Таб.ТолькоПросмотр = Истина;
	
	Таб.ПолеСлева = 3;
	Таб.ПолеСправа = 3;
	Таб.ПолеСнизу = 3;
	Таб.ПолеСверху = 3;
	Таб.разборПоКопиям = РазборПоКопиям;
	Таб.АвтоМасштаб = Истина;
КонецПроцедуры	


Функция СоздатьТаблицуСуммАдминки(МасНом) Экспорт
	
	НомерЗаказа = "";
	Для Сч = 0 По МасНом.Количество() - 1 Цикл
		НомерЗаказа = НомерЗаказа + СокрЛП(МасНом[Сч]) + ",";
	КонецЦикла;	
	
	НомерЗаказа = Лев(НомерЗаказа, СтрДлина(НомерЗаказа) - 1);
	
	Соединение = Евген.СоздатьПодключениеКИнтернетМагазину();
	Ткст = "select o.orderID, o.orderSumUSD_all
	|from mv_OrderItemsSum o (nolock) where 
	|o.orderId IN (" + Формат(НомерЗаказа, "ЧГ=") + ")";
	
	Попытка
		RS = Евген.ЗапросКИнтернетМагазину(Ткст, Соединение);
		Сп = СоздатьТаблицу(RS, "OrderID_Ч, orderSumUSD_all_Ч");
	Исключение
		#Если Клиент Тогда
			Сообщить("Ошибка при обращении к данным админки...");
			Возврат Неопределено;
		#КонецЕСли	
	КонецПопытки;	
	Возврат Сп;
КонецФункции


Функция СоздатьТаблицу(RS, СписокКолонок) Экспорт
	Таб = Новый ТаблицаЗначений;
	Разделитель = Найти(СписокКолонок, ",");
	Пока Разделитель > 0 Цикл
		Таб.Колонки.Добавить(СокрЛП(Лев(СписокКолонок, Разделитель - 1)));
		СписокКолонок = Сред(СписокКолонок, Разделитель + 1);
		Разделитель = Найти(СписокКолонок, ",");
	КонецЦикла;
	Таб.Колонки.Добавить(СокрЛП(СписокКолонок));
	
	СписокКолонок = Таб.Колонки;
	Пока НЕ RS.EOF Цикл
		НоваяСтрока = Таб.Добавить();
		Для Кол = 1 По СписокКолонок.Количество() Цикл
			ИмяКолонки = СписокКолонок.Получить(Кол - 1).Имя;
			Суффикс = Прав(ИмяКолонки, 2);
			Если Суффикс = "_Ч" Тогда
				НоваяСтрока.Установить(Кол - 1, RS.Fields(Лев(ИмяКолонки, СтрДлина(ИмяКолонки) - 2)).Value);
			ИначеЕсли Суффикс = "_Д" Тогда
				НоваяСтрока.Установить(Кол - 1, RS.Fields(Лев(ИмяКолонки, СтрДлина(ИмяКолонки) - 2)).Value);
			Иначе
				НоваяСтрока.Установить(Кол - 1,  СокрЛП(RS.Fields(ИмяКолонки).Value));
			КонецЕсли;
		КонецЦикла;
		Rs.MoveNext()
	КонецЦикла;
	
	Возврат Таб;
КонецФункции


Процедура ВыборПечати(Таб, Доставка, МасНом, МасДос, ТабСверки) Экспорт
	Если БизнесПроцессы.новаМестнаяДоставка.НайтиПоНомеру(Доставка.Номер).Пустая() Тогда
		ПечатьПоДоставкеСамовывоз(Таб, Доставка, МасНом, МасДос, ТабСверки, Истина);
	Иначе	
		ПечатьПоДоставке(Таб, Доставка, МасНом, МасДос, ТабСверки, Истина);
	КонецеСли;	
КонецПроцедуры	
