Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Наименование) Тогда
		Сообщить("Внимание!!! Ошибка записи, введите наименование!");
		Отказ = Истина;
	КонецЕсли;
	
	Если Не Ссылка.Пустая() Тогда
		//Геннадий #4099 06.04.2022 ++
		//временное решение... 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК Поле1
		|ИЗ
		|	Справочник.зпСхемыРасчетаЗП.СхемыКатегорийЗаказов КАК зпСхемыРасчетаЗПСхемыКатегорийЗаказов
		|ГДЕ
		|	зпСхемыРасчетаЗПСхемыКатегорийЗаказов.СхемаКатегорий = &СхемаКатегорий
		|	И НЕ зпСхемыРасчетаЗПСхемыКатегорийЗаказов.Ссылка.РазрешитьРедактирование";
		
		Запрос.УстановитьПараметр("СхемаКатегорий", Ссылка.Владелец);
		
		Если Не Запрос.Выполнить().Пустой() Тогда
			
			Если Не зпРаботаСРасчетомЗарплатыСервер.НетЗаписиВРегистре("РегистрСведений.зпИсходныеДанныеРасчетаЗППоЗаказам", "КатегорияЗаказа", Ссылка) Тогда
				Отказ = Истина;
				Сообщить("Редактирование запрещено");
				Сообщить("Обнаружены данные по Категории заказов!");
			КонецЕсли;
			
		КонецЕсли;
		//Геннадий #4099 06.04.2022 --
	КонецЕсли;	
		
КонецПроцедуры