
&НаКлиенте
Функция ВызватьПрослойкуAssist(СтрокаJSON, ТипОперации = "Оплата") Экспорт
	#Если МобильноеПриложениеКлиент Тогда
		Зап = Новый ЗапускПриложенияМобильногоУстройства();
		Зап.Приложение = "com.example.gateway";
		Зап.ИмяКласса = "com.example.gateway.MainActivity";
		
		Если ТипОперации = "Оплата" Тогда
			Зап.Действие = "com.example.gateway.PushPay";
		ИначеЕсли ТипОперации = "Отмена" Тогда	
			Зап.Действие = "com.example.gateway.PushCancel";
		Иначе
			Возврат Ложь;
		КонецЕсли;	
		Зап.ДополнительныеДанные.Добавить("android.intent.extra.TEXT", СтрокаJSON);		
		
		РезультатВызова = Зап.Запустить(Ложь);
		
		Если РезультатВызова <> Неопределено Тогда
			//Сообщить(Строка(РезультатВызова));
			Возврат Истина;
		КонецеСли;	
		
		Возврат Истина;
	#Иначе
		Возврат Ложь;
	#КонецЕсли
		
КонецФункции	

Функция ДанныеJSONВСтруктуруAssist(ДанныеJSON, ИменаСвойствСоЗначениямиДата = "", ВозниклаОшибка = Ложь) Экспорт
	Чт = Новый ЧтениеJSON;
	Чт.УстановитьСтроку(ДанныеJSON);
	Попытка
		СтруктураДанных = ПрочитатьJSON(Чт, Ложь);
	Исключение
		ВозниклаОшибка = Истина;
		Ош = ОписаниеОшибки();
		ОбщегоНазначения.ЗаписатьОшибкуВЛог(Ош + "-------ASSS--" + ДанныеJSON);
	КонецПопытки;	
	Возврат СтруктураДанных;
КонецФункции

Функция ПреобразованиеДатыAssist(СтрокаДатыAssist) Экспорт	
	СтрокаДаты = Сред(СтрокаДатыAssist, 7, 4) + 
		Сред(СтрокаДатыAssist, 4, 2) +
		Лев(СтрокаДатыAssist, 2) +
		Сред(СтрокаДатыAssist, 12, 2) +
		Сред(СтрокаДатыAssist, 15, 2) +
		Прав(СтрокаДатыAssist, 2);
		
		
	Возврат Дата(СтрокаДаты);
КонецФункции	
