
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//+Степанов Задача № 3459
	Если Не УчетКонтроляВремениСервер.ПроверитьСостояниеСобытия(ПредопределенноеЗначение("Справочник.СобытияКонтроляВремени.ПМФормированиеРейсов"),,Регион) Тогда		
		Сообщить("В данный момент уже происходит формирование рейсов!");		
		Отказ = Истина;	
	Конецесли;
	//-Степанов Задача № 3459
	
	УдалитьДвиженияДокумента();
	
	//CeHbKA 15.11.2021 #3729
	Возврат;
	//CeHbKA 15.11.2021 #3729
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СформированныйГрафикПоТранспорту");
	ЭлементБлокировки.УстановитьЗначение("ДатаРейса", ДатаПланирования);
	ЭлементБлокировки.УстановитьЗначение("Регион", Регион);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = Экипажи;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Транспорт", "Транспорт");
	Блокировка.Заблокировать();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокТЧ.НомерСтроки КАК НомерСтроки,
		|	ДокТЧ.Транспорт КАК Транспорт,
		|	&ДатаПланирования КАК ДатаПланирования,
		|	&Регион КАК Регион,
		|	ДокТЧ.Водитель КАК Водитель,
		|	ДокТЧ.Экспедитор КАК Экспедитор,
		|	ДокТЧ.РольРейса КАК РольРейса,
		|	ДокТЧ.СменаРейса КАК СменаРейса,
		|	ДокТЧ.ЭкипажАктивен КАК ЭкипажАктивен
		|ПОМЕСТИТЬ ВТ_ДокТЧ
		|ИЗ
		|	&ДокТЧ КАК ДокТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СформированныйГрафикПоТранспортуСрезПоследних.Транспорт КАК Транспорт,
		|	СформированныйГрафикПоТранспортуСрезПоследних.СформированныйРейс КАК СформированныйРейс
		|ПОМЕСТИТЬ ВТ_Рейсы
		|ИЗ
		|	РегистрСведений.СформированныйГрафикПоТранспорту.СрезПоследних(
		|			,
		|			Регион = &Регион
		|				И ДатаРейса = &ДатаПланирования
		|				И Транспорт В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВТ_ДокТЧ.Транспорт КАК Транспорт
		|					ИЗ
		|						ВТ_ДокТЧ КАК ВТ_ДокТЧ)) КАК СформированныйГрафикПоТранспортуСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДокТЧ.Транспорт КАК Транспорт,
		|	ВТ_ДокТЧ.ДатаПланирования КАК ДатаПланирования,
		|	ВТ_ДокТЧ.Регион КАК Регион,
		|	ВТ_ДокТЧ.Водитель КАК Водитель,
		|	ВТ_ДокТЧ.Экспедитор КАК Экспедитор,
		|	ВТ_ДокТЧ.РольРейса КАК РольРейса,
		|	ВТ_ДокТЧ.СменаРейса КАК СменаРейса,
		|	ВТ_ДокТЧ.ЭкипажАктивен КАК ЭкипажАктивен,
		|	ЕСТЬNULL(СформированныйГрафикПоТранспортуСрезПоследних.Водитель, ЗНАЧЕНИЕ(Справочник.новаВодители.ПустаяСсылка)) КАК ТекущийВодитель,
		|	ЕСТЬNULL(СформированныйГрафикПоТранспортуСрезПоследних.Экспедитор, ЗНАЧЕНИЕ(Справочник.новаЭкспедиторы.ПустаяСсылка)) КАК ТекущийЭкспедитор,
		|	ЕСТЬNULL(СформированныйГрафикПоТранспортуСрезПоследних.РольРейса, ЗНАЧЕНИЕ(Справочник.РолиТранспорта.ПустаяСсылка)) КАК ТекущийРольРейса,
		|	ЕСТЬNULL(СформированныйГрафикПоТранспортуСрезПоследних.СменаРейса, ЗНАЧЕНИЕ(Справочник.Смены.ПустаяСсылка)) КАК ТекущийСменаРейса,
		|	ЕСТЬNULL(СформированныйГрафикПоТранспортуСрезПоследних.ТранспортВыйдетВРейс, ЛОЖЬ) КАК ТекущийТранспортВыйдетВРейс,
		|	ЕСТЬNULL(ВТ_Рейсы.СформированныйРейс, ЗНАЧЕНИЕ(Документ.Рейс.ПустаяСсылка)) КАК ТекущийСформированныйРейс
		|ИЗ
		|	ВТ_ДокТЧ КАК ВТ_ДокТЧ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СформированныйГрафикПоТранспорту.СрезПоследних(
		|				,
		|				(ДатаРейса, Регион, Транспорт) В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВТ_ДокТЧ.ДатаПланирования КАК ДатаПланирования,
		|						ВТ_ДокТЧ.Регион КАК Регион,
		|						ВТ_ДокТЧ.Транспорт КАК Транспорт
		|					ИЗ
		|						ВТ_ДокТЧ КАК ВТ_ДокТЧ)) КАК СформированныйГрафикПоТранспортуСрезПоследних
		|		ПО ВТ_ДокТЧ.ДатаПланирования = СформированныйГрафикПоТранспортуСрезПоследних.ДатаРейса
		|			И ВТ_ДокТЧ.Регион = СформированныйГрафикПоТранспортуСрезПоследних.Регион
		|			И ВТ_ДокТЧ.Транспорт = СформированныйГрафикПоТранспортуСрезПоследних.Транспорт
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Рейсы КАК ВТ_Рейсы
		|		ПО ВТ_ДокТЧ.Транспорт = ВТ_Рейсы.СформированныйРейс";
	
	Запрос.УстановитьПараметр("ДокТч", Экипажи);
	Запрос.УстановитьПараметр("ДатаПланирования", ДатаПланирования);
	Запрос.УстановитьПараметр("Регион", Регион);
	
	РезультатЗапроса = Запрос.Выполнить();
		
	Набор = РегистрыСведений.СформированныйГрафикПоТранспорту.СоздатьНаборЗаписей();
	Набор.Отбор.Регион.Установить(Регион);
	Набор.Отбор.ДатаРейса.Установить(ДатаПланирования);
	
	Набор.Прочитать();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ЕстьИзменения = (ВыборкаДетальныеЗаписи.Водитель <> ВыборкаДетальныеЗаписи.ТекущийВодитель)
			ИЛИ (ВыборкаДетальныеЗаписи.Экспедитор <> ВыборкаДетальныеЗаписи.ТекущийЭкспедитор)
			ИЛИ (ВыборкаДетальныеЗаписи.РольРейса <> ВыборкаДетальныеЗаписи.ТекущийРольРейса)
			ИЛИ (ВыборкаДетальныеЗаписи.СменаРейса <> ВыборкаДетальныеЗаписи.ТекущийСменаРейса)
			ИЛИ (ВыборкаДетальныеЗаписи.ЭкипажАктивен <> ВыборкаДетальныеЗаписи.ТекущийТранспортВыйдетВРейс);		
		
		Если НЕ ЕстьИзменения Тогда
			Продолжить;	
		КонецЕсли; 	
		
		Запись = Набор.Добавить();
		Запись.Период	  = Дата;
		Запись.Транспорт  = ВыборкаДетальныеЗаписи.Транспорт;
		Запись.ДатаРейса  = ДатаПланирования;
		Запись.Регион	  = Регион;
		
		Запись.ТранспортВыйдетВРейс = ВыборкаДетальныеЗаписи.ЭкипажАктивен;
		Запись.СформированныйРейс	= ВыборкаДетальныеЗаписи.ТекущийСформированныйРейс;
		
		Запись.Водитель	  = ВыборкаДетальныеЗаписи.Водитель;
		Запись.Экспедитор = ВыборкаДетальныеЗаписи.Экспедитор;
		Запись.РольРейса  = ВыборкаДетальныеЗаписи.РольРейса;
		Запись.СменаРейса = ВыборкаДетальныеЗаписи.СменаРейса;
		
		Запись.Пользователь = Пользователь;
		Запись.ГрафикЭкипажей = Ссылка;
	КонецЦикла;
	
	Набор.Записать();
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	УдалитьДвиженияДокумента();
КонецПроцедуры

Процедура УдалитьДвиженияДокумента() Экспорт

	Регистр = РегистрыСведений.СформированныйГрафикПоТранспорту;
	Выборка = Регистр.Выбрать(,,Новый Структура("ГрафикЭкипажей", Ссылка)); 
	
	Пока Выборка.Следующий() Цикл
		Выборка.ПолучитьМенеджерЗаписи().Удалить();
	КонецЦикла;	

КонецПроцедуры
 
