
&НаСервере
Процедура ОбработатьНаСервере()
	
	Попытка
		
		БылаОшибка = Ложь;
		
		ПодключениеКМагазину = Евген.СоздатьПодключениеКИнтернетМагазину(); 
		
		МассивИдентификаторов = ЭтаФорма.Элементы.Список.ВыделенныеСтроки;
		Для Каждого Строка Из МассивИдентификаторов Цикл 
			
			МЗ = РегистрыСведений.ОшибкиSQL.СоздатьМенеджерЗаписи();
			МЗ.Период = Строка.Период;
			МЗ.ИсточникДанных = Строка.ИсточникДанных;
			МЗ.ТипОперации = Строка.ТипОперации;
			МЗ.Прочитать();
			
			Если ЗначениеЗаполнено(МЗ.ТекстЗапроса) И МЗ.ТипОперации = Перечисления.ТипыОперацийADO.Execute Тогда
				
				Результат = Евген.ЗапросКИнтернетМагазину(МЗ.ТекстЗапроса, ПодключениеКМагазину);
				
				//Если Результат = Неопределено Тогда
				//	
				//	БылаОшибка = Истина
				//	
				//КонецЕсли;	
				
				
			КонецЕсли;	
			
		КонецЦикла;
		
		Если ПодключениеКМагазину <> Неопределено Тогда
			
			Евген.ОтключитьсяОтADO(ПодключениеКМагазину);
			
		КонецЕсли; 
		
	Исключение
		
		Если ПодключениеКМагазину <> Неопределено Тогда
			
			Евген.ОтключитьсяОтADO(ПодключениеКМагазину);
			
		КонецЕсли; 
		
		Сообщить(ОписаниеОшибки());
		
	КонецПопытки;
	
	Если БылаОшибка Тогда
		
		Сообщить("Были ошибки во время выполнения запроса");
		ЭтаФорма.Элементы.Список.Обновить();
		
	КонецЕсли;	
		
	
КонецПроцедуры

&НаКлиенте
Процедура Обработать(Команда)
	ОбработатьНаСервере();
КонецПроцедуры
