
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ТипДанных = ТипЗнч(ДанныеЗаполнения);
	Если ТипДанных = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
	Пользователь = ПараметрыСеанса.ТекущийПользователь;
	//ТерминалОбработки = ПараметрыСеанса.ТерминалДоставки;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.СтатусыДвиженияПриложенныхДокументов.Записывать = Истина;
	Движения.СтатусыДвиженияПриложенныхДокументов.Очистить();
	
	//СопроводительныеДокументы = Справочники.ВидыПриложенныхДокументов.СопроводительныеДокументы;
	ДокументыВозвращеныПартнеру = Справочники.СтатусыДвиженияПриложенныхДокументов.ДокументыВозвращеныПартнеру;
	
	Для Каждого СтрокаЗаказа Из Заказы.НайтиСтроки(Новый Структура("ЗаказПодтвержденКСборке", Истина)) Цикл
		Движение = Движения.СтатусыДвиженияПриложенныхДокументов.Добавить();
		Движение.Период = Дата;
		Движение.Регион = ТерминалОбработки;
		Движение.Заказ = СтрокаЗаказа.Заказ;
		Движение.ВидПриложенногоДокумента = СтрокаЗаказа.ВидПриложенногоДокумента;
		Движение.Статус = ДокументыВозвращеныПартнеру;
		//Движение.Рейс = СтрокаЗаказа.Рейс;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УжеЗаписан = Не ЭтоНовый();
	
	Если УжеЗаписан Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК Поле1
		|ИЗ
		|	РегистрСведений.ЭтапыВозвратаСопроводительныхДокументов КАК ЭтапыВозвратаСопроводительныхДокументов
		|ГДЕ
		|	ЭтапыВозвратаСопроводительныхДокументов.ВозвратСопроводительныхДокументов = &Ссылка";
		Если Не Запрос.Выполнить().Пустой() Тогда
			Отказ = Истина;
			Сообщить("Наборная ведомость на этапе обработки!");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
