#Область ОбработчикиСобытий
// При начале работы системы.
// 
// Параметры:
//  Отказ - Булево - Отказ
Процедура ПриНачалеРаботыСистемы(Отказ)
	Отказ = Не ПроцедурыНачалаРаботыВызовСервера.ПроверитьИУстановитьИзначальныеПараметрыМА();
	УстановленоЗначениеРегионаРаботыМП = ОбщегоНазначенияСервер.УстановленоЗначениеРегионаРаботыМП();
	
	Если Не УстановленоЗначениеРегионаРаботыМП Тогда
		ГеопозиционированиеКлиент.ПолучитьИЗафиксироватьРегионРаботыМП();
		УстановленоЗначениеРегионаРаботыМП = ОбщегоНазначенияСервер.УстановленоЗначениеРегионаРаботыМП();
	КонецЕсли;	
	
	Если Не ОбщегоНазначенияСервер.ТранспортВходаВМППринадлежитРегионуРаботыМП() Тогда
		ОбщегоНазначенияСервер.ОчиститьТранспортМПИДанныеАвтологина();
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Регион работы МП не соответствует выбранному транспорту! Транспорт будет очищен.";
		Сообщение.Сообщить();
	КонецеСли;	
	
	Если УстановленоЗначениеРегионаРаботыМП Тогда
		Если Не РаботаСАвторизациейВызовСервера.ПроверитьВозможностьАвтологинаВМП() Тогда
			ОткрытьФормуАвторизацииМП();
		КонецеСли;	
	Иначе
		ПодключитьОбработчикОжидания("ПроверкаУстановленногоРегионаРаботы", 10);
	КонецЕсли;	
КонецПроцедуры


Процедура ПередНачаломРаботыСистемы(Отказ)

КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
// Проверка установленного региона работы.
Процедура ПроверкаУстановленногоРегионаРаботы() Экспорт
	СправочникРегионовПустой = ОбщегоНазначенияСервер.СправочникРегионовПустой();
	
	Если Не ОбщегоНазначенияСервер.УстановленоЗначениеРегионаРаботыМП() И Не СправочникРегионовПустой Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не установлен регион работы. Работа приложения будет завершена!";
		Сообщение.Сообщить();
		ЗавершитьРаботуСистемы();
	ИначеЕсли Не СправочникРегионовПустой Тогда
		ОтключитьОбработчикОжидания("ПроверкаУстановленногоРегионаРаботы");
		Если Не РаботаСАвторизациейВызовСервера.ПроверитьВозможностьАвтологинаВМП() Тогда
			ОткрытьФормуАвторизацииМП();
		КонецЕСли;		
	КонецЕсли;	
КонецПроцедуры

// Открыть форму авторизации МП.
Процедура ОткрытьФормуАвторизацииМП()
	ПараметрыФормы = Новый Структура("ТипАвторизации", "ВходВМП");
	ОповещениеЗакрытия = Новый ОписаниеОповещения("ЗакрытиеФормыАвторизации", ПроцедурыНачалаРаботыКлиент);
	ОткрытьФорму("ОбщаяФорма.Авторизация", ПараметрыФормы,,,,, ОповещениеЗакрытия);
КонецПроцедуры	
#КонецОбласти		