#Область ОбработчикиСобытий

Процедура ОбработкаПереходаПоНавигационнойСсылке(ДанныеПереходаПоНавигационнойСсылке, СтандартнаяОбработка)
	//БазоваяСсылка = ДанныеПереходаПоНавигационнойСсылке.БазоваяНавигационнаяСсылка;
	//Путь = ДанныеПереходаПоНавигационнойСсылке.ОтносительнаяНавигационнаяСсылка;
	//ДопДанные = 
	//ДанныеПереходаПоНавигационнойСсылке.ДополнительныеДанныеПереходаВМобильноеПриложение;   
	//Параметр1 = 
	//ДанныеПереходаПоНавигационнойСсылке.ПараметрыНавигационнойСсылки.Получить("key1");
	
	Параметр1 = 
	ДанныеПереходаПоНавигационнойСсылке.ПараметрыНавигационнойСсылки.Получить("responseAssist");
	
	//Параметр2 = ДопДанные.Получить("key2");
	//Сообщение = "Произошел запуск по ссылке:" + Символы.ПС +
	//"Базовая ссылка: " + БазоваяСсылка + Символы.ПС +
	//"Параметр 1: " + Параметр1 + Символы.ПС +
	//"Параметр 2: " + Параметр2;
	//Сообщить(Сообщение);
	
	Оповестить("ОплатаAssist", Параметр1);	
	СтандартнаяОбработка = Ложь;	
КонецПроцедуры

// При начале работы системы.
// 
// Параметры:
//  Отказ - Булево - Отказ
Процедура ПриНачалеРаботыСистемы(Отказ)
	Отказ = Не ПроцедурыНачалаРаботыВызовСервера.ПроверитьИУстановитьИзначальныеПараметрыМА();
	УстановленоЗначениеРегионаРаботыМП = ОбщегоНазначенияСервер.УстановленоЗначениеРегионаРаботыМП();
	
	Если Не УстановленоЗначениеРегионаРаботыМП Тогда
		ГеопозиционированиеКлиент.ПолучитьИЗафиксироватьРегионРаботыМП();
		УстановленоЗначениеРегионаРаботыМП = ОбщегоНазначенияСервер.УстановленоЗначениеРегионаРаботыМП();
	КонецЕсли;	
	
	Если Не ОбщегоНазначенияСервер.ТранспортВходаВМППринадлежитРегионуРаботыМП() Тогда
		ОбщегоНазначенияСервер.ОчиститьТранспортМПИДанныеАвтологина();
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Регион работы МП не соответствует выбранному транспорту! Транспорт будет очищен.";
		Сообщение.Сообщить();
	КонецеСли;	
	
	Если УстановленоЗначениеРегионаРаботыМП Тогда
		Если Не РаботаСАвторизациейВызовСервера.ПроверитьВозможностьАвтологинаВМП() Тогда
			ОткрытьФормуАвторизацииМП();
		КонецеСли;	
	Иначе
		ПодключитьОбработчикОжидания("ОбработчикОжиданияПроверкаУстановленногоРегионаРаботы", 10);
	КонецЕсли;
		
	ИнтервалОбмена = ОбменДаннымиЦУВызовСервера.ИнтервалФоновогоОбменаСЦУ();
	Если ИнтервалОбмена <> 0 Тогда
		ПодключитьОбработчикОжидания("ОбработчикОжиданияВыполнитьОбменСЦУ", ИнтервалОбмена, Ложь);
		ОбменДаннымиЦУВызовСервера.ВыполнитьОбменФоновоеЗадание();
	КонецеСли;		
КонецПроцедуры


Процедура ПередНачаломРаботыСистемы(Отказ)

КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
// Проверка установленного региона работы.
Процедура ОбработчикОжиданияПроверкаУстановленногоРегионаРаботы() Экспорт
	СправочникРегионовПустой = ОбщегоНазначенияСервер.СправочникРегионовПустой();
	
	Если Не ОбщегоНазначенияСервер.УстановленоЗначениеРегионаРаботыМП() И Не СправочникРегионовПустой Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не установлен регион работы. Работа приложения будет завершена!";
		Сообщение.Сообщить();
		ЗавершитьРаботуСистемы();
	ИначеЕсли Не СправочникРегионовПустой Тогда
		ОтключитьОбработчикОжидания("ОбработчикОжиданияПроверкаУстановленногоРегионаРаботы");
		Если Не РаботаСАвторизациейВызовСервера.ПроверитьВозможностьАвтологинаВМП() Тогда
			ОткрытьФормуАвторизацииМП();
		КонецЕСли;		
	КонецЕсли;	
КонецПроцедуры

Процедура ОбработчикОжиданияВыполнитьОбменСЦУ() Экспорт
	ОбменДаннымиЦУВызовСервера.ВыполнитьОбменФоновоеЗадание();
КонецПроцедуры	

// Открыть форму авторизации МП.
Процедура ОткрытьФормуАвторизацииМП()
	ПараметрыФормы = Новый Структура("ТипАвторизации", "ВходВМП");
	ОповещениеЗакрытия = Новый ОписаниеОповещения("ЗакрытиеФормыАвторизации", ПроцедурыНачалаРаботыКлиент);
	ОткрытьФорму("ОбщаяФорма.Авторизация", ПараметрыФормы,,,,, ОповещениеЗакрытия);
КонецПроцедуры	
#КонецОбласти		