Процедура СформироватьОтчет(Таб, Контрагент, ДатаНачала, ДатаОкончания) Экспорт
	Таб.Очистить();
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	ЗакрытиеЗаказовТовары.Номенклатура.Ссылка КАК Номенклатура,
	            |	ЗакрытиеЗаказовТовары.Количество - ЗакрытиеЗаказовТовары.КоличествоВозвращено КАК Количество,
	            |	ЗакрытиеЗаказовТовары.Цена,
	            |	ЗакрытыеЗаказы.УслугиСД,
	            |	ЗакрытыеЗаказы.АгентскоеВознаграждение + ЗакрытыеЗаказы.КассовоеОбслуживание КАК АгентскоеВознаграждение,
	            |	ЗакрытиеЗаказовТовары.Номенклатура.Артикул КАК Артикул,
	            |	ЗакрытыеЗаказы.БанковскаяКомиссия,
	            |	ЗакрытыеЗаказы.СуммаОценочная + ЗакрытыеЗаказы.СуммаДоставкиДоМКАД + ЗакрытыеЗаказы.СуммаДоставкиЗаМКАД КАК Оборот,
	            |	ЗакрытыеЗаказы.Реализация.Номер КАК Номер,
	            |	ЗакрытыеЗаказы.Реализация.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
	            |	ЗакрытиеЗаказовТовары.НомерСтроки КАК НомерСтроки,
	            |	ЗакрытыеЗаказы.Реализация.Дата КАК Дата,
	            |	ЗакрытыеЗаказы.СуммаОценочная + ЗакрытыеЗаказы.СуммаДоставкиДоМКАД + ЗакрытыеЗаказы.СуммаДоставкиЗаМКАД - ЗакрытыеЗаказы.ОплаченоКлиентовНал КАК БНал,
	            |	ЗакрытыеЗаказы.ОплаченоКлиентовНал КАК Наличные
	            |ИЗ
	            |	РегистрНакопления.ЗакрытыеЗаказы КАК ЗакрытыеЗаказы
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗакрытиеЗаказов.Товары КАК ЗакрытиеЗаказовТовары
	            |		ПО (ВЫРАЗИТЬ(ЗакрытыеЗаказы.Регистратор КАК Документ.ЗакрытиеЗаказов).Ссылка = ЗакрытиеЗаказовТовары.Ссылка.Ссылка)
	            |			И (ВЫРАЗИТЬ(ЗакрытыеЗаказы.Реализация КАК Документ.РеализацияТоваровУслуг).Ссылка = ВЫРАЗИТЬ(ЗакрытиеЗаказовТовары.Реализация КАК Документ.РеализацияТоваровУслуг).Ссылка)
	            |ГДЕ
	            |	ЗакрытыеЗаказы.Период МЕЖДУ &НачПериода И &КонПериода
	            |	И ЗакрытыеЗаказы.ИнтернетМагазин = &ИнтернетМагазин
	            |	И ЗакрытыеЗаказы.СтатусИнтернетМагазина = ЗНАЧЕНИЕ(Справочник.СтатусЗаказаИнтернетМагазина.ЗаказЗакрыт)
	            |	И ЗакрытиеЗаказовТовары.Количество - ЗакрытиеЗаказовТовары.КоличествоВозвращено <> 0
	            |
	            |УПОРЯДОЧИТЬ ПО
	            |	Дата,
	            |	Номер,
	            |	НомерСтроки";
	Зап.УстановитьПараметр("ИнтернетМагазин", Контрагент.Ссылка);			
	Зап.УстановитьПараметр("НачПериода", НачалоДня(ДатаНачала));
	Зап.УстановитьПараметр("КонПериода", КонецДня(ДатаНачала));
	Рез = Зап.Выполнить().Выгрузить();
	
	Мак = ПолучитьМакет("Макет");
	
	Шапка = Мак.ПолучитьОбласть("Шапка");
	Строка = Мак.ПолучитьОбласть("Строка");
	Подвал = Мак.ПолучитьОбласть("Итог");
	
	Шапка.Параметры.Назв = "Интернет-магазин: " + СокрЛП(Контрагент.Наименование);
	
	Таб.Вывести(Шапка);
	
	ПредНомер = Неопределено;
	
	ИтУслугиСД = 0;
	ИтБанковскаяКомиссия = 0;
	ИтОборот = 0;
	ИтНаличные = 0;
	ИтБНал = 0;
	ИтАгентскоеВознаграждение = 0;
	
	Для Каждого Тек Из Рез Цикл
		ЗаполнитьЗначенияСвойств(Строка.Параметры, Тек);
		//Строка.Параметры.ПолныйНомерЗаказа = ОбщегоНазначения.СформироватьПолныйНомерЗаказа(Тек.Номер, Тек.НомерВнешнегоЗаказа);
		Если ПредНомер <> Неопределено Тогда
			Если ПредНомер = Строка.Параметры.Номер Тогда
				ОчиститьЗначения(Строка.Параметры);
			КонецеСли;	
		конецеСли;	
		Таб.Вывести(Строка);
		
		ИтУслугиСД = ИтУслугиСД + Строка.Параметры.УслугиСД;
		ИтБанковскаяКомиссия = ИтБанковскаяКомиссия + Строка.Параметры.БанковскаяКомиссия;
		ИтОборот = ИтОборот + Строка.Параметры.Оборот;
		ИтНаличные = ИтНаличные + Строка.Параметры.Наличные;
		ИтБНал = ИтБНал + Строка.Параметры.БНал;
		ИтАгентскоеВознаграждение = ИтАгентскоеВознаграждение + Строка.Параметры.АгентскоеВознаграждение;
		
		ПредНомер = Строка.Параметры.Номер;
	КонецЦикла;
	
	Подвал.Параметры.УслугиСд = ИтУслугиСД;
	Подвал.Параметры.БанковскаяКомиссия = ИтБанковскаяКомиссия;
	Подвал.Параметры.Оборот = ИтОборот;
	Подвал.Параметры.Наличные = ИтНаличные;
	Подвал.Параметры.БНал = ИтБНал;
	Подвал.Параметры.АгентскоеВознаграждение = ИтАгентскоеВознаграждение;
	
	
	Таб.Вывести(Подвал);
	
	
	Таб.ПолеСлева = 3;
	Таб.ПолеСверху = 3;
	Таб.ПолеСнизу = 3;
	Таб.ПолеСправа = 3;
	Таб.ТолькоПросмотр = Истина;
	
КонецПроцедуры	

Процедура ОчиститьЗначения(Стр)
	Стр.УслугиСд = 0;
	Стр.БанковскаяКомиссия = 0;
	Стр.АгентскоеВознаграждение = 0;
	Стр.Оборот = 0;
	Стр.Наличные = 0;
	Стр.БНал = 0;
КонецПроцедуры	