#Область ПрограммыйИнтерфейс

Функция ПараметрыЗапросаПоЗаказам() Экспорт
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ИнтернетМагазин", Справочники.Контрагенты.ПустаяСсылка());
	СтруктураПараметров.Вставить("Партнер", Справочники.Контрагенты.ПустаяСсылка());
	СтруктураПараметров.Вставить("ПоИнтернетМагазину", Ложь);
	СтруктураПараметров.Вставить("ПоПартнеру", Ложь);
	СтруктураПараметров.Вставить("ПоСтатусуЗаказа", Ложь);
	СтруктураПараметров.Вставить("ПоТипуЗаказа", Ложь);
	СтруктураПараметров.Вставить("СтатусЗаказа", Справочники.новаРезультатМестнойДоставки.ПустаяСсылка());
	СтруктураПараметров.Вставить("ТипЗаказа", Перечисления.ТипыЗаказов.ПустаяСсылка());
	
	Возврат СтруктураПараметров;
	
КонецФункции	

Функция ПолучитьЗакрытыеЗаказыВПериоде(Период, ПараметрыЗапроса, ТолькоТекстЗапроса = Ложь) Экспорт
	
	#Область ПримерЗапросаКТаблице
	 ТекстЗапроса = "ВЫБРАТЬ
		|	ТаблицаЗаказов.Документ,
		|	ТаблицаЗаказов.НомерДокумента,
		|	ТаблицаЗаказов.ЮрЛицо,
		|	ТаблицаЗаказов.ТипЗаказа,
		|	ТаблицаЗаказов.Транспорт,
		|	ТаблицаЗаказов.ИнтернетМагазин,
		|	ТаблицаЗаказов.Партнер,
		|	ТаблицаЗаказов.КатегорияДоставки,
		|	ТаблицаЗаказов.Водитель,
		|	ТаблицаЗаказов.Клиент,
		|	ТаблицаЗаказов.ТипОплаты,
		|	ТаблицаЗаказов.СтатусЗаказа,
		|	ТаблицаЗаказов.ПричинаНевыполнения,
		|	ТаблицаЗаказов.СтатусИнтернетМагазина,
		|	ТаблицаЗаказов.ПричинаОтказа,
		|	ТаблицаЗаказов.VIPДоставка,
		|	ТаблицаЗаказов.ВидVip,
		|	ТаблицаЗаказов.ТарифнаяСетка,
		|	ТаблицаЗаказов.РасчетныйБрейк,
		|	ТаблицаЗаказов.ТарифнаяСеткаПартнера,
		|	ТаблицаЗаказов.ЗонаТарификации,
		|	ТаблицаЗаказов.ПричинаОтклоненияЗаказа,
		|	ТаблицаЗаказов.ТерминалДоставки,
		|	ТаблицаЗаказов.ТерминалПриёма,
		|	ТаблицаЗаказов.ОбъемныйБрейк,
		|	ТаблицаЗаказов.ПодъемныйБрейк,
		|	ТаблицаЗаказов.СуммаОценочная,
		|	ТаблицаЗаказов.СуммаПолученная,
		|	ТаблицаЗаказов.СуммаДоставкиДоМКАД,
		|	ТаблицаЗаказов.СуммаДоставкиЗаМКАД,
		|	ТаблицаЗаказов.УслугиСД,
		|	ТаблицаЗаказов.БанковскаяКомиссия,
		|	ТаблицаЗаказов.КассовоеОбслуживание,
		|	ТаблицаЗаказов.СуммаВозврата,
		|	ТаблицаЗаказов.Масса,
		|	ТаблицаЗаказов.СуммаЧастичногоВозврата,
		|	ТаблицаЗаказов.ОплаченоКлиентовНал,
		|	ТаблицаЗаказов.АгентскоеВознаграждение,
		|	ТаблицаЗаказов.ПредоплатаПоКредиту,
		|	ТаблицаЗаказов.УслугиСДЧистые,
		|	ТаблицаЗаказов.СтраховойСбор,
		|	ТаблицаЗаказов.ФактическийВес,
		|	ТаблицаЗаказов.ОбъемЗабора,
		|	ТаблицаЗаказов.ОбъемЗабораПоЗаказам,
		|	ТаблицаЗаказов.ВыгруженныйОбъем,
		|	ТаблицаЗаказов.ТарифицируемыйВес,
		|	ТаблицаЗаказов.СтоимостьОценочнаяПоТоварно,
		|	ТаблицаЗаказов.КоличествоПереносовСЗаездами,
		|	ТаблицаЗаказов.СтоимостьПереносовСЗаездами,
		|	ТаблицаЗаказов.СтоимостьПодъемаМП
		|ПОМЕСТИТЬ ТаблицаЗаказов
		|ИЗ &ТаблицаЗаказов КАК ТаблицаЗаказов";
		
	#КонецОбласти
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗакрытыеЗаказы.Реализация КАК Документ
		|ПОМЕСТИТЬ ВТ_Документы
		|ИЗ
		|	РегистрНакопления.ЗакрытыеЗаказы КАК ЗакрытыеЗаказы
		|ГДЕ
		|	ЗакрытыеЗаказы.Реализация.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ВЫБОР
		|			КОГДА &ПоИнтернетМагазину
		|				ТОГДА ЗакрытыеЗаказы.ИнтернетМагазин В (&ИнтернетМагазин)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &ПоПартнеру
		|				ТОГДА ЗакрытыеЗаказы.Партнер В (&Партнер)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &ПоТипуЗаказа
		|				ТОГДА ЗакрытыеЗаказы.ТипЗаказа В (&ТипЗаказа)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &ПоСтатусуЗаказа
		|				ТОГДА ЗакрытыеЗаказы.СтатусЗаказа В (&СтатусЗаказа)
		|						ИЛИ ЗакрытыеЗаказы.ПричинаНевыполнения = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ОтказКлиентаСЗаездом)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(ЗакрытыеЗаказы.Период) КАК КолВо,
		|	ЗакрытыеЗаказы.Реализация КАК Документ
		|ПОМЕСТИТЬ ВТ_КоличествоЗаписей
		|ИЗ
		|	РегистрНакопления.ЗакрытыеЗаказы КАК ЗакрытыеЗаказы
		|ГДЕ
		|	ЗакрытыеЗаказы.Реализация В
		|			(ВЫБРАТЬ
		|				ВТ_Документы.Документ
		|			ИЗ
		|				ВТ_Документы)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗакрытыеЗаказы.Реализация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗакрытыеЗаказы.Реализация КАК Документ,
		|	ЗакрытыеЗаказы.Реализация.Номер КАК НомерДокумента,
		|	ЗакрытыеЗаказы.ЮрЛицо КАК ЮрЛицо,
		|	ЗакрытыеЗаказы.ТипЗаказа КАК ТипЗаказа,
		|	ЗакрытыеЗаказы.Транспорт КАК Транспорт,
		|	ЗакрытыеЗаказы.ИнтернетМагазин КАК ИнтернетМагазин,
		|	ВЫБОР
		|		КОГДА ЗакрытыеЗаказы.КатегорияДоставки = """"
		|				ИЛИ ЗакрытыеЗаказы.КатегорияДоставки = НЕОПРЕДЕЛЕНО
		|				ИЛИ ЗакрытыеЗаказы.КатегорияДоставки = ЗНАЧЕНИЕ(Справочник.КатегорииДоставки2014.ПустаяСсылка)
		|				ИЛИ ЗакрытыеЗаказы.КатегорияДоставки ЕСТЬ NULL
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.КатегорииДоставки2014.ПустаяСсылка)
		|		ИНАЧЕ ЗакрытыеЗаказы.КатегорияДоставки
		|	КОНЕЦ КАК КатегорияДоставки,
		|	ЗакрытыеЗаказы.Водитель КАК Водитель,
		|	ЗакрытыеЗаказы.Клиент КАК Клиент,
		|	ЗакрытыеЗаказы.ТипОплаты КАК ТипОплаты,
		|	ЗакрытыеЗаказы.СтатусЗаказа КАК СтатусЗаказа,
		|	ЗакрытыеЗаказы.ПричинаНевыполнения КАК ПричинаНевыполнения,
		|	ЗакрытыеЗаказы.СтатусИнтернетМагазина КАК СтатусИнтернетМагазина,
		|	ЗакрытыеЗаказы.ПричинаОтказа КАК ПричинаОтказа,
		|	ЗакрытыеЗаказы.VIPДоставка КАК VIPДоставка,
		|	ЗакрытыеЗаказы.ВидVip КАК ВидVip,
		|	ЗакрытыеЗаказы.ТарифнаяСетка КАК ТарифнаяСетка,
		|	ЗакрытыеЗаказы.РасчетныйБрейк КАК РасчетныйБрейк,
		|	ЗакрытыеЗаказы.ТарифнаяСеткаПартнера КАК ТарифнаяСеткаПартнера,
		|	ЗакрытыеЗаказы.ЗонаТарификации КАК ЗонаТарификации,
		|	ЗакрытыеЗаказы.ПричинаОтклоненияЗаказа КАК ПричинаОтклоненияЗаказа,
		|	ЗакрытыеЗаказы.Партнер КАК Партнер,
		|	ЗакрытыеЗаказы.ТерминалДоставки КАК ТерминалДоставки,
		|	ЗакрытыеЗаказы.ТерминалПриёма КАК ТерминалПриёма,
		|	ЗакрытыеЗаказы.ОбъемныйБрейк КАК ОбъемныйБрейк,
		|	ЗакрытыеЗаказы.ПодъемныйБрейк КАК ПодъемныйБрейк,
		|	ВЫБОР
		|		КОГДА ВТ_КоличествоЗаписей.КолВо = 1
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЗакрытыеЗаказы.Регистратор ССЫЛКА Документ.КорректировкаУслугСД
		|						И НЕ ЗакрытыеЗаказы.Корректировка
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ
		|	КОНЕЦ КАК ЗаписьВОтчет
		|ПОМЕСТИТЬ ВТ_ЗакрытыеЗаказы
		|ИЗ
		|	РегистрНакопления.ЗакрытыеЗаказы КАК ЗакрытыеЗаказы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоличествоЗаписей КАК ВТ_КоличествоЗаписей
		|		ПО ЗакрытыеЗаказы.Реализация = ВТ_КоличествоЗаписей.Документ
		|ГДЕ
		|	ЗакрытыеЗаказы.Реализация В
		|			(ВЫБРАТЬ
		|				ВТ_Документы.Документ
		|			ИЗ
		|				ВТ_Документы)
		|	И ВЫБОР
		|			КОГДА ВТ_КоличествоЗаписей.КолВо = 1
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ЗакрытыеЗаказы.Регистратор ССЫЛКА Документ.КорректировкаУслугСД
		|							И НЕ ЗакрытыеЗаказы.Корректировка
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_Документы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_КоличествоЗаписей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЗакрытыеЗаказы.Документ КАК Документ,
		|	ВТ_ЗакрытыеЗаказы.НомерДокумента КАК НомерДокумента,
		|	ВТ_ЗакрытыеЗаказы.ЮрЛицо КАК ЮрЛицо,
		|	ВТ_ЗакрытыеЗаказы.ТипЗаказа КАК ТипЗаказа,
		|	ВТ_ЗакрытыеЗаказы.Транспорт КАК Транспорт,
		|	ВТ_ЗакрытыеЗаказы.ИнтернетМагазин КАК ИнтернетМагазин,
		|	ВТ_ЗакрытыеЗаказы.Партнер КАК Партнер,
		|	ВТ_ЗакрытыеЗаказы.КатегорияДоставки КАК КатегорияДоставки,
		|	ВТ_ЗакрытыеЗаказы.Водитель КАК Водитель,
		|	ВТ_ЗакрытыеЗаказы.Клиент КАК Клиент,
		|	ВТ_ЗакрытыеЗаказы.ТипОплаты КАК ТипОплаты,
		|	ВТ_ЗакрытыеЗаказы.СтатусЗаказа КАК СтатусЗаказа,
		|	ВТ_ЗакрытыеЗаказы.ПричинаНевыполнения КАК ПричинаНевыполнения,
		|	ВТ_ЗакрытыеЗаказы.СтатусИнтернетМагазина КАК СтатусИнтернетМагазина,
		|	ВТ_ЗакрытыеЗаказы.ПричинаОтказа КАК ПричинаОтказа,
		|	ВТ_ЗакрытыеЗаказы.VIPДоставка КАК VIPДоставка,
		|	ВТ_ЗакрытыеЗаказы.ВидVip КАК ВидVip,
		|	ВТ_ЗакрытыеЗаказы.ТарифнаяСетка КАК ТарифнаяСетка,
		|	ВТ_ЗакрытыеЗаказы.РасчетныйБрейк КАК РасчетныйБрейк,
		|	ВТ_ЗакрытыеЗаказы.ТарифнаяСеткаПартнера КАК ТарифнаяСеткаПартнера,
		|	ВТ_ЗакрытыеЗаказы.ЗонаТарификации КАК ЗонаТарификации,
		|	ВТ_ЗакрытыеЗаказы.ПричинаОтклоненияЗаказа КАК ПричинаОтклоненияЗаказа,
		|	ВТ_ЗакрытыеЗаказы.ТерминалДоставки КАК ТерминалДоставки,
		|	ВТ_ЗакрытыеЗаказы.ТерминалПриёма КАК ТерминалПриёма,
		|	ВТ_ЗакрытыеЗаказы.ОбъемныйБрейк КАК ОбъемныйБрейк,
		|	ВТ_ЗакрытыеЗаказы.ПодъемныйБрейк КАК ПодъемныйБрейк,
		|	СУММА(ЕСТЬNULL(ЗакрытыеЗаказыОбороты.СуммаОценочнаяОборот, 0)) КАК СуммаОценочная,
		|	СУММА(ЕСТЬNULL(ЗакрытыеЗаказыОбороты.СуммаПолученнаяОборот, 0)) КАК СуммаПолученная,
		|	СУММА(ЕСТЬNULL(ЗакрытыеЗаказыОбороты.СуммаДоставкиДоМКАДОборот, 0)) КАК СуммаДоставкиДоМКАД,
		|	СУММА(ЕСТЬNULL(ЗакрытыеЗаказыОбороты.СуммаДоставкиЗаМКАДОборот, 0)) КАК СуммаДоставкиЗаМКАД,
		|	СУММА(ЕСТЬNULL(ЗакрытыеЗаказыОбороты.УслугиСДОборот, 0)) КАК УслугиСД,
		|	СУММА(ЕСТЬNULL(ЗакрытыеЗаказыОбороты.БанковскаяКомиссияОборот, 0)) КАК БанковскаяКомиссия,
		|	СУММА(ЕСТЬNULL(ЗакрытыеЗаказыОбороты.КассовоеОбслуживаниеОборот, 0)) КАК КассовоеОбслуживание,
		|	СУММА(ЕСТЬNULL(ЗакрытыеЗаказыОбороты.СуммаВозвратаОборот, 0)) КАК СуммаВозврата,
		|	СУММА(ЕСТЬNULL(ЗакрытыеЗаказыОбороты.МассаОборот, 0)) КАК Масса,
		|	СУММА(ЕСТЬNULL(ЗакрытыеЗаказыОбороты.СуммаЧастичногоВозвратаОборот, 0)) КАК СуммаЧастичногоВозврата,
		|	СУММА(ЕСТЬNULL(ЗакрытыеЗаказыОбороты.ОплаченоКлиентовНалОборот, 0)) КАК ОплаченоКлиентовНал,
		|	СУММА(ЕСТЬNULL(ЗакрытыеЗаказыОбороты.АгентскоеВознаграждениеОборот, 0)) КАК АгентскоеВознаграждение,
		|	СУММА(ЕСТЬNULL(ЗакрытыеЗаказыОбороты.ПредоплатаПоКредитуОборот, 0)) КАК ПредоплатаПоКредиту,
		|	СУММА(ЕСТЬNULL(ЗакрытыеЗаказыОбороты.УслугиСДЧистыеОборот, 0)) КАК УслугиСДЧистые,
		|	СУММА(ЕСТЬNULL(ЗакрытыеЗаказыОбороты.СтраховойСборОборот, 0)) КАК СтраховойСбор,
		|	СУММА(ЕСТЬNULL(ЗакрытыеЗаказыОбороты.ФактическийВесОборот, 0)) КАК ФактическийВес,
		|	СУММА(ЕСТЬNULL(ЗакрытыеЗаказыОбороты.ОбъемЗабораОборот, 0)) КАК ОбъемЗабора,
		|	СУММА(ЕСТЬNULL(ЗакрытыеЗаказыОбороты.ОбъемЗабораПоЗаказамОборот, 0)) КАК ОбъемЗабораПоЗаказам,
		|	СУММА(ЕСТЬNULL(ЗакрытыеЗаказыОбороты.ВыгруженныйОбъемОборот, 0)) КАК ВыгруженныйОбъем,
		|	СУММА(ЕСТЬNULL(ЗакрытыеЗаказыОбороты.ТарифицируемыйВесОборот, 0)) КАК ТарифицируемыйВес,
		|	СУММА(ЕСТЬNULL(ЗакрытыеЗаказыОбороты.СтоимостьОценочнаяПоТоварноОборот, 0)) КАК СтоимостьОценочнаяПоТоварно,
		|	СУММА(ЕСТЬNULL(ЗакрытыеЗаказыОбороты.КоличествоПереносовСЗаездамиОборот, 0)) КАК КоличествоПереносовСЗаездами,
		|	СУММА(ЕСТЬNULL(ЗакрытыеЗаказыОбороты.СтоимостьПереносовСЗаездамиОборот, 0)) КАК СтоимостьПереносовСЗаездами,
		|	СУММА(ЕСТЬNULL(ЗакрытыеЗаказыОбороты.СтоимостьПодъемаМПОборот, 0)) КАК СтоимостьПодъемаМП
		|ИЗ
		|	ВТ_ЗакрытыеЗаказы КАК ВТ_ЗакрытыеЗаказы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗакрытыеЗаказы.Обороты КАК ЗакрытыеЗаказыОбороты
		|		ПО ВТ_ЗакрытыеЗаказы.Документ = ЗакрытыеЗаказыОбороты.Реализация
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЗакрытыеЗаказы.НомерДокумента,
		|	ВТ_ЗакрытыеЗаказы.ТипЗаказа,
		|	ВТ_ЗакрытыеЗаказы.Транспорт,
		|	ВТ_ЗакрытыеЗаказы.Документ,
		|	ВТ_ЗакрытыеЗаказы.ЮрЛицо,
		|	ВТ_ЗакрытыеЗаказы.Партнер,
		|	ВТ_ЗакрытыеЗаказы.ИнтернетМагазин,
		|	ВТ_ЗакрытыеЗаказы.КатегорияДоставки,
		|	ВТ_ЗакрытыеЗаказы.Водитель,
		|	ВТ_ЗакрытыеЗаказы.ОбъемныйБрейк,
		|	ВТ_ЗакрытыеЗаказы.РасчетныйБрейк,
		|	ВТ_ЗакрытыеЗаказы.СтатусЗаказа,
		|	ВТ_ЗакрытыеЗаказы.ВидVip,
		|	ВТ_ЗакрытыеЗаказы.ЗаписьВОтчет,
		|	ВТ_ЗакрытыеЗаказы.VIPДоставка,
		|	ВТ_ЗакрытыеЗаказы.ТерминалДоставки,
		|	ВТ_ЗакрытыеЗаказы.ТарифнаяСетка,
		|	ВТ_ЗакрытыеЗаказы.ЗонаТарификации,
		|	ВТ_ЗакрытыеЗаказы.ПричинаНевыполнения,
		|	ВТ_ЗакрытыеЗаказы.СтатусИнтернетМагазина,
		|	ВТ_ЗакрытыеЗаказы.ПричинаОтказа,
		|	ВТ_ЗакрытыеЗаказы.ТарифнаяСеткаПартнера,
		|	ВТ_ЗакрытыеЗаказы.Клиент,
		|	ВТ_ЗакрытыеЗаказы.ПричинаОтклоненияЗаказа,
		|	ВТ_ЗакрытыеЗаказы.ТерминалПриёма,
		|	ВТ_ЗакрытыеЗаказы.ПодъемныйБрейк,
		|	ВТ_ЗакрытыеЗаказы.ТипОплаты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ЗакрытыеЗаказы";
	
	Если ТолькоТекстЗапроса Тогда 
		Возврат  Запрос.Текст;
	КонецЕсли;	
		
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания);
	
	Запрос.УстановитьПараметр("ПоИнтернетМагазину", ПараметрыЗапроса.ПоИнтернетМагазину);
	Запрос.УстановитьПараметр("ИнтернетМагазин", ПараметрыЗапроса.ИнтернетМагазин);
	
	Запрос.УстановитьПараметр("Партнер", ПараметрыЗапроса.Партнер);
	Запрос.УстановитьПараметр("ПоПартнеру", ПараметрыЗапроса.ПоПартнеру);
	
	Запрос.УстановитьПараметр("ПоСтатусуЗаказа", ПараметрыЗапроса.ПоСтатусуЗаказа);
	Запрос.УстановитьПараметр("СтатусЗаказа", ПараметрыЗапроса.СтатусЗаказа);
	
	Запрос.УстановитьПараметр("ПоТипуЗаказа", ПараметрыЗапроса.ПоТипуЗаказа);	
	Запрос.УстановитьПараметр("ТипЗаказа", ПараметрыЗапроса.ТипЗаказа);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции	

#КонецОбласти