
&НаСервере
Процедура ЗаполнитьТранспортНаСервере()
	
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Рейс.РейсМестнойДоставки.Транспорт КАК РейсМестнойДоставкиТранспорт,
	                      |	Рейс.РейсМестнойДоставки.Водитель КАК РейсМестнойДоставкиВодитель,
	                      |	Рейс.Ссылка КАК Рейс
	                      |ПОМЕСТИТЬ ВТ_Рейсы
	                      |ИЗ
	                      |	Документ.Рейс КАК Рейс
	                      |ГДЕ
	                      |	Рейс.Дата МЕЖДУ &Дата1 И &Дата2
	                      |	И Рейс.Проведен
	                      |	И Рейс.ТерминалДоставки = &ТерминалДоставки
	                      |	И Рейс.РейсМестнойДоставки.Водитель.Наемный = ЛОЖЬ
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Рейс.РейсМестнойДоставки.Водитель,
	                      |	Рейс.РейсМестнойДоставки.Транспорт,
	                      |	Рейс.Ссылка
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ЗаборТовара.Транспорт,
	                      |	ЗаборТовара.Водитель,
	                      |	РейсЗаказы.Ссылка
	                      |ИЗ
	                      |	Документ.ЗаборТовара КАК ЗаборТовара
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Рейс.Заказы КАК РейсЗаказы
	                      |		ПО ЗаборТовара.Ссылка = РейсЗаказы.Заказ
	                      |ГДЕ
	                      |	ЗаборТовара.Дата МЕЖДУ &Дата1 И &Дата2
	                      |	И ЗаборТовара.Проведен
	                      |	И ЗаборТовара.ТерминалДоставки = &ТерминалДоставки
	                      |	И ЗаборТовара.Водитель.Наемный = ЛОЖЬ
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ЗаборТовара.Транспорт,
	                      |	ЗаборТовара.Водитель,
	                      |	РейсЗаказы.Ссылка
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	Фрахт.Транспорт,
	                      |	Фрахт.Водитель,
	                      |	ЗНАЧЕНИЕ(Документ.Рейс.ПустаяСсылка)
	                      |ИЗ
	                      |	Документ.Фрахт КАК Фрахт
	                      |ГДЕ
	                      |	Фрахт.Дата МЕЖДУ &Дата1 И &Дата2
	                      |	И Фрахт.Проведен
	                      |	И Фрахт.Терминал = &ТерминалДоставки
	                      |	И Фрахт.Водитель.Наемный = ЛОЖЬ
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Фрахт.Транспорт,
	                      |	Фрахт.Водитель
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_Рейсы.РейсМестнойДоставкиТранспорт,
	                      |	ВТ_Рейсы.РейсМестнойДоставкиВодитель,
	                      |	ВТ_Рейсы.Рейс
	                      |ПОМЕСТИТЬ ВТ_ЗаказыГруппировка
	                      |ИЗ
	                      |	ВТ_Рейсы КАК ВТ_Рейсы
	                      |ГДЕ
	                      |	НЕ ВТ_Рейсы.РейсМестнойДоставкиТранспорт ЕСТЬ NULL 
	                      |	И ВТ_Рейсы.РейсМестнойДоставкиТранспорт <> ЗНАЧЕНИЕ(Справочник.новаТранспорт.ПустаяСсылка)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВТ_Рейсы.РейсМестнойДоставкиТранспорт,
	                      |	ВТ_Рейсы.РейсМестнойДоставкиВодитель,
	                      |	ВТ_Рейсы.Рейс
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	МАКСИМУМ(ТранспортыРасходГСМ.Период) КАК Период,
	                      |	ТранспортыРасходГСМ.Транспорт,
	                      |	ТранспортыРасходГСМ.Рейс
	                      |ПОМЕСТИТЬ ВТ_КрайняяДата
	                      |ИЗ
	                      |	РегистрНакопления.РасходГСМ КАК ТранспортыРасходГСМ
	                      |ГДЕ
	                      |	ТранспортыРасходГСМ.ТерминалДоставки = &ТерминалДоставки
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ТранспортыРасходГСМ.Транспорт,
	                      |	ТранспортыРасходГСМ.Рейс
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ДанныеРасходГСМ.Транспорт,
	                      |	ДанныеРасходГСМ.ПоказанияОдометраНаКонецДня,
	                      |	ДанныеРасходГСМ.Рейс
	                      |ПОМЕСТИТЬ ВТ_КрайниеПоказания
	                      |ИЗ
	                      |	ВТ_КрайняяДата КАК ВТ_КрайняяДата
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасходГСМ КАК ДанныеРасходГСМ
	                      |		ПО ВТ_КрайняяДата.Транспорт = ДанныеРасходГСМ.Транспорт
	                      |			И ВТ_КрайняяДата.Период = ДанныеРасходГСМ.Период
	                      |			И ВТ_КрайняяДата.Рейс = ДанныеРасходГСМ.Рейс
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ВТ_ЗаказыГруппировка.РейсМестнойДоставкиТранспорт КАК Транспорт,
	                      |	ВТ_ЗаказыГруппировка.РейсМестнойДоставкиВодитель КАК Водитель,
	                      |	ВТ_КрайниеПоказания.ПоказанияОдометраНаКонецДня КАК ПоказанияОдометраНаНачалоДня
	                      |ИЗ
	                      |	ВТ_ЗаказыГруппировка КАК ВТ_ЗаказыГруппировка
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КрайниеПоказания КАК ВТ_КрайниеПоказания
	                      |		ПО ВТ_ЗаказыГруппировка.РейсМестнойДоставкиТранспорт = ВТ_КрайниеПоказания.Транспорт
	                      |			И ВТ_ЗаказыГруппировка.Рейс = ВТ_КрайниеПоказания.Рейс");
	
	
	
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//                      |	новаОтчетВодителя.Транспорт КАК РейсМестнойДоставкиТранспорт,
	//                      |	новаОтчетВодителя.Водитель КАК РейсМестнойДоставкиВодитель,
	//                      |	новаОтчетВодителя.Рейс КАК Рейс
	//                      |ПОМЕСТИТЬ ВТ_Рейсы
	//                      |ИЗ
	//                      |	Документ.новаОтчетВодителя КАК новаОтчетВодителя
	//                      |ГДЕ
	//                      |	новаОтчетВодителя.Дата МЕЖДУ &Дата1 И &Дата2
	//                      |	И новаОтчетВодителя.Проведен
	//                      |	И новаОтчетВодителя.Транспорт.НаёмныйТранспорт = ЛОЖЬ
	//                      |	И новаОтчетВодителя.Транспорт.ТерминалДоставки = &ТерминалДоставки
	//                      |
	//                      |СГРУППИРОВАТЬ ПО
	//                      |	новаОтчетВодителя.Транспорт,
	//                      |	новаОтчетВодителя.Водитель,
	//                      |	новаОтчетВодителя.Рейс
	//                      |
	//                      |ОБЪЕДИНИТЬ ВСЕ
	//                      |
	//                      |ВЫБРАТЬ
	//                      |	Фрахт.Транспорт,
	//                      |	Фрахт.Водитель,
	//                      |	ЗНАЧЕНИЕ(Документ.рейс.пустаяСсылка)
	//                      |ИЗ
	//                      |	Документ.Фрахт КАК Фрахт
	//                      |ГДЕ
	//                      |	Фрахт.Дата МЕЖДУ &Дата1 И &Дата2
	//                      |	И Фрахт.Проведен
	//                      |	И Фрахт.Терминал = &ТерминалДоставки
	//                      |	И Фрахт.Транспорт.НаёмныйТранспорт = ЛОЖЬ
	//                      |
	//                      |СГРУППИРОВАТЬ ПО
	//                      |	Фрахт.Транспорт,
	//                      |	Фрахт.Водитель
	//                      |;
	//                      |
	//                      |////////////////////////////////////////////////////////////////////////////////
	//                      |ВЫБРАТЬ
	//                      |	ВТ_Рейсы.РейсМестнойДоставкиТранспорт,
	//                      |	ВТ_Рейсы.РейсМестнойДоставкиВодитель,
	//                      |	ВТ_Рейсы.Рейс
	//                      |ПОМЕСТИТЬ ВТ_ЗаказыГруппировка
	//                      |ИЗ
	//                      |	ВТ_Рейсы КАК ВТ_Рейсы
	//                      |ГДЕ
	//                      |	НЕ ВТ_Рейсы.РейсМестнойДоставкиТранспорт ЕСТЬ NULL 
	//                      |	И ВТ_Рейсы.РейсМестнойДоставкиТранспорт <> ЗНАЧЕНИЕ(Справочник.новаТранспорт.ПустаяСсылка)
	//                      |
	//                      |СГРУППИРОВАТЬ ПО
	//                      |	ВТ_Рейсы.РейсМестнойДоставкиТранспорт,
	//                      |	ВТ_Рейсы.РейсМестнойДоставкиВодитель,
	//                      |	ВТ_Рейсы.Рейс
	//                      |;
	//                      |
	//                      |////////////////////////////////////////////////////////////////////////////////
	//                      |ВЫБРАТЬ
	//                      |	МАКСИМУМ(ТранспортыРасходГСМ.Период) КАК Период,
	//                      |	ТранспортыРасходГСМ.Транспорт,
	//                      |	ТранспортыРасходГСМ.Рейс
	//                      |ПОМЕСТИТЬ ВТ_КрайняяДата
	//                      |ИЗ
	//                      |	РегистрНакопления.РасходГСМ КАК ТранспортыРасходГСМ
	//                      |ГДЕ
	//                      |	ТранспортыРасходГСМ.ТерминалДоставки = &ТерминалДоставки
	//                      |
	//                      |СГРУППИРОВАТЬ ПО
	//                      |	ТранспортыРасходГСМ.Транспорт,
	//                      |	ТранспортыРасходГСМ.Рейс
	//                      |;
	//                      |
	//                      |////////////////////////////////////////////////////////////////////////////////
	//                      |ВЫБРАТЬ
	//                      |	ДанныеРасходГСМ.Транспорт,
	//                      |	ДанныеРасходГСМ.ПоказанияОдометраНаКонецДня,
	//                      |	ДанныеРасходГСМ.Рейс
	//                      |ПОМЕСТИТЬ ВТ_КрайниеПоказания
	//                      |ИЗ
	//                      |	ВТ_КрайняяДата КАК ВТ_КрайняяДата
	//                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасходГСМ КАК ДанныеРасходГСМ
	//                      |		ПО ВТ_КрайняяДата.Транспорт = ДанныеРасходГСМ.Транспорт
	//                      |			И ВТ_КрайняяДата.Период = ДанныеРасходГСМ.Период
	//                      |			И ВТ_КрайняяДата.Рейс = ДанныеРасходГСМ.Рейс
	//                      |;
	//                      |
	//                      |////////////////////////////////////////////////////////////////////////////////
	//                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
	//                      |	ВТ_ЗаказыГруппировка.РейсМестнойДоставкиТранспорт КАК Транспорт,
	//                      |	ВТ_ЗаказыГруппировка.РейсМестнойДоставкиВодитель КАК Водитель,
	//                      |	ВТ_КрайниеПоказания.ПоказанияОдометраНаКонецДня КАК ПоказанияОдометраНаНачалоДня
	//                      |ИЗ
	//                      |	ВТ_ЗаказыГруппировка КАК ВТ_ЗаказыГруппировка
	//                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КрайниеПоказания КАК ВТ_КрайниеПоказания
	//                      |		ПО ВТ_ЗаказыГруппировка.РейсМестнойДоставкиТранспорт = ВТ_КрайниеПоказания.Транспорт");
						  
	Запрос.УстановитьПараметр("Дата1", НачалоДня(Объект.ДатаОтчета));
	Запрос.УстановитьПараметр("Дата2", КонецДня(Объект.ДатаОтчета));
	Запрос.УстановитьПараметр("ТерминалДоставки", Объект.ТерминалДоставки);
	РезТЗ = Запрос.Выполнить().Выгрузить();
	
	

	Объект.Транспорт.Загрузить(РезТЗ);
	
								   
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТранспорт(Команда)
	
	Если ЗначениеЗаполнено(Объект.ТерминалДоставки) Тогда
		Если ЗначениеЗаполнено(Объект.ДатаОтчета) Тогда
	
			Если Объект.Транспорт.Итог("РасходГСМ") > 0 ИЛИ Объект.Транспорт.Итог("ПоказанияОдометраНаКонецДня") > 0 Тогда
			
				#Если Клиент Тогда
					Режим = РежимДиалогаВопрос.ДаНет;
					Ответ = Вопрос(НСтр("ru = 'В табличную часть были внесены данные, очистить и заполнить заново?';"
					     + " en = 'Do you want to continue?'"), Режим, 0);
					Если Ответ = КодВозвратаДиалога.Нет Тогда
					    Возврат;
					ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда
						Объект.Транспорт.Очистить();
						ЗаполнитьТранспортНаСервере();
					КонецЕсли; 
				#Иначе
					Объект.Транспорт.Очистить();
					ЗаполнитьТранспортНаСервере();
				#КонецЕсли	
			
			Иначе
			    Объект.Транспорт.Очистить();
				ЗаполнитьТранспортНаСервере();		
			КонецЕсли;		
			
		Иначе
	        Сообщить("Не заполнена ""дата отчета""");
		КонецЕсли;			
	Иначе
		Сообщить("Не заполнен терминал доставки");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтоимостиНаСервере()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
                       |	СтоимостьГСМСрезПоследних.ТипГСМ,
                       |	СтоимостьГСМСрезПоследних.Стоимость
                       |ИЗ
                       |	РегистрСведений.СтоимостьГСМ.СрезПоследних(&Период, ) КАК СтоимостьГСМСрезПоследних
                       |ГДЕ
                       |	СтоимостьГСМСрезПоследних.ТерминалДоставки = &ТерминалДоставки");
	Запрос.УстановитьПараметр("Период", Объект.ДатаОтчета);
	Запрос.УстановитьПараметр("ТерминалДоставки", Объект.ТерминалДоставки);
	РезТЗ = Запрос.Выполнить().Выгрузить();
	
	Объект.СтоимостьГСМ.Загрузить(РезТЗ);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтоимости(Команда)
	
	Если ЗначениеЗаполнено(Объект.ТерминалДоставки) Тогда
		
		Если ЗначениеЗаполнено(Объект.ДатаОтчета) Тогда
			
			Если Объект.СтоимостьГСМ.Количество() Тогда
				#Если Клиент Тогда
					Режим = РежимДиалогаВопрос.ДаНет;
					Ответ = Вопрос(НСтр("ru = 'Табличная часть не пуста. Очистить и заполнить заново?';"
					     + " en = 'Do you want to continue?'"), Режим, 0);
					Если Ответ = КодВозвратаДиалога.Нет Тогда
					    Возврат;
					ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда
						Объект.СтоимостьГСМ.Очистить();
						ЗаполнитьСтоимостиНаСервере();
					КонецЕсли; 
				#Иначе
					Объект.СтоимостьГСМ.Очистить();
					ЗаполнитьСтоимостиНаСервере();
				#КонецЕсли
			Иначе
				ЗаполнитьСтоимостиНаСервере();
			КонецЕсли;
		Иначе
	        Сообщить("Не заполнена ""дата отчета""");
		КонецЕсли;
			
	Иначе
		Сообщить("Не заполнен терминал доставки");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда	
		Объект.ДатаОтчета = НачалоДня(ТекущаяДата() - 86400);		
	КонецЕсли;	
	
	Объект.ТерминалДоставки = Справочники.РегиональныеТерминалы.МоскваСтриж;
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортПередУдалением(Элемент, Отказ)
	
	ТекСтрока = Элементы.Транспорт.ТекущиеДанные;
	Парам = Новый Структура("ТекСтрока", ТекСтрока);
	ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаУдалениеСтроки",ЭтотОбъект, Парам), "Удалить строку?", РежимДиалогаВопрос.ДаНет);
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаУдалениеСтроки(РезВопроса, Парам) Экспорт
	
	СтрокаДляУдаления = Парам.ТекСтрока;
	Если РезВопроса = КодВозвратаДиалога.Да Тогда	
		Объект.Транспорт.Удалить(Объект.Транспорт.Индекс(СтрокаДляУдаления));			
	Иначе	
	КонецЕсли;	

КонецПроцедуры


&НаКлиенте
Процедура ТранспортПослеУдаления(Элемент)
	
	Элементы.Транспорт.Обновить();
	
КонецПроцедуры

