
&НаКлиенте
Процедура ЗаписатьСписокИМВРассылку(Команда)
	
	СписокИМ = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[1].ПравоеЗначение;
	
	Если СписокИМ.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса",
		ЭтотОбъект,СписокИМ);	
		
		ПоказатьВопрос(Оповещение,
		"Заполнить список Интернет Магазинов в Рассылке данным отбором?",
		РежимДиалогаВопрос.ДаНет,
		0, // таймаут в секундах
		КодВозвратаДиалога.Нет, // (необ.) кнопка по умолчанию
		"Внимание!!!" // (необ.) заголовок
		);    
	КонецЕсли;

		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
 
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнениеСпискаИМРегламентированный(Параметры);
    КонецЕсли;	
 
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеСпискаИМРегламентированный(СписокИМРег)
    СправОтчетПоВесам = Справочники.НастройкиАвтоматическойОтправкиОбщихОтчетов.НайтиПоКоду("00000000009");
	РедСпр = СправОтчетПоВесам.ПолучитьОбъект();
	РедСпр.КонтрагентыЦелевые.Очистить();
	
	Для Каждого Элем Из СписокИМРег Цикл
		НовСтр = РедСпр.КонтрагентыЦелевые.Добавить();
	    НовСтр.Контрагент = Элем.Значение;
	    НовСтр.Отметка = Истина;
	КонецЦикла;	
	
	РедСпр.Записать();
	
КонецПроцедуры
