
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// ТипАвторизации: ВходВМП, ОткрытиеНастроекМП	
	ТипАвторизации = Параметры.ТипАвторизации;
	ПолучитьАвторизационныеДанныеСистемы();
	ЗаполнитьСписокТранспортаПоРегиону();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьЭлементовФормы();
	УправлениеДоступностьюЭлементовФормы();
	АктивироватьЭлементФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если Не ФлагЗакрытияФормыПриАвторизации Тогда
		Отказ = Истина;
		СтандартнаяОбработка = Ложь;
		ПоказатьВопрос(Новый ОписаниеОповещения("ОтветНаВопросОЗакрытииМПЗавершение", ЭтотОбъект), "Вы действительно хотите завершить работу МП?", РежимДиалогаВопрос.ДаНет);
	КонецЕсли;	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТранспортПриИзменении(Элемент)
	ТранспортОбработкаВыбораНаСервере();
	УправлениеДоступностьюЭлементовФормы();
	АктивироватьЭлементФормы();
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Авторизация(Команда)
	УспешнаяАвторизация = Ложь;
	Если ТипАвторизации = "ВходВМП" Тогда
		Если Пароль = ПарольВСистеме Тогда
			УспешнаяАвторизация = Истина;
		КонецЕсли;	 
	КонецеСли;	 
	
	Если УспешнаяАвторизация Тогда
		ПараметрыЗакрытия = Новый Структура;
		ПараметрыЗакрытия.Вставить("РезультатАвторизации", "Успешно");
    
		ФлагЗакрытияФормыПриАвторизации = Истина;
		РаботаСАвторизациейВызовСервера.СохранитьДанныеАвтологина(Пароль);    
		Закрыть(ПараметрыЗакрытия);		
	Иначе
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Неверный пароль!";
		Сообщение.Поле = "Пароль";
		Сообщение.Сообщить();
	КонецЕсли;	
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
// Активировать элемент формы.
&НаКлиенте
Процедура АктивироватьЭлементФормы()
	Если ЗначениеЗаполнено(Транспорт) Тогда
		ТекущийЭлемент = Элементы.Пароль;
	Иначе
		ТекущийЭлемент = Элементы.Транспорт;	
	КонецеСли;	
КонецПроцедуры	



&НаКлиенте
Процедура ОтветНаВопросОЗакрытииМПЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗавершитьРаботуСистемы(Ложь);
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементовФормы()
	Если ТипАвторизации = "ВходВМП" Тогда
		Элементы.Транспорт.Видимость = Истина;
	Конецесли;	
КонецПроцедуры

&НаСервере
Процедура ПолучитьАвторизационныеДанныеСистемы()
	Если ТипАвторизации = "ВходВМП" Тогда
		РегионРаботыМП = ПараметрыСеанса.РегионМП;
		ПарольВСистеме = Константы.ПарольВходаВМП.Получить();
		Транспорт = ПараметрыСеанса.ТранспортМП;
		ТранспортВСистеме = Транспорт;
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура УправлениеДоступностьюЭлементовФормы()
	Если ТипАвторизации = "ВходВМП" Тогда
		Элементы.Авторизация.Доступность = ЗначениеЗаполнено(Транспорт);
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура ТранспортОбработкаВыбораНаСервере()
	Если Транспорт <> ТранспортВСистеме Тогда
		//@skip-check reading-attribute-from-database
		РезультатВызова =  ПроцедурыОбменаСЦУ.ВыполнитьОбмен_ПолучитьПарольТранспорта("", СокрЛП(Транспорт.Код));
		Если Не РезультатВызова Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Ошибка получения авторизационных данных на сервере!";
			Сообщение.Сообщить();
			Транспорт = Справочники.Транспорт.ПустаяСсылка();
			Возврат;
		КонецеСли;
		
		Константы.ТранспортМП.Установить(Транспорт);
		ПараметрыСеанса.ТранспортМП = Транспорт;
		ПолучитьАвторизационныеДанныеСистемы();
	КонецеСли;	
КонецПроцедуры

// Заполнить список транспорта по региону.
&НаСервере
Процедура ЗаполнитьСписокТранспортаПоРегиону()
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	|	ТранспортТабл.Ссылка КАК Транспорт
	|ИЗ
	|	Справочник.Транспорт КАК ТранспортТабл
	|ГДЕ
	|	ТранспортТабл.Регион = &Регион
	|	И ТранспортТабл.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТранспортТабл.Наименование";
	Зап.УстановитьПараметр("Регион", РегионРаботыМП);
	
	Выб = Зап.Выполнить().Выбрать();
	
	Пока Выб.Следующий() Цикл
		Элементы.Транспорт.СписокВыбора.Добавить(Выб.Транспорт);
	КонецЦикла;	
КонецПроцедуры	
#КонецОбласти
