
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр СтатусыЗапросовНаПередачуЗаказовЭкипажам
	Движения.СтатусыЗапросовНаПередачуЗаказовЭкипажам.Записывать = Истина;
	Движения.СтатусыЗапросовНаПередачуЗаказовЭкипажам.Очистить();
	Движение = Движения.СтатусыЗапросовНаПередачуЗаказовЭкипажам.Добавить();
	Движение.Период = Дата;
	Движение.ЗапросНаПередачуЗаказовЭкипажу = Ссылка;
	Движение.СтатусЗапроса = Перечисления.СтатусыЗапросовНаПередачуЗаказовЭкипажам.ЗапросСоздан;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
