
&НаСервере
Функция ЗаписатьДанныеФайла(Значение, Документ, Заказ, ТипДокумента, Расширение, ТипСодержимого = "") Экспорт
	Хр = Новый ХранилищеЗначения(Значение, Новый СжатиеДанных(9));
	
	СпрФайл = Справочники.ПрикрепленныеФайлы.СоздатьЭлемент();
	СпрФайл.Данные = Хр;
	СпрФайл.РасширениеДокумента = Расширение;
	СпрФайл.ТипДокумента = ТипДокумента;
	СпрФайл.ДатаСоздания = ТекущаяДата();
	ИмяФ = "";
	Если ЗначениеЗаполнено(ТипДокумента.ПрефиксИмениФайла) Тогда
		ИмяФ = СокрЛП(ТипДокумента.ПрефиксИмениФайла);
	Иначе	
		ИмяФ = "foto_ma";
	КонецеСли;	
	
	ИмяФ = ИмяФ + "_" + СокрЛП(Заказ.Номер) + "_" + Формат(День(СпрФайл.ДатаСоздания), "ЧЦ=2; ЧН=; ЧВН=") + "_" + Формат(Месяц(СпрФайл.ДатаСоздания), "ЧЦ=2; ЧН=; ЧВН=") + "_" + Формат(Год(СпрФайл.ДатаСоздания), "ЧЦ=4; ЧН=; ЧВН=; ЧГ=0");
	
	СпрФайл.Наименование = ИмяФ;
	
	СпрФайл.Записать();
	
	ТекВр = ТекущаяДата();
	
	Наб = РегистрыСведений.ПрикрепленныеФайлы.СоздатьНаборЗаписей();
	Наб.Отбор.Документ.Установить(Документ);
	Наб.Отбор.Заказ.Установить(Заказ);   
	Наб.Отбор.Период.Установить(ТекВр);
	
	Нов = Наб.Добавить();
	
	Нов.Период = ТекВр;
	Нов.Документ = Документ;
	Нов.Заказ = Заказ;
	Нов.Данные = СпрФайл.Ссылка;
	
	Наб.Записать();
	Возврат Истина;
КонецФункции

Функция ПолучитьТипыПрикрепленныхДокументов(Заказ) Экспорт
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	ТипыПрикрепленныхДокументов.Ссылка КАК Тип,
	            |	ТипыПрикрепленныхДокументов.Наименование КАК Наименование
	            |ИЗ
	            |	Справочник.ТипыПрикрепленныхДокументов.ДоступностьПоТипамЗаказов КАК ТипыПрикрепленныхДокументовДоступностьПоТипамЗаказов
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТипыПрикрепленныхДокументов КАК ТипыПрикрепленныхДокументов
	            |		ПО ТипыПрикрепленныхДокументовДоступностьПоТипамЗаказов.Ссылка = ТипыПрикрепленныхДокументов.Ссылка
	            |ГДЕ
	            |	ТипыПрикрепленныхДокументовДоступностьПоТипамЗаказов.Доступен = ИСТИНА
	            |	И ТипыПрикрепленныхДокументовДоступностьПоТипамЗаказов.ТипЗаказа = &ТипЗаказа
	            |	И ТипыПрикрепленныхДокументов.ДоступенВыборВМП = ИСТИНА";
	Зап.УстановитьПараметр("ТипЗаказа", Заказ.ТипЗаказа);
	
	Выб = Зап.Выполнить().Выбрать();
	
	Сп = Новый СписокЗначений();
	
	Пока Выб.Следующий() Цикл
		Сп.Добавить(Выб.Тип, Выб.Наименование);
	КонецЦикла;	
	
	Возврат Сп;
КонецФункции	