
&НаКлиенте
Процедура ВыгрузитьПакетДанных(Команда)
	Если Не ЗначениеЗаполнено(АдресПакета) Тогда
		Возврат;
	КонецеСли;
	
	Д = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Д.ПолноеИмяФайла = "veerote_xml.xml";
	Фильтр = "xml-файл" 
	+ "(*.xml)|*.xml";
	Д.Фильтр = Фильтр;
	Д.МножественныйВыбор = Ложь;
	Д.Заголовок = "Выберите файл";
	Если Д.Выбрать() Тогда
		
		Хр = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресПакета));
		Дв = Хр.Получить();
		Дв.Записать(Д.ПолноеИмяФайла);
		Предупреждение("Пакет записан!");
	КонецеСли;		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	АдресПакета = ПоместитьВоВременноеХранилище(ДокОбъект.Данные.Получить(),ЭтаФорма.УникальныйИдентификатор);
	
	
	//Зн = ЭтотОбъект.Данные.получить();
	//Если ЗначениеЗаполнено(Зн) Тогда
	//	НадписьПО = "Приложение загружено";
	//	Элементы.НадписьПО.ЦветТекста = WebЦвета.ЗеленыйЛес;
	//Иначе
	//	НадписьПО = "Приложение не загружено";
	//	Элементы.НадписьПО.ЦветТекста = WebЦвета.Малиновый;
	//КонецеСли;	
КонецПроцедуры
