
&НаКлиенте
Процедура СелекторТипаНомераПриИзменении(Элемент)
	
	ПоНомеруСтриж = Объект.СелекторТипаНомера = 1;
	
	Если ПоНомеруСтриж Тогда
		Элементы.Партнер.ТолькоПросмотр = Истина;
		Объект.Партнер = Неопределено;
	Иначе
		Элементы.Партнер.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.СелекторТипаНомера = 1;
	//Асеев 25.01.2022 (Задача № 4975)>>>
	Объект.ПричинаОтказаПереноса = Справочники.ПричиныОтказаПереноса.НайтиПоКоду("00000000004");
	//Асеев 25.01.2022 (Задача № 4975)<<<
	
	Элементы.МассоваяОперация.Доступность = РольДоступна("МассоваяГрупповаяОперация");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыполнить(Команда)
	
	Если Объект.СелекторТипаНомера = 2 И Объект.Партнер.Пустая() Тогда
		ПоказатьПредупреждение(, "Укажите партнера");
		Возврат;
	КонецЕсли;
	
	Если Объект.ИнициаторСостояния.Пустая() Тогда
		ПоказатьПредупреждение(, "Укажите инициатора состояния");
		Возврат;
	КонецЕсли;
	
	Если Объект.ПричинаОтказаПереноса.Пустая() Тогда
		ПоказатьПредупреждение(, "Укажите причину отказа переноса");
		Возврат;
	КонецЕсли;
	
	Фиксация = ОтменитьЗаказыНаСервере();
	Если Фиксация <> Неопределено Тогда
		ОткрытьЗначение(Фиксация);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОтменитьЗаказыНаСервере()
	
	ПоНомеруСтриж = Объект.СелекторТипаНомера = 1;
	
	КоличествоСтрок = СтрЧислоСтрок(Объект.СписокЗаказов);
	
	ТаблицаНомеров = Новый ТаблицаЗначений;
	КолонкиТаблицы = ТаблицаНомеров.Колонки;
	
	Если ПоНомеруСтриж Тогда
		КолонкиТаблицы.Добавить("Номер", ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(11));
	Иначе
		КолонкиТаблицы.Добавить("Номер", ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(50));
	КонецЕсли;

	Для НомерСтроки = 1 По КоличествоСтрок Цикл
		НомерЗаказа = СокрЛП(СтрПолучитьСтроку(Объект.СписокЗаказов, НомерСтроки));
		Если НомерСтроки <> "" Тогда
			СтрокаТаблицы = ТаблицаНомеров.Добавить();
			СтрокаТаблицы.Номер = НомерЗаказа;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ТаблицаНомеров.Количество() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.ОтменитьЗаказы(ТаблицаНомеров);
	
КонецФункции
