
Процедура ОбработкаОповещенияПодключенияСерверныхСообщенийБезКонтекста(ДополнительныеПараметры) Экспорт
	
	//Тут обработка ошибок подключения обработчика
	Сообщить("Обработчик подключен.");
	
КонецПроцедуры


Процедура ОбработкаОповещенияСерверныхСообщенийБезКонтекста(Сообщение, ДополнительныеПараметры) ЭКспорт
	
	//Тут обработка присланного сообщения
	Если Сообщение.Получатели.Содержит(СерверВзаимодействияПривилегированный.ПолучитьИдентификаторТекущегоПользователя()) Тогда
		Сообщить(Сообщение.Текст);
	КонецЕсли;
	
КонецПроцедуры