Функция ПолучитьВес(АдресВесов) Экспорт
	Для Сч = 1 По 5 Цикл
		Попытка
			Вес = СчитатьВес(АдресВесов);
		Исключение
			Вес = 0;
		КонецПопытки;	
		Если Вес <> 0 Тогда
			Возврат Вес;
		КонецеСли;	
	КонецЦикла;
КонецФункции

Функция СчитатьВес(АдресВесов)
	HTTPС = Новый HTTPСоединение(АдресВесов,,,,,2);
	HTTPЗ = Новый HTTPЗапрос;
	HTTPЗ.АдресРесурса = "rawdata.html";
	Ответ = HTTPС.Получить(HTTPЗ);
	попытка
		СтрОтвет = Ответ.ПолучитьТелоКакСтроку();
		Вес = Число(СтрПолучитьСтроку(СтрОтвет, 1));
	Исключение
		Вес = 0;
	КонецПопытки;	
	Возврат Вес;
КонецФункции	