
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.СтатусыОборудования.Записывать = Истина;
	Движения.СтатусыОборудования.Очистить();
	Для Каждого ТекСтрокаСписокОборудования Из СписокОборудования Цикл
		Движение = Движения.СтатусыОборудования.Добавить();
		Движение.Период = Дата;
		Движение.Оборудование = ТекСтрокаСписокОборудования.Оборудование;
		Движение.СтатусОборудования = СтатусОборудования;
		Движение.Пользователь = Пользователь;
		Движение.Регион = Регион;
	КонецЦикла;

КонецПроцедуры
