
&НаКлиенте
Процедура ВнешнийНомерЗаказаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Если ЗначениеЗаполнено(ВнешнийНомерЗаказа) Тогда
		Зап = Новый Запрос;
		//+Степанов Задача № 3787 В поиск включена ТЧ игнорируемых ШК
		//Зап.Текст = "ВЫБРАТЬ
		//            |	ЗагрузкаСТСДШтрихкоды.Ссылка.Номер КАК Номер
		//            |ИЗ
		//            |	Документ.ЗагрузкаСТСД.Штрихкоды КАК ЗагрузкаСТСДШтрихкоды
		//            |ГДЕ
		//            |	(ЗагрузкаСТСДШтрихкоды.Заказ.НомерВнешнегоЗаказа = &НомерВнешнегоЗаказа
		//            |			ИЛИ ЗагрузкаСТСДШтрихкоды.Штрихкод = &НомерВнешнегоЗаказа
		//            |			ИЛИ ЗагрузкаСТСДШтрихкоды.ВнешнийНомерЗаказа = &НомерВнешнегоЗаказа)
		//            |
		//            |СГРУППИРОВАТЬ ПО
		//            |	ЗагрузкаСТСДШтрихкоды.Ссылка.Ссылка,
		//            |	ЗагрузкаСТСДШтрихкоды.Ссылка.Номер";
		Зап.Текст = "ВЫБРАТЬ
		            |	ЗагрузкаСТСДШтрихкоды.Ссылка.Номер КАК Номер,
		            |	ЗагрузкаСТСДШтрихкоды.Ссылка КАК Ссылка
		            |ПОМЕСТИТЬ втНайденныеДокументы
		            |ИЗ
		            |	Документ.ЗагрузкаСТСД.Штрихкоды КАК ЗагрузкаСТСДШтрихкоды
		            |ГДЕ
		            |	ЗагрузкаСТСДШтрихкоды.Заказ.НомерВнешнегоЗаказа = &НомерВнешнегоЗаказа
		            |
		            |ОБЪЕДИНИТЬ ВСЕ
		            |
		            |ВЫБРАТЬ
		            |	ЗагрузкаСТСДШтрихкоды.Ссылка.Номер,
		            |	ЗагрузкаСТСДШтрихкоды.Ссылка
		            |ИЗ
		            |	Документ.ЗагрузкаСТСД.Штрихкоды КАК ЗагрузкаСТСДШтрихкоды
		            |ГДЕ
		            |	ЗагрузкаСТСДШтрихкоды.Штрихкод = &НомерВнешнегоЗаказа
		            |
		            |ОБЪЕДИНИТЬ ВСЕ
		            |
		            |ВЫБРАТЬ
		            |	ЗагрузкаСТСДШтрихкоды.Ссылка.Номер,
		            |	ЗагрузкаСТСДШтрихкоды.Ссылка
		            |ИЗ
		            |	Документ.ЗагрузкаСТСД.Штрихкоды КАК ЗагрузкаСТСДШтрихкоды
		            |ГДЕ
		            |	ЗагрузкаСТСДШтрихкоды.ВнешнийНомерЗаказа = &НомерВнешнегоЗаказа
		            |
		            |ОБЪЕДИНИТЬ ВСЕ
		            |
		            |ВЫБРАТЬ
		            |	ЗагрузкаСТСДИгнорируемыеШтрихкоды.Ссылка.Номер,
		            |	ЗагрузкаСТСДИгнорируемыеШтрихкоды.Ссылка
		            |ИЗ
		            |	Документ.ЗагрузкаСТСД.ИгнорируемыеШтрихкоды КАК ЗагрузкаСТСДИгнорируемыеШтрихкоды
		            |ГДЕ
		            |	ЗагрузкаСТСДИгнорируемыеШтрихкоды.Штрихкод = &НомерВнешнегоЗаказа
		            |;
		            |
		            |////////////////////////////////////////////////////////////////////////////////
		            |ВЫБРАТЬ
		            |	втНайденныеДокументы.Номер КАК Номер
		            |ИЗ
		            |	втНайденныеДокументы КАК втНайденныеДокументы
		            |
		            |СГРУППИРОВАТЬ ПО
		            |	втНайденныеДокументы.Номер,
		            |	втНайденныеДокументы.Ссылка";
		//-Степанов Задача № 3787 
		Зап.УстановитьПараметр("НомерВнешнегоЗаказа", ВнешнийНомерЗаказа);
		
		Рез = Зап.Выполнить().Выбрать();;
		Мас = Новый Массив;
		Если Рез.Количество() = 0 Тогда
			ОчиститьПоиск(Неопределено);
		Иначе
			Пока Рез.Следующий() Цикл
				Мас.Добавить(Рез.Номер);
			КонецЦикла;	
		ИП = "Номер";
		ПЗ = Мас;
		Исп = Истина;
		ОбщегоНазначенияКлиентСервер83.УстановитьЭлементОтбора(Список.Отбор,
								ИП,
								ПЗ,
								,
								,
								Исп,
								,
								);
		КонецеСли;	
	Иначе
		ОчиститьПоиск(Неопределено);
	КонецеСли;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПоиск(Команда)
	// Вставить содержимое обработчика.
		ИП = "Номер";
		ПЗ = Новый Массив;
		Исп = Ложь;
		ОбщегоНазначенияКлиентСервер83.УстановитьЭлементОтбора(Список.Отбор,
								ИП,
								ПЗ,
								,
								,
								Исп,
								,
								);
								
		ИП = "ТипЗагрузкиТСД";
		ПЗ = 1;
		Исп = Ложь;
		ОбщегоНазначенияКлиентСервер83.УстановитьЭлементОтбора(Список.Отбор,
								ИП,
								ПЗ,
								,
								,
								Исп,
								,
								);
								
	//Список.Отбор.элементы[2].Использование = Ложь;
	ВнешнийНомерЗаказа = "";
	НомерЗаказа = "";
	Штрихкод = "";
КонецПроцедуры


&НаКлиенте
Процедура НомерЗаказаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Если ЗначениеЗаполнено(НомерЗаказа) Тогда
		Зап = Новый Запрос;
		Зап.Текст = "ВЫБРАТЬ
		            |	ЗагрузкаСТСДШтрихкоды.Ссылка.Номер КАК Номер
		            |ИЗ
		            |	Документ.ЗагрузкаСТСД.Штрихкоды КАК ЗагрузкаСТСДШтрихкоды
		            |ГДЕ
		            |	(ЗагрузкаСТСДШтрихкоды.Заказ.Номер = &НомерЗаказа
		            |			ИЛИ ЗагрузкаСТСДШтрихкоды.ВнешнийНомерЗаказа = &НомерЗаказа)
		            |
		            |СГРУППИРОВАТЬ ПО
		            |	ЗагрузкаСТСДШтрихкоды.Ссылка.Ссылка,
		            |	ЗагрузкаСТСДШтрихкоды.Ссылка.Номер";
		Зап.УстановитьПараметр("НомерЗаказа", Формат(НомерЗаказа, "ЧГ="));
		
		Рез = Зап.Выполнить().Выбрать();;
		Мас = Новый Массив;
		Если Рез.Количество() = 0 Тогда
			ОчиститьПоиск(Неопределено);
		Иначе
			Пока Рез.Следующий() Цикл
				Мас.Добавить(Рез.Номер);
			КонецЦикла;	
		ИП = "Номер";
		ПЗ = Мас;
		Исп = Истина;
		ОбщегоНазначенияКлиентСервер83.УстановитьЭлементОтбора(Список.Отбор,
								ИП,
								ПЗ,
								,
								,
								Исп,
								,
								);
		КонецеСли;	
	Иначе
		ОчиститьПоиск(Неопределено);
	КонецеСли;
КонецПроцедуры


&НаКлиенте
Процедура ТипЗагрузкиПриИзменении(Элемент)
	Если ТипЗагрузки.Пустая() Тогда
		ИП = "ТипЗагрузкиТСД";
		ПЗ = 1;
		Исп = Ложь;
		ОбщегоНазначенияКлиентСервер83.УстановитьЭлементОтбора(Список.Отбор,
								ИП,
								ПЗ,
								,
								,
								Исп,
								,
								);
	Иначе	
		ИП = "ТипЗагрузкиТСД";
		ПЗ = ТипЗагрузки;
		Исп = Истина;
		ОбщегоНазначенияКлиентСервер83.УстановитьЭлементОтбора(Список.Отбор,
								ИП,
								ПЗ,
								,
								,
								Исп,
								,
								);
	КонецЕСли;	
	
	ТекущийЭлемент = Элементы.Список;
	Shell = Новый COMОбъект("WScript.Shell");
	Shell.SendKeys("^{END}");	
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТипЗагрузки = Перечисления.ТипыЗагрузкиТСД.ПриходWiFiVeeRoute;
	Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	
	//+++ БАО 22.08.2017 №1730
	//bao.ДобавитьОтборДинСпискаПоДоступнымПользователюТерминалам(Список, "ТерминалПриема");
	//--- БАО 22.08.2017 №1730
	ПериодОтбораАктивныхТСД = Новый СтандартныйПериод(НачалоДня(ТекущаяДата()), КонецДня(ТекущаяДата()));
	КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Вставить содержимое обработчика.
	ТипЗагрузкиПриИзменении(Неопределено);
	bao.ДобавитьОтборДинСпискаПоДоступнымПользователюТерминалам(Список, "ТерминалПриема");
	ПериодОтбораАктивныхТСДПриИзменении(Неопределено);
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузкаДанныхWiFi(Команда)
	От = Вопрос("Удалить после загрузки документы с сервера ТСД?", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
	
	Если От = КодВозвратаДиалога.Да Тогда
		lem.РегламентЗагрузкаДанныхСТСД(Истина);
	Иначе	
		lem.РегламентЗагрузкаДанныхСТСД(Ложь);
	КонецеСли;
	
	ОбновитьОтображениеДанных();
	ТекущийЭлемент = Элементы.Список;
	Shell = Новый COMОбъект("WScript.Shell");
	Shell.SendKeys("^{END}");	
КонецПроцедуры


&НаКлиенте
Процедура ШтрихкодПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Штрихкод) Тогда
		Зап = Новый Запрос;
		//+Степанов Задача № 3787 В поиск включена ТЧ игнорируемых ШК
		//Зап.Текст = "ВЫБРАТЬ
		//            |	ЗагрузкаСТСДШтрихкоды.Ссылка.Номер КАК Номер
		//            |ИЗ
		//            |	Документ.ЗагрузкаСТСД.Штрихкоды КАК ЗагрузкаСТСДШтрихкоды
		//            |ГДЕ
		//            |	ЗагрузкаСТСДШтрихкоды.Штрихкод ПОДОБНО &Штрихкод
		//            |
		//            |СГРУППИРОВАТЬ ПО
		//            |	ЗагрузкаСТСДШтрихкоды.Ссылка.Ссылка,
		//            |	ЗагрузкаСТСДШтрихкоды.Ссылка.Номер";
		Зап.Текст = "ВЫБРАТЬ
		            |	ЗагрузкаСТСДШтрихкоды.Ссылка.Номер КАК Номер,
		            |	ЗагрузкаСТСДШтрихкоды.Ссылка КАК Ссылка
		            |ПОМЕСТИТЬ втНайденныеДокументы
		            |ИЗ
		            |	Документ.ЗагрузкаСТСД.Штрихкоды КАК ЗагрузкаСТСДШтрихкоды
		            |ГДЕ
		            |	ЗагрузкаСТСДШтрихкоды.Штрихкод ПОДОБНО &Штрихкод
		            |
		            |СГРУППИРОВАТЬ ПО
		            |	ЗагрузкаСТСДШтрихкоды.Ссылка.Ссылка,
		            |	ЗагрузкаСТСДШтрихкоды.Ссылка.Номер,
		            |	ЗагрузкаСТСДШтрихкоды.Ссылка
		            |
		            |ОБЪЕДИНИТЬ ВСЕ
		            |
		            |ВЫБРАТЬ
		            |	ЗагрузкаСТСДИгнорируемыеШтрихкоды.Ссылка.Номер,
		            |	ЗагрузкаСТСДИгнорируемыеШтрихкоды.Ссылка
		            |ИЗ
		            |	Документ.ЗагрузкаСТСД.ИгнорируемыеШтрихкоды КАК ЗагрузкаСТСДИгнорируемыеШтрихкоды
		            |ГДЕ
		            |	ЗагрузкаСТСДИгнорируемыеШтрихкоды.Штрихкод ПОДОБНО &Штрихкод
		            |;
		            |
		            |////////////////////////////////////////////////////////////////////////////////
		            |ВЫБРАТЬ
		            |	втНайденныеДокументы.Номер КАК Номер
		            |ИЗ
		            |	втНайденныеДокументы КАК втНайденныеДокументы
		            |
		            |СГРУППИРОВАТЬ ПО
		            |	втНайденныеДокументы.Ссылка,
		            |	втНайденныеДокументы.Номер";
		//+Степанов Задача № 3787
		Зап.УстановитьПараметр("Штрихкод", "%" + СокрЛП(Штрихкод) + "%");
		
		Рез = Зап.Выполнить().Выбрать();;
		Мас = Новый Массив;
		Если Рез.Количество() = 0 Тогда
			ОчиститьПоиск(Неопределено);
		Иначе
			Пока Рез.Следующий() Цикл
				Мас.Добавить(Рез.Номер);
			КонецЦикла;	
		ИП = "Номер";
		ПЗ = Мас;
		Исп = Истина;
		ОбщегоНазначенияКлиентСервер83.УстановитьЭлементОтбора(Список.Отбор,
								ИП,
								ПЗ,
								,
								,
								Исп,
								,
								);
		КонецеСли;	
	Иначе
		ОчиститьПоиск(Неопределено);
	КонецеСли;
КонецПроцедуры


&НаСервереБезКонтекста
Процедура СнятьРежимЗагрузкиНаСервере()
	Константы.ФлагЗагрузкиДанныхСТСД.Установить(Ложь);	
КонецПроцедуры


&НаКлиенте
Процедура СнятьРежимЗагрузки(Команда)
	СнятьРежимЗагрузкиНаСервере();
КонецПроцедуры


&НаСервереБезКонтекста
Процедура СнятьРежимЗагрузки_v3НаСервере()
	Константы.ФлагЗагрузкиДанныхСТСД_V3.Установить(Ложь);
КонецПроцедуры


&НаКлиенте
Процедура СнятьРежимЗагрузки_v3(Команда)
	//СнятьРежимЗагрузки_v3НаСервере();
	СписокСерверовОбменаСВзведеннымиФлагамиОбмена = ПолучитьСписокСерверовОбменаТСДСУстановленнымФлагом();
	Если СписокСерверовОбменаСВзведеннымиФлагамиОбмена = Неопределено Тогда
		Сообщить("Нет серверов обмена с взведенными флагами обмена!!!", СтатусСообщения.ОченьВажное);
		Возврат;
	КонецеСли;
	
	ВыбранныйСервер = СписокСерверовОбменаСВзведеннымиФлагамиОбмена.ВыбратьЭлемент("Сервер обмена V3");
	Если ВыбранныйСервер <> Неопределено Тогда
		РаботаСТСДСервер.УстановитьФлагЗагрузкиСТСД(ВыбранныйСервер.Значение, Ложь);
	КонецеСли;	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокСерверовОбменаТСДСУстановленнымФлагом()
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	ПараметрыРегламентныхЗаданий.Ключ КАК Наименование
	            |ИЗ
	            |	РегистрСведений.ПараметрыРегламентныхЗаданий КАК ПараметрыРегламентныхЗаданий
	            |ГДЕ
	            |	ПараметрыРегламентныхЗаданий.Ключ ПОДОБНО &Парам
	            |	И ПараметрыРегламентныхЗаданий.Значение = ""1""
	            |
	            |УПОРЯДОЧИТЬ ПО
	            |	Наименование";
	Зап.УстановитьПараметр("Парам", "ФлагЗагрузкиТСД__%");
	
	Сп = Новый СписокЗначений;
	Рез = Зап.Выполнить();
	Если Рез.Пустой() Тогда
		Возврат Неопределено;
	КонецеСли;
	
	Выб = Рез.Выбрать();
	Пока Выб.Следующий() Цикл
		СобрНаим = СтрЗаменить(Выб.Наименование, "__", Символы.ПС);
		СО = Справочники.СерверыОбменаСТСД.НайтиПоКоду(СтрПолучитьСтроку(СобрНаим, 2));
		Сп.Добавить(СО.Ссылка, СО.Наименование);
	КонецЦикла;	
	
	Возврат Сп;
КонецФункции	


&НаКлиенте
Процедура ПериодОтбораАктивныхТСДПриИзменении(Элемент)
	СписокАктивныхТСД.Параметры.УстановитьЗначениеПараметра("ДатаНачала", ПериодОтбораАктивныхТСД.ДатаНачала);
	СписокАктивныхТСД.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", ПериодОтбораАктивныхТСД.ДатаОкончания);
	Элементы.СписокАктивныхТСД.Обновить();
	
	СписокТСДПоТерминалам.Параметры.УстановитьЗначениеПараметра("ДатаНачала", ПериодОтбораАктивныхТСД.ДатаНачала);
	СписокТСДПоТерминалам.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", ПериодОтбораАктивныхТСД.ДатаОкончания);
	Элементы.СписокТСДПоТерминалам.Обновить();
	
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьСписокАктивныхТСД(Команда)
	// Вставить содержимое обработчика.
	Элементы.ФормаОткрытьСписокАктивныхТСД.Пометка = Не Элементы.ФормаОткрытьСписокАктивныхТСД.Пометка;
	Элементы.ГруппаСписокТСД.Видимость = Элементы.ФормаОткрытьСписокАктивныхТСД.Пометка;
КонецПроцедуры


&НаКлиенте
Процедура ТолькоНовыеТСДПриИзменении(Элемент)
	Если ТолькоНовыеТСД Тогда
		ИП = "СерверТСД";
		ПЗ = Справочники.СерверыWiFiТСД.СерверСканирования;
		//Справочники.СерверыWiFiТСД.ПустаяСсылка();
		Исп = Истина;
		ОбщегоНазначенияКлиентСервер83.УстановитьЭлементОтбора(Список.Отбор,
								ИП,
								ПЗ,
								,
								,
								Исп,
								,
								);
	Иначе	
		ИП = "СерверТСД";
		ПЗ = "";
		Исп = Ложь;
		//ВидСравненияП = ВидСравнения.НеРавно;
		ОбщегоНазначенияКлиентСервер83.УстановитьЭлементОтбора(Список.Отбор,
								ИП,
								ПЗ,
								,
								,
								Исп,
								,
								);
	КонецЕСли;	
	
	ТекущийЭлемент = Элементы.Список;
	Shell = Новый COMОбъект("WScript.Shell");
	Shell.SendKeys("^{END}");	
КонецПроцедуры

