
Функция СформироватьОтправитьПоПочте(Период, Сумма) Экспорт
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	СтруктураВариантов = Новый Структура;
	пВарианты = СхемаКомпоновкиДанных.ВариантыНастроек;
	Для Каждого пЭл ИЗ пВарианты Цикл
		СтруктураВариантов.Вставить(пЭл.Имя,пЭл.Настройки);
	КонецЦикла;
	КомпоновщикНастроек.ЗагрузитьНастройки(СтруктураВариантов.Основной);
	
	КомпоновщикНастроек.Настройки.параметрыданных.Элементы[2].Значение = Период;
	КомпоновщикНастроек.Настройки.параметрыданных.Элементы[2].использование = Истина;
	
	КомпоновщикНастроек.Настройки.отбор.элементы[0].ПравоеЗначение = Сумма;
	КомпоновщикНастроек.Настройки.отбор.элементы[0].ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	КомпоновщикНастроек.Настройки.отбор.элементы[0].Использование = Истина;
	
	Настройки = КомпоновщикНастроек.Настройки;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,Настройки);	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,,, Истина);
	
	Результат = Новый ТабличныйДокумент;
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);
	//ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	ЕстьДанные = Ложь;
	
	ПроцессорВывода.НачатьВывод();
	
	//Обл = Результат.Область("R7:R12");
	//ДокументРезультат.ПовторятьПриПечатиСтроки = Обл;
	//
	//ДокументРезультат.РазборПоКопиям = РазобратьПоКопиям;
	//ДокументРезультат.Автомасштаб = истина;
	
	ЭлементРезультата = ПроцессорКомпоновкиДанных.Следующий();

	Пока ЭлементРезультата <> Неопределено Цикл
		Если ЭлементРезультата.ЗначенияПараметров.Количество()=1 Тогда
		//	Если ЭлементРезультата.ЗначенияПараметров[0].Значение = "Разорвать" Тогда
		//		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
		//	КонецЕсли;
		    Если ЗначениеЗаполнено(ЭлементРезультата.ЗначенияПараметров[0].Значение) Тогда
				ЕстьДанные = Истина;
			КонецеСли;	
		КонецЕсли;
		ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
		ЭлементРезультата = ПроцессорКомпоновкиДанных.Следующий();
		//ТипЭлементаРезультатаКомпоновкиДанных.
		
	КонецЦикла;
	ПроцессорВывода.ЗакончитьВывод();
	
	Если ЕстьДанные Тогда
		Возврат Результат;
	Иначе
		Возврат Неопределено;
	КонецеСли;	
КонецФункции	
