
&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураТовара = Новый Структура("Номенклатура,КодМаркировки,Цена,Количество,Сумма");
	ЗаполнитьЗначенияСвойств(СтруктураТовара, Элемент.ТекущиеДанные);
	
	Закрыть(СтруктураТовара);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТоварыКДобавлению = Параметры.ТоварыКДобавлению;
	Для Каждого СтруктураТовара Из ТоварыКДобавлению Цикл
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), СтруктураТовара);
	КонецЦикла;
	
КонецПроцедуры
