#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТипАдресаВозвращения = 1;
	УстановкаВидимостиИДоступностиЭлементовФормы();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, "ВыбранныйРейс, ВыбранноеВремя, ДанныеТекущейТочки");
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ТипАдресаВозвращенияПриИзменении(Элемент)
	УстановкаВидимостиИДоступностиЭлементовФормы();
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	Сообщение = Новый СообщениеПользователю();
	Если ТипАдресаВозвращения = 0 Тогда
		Сообщение.Поле = Элементы.ТипАдресаВозвращения;
		Сообщение.Текст = "Выберите точку возвращения!";
		Сообщение.Сообщить();
	ИначеЕсли ТипАдресаВозвращения = 3 И ПустаяСтрока(СтрокаАдреса) Тогда
		Сообщение.Поле = Элементы.СтрокаАдреса;
		Сообщение.Текст = "Укажите адрес!";
		Сообщение.Сообщить();
	ИначеЕсли ТипАдресаВозвращения = 3 И (ПустаяСтрока(Широта) Или ПустаяСтрока(Долгота)) Тогда
		Сообщение.Текст = "Адрес не распознан!";
		Сообщение.Сообщить();
		Возврат;
	Иначе	
		ПараметрОтвета = Новый Структура;
		ПараметрыФинальнойТочкиМаршрута = Новый Структура;
		
		ПараметрыФинальнойТочкиМаршрута.Вставить("ТипАдреса", ТипАдресаВозвращения);
		ПараметрыФинальнойТочкиМаршрута.Вставить("Широта", Широта);
		ПараметрыФинальнойТочкиМаршрута.Вставить("Долгота", Долгота);
		ПараметрыФинальнойТочкиМаршрута.Вставить("РаспознанныйАдрес", РаспознанныйАдрес);
		ПараметрыФинальнойТочкиМаршрута.Вставить("ШиротаДолгота", СтрЗаменить(СокРЛП(Широта) + ";" + СокрЛП(Долгота), ",", "."));

		
		ПараметрОтвета.Вставить("ФинальнаяТочкаМаршрута", ПараметрыФинальнойТочкиМаршрута);
		ПараметрОтвета.Вставить("ВыбранныйРейс", ВыбранныйРейс);
		ПараметрОтвета.Вставить("ВыбранноеВремя", ВыбранноеВремя);
		ПараметрОтвета.Вставить("ДанныеТекущейТочки", ДанныеТекущейТочки);
		
		Закрыть(ПараметрОтвета);
	КонецеСли;	
КонецПроцедуры

&НаКлиенте
Процедура РаспознатьАдрес(Команда)
	РаспознатьАдресНаСервере(СтрокаАдреса);
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура УстановкаВидимостиИДоступностиЭлементовФормы()
	Если ТипАдресаВозвращения = 3 Тогда
		Элементы.ГруппаСтрокиАдреса.Доступность = Истина;
		Если ЗначениеЗаполнено(Широта) И ЗначениеЗаполнено(Долгота) Тогда
			Элементы.РаспознанныйАдрес.Видимость = Истина;
		КонецЕсли;	
	Иначе
		Элементы.ГруппаСтрокиАдреса.Доступность = Ложь;
	КонецеСли;		
КонецПроцедуры	

&НаСервере
Процедура РаспознатьАдресНаСервере(СтрокаАдреса)
	ОтветМетода = ПроцедурыОбменаСЦУ.ВыполнитьОбмен_РаспознатьАдрес(, СтрокаАдреса);
	Если ОтветМетода.РезультатВызова Тогда
		Широта = ОтветМетода.Широта;
		Долгота = ОтветМетода.Долгота;
		РаспознанныйАдрес = ОтветМетода.РаспознанныйАдрес;
		Элементы.РаспознанныйАдрес.ЦветФона = WebЦвета.БледноЗеленый;
		Элементы.РаспознанныйАдрес.Видимость = Истина;		
	Иначе
		Широта = "";
		Долгота = "";
		РаспознанныйАдрес = "Адрес не распознан!";
		Элементы.РаспознанныйАдрес.ЦветФона = WebЦвета.ЛососьСветлый;
		Элементы.РаспознанныйАдрес.Видимость = Истина;
	КонецеСли;
КонецПроцедуры

#КонецОбласти


