
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	АдресаАбонентовПолученияУведомлений.АдресEmail КАК Почта,
	               |	ЛОЖЬ КАК Галка
	               |ИЗ
	               |	РегистрСведений.АдресаАбонентовПолученияУведомлений КАК АдресаАбонентовПолученияУведомлений";
	
	Почта.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьНажатие(Команда)
	
	Если Объект.Режим = 1 Тогда
		ТекстВопроса = "Производится установка режима тестовой БД. Продолжить?";
	ИначеЕсли Объект.Режим = 2 Тогда
		ТекстВопроса = "Производится очистка настроек БД. Продолжить?" ;
	Иначе 
		ТекстВопроса = "Выбран режим Рабочей базы. Действия не будут произведены.";
	КонецЕсли;	
	
	Если Объект.Режим = 1 или Объект.Режиим = 2 Тогда
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос(ТекстВопроса, Режим, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
    		Возврат;
		КонецЕсли; 
			
		ВыполнитьНаСервере();
		
	Иначе 
		
		ПоказатьПредупреждение(ТекстВопроса,, 60);
		
	КонецЕсли;	
		
		
		
КонецПроцедуры
