
//**** Обработчики событий объекта ****//

//Синхронизация с КСЛ
//
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	Конецесли;
	
	Попытка
		новаОбменКСЛ.СохранитьУлицу(ЭтотОбъект);
	Исключение
		#Если Клиент Тогда			
			новаОбщиеПроцедуры.СообщитьПользователюОбОшибке("ВнутренняОшибкаСервера", ОписаниеОшибки());
		#КонецЕсли
		Отказ = Истина;
	КонецПопытки;
	
КонецПроцедуры

//Синхронизация с КСЛ
//
Процедура ПередУдалением(Отказ)
	
	Попытка
		новаОбменКСЛ.УдалитьУлицу(ЭтотОбъект);
	Исключение
		#Если Клиент Тогда			
			новаОбщиеПроцедуры.СообщитьПользователюОбОшибке("ВнутренняОшибкаСервера", ОписаниеОшибки());
		#КонецЕсли
		Отказ = Истина;
	КонецПопытки;
	
КонецПроцедуры

//Установка полного наименования
//
Процедура ПередЗаписью(Отказ)
	
	НаименованиеПолное = СокрЛП(Наименование) + ?(ЗначениеЗаполнено(Вид), " " + СокрЛП(Вид), "");
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	Конецесли;
	
КонецПроцедуры
