
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ВводДанныхОРасходахКомпании
	Движения.ВводДанныхОРасходахКомпании.Записывать = Истина;
	Движения.ВводДанныхОРасходахКомпании.Очистить();
	Для Каждого ТекСтрокаСтатьиЗатрат Из СтатьиЗатрат Цикл
		Движение = Движения.ВводДанныхОРасходахКомпании.Добавить();
		Движение.Период = Дата;
		Движение.Партнер = Партнер;
		Движение.СтатьяЗатрат = ТекСтрокаСтатьиЗатрат.СтатьяЗатрат;
		Движение.ТипЗатрат = ТекСтрокаСтатьиЗатрат.СтатьяЗатрат.ТипЗатрат; 
		Движение.ВидЗатрат = Перечисления.ВидыЗатратКомпании.ПрямыеРасходы;
		Движение.КатегорияДоставки = ТекСтрокаСтатьиЗатрат.КатегорияДоставки;
		Движение.ТипЗаказа = ТекСтрокаСтатьиЗатрат.ТипЗаказа;
		Движение.Сумма = ТекСтрокаСтатьиЗатрат.Сумма;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
