
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр мгТарифыОсновныхНачислений
	Движения.мгТарифыОсновныхНачислений.Записывать = Истина;
	Движения.мгТарифыОсновныхНачислений.Очистить();
	Для Каждого ТекСтрокаСписокТарифовДоставкаЗабор Из СписокТарифовДоставкаЗабор Цикл
		Движение = Движения.мгТарифыОсновныхНачислений.Добавить();
		Движение.Период = Дата;
		Движение.Регион = Регион;
		Движение.ТипЗаказа = ТекСтрокаСписокТарифовДоставкаЗабор.ТипЗаказа;
		Движение.КатегорияЗаказа = ТекСтрокаСписокТарифовДоставкаЗабор.КатегорияЗаказа;
		Движение.Территориальность = ТекСтрокаСписокТарифовДоставкаЗабор.Территориальность;
		Движение.ВидТарифа = ТекСтрокаСписокТарифовДоставкаЗабор.ВидТарифа;
		Движение.Значение = ТекСтрокаСписокТарифовДоставкаЗабор.Значение;
	КонецЦикла;

	// регистр мгТарифыФрахт
	Движения.мгТарифыФрахт.Записывать = Истина;
	Движения.мгТарифыФрахт.Очистить();
	Для Каждого ТекСтрокаСписокТарифовФрахт Из СписокТарифовФрахт Цикл
		Движение = Движения.мгТарифыФрахт.Добавить();
		Движение.Период = Дата;
		Движение.Условие = ТекСтрокаСписокТарифовФрахт.Условие;
		Движение.Значение = ТекСтрокаСписокТарифовФрахт.Значение;
	КонецЦикла;

	//// регистр мгТарифыПодъем
	//Движения.мгТарифыПодъем.Записывать = Истина;
	//Движения.мгТарифыПодъем.Очистить();
	//Для Каждого ТекСтрокаСписокТарифовЗаПодьемы Из СписокТарифовЗаПодьемы Цикл
	//	Движение = Движения.мгТарифыПодъем.Добавить();
	//	Движение.Период = Дата;
	//	Движение.ВесоваяКатегория = ТекСтрокаСписокТарифовЗаПодьемы.ВесоваяКатегория;
	//	Движение.ВидПодъема = ТекСтрокаСписокТарифовЗаПодьемы.ВидПодъема;
	//	Движение.Тариф = ТекСтрокаСписокТарифовЗаПодьемы.Тариф;
	//КонецЦикла;

	// регистр мгТарифыПоКонтрагентам
	Движения.мгТарифыПоКонтрагентам.Записывать = Истина;
	Движения.мгТарифыПоКонтрагентам.Очистить();
	Для каждого ТекСтрокаСписокТарифовПоКонтрагентам Из СписокТарифовПоКонтрагентам Цикл
		Движение = Движения.мгТарифыПоКонтрагентам.Добавить();
		Движение.Период = Дата;
		Движение.Контрагент = ТекСтрокаСписокТарифовПоКонтрагентам.Магазин;
		Движение.Тариф = ТекСтрокаСписокТарифовПоКонтрагентам.Тариф;
	КонецЦикла;
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
