
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ДвиженияПоРСЗаказыУдаленногоЗакрытияНаСкладе();
КонецПроцедуры

Процедура ДвиженияПоРСЗаказыУдаленногоЗакрытияНаСкладе()
	Движения.СостояниеЗаказовНаСкладеПриУдаленномЗакрытии.Очистить();
	Движения.СостояниеЗаказовНаСкладеПриУдаленномЗакрытии.Записывать = Истина;
	
	
	Зап = Новый Запрос;
	
	Зап.Текст = "ВЫБРАТЬ
	            |	ПривязкаМашинКРейсам.Транспорт КАК Транспорт,
	            |	МАКСИМУМ(ПривязкаМашинКРейсам.Период) КАК Период
	            |ПОМЕСТИТЬ ВТ_СрезТранспортПоРейсам
	            |ИЗ
	            |	РегистрСведений.ПривязкаМашинКРейсам КАК ПривязкаМашинКРейсам
	            |ГДЕ
	            |	ПривязкаМашинКРейсам.Период МЕЖДУ &ДатаНач И &ДатаКон
	            |	И ПривязкаМашинКРейсам.Транспорт = &Транспорт
	            |	И ПривязкаМашинКРейсам.Рейс.ДатаРейса = НАЧАЛОПЕРИОДА(&ДатаКон, ДЕНЬ)
	            |
	            |СГРУППИРОВАТЬ ПО
	            |	ПривязкаМашинКРейсам.Транспорт
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	ПривязкаМашинКРейсамСрезПоследних.Рейс КАК Рейс,
	            |	ПривязкаМашинКРейсамСрезПоследних.Транспорт КАК Транспорт,
	            |	ПривязкаМашинКРейсамСрезПоследних.Водитель КАК Водитель,
	            |	ВТ_СрезТранспортПоРейсам.Период КАК Период
	            |ИЗ
	            |	ВТ_СрезТранспортПоРейсам КАК ВТ_СрезТранспортПоРейсам
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних(, ) КАК ПривязкаМашинКРейсамСрезПоследних
	            |		ПО ВТ_СрезТранспортПоРейсам.Транспорт.Ссылка = ПривязкаМашинКРейсамСрезПоследних.Транспорт.Ссылка
	            |			И ВТ_СрезТранспортПоРейсам.Период = ПривязкаМашинКРейсамСрезПоследних.Период";
	Зап.УстановитьПараметр("ДатаНач", НачалоДня(ДатаРейса - 86400));
	Зап.УстановитьПараметр("ДатаКон", КонецДня(ДатаРейса));
	Зап.УстановитьПараметр("Транспорт", Транспорт);
	
	ВыбРейс = Зап.Выполнить().Выбрать();
	ВыбРейс.Следующий();
	
	
	Зап.Текст = "ВЫБРАТЬ
	            |	ОтчетПоТоварамМПТовары.Заказ КАК Заказ
	            |ИЗ
	            |	Документ.ОтчетПоТоварамМП.Товары КАК ОтчетПоТоварамМПТовары
	            |ГДЕ
	            |	ОтчетПоТоварамМПТовары.Ссылка.Ссылка = &Док
	            |
	            |СГРУППИРОВАТЬ ПО
	            |	ОтчетПоТоварамМПТовары.Заказ";
	Зап.УстановитьПараметр("Док", Ссылка);
	
	ВыбЗаказы = Зап.Выполнить().Выбрать();
	
	
	Пока ВыбЗаказы.Следующий() Цикл
		Нов = Движения.СостояниеЗаказовНаСкладеПриУдаленномЗакрытии.Добавить();
		ЗаполнитьЗначенияСвойств(Нов, ВыбРейс, "Рейс, Транспорт, Водитель");
		Нов.Период = Дата;
		Нов.Заказ = ВыбЗаказы.Заказ;
	КонецЦикла;	
КонецПроцедуры	