Процедура ПередВыполнением(Отказ)
	новаУправлениеТранспортнойЛогистикой.ЗаполнитьАвтораИДатуВыполненияЗадачи(ЭтотОбъект);
	если Роль = Справочники.новаЭтапыМестнойДоставки.ЗавершениеПланирования Тогда
		
		Зап = Новый Запрос;
		
		Зап.Текст = "ВЫБРАТЬ
		            |	новаЗадачаРейсаМестнойДоставки.Ссылка
		            |ИЗ
		            |	Задача.новаЗадачаРейсаМестнойДоставки КАК новаЗадачаРейсаМестнойДоставки
		            |ГДЕ
		            |	новаЗадачаРейсаМестнойДоставки.Выполнена = ЛОЖЬ
		            |	И новаЗадачаРейсаМестнойДоставки.Роль = &ВыбЭтап
		            |	И новаЗадачаРейсаМестнойДоставки.БизнесПроцесс.ДатаНачала < &ДатаНачала";
		Зап.УстановитьПараметр("ВыбЭтап", Справочники.новаЭтапыМестнойДоставки.ЗавершениеМестнойДоставки);
		Зап.УстановитьПараметр("ДатаНачала", НачалоДня(БизнесПроцесс.ДатаНачала));
		
		Рез = Зап.Выполнить();			
		Если Не Рез.Пустой() Тогда
			#Если Клиент Тогда  
				Сообщить("Имеются прошлые незавершенные рейсы!", СтатусСообщения.Внимание);
			#КонецЕсли
		    Отказ = истина;
			Возврат;
		КонецеСли;	
		
	КонецеСли;	
КонецПроцедуры
