
&НаСервере
Процедура ЗарегистрироватьИзмененияПоТранспортуНаСервере()
	ПланыОбмена.ЗарегистрироватьИзменения(Объект.Ссылка, Метаданные.Справочники.новаТранспорт);
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьИзмененияПоТранспорту(Команда)
	ЗарегистрироватьИзмененияПоТранспортуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДерегистрироватьИзмененияПоТранспортуНаСервере()
	ПланыОбмена.УдалитьРегистрациюИзменений(Объект.Ссылка, Метаданные.Справочники.новаТранспорт);
КонецПроцедуры

&НаКлиенте
Процедура ДерегистрироватьИзмененияПоТранспорту(Команда)
	ДерегистрироватьИзмененияПоТранспортуНаСервере();
КонецПроцедуры
