
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ксЧекККМ.Ссылка КАК Чек
	               |ИЗ
	               |	Документ.ксЧекККМ КАК ксЧекККМ
	               |ГДЕ
	               |	ксЧекККМ.ЧекКПечати = &ЧекКПечати";
	Запрос.УстановитьПараметр("ЧекКПечати", Объект.Ссылка);
	
	Выб = Запрос.Выполнить().Выбрать();
	
	Если Выб.Следующий() Тогда
		Чек = Выб.Чек;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЧекНажатие(Элемент, СтандартнаяОбработка)
	//Если Не 
	//Парам = Новый Структура;
	//Парам.Вставить("Ключ", Чек.Ссылка);
	//ОткрытьФорму("Документ.ксЧекККМ.ФормаОбъекта", 
КонецПроцедуры
