
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	
	
	//   -----------------  РС ПозицииКВозврату  ----------------------
	
	Запрос = новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ПередачаЗаказовНаВозвратЗаказыНеПоМестам.Заказ КАК Заказ
	                      |ПОМЕСТИТЬ ВТ_Заказы
	                      |ИЗ
	                      |	Документ.ПередачаЗаказовНаВозврат.ЗаказыНеПоМестам КАК ПередачаЗаказовНаВозвратЗаказыНеПоМестам
	                      |ГДЕ
	                      |	ПередачаЗаказовНаВозвратЗаказыНеПоМестам.Ссылка = &Ссылка
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ПередачаЗаказовНаВозвратЗаказыНеПоМестам.Заказ
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ПередачаЗаказовНаВозвратЗаказыПоМестам.Заказ
	                      |ИЗ
	                      |	Документ.ПередачаЗаказовНаВозврат.ЗаказыПоМестам КАК ПередачаЗаказовНаВозвратЗаказыПоМестам
	                      |ГДЕ
	                      |	ПередачаЗаказовНаВозвратЗаказыПоМестам.Ссылка = &Ссылка
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ПередачаЗаказовНаВозвратЗаказыПоМестам.Заказ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_Заказы.Заказ КАК Заказ,
	                      |	ВТ_Заказы.Заказ.ВладелецТовара КАК ИнтернетМагазин,
	                      |	ВТ_Заказы.Заказ.ТерминалПриема КАК ТерминалПриема,
	                      |	ВТ_Заказы.Заказ.КоличествоМест КАК КоличествоМест,
	                      |	ВЫБОР
	                      |		КОГДА ВТ_Заказы.Заказ.ТерминалПриема <> ВТ_Заказы.Заказ.ТерминалДоставки
	                      |			ТОГДА ИСТИНА
	                      |		ИНАЧЕ ЛОЖЬ
	                      |	КОНЕЦ КАК Магистраль,
	                      |	ВТ_Заказы.Заказ.ТерминалДоставки КАК ТерминалДоставки
	                      |ИЗ
	                      |	ВТ_Заказы КАК ВТ_Заказы");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезТЗ = Запрос.Выполнить().Выгрузить();
	
	Если РезТЗ.Количество() Тогда
	
		Набор = РегистрыСведений.ПозицииКВозврату.СоздатьНаборЗаписей();	
	    Набор.Отбор.ДокументИсточник.Установить(Ссылка);	
	    Набор.Прочитать();
		Набор.Очистить();
		
		Для каждого Стр Из РезТЗ Цикл
			
			НЗапись = Набор.Добавить();		
			ЗаполнитьЗначенияСвойств(НЗапись, Стр);		
			НЗапись.ДокументИсточник = Ссылка;
			НЗапись.Вскрытый = Ложь;
			НЗапись.ПериодОбработки = Дата;		
					
			//Набор.Отбор.Заказ.Установить(Стр.Заказ);
			//Набор.Прочитать();
			
			//Если Набор.Количество() Тогда		
			//	// Что-то не так	
			//	Продолжить;
			//Иначе			
				//НЗапись = Набор.Добавить();			
				//ЗаполнитьЗначенияСвойств(НЗапись, Стр);		
				//НЗапись.ДокументИсточник = Ссылка;
				//НЗапись.Вскрытый = Ложь;
				//НЗапись.ПериодОбработки = Дата;			
			//КонецЕсли;
		КонецЦикла;
		
		Набор.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
	
		// Проверки на полностью собранные заказы
		ТекстНеполностьюСобранные = "Присутствуют неполностью собранные заказы: ";
		ЕстьНеполностьюСобранные = Ложь;
		
		Для каждого Ст Из ЗаказыНеПоМестам Цикл		
			Если Ст.КоличествоМест <> Ст.МестСобрано Тогда
				ЕстьНеполностьюСобранные = Истина;	
				ТекстНеполностьюСобранные = ТекстНеполностьюСобранные + Символы.ПС + СокрЛП(Ст.Заказ.Номер);
				Отказ = Истина;
			КонецЕсли;		
		КонецЦикла;
		
		Для каждого Ст Из ЗаказыПоМестам Цикл		
			Если НЕ Ст.Собрано Тогда
				ЕстьНеполностьюСобранные = Истина;	
				ТекстНеполностьюСобранные = ТекстНеполностьюСобранные + Символы.ПС + СокрЛП(Ст.Заказ.Номер);
				Отказ = Истина;
			КонецЕсли;	
		КонецЦикла;
		
		Если Отказ И ЕстьНеполностьюСобранные Тогда	
			Сообщить(ТекстНеполностьюСобранные);		
		КонецЕсли;
		
	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда	
		
		// РС ПозицииКВозврату - удаление записей по документу
		Набор = РегистрыСведений.ПозицииКВозврату.СоздатьНаборЗаписей();
		Набор.Отбор.ДокументИсточник.Установить(Ссылка);
		Набор.Прочитать();
		Набор.Очистить();
		Набор.Записать();
	
		//Сообщить("Запрещена отмена проведения");
		//Отказ = Истина;
		
	КонецЕсли;	
	
	
КонецПроцедуры

