
//Асеев 20.03.2023 (Задача № 5015)>>>
Функция ПроверитьОсновныеНачисленияЭкипажа(Знач Водитель, Знач Экспедитор) Экспорт
	
	//Возврат Истина;//отключение проверки
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Водитель", Водитель);
	Если Экспедитор = Справочники.новаЭкспедиторы.ПустаяСсылка() Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ИСТИНА КАК ЭтоВодитель
		|ИЗ
		|	(ВЫБРАТЬ
		|		ИСТИНА КАК Поле1) КАК ВЗ_Связь
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ ПЕРВЫЕ 1
		|			РаботникиОрганизации.ОсновноеНачисление КАК ОсновноеНачисление
		|		ИЗ
		|			РегистрСведений.РаботникиОрганизации КАК РаботникиОрганизации
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.новаВодители КАК новаВодители
		|				ПО (новаВодители.Ссылка = &Водитель)
		|					И РаботникиОрганизации.ФизЛицо = новаВодители.ФизЛицо
		|					И (РаботникиОрганизации.Состояние = ЗНАЧЕНИЕ(Перечисление.СостояниеРаботникаОрганизации.ПринятНаРаботуВОрганизацию))
		|		
		|		УПОРЯДОЧИТЬ ПО
		|			РаботникиОрганизации.Период УБЫВ) КАК ВЗ_ОсновноеНачисление
		|		ПО (ВЗ_ОсновноеНачисление.ОсновноеНачисление <> ЗНАЧЕНИЕ(Справочник.зпНачисления.ПустаяСсылка))
		|ГДЕ
		|	ВЗ_ОсновноеНачисление.ОсновноеНачисление ЕСТЬ NULL";
	Иначе
		Запрос.УстановитьПараметр("Экспедитор", Экспедитор);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ИСТИНА КАК ЭтоВодитель
		|ИЗ
		|	(ВЫБРАТЬ
		|		ИСТИНА КАК Поле1) КАК ВЗ_Связь
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ ПЕРВЫЕ 1
		|			РаботникиОрганизации.ОсновноеНачисление КАК ОсновноеНачисление
		|		ИЗ
		|			РегистрСведений.РаботникиОрганизации КАК РаботникиОрганизации
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.новаВодители КАК новаВодители
		|				ПО (новаВодители.Ссылка = &Водитель)
		|					И РаботникиОрганизации.ФизЛицо = новаВодители.ФизЛицо
		|					И (РаботникиОрганизации.Состояние = ЗНАЧЕНИЕ(Перечисление.СостояниеРаботникаОрганизации.ПринятНаРаботуВОрганизацию))
		|		
		|		УПОРЯДОЧИТЬ ПО
		|			РаботникиОрганизации.Период УБЫВ) КАК ВЗ_ОсновноеНачисление
		|		ПО (ВЗ_ОсновноеНачисление.ОсновноеНачисление <> ЗНАЧЕНИЕ(Справочник.зпНачисления.ПустаяСсылка))
		|ГДЕ
		|	ВЗ_ОсновноеНачисление.ОсновноеНачисление ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛОЖЬ
		|ИЗ
		|	(ВЫБРАТЬ
		|		ИСТИНА КАК Поле1) КАК ВЗ_Связь
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ ПЕРВЫЕ 1
		|			РаботникиОрганизации.ОсновноеНачисление КАК ОсновноеНачисление
		|		ИЗ
		|			РегистрСведений.РаботникиОрганизации КАК РаботникиОрганизации
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.новаЭкспедиторы КАК новаЭкспедиторы
		|				ПО (новаЭкспедиторы.Ссылка = &Экспедитор)
		|					И РаботникиОрганизации.ФизЛицо = новаЭкспедиторы.ФизЛицо
		|					И (РаботникиОрганизации.Состояние = ЗНАЧЕНИЕ(Перечисление.СостояниеРаботникаОрганизации.ПринятНаРаботуВОрганизацию))
		|		
		|		УПОРЯДОЧИТЬ ПО
		|			РаботникиОрганизации.Период УБЫВ) КАК ВЗ_ОсновноеНачисление
		|		ПО (ВЗ_ОсновноеНачисление.ОсновноеНачисление <> ЗНАЧЕНИЕ(Справочник.зпНачисления.ПустаяСсылка))
		|ГДЕ
		|	ВЗ_ОсновноеНачисление.ОсновноеНачисление ЕСТЬ NULL";
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Истина;
	Иначе
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Сообщить(?(Выборка.ЭтоВодитель, "Для водителя " + Водитель, "Для экспедитора " + Экспедитор) + " не задано Основное начисление для целей расчета з/п");
		КонецЦикла;
		Возврат Ложь;
	КонецЕсли;
КонецФункции
//Асеев 20.03.2023 (Задача № 5015)<<<