
// Устанавливает в параметрах сеанса текущего пользователя
//
Процедура УстановитьТекущегоПользователя() Экспорт
	
	ИмяТекущегоПользователя = ИмяПользователя();
	ИмяТекущегоПользователя = ?(не ПустаяСтрока(ИмяТекущегоПользователя), ИмяТекущегоПользователя, "Не авторизован");
	
	ТекущийПользователь = Справочники.новаПользователи.НайтиПоНаименованию(ИмяТекущегоПользователя, Истина);
	Если Не ЗначениеЗаполнено(ТекущийПользователь) Тогда
		обПользователь = Справочники.новаПользователи.СоздатьЭлемент();
		обПользователь.Наименование = ИмяТекущегоПользователя;
		обПользователь.Записать();
		ТекущийПользователь = обПользователь.Ссылка;
		Сообщить("Создан пользователь " + СокрЛП(обПользователь.Наименование));
	КонецЕсли;
	
	ПараметрыСеанса.новаТекущийПользователь = ТекущийПользователь;
КонецПроцедуры

// Устанавливает параметры сеанса подсистемы "Управление доставкой"
//
Процедура УстановитьПараметрыСеанса() Экспорт
	УстановитьТекущегоПользователя();
КонецПроцедуры

// Заполняет значения по умолчанию в документах подсистемы "Управление доставкой"
//
// Параметры:
//  Объект <ДокументОбъект>
//
Процедура ЗаполнитьДокументПоУмолчанию(Объект) Экспорт
	мдОбъект = Объект.Метаданные();
	
	Если мдОбъект.Реквизиты.Найти("Ответственные") <> Неопределено Тогда
		Объект.Ответственный = ПараметрыСеанса.новаТекущийПользователь;
	КонецЕсли;
КонецПроцедуры
