
&НаКлиенте
Процедура ВвестиДокументПриход(Команда)
	// Вставить содержимое обработчика.
	ОткрытьФорму("Документ.Сканирование.Форма.ФормаДокумента");
КонецПроцедуры

&НаСервере
Процедура УстановитьДатуПоследнегоОбменаНаСервере()
	ДатаПоследнегоОбмена = Константы.ДатаВремяПоследнегоОбмена.Получить();
конецПроцедуры	

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновитьСписокСканирования" Тогда
		Элементы.Список.Обновить();
		УстановитьДатуПоследнегоОбменаНаСервере();
		//ОбновитьОтображениеДанных(Элементы.ДатаПоследнегоОбмена);   //Элементы.ДатаПоследнегоОбмена
	КонецеСли;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьДатуПоследнегоОбменаНаСервере();
	НомерТСД = Константы.НомерТСД.Получить();
	НадписьВерсия = Метаданные.Версия;
	ОбщегоНазначенияСервер.ОчиститьДанныеВРСПоСтарымОшибкамОбмена();
КонецПроцедуры

&НаСервере
Функция СписокВыборНаСервере()
	// Вставить содержимое обработчика.
	Возврат Константы.МожноОткрыватьЗавершенныеДокументы.Получить();
КонецФункции

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	МожноОткрытьДокумент = Истина;
	Если Элемент.ТекущиеДанные.ДокументВыгружен Тогда
		МожноОткрытьДокумент = СписокВыборНаСервере();
	КонецеСли;	
	Если Не МожноОткрытьДокумент Тогда
		Сообщить("Запрещено открывать завершенные документы!");
	КонецеСли;	
	СтандартнаяОбработка = МожноОткрытьДокумент;
КонецПроцедуры
