
Функция MAPost(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	ИмяМетода = Запрос.ПараметрыURL.Получить("ИмяМетода");
	ТекстЗапроса = Запрос.ПолучитьТелоКакСтроку();
	
	СтруктураОтвета = Новый Структура;
	Попытка
		Если ИмяМетода = "getbc" Тогда
			ВходныеДанные = скан_ОбменДаннымСервер.ДанныеJSONВСтруктуру(ТекстЗапроса);
			ДанныеПоШК = скан_СерверСканирования.ПолучитьДанныеПоШК(ВходныеДанные.BC);
			
			СтрокаJSON = скан_ОбменДаннымСервер.СформироватьСтрокуJSON(ДанныеПоШК);
			Ответ.УстановитьТелоИзСтроки(СтрокаJSON);
		ИначеЕсли ИмяМетода = "uploadScanDocuments" Тогда
			МассивПолейДаты = Новый Массив;
			МассивПолейДаты.Добавить("dateDoc");
			МассивПолейДаты.Добавить("deliveryDate");
			МассивПолейДаты.Добавить("scanTime");
			ВходныеДанные = скан_ОбменДаннымСервер.ДанныеJSONВСтруктуру(ТекстЗапроса, МассивПолейДаты);
			ДанныеДокументов = скан_СерверСканирования.ЗагрузитьДокументыСканирования(ВходныеДанные);
			
			СтрокаJSON = скан_ОбменДаннымСервер.СформироватьСтрокуJSON(ДанныеДокументов);
			Ответ.УстановитьТелоИзСтроки(СтрокаJSON);		
		ИначеЕсли ИмяМетода = "getWeighers" Тогда
			ВходныеДанные = скан_ОбменДаннымСервер.ДанныеJSONВСтруктуру(ТекстЗапроса);
			МассивВесов = скан_СерверСканирования.ПолучитьСписокВесов(ВходныеДанные.TSDid);
			
			СтрокаJSON = скан_ОбменДаннымСервер.СформироватьСтрокуJSON(МассивВесов);
			Ответ.УстановитьТелоИзСтроки(СтрокаJSON);	
			
		ИначеЕсли ИмяМетода = "unregisterReferences" Тогда
			ВходныеДанные = скан_ОбменДаннымСервер.ДанныеJSONВСтруктуру(ТекстЗапроса);
			ОтветПоДеРегистрации = скан_СерверСканирования.ОчиститьРегистрациюДанных(ВходныеДанные);
			
			СтрокаJSON = скан_ОбменДаннымСервер.СформироватьСтрокуJSON(ОтветПоДеРегистрации);
			Ответ.УстановитьТелоИзСтроки(СтрокаJSON);	
			//+Степанов Задача № 3827 	
		ИначеЕсли ИмяМетода = "setMAVersion" Тогда	
			ВходныеДанные = скан_ОбменДаннымСервер.ДанныеJSONВСтруктуру(ТекстЗапроса);
			Узел = ПланыОбмена.скан_ПриложенияТСД.НайтиПоКоду(ВходныеДанные.TSDid);
			СтруктураОтвета = Новый Структура("result, error","","");
			Попытка
				скан_ОбменДаннымСервер.ЗафиксироватьНомерВерсии(Узел, ВходныеДанные.MA_Version, ВходныеДанные.MA_VersionDescr, ВходныеДанные.MA_VersionFinal);
				СтруктураОтвета.result = "OK";
			Исключение
				СтруктураОтвета.result = "failed";
				СтруктураОтвета.error  = ОписаниеОшибки();
			КонецПопытки;		
			СтрокаJSON = скан_ОбменДаннымСервер.СформироватьСтрокуJSON(СтруктураОтвета);
			Ответ.УстановитьТелоИзСтроки(СтрокаJSON);
		КонецеСли;
	исключение
		ТекстОшибки = ОписаниеОшибки();
		ПараметрыОтправки = Новый Структура("Кому,Тема,Тело","n.stepanov@strizh-logistic.ru,evgeniy.marochkin@strizh-logistic.ru","При выполнении метода MA_" + ИмяМетода + " произошла ошибка!" ,ТекстОшибки);
		РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты,ПараметрыОтправки);	
		
	КонецПопытки;
	
	Возврат Ответ;
КонецФункции
