
&НаКлиенте
Процедура ВариантТаблицыПодъемовПриИзменении(Элемент)
	
	Список.Параметры.УстановитьЗначениеПараметра("ВариантТаблицыПодъемов", ВариантТаблицыПодъемов);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("ВариантТаблицыПодъемов", ВариантТаблицыПодъемов);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ФормаП = ОткрытьФорму("РегистрСведений.ПодъёмыНаБланкахЗаказа.Форма.ФормаЗаписи");//, Парам);
	ФормаП.Запись.ВариантТаблицыПодъемов = ВариантТаблицыПодъемов;

КонецПроцедуры
