Процедура ПриЗаписи(Отказ, Замещение)
	Если ЭтотОбъект.Количество() Тогда
		ТаблицаШтрихкодов = ЭтотОбъект.Выгрузить(,"Штрихкод,НомерЗаказа");
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ТаблицаШтрихкодов.Штрихкод КАК Штрихкод,
		|	ТаблицаШтрихкодов.НомерЗаказа КАК НомерЗаказа
		|ПОМЕСТИТЬ втШтрихкоды
		|ИЗ
		|	&ТаблицаШтрихкодов КАК ТаблицаШтрихкодов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втШтрихкоды.Штрихкод КАК Штрихкод,
		|	втШтрихкоды.НомерЗаказа КАК НомерЗаказа
		|ИЗ
		|	втШтрихкоды КАК втШтрихкоды
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НомерЗаказа)
		|ПО
		|	Штрихкод";
		Запрос.УстановитьПараметр("ТаблицаШтрихкодов",ТаблицаШтрихкодов);
		ВыборкаПоШтрихкодам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ТекстПисьма = "";
		Пока ВыборкаПоШтрихкодам.Следующий() Цикл
			Если ВыборкаПоШтрихкодам.НомерЗаказа > 1 Тогда
				ТекстШтрихкодЗаказы = "Штрихкод " + ВыборкаПоШтрихкодам.Штрихкод + " в заказах: ";
				ВыборкаНомеровЗаказов = ВыборкаПоШтрихкодам.Выбрать();
				Пока ВыборкаНомеровЗаказов.Следующий() Цикл
					ТекстШтрихкодЗаказы = ТекстШтрихкодЗаказы + Строка(ВыборкаНомеровЗаказов.НомерЗаказа) + ",";
				КонецЦикла;	
				ТекстШтрихкодЗаказы = Лев(ТекстШтрихкодЗаказы,СтрДлина(ТекстШтрихкодЗаказы) - 1);
				Если ТекстПисьма = "" Тогда
					ТекстПисьма = ТекстПисьма + ТекстШтрихкодЗаказы;
				Иначе
					ТекстПисьма = ТекстПисьма + Символы.ПС + ТекстШтрихкодЗаказы;
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;	
		Если ТекстПисьма <> "" Тогда
			Попытка
				ПараметрыОтправки = Новый Структура("Кому,Тема,Тело","n.stepanov@strizh-logistic.ru,evgeniy.marochkin@strizh-logistic.ru","При загрузке на сервер сканирования обнаружены дублирующиеся штрихкоды!",ТекстПисьма);
				РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты,ПараметрыОтправки);	
			Исключение
				ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Отправка письма по дублям ШК",УровеньЖурналаРегистрации.Ошибка,,,ТекстПисьма);
			КонецПопытки;	
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

