Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Ссылка.Пустая() И Ссылка.РазрешитьРедактирование = РазрешитьРедактирование Тогда
		
		Если Не РазрешитьРедактирование Тогда
			
			Если Не зпРаботаСРасчетомЗарплатыСервер.НетЗаписиВРегистре("РегистрСведений.зпИсходныеДанныеРасчетаЗППоЗаказам", "СхемаРасчетаЗП", Ссылка) Тогда
				Отказ = Истина;
				Сообщить("Редактирование запрещено");
				Сообщить("Обнаружены данные по Схеме расчета!");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры