&НаКлиенте

Процедура УстановкиДоступностиКнопки()
	Объект.ФормированиеЧеков = Документы.ПечатьЧековПоДоставкам.ПустаяСсылка();
	Объект.Чек = Документы.ЧекККМ.ПустаяСсылка();
	Объект.СуммаЧека = 0;
	Элементы.ФормаИзменитьЧек.Доступность = Ложь;
	Если Не Объект.КассаККМ.Пустая() И ЗначениеЗаполнено(Объект.ДатаЧека) И ЗначениеЗаполнено(Объект.НомерЧека) И Не Объект.Пользователь.Пустая() Тогда
		Зап = Новый Запрос;
		Зап.Текст = "ВЫБРАТЬ
		            |	ПечатьЧековПоДоставкамЧеки.Ссылка.Ссылка КАК ФормированиеЧеков,
		            |	ПечатьЧековПоДоставкамЧеки.Чек.Ссылка КАК Чек,
		            |	ПечатьЧековПоДоставкамЧеки.ЧекПробитОшибочно
		            |ИЗ
		            |	Документ.ПечатьЧековПоДоставкам.Чеки КАК ПечатьЧековПоДоставкамЧеки
		            |ГДЕ
		            |	ПечатьЧековПоДоставкамЧеки.Чек.Дата МЕЖДУ &ДатаНач И &ДатаКон
		            |	И ПечатьЧековПоДоставкамЧеки.Чек.КассаККМ = &КассаККМ
		            |	И ПечатьЧековПоДоставкамЧеки.Чек.ЧекПробитНаККМ = ИСТИНА
		            |	И ПечатьЧековПоДоставкамЧеки.Чек.НомерЧекаККМ = &НомерЧекаККМ
		            |
		            |СГРУППИРОВАТЬ ПО
		            |	ПечатьЧековПоДоставкамЧеки.Ссылка.Ссылка,
		            |	ПечатьЧековПоДоставкамЧеки.Чек.Ссылка,
		            |	ПечатьЧековПоДоставкамЧеки.ЧекПробитОшибочно";
					
		Зап.УстановитьПараметр("ДатаНач", НачалоДня(Объект.ДатаЧека));			
		Зап.УстановитьПараметр("ДатаКон", КонецДня(Объект.ДатаЧека));
		Зап.УстановитьПараметр("КассаККМ", Объект.КассаККМ.Ссылка);
		Зап.УстановитьПараметр("НомерЧекаККМ", Объект.НомерЧека);
		
		Рез = Зап.Выполнить().Выгрузить();
		
		Если Рез.Количество() = 1 Тогда
			Объект.ФормированиеЧеков = Рез[0].ФормированиеЧеков;
			Объект.Чек = Рез[0].Чек;
			Объект.ЧекПробитОшибочно = Рез[0].ЧекПробитОшибочно;
			Объект.СуммаЧека = Рез[0].Чек.СуммаДокумента;
			Элементы.ФормаИзменитьЧек.Доступность = Истина;
		ИначеЕсли Рез.Количество() > 1 Тогда
			Стр = Рез.ВыбратьСтроку("Выберите чек..");
			Объект.ФормированиеЧеков = Стр.ФормированиеЧеков;
			Объект.Чек = Стр.Чек;
			Объект.ЧекПробитОшибочно = Стр.ЧекПробитОшибочно;
			Объект.СуммаЧека = Стр.Чек.СуммаДокумента;
			Элементы.ФормаИзменитьЧек.Доступность = Истина;
		КонецеСли;	
	КонецеСли;	
КонецПроцедуры	

&НаКлиенте
Процедура КассаККМПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	УстановкиДоступностиКнопки();
КонецПроцедуры


&НаКлиенте
Процедура НомерЧекаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	УстановкиДоступностиКнопки();
КонецПроцедуры


&НаКлиенте
Процедура ДатаЧекаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	УстановкиДоступностиКнопки();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьЧек(Команда)
	ИзменитьЧекНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИзменитьЧекНаСервере()
	НачатьТранзакцию();
	Д = Объект.ФормированиеЧеков.ПолучитьОбъект();
	НайСтр = Д.Чеки.Найти(Объект.Чек);
	НайСтр.ЧекПробитОшибочно = Объект.ЧекПробитОшибочно;
	Д.Записать(РежимЗаписиДокумента.Запись);
	Д.Записать(РежимЗаписиДокумента.Проведение);
	
	Наб = РегистрыСведений.ИзменениеЧеков.СоздатьНаборЗаписей();
	Наб.Отбор.Период.Установить(ТекущаяДата());
	Наб.Отбор.ФормированиеЧеков.Установить(Объект.ФормированиеЧеков);
	Наб.Отбор.Чек.Установить(Объект.Чек);
	Наб.Прочитать();
	
	
	Нов = наб.Добавить();
	Нов.Пользователь = Объект.Пользователь;
	Нов.Период = ТекущаяДата();
	Нов.ФормированиеЧеков = Объект.ФормированиеЧеков;
	Нов.Чек = Объект.Чек;
	Нов.Признак = Объект.ЧекПробитОшибочно;
	
	Наб.Записать();
	
	Если ЗначениеЗаполнено(Объект.ИзмененнаяДатаЧека) Тогда
		Д = Объект.Чек.ПолучитьОбъект();
		Д.Дата = Объект.ИзмененнаяДатаЧека;
		Д.Записать(РежимЗаписиДокумента.Запись);
		Д.Записать(РежимЗаписиДокумента.Проведение);
		//
		//Наб = РегистрыСведений.ИзменениеЧеков.СоздатьНаборЗаписей();
		//Наб.Отбор.Период.Установить(ТекущаяДата());
		//Наб.Отбор.ФормированиеЧеков.Установить(Объект.ФормированиеЧеков);
		//Наб.Отбор.Чек.Установить(Объект.Чек);
		//Наб.Прочитать();
		//
		//
		//Нов = наб.Добавить();
		//Нов.Пользователь = Объект.Пользователь;
		//Нов.Период = ТекущаяДата();
		//Нов.ФормированиеЧеков = Объект.ФормированиеЧеков;
		//Нов.Чек = Объект.Чек;
		//Нов.Признак = Объект.ЧекПробитОшибочно;
	КонецеСли;

	Наб.Записать();
	
	ЗафиксироватьТранзакцию();
КонецПроцедуры


Элементы.ФормаИзменитьЧек.Доступность = Ложь;