Процедура Сформировать(Т, СписокНомеров) Экспорт
	Т.Очистить();
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	ЗакрытиеЗаказовЗаказы.ВнешнийНомер КАК ВнешнийНомер,
	            |	Накладная003Заказы.Вес,
	            |	ЗакрытиеЗаказовЗаказы.КомментарийСД,
	            |	НЕ ЗакрытиеЗаказовЗаказы.Доставка.ТочкаПрибытия.Москва КАК ЗаМкад,
	            |	ЗакрытиеЗаказовЗаказы.Показатель1 КАК УслугиСД,
	            |	ЗакрытиеЗаказовЗаказы.Показатель2 КАК Подъём
	            |ИЗ
	            |	Документ.ЗакрытиеЗаказов.Заказы КАК ЗакрытиеЗаказовЗаказы
	            |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Накладная003.Заказы КАК Накладная003Заказы
	            |		ПО ЗакрытиеЗаказовЗаказы.Реализация.Ссылка = Накладная003Заказы.Заказ.Ссылка
	            |ГДЕ
	            |	(ПОДСТРОКА(ЗакрытиеЗаказовЗаказы.ВнешнийНомер, 6, 8) В (&МасНомеров)
	            |			ИЛИ ЗакрытиеЗаказовЗаказы.ВнешнийНомер В (&МасНомеров))
	            |	И ЗакрытиеЗаказовЗаказы.Ссылка.Проведен = ИСТИНА
	            |	И (ЗакрытиеЗаказовЗаказы.Закрыть = ИСТИНА
	            |			ИЛИ ЗакрытиеЗаказовЗаказы.Отклонить = ИСТИНА)
	            |
	            |УПОРЯДОЧИТЬ ПО
	            |	ВнешнийНомер";
				
	Зап.УстановитьПараметр("МасНомеров", СписокНомеров);			
	Рез = Зап.Выполнить().Выгрузить();
	
	
	Мак = ПолучитьМакет("Макет");
	Обл = Мак.ПолучитьОбласть("Строка");
	ОблШ = Мак.ПолучитьОбласть("Шапка");
	
	Т.Вывести(ОблШ);
	
	НПП = 1;
	Для Каждого Тек Из СписокНомеров Цикл
		СтрукНом = Новый Структура;
		СтрукНом.Вставить("ВнешнийНомер", Тек);
		
		НайСтроки = Рез.НайтиСтроки(СтрукНом);
		
		Для СчСтр = 0 По НайСтроки.Количество() - 1 Цикл
			Обл.Параметры.НПП = НПП;
			Обл.Параметры.Номер = Тек;
			Най = НайСТроки[СчСтр];
			Если Най <> Неопределено Тогда
				Обл.Параметры.ЕстьВСистеме = истина;
				Обл.Параметры.Вес = Най.Вес;
				Обл.Параметры.КомментарийСД = Най.КомментарийСД;
				Обл.Параметры.ЗаМкад = Най.ЗаМкад;
				Обл.Параметры.УслугиСД = Най.УслугиСД;
				Обл.Параметры.подъём = Най.подъём;
			Иначе
				Обл.Параметры.ЕстьВСистеме = Ложь;
				Обл.Параметры.Вес = 0;
				Обл.Параметры.КомментарийСД = "";
				Обл.Параметры.ЗаМкад = Ложь;
				Обл.Параметры.УслугиСД = 0;
				Обл.Параметры.подъём = 0;
			КонецеСли;	
			НПП = НПП + 1;
			т.Вывести(Обл);
		КонецЦикла;
	КонецЦикла;	
	
КонецПроцедуры	