Функция  СписокПолигоновСоСложнойПарковкой() Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеПараметрыПолигоновМаршрутизацииСрезПоследних.НомерПолигона КАК НомерПолигона
		|ИЗ
		|	РегистрСведений.ДополнительныеПараметрыПолигоновМаршрутизации.СрезПоследних КАК ДополнительныеПараметрыПолигоновМаршрутизацииСрезПоследних
		|ГДЕ
		|	ДополнительныеПараметрыПолигоновМаршрутизацииСрезПоследних.ПолигонСоСложнойПарковкой
		|
		|СГРУППИРОВАТЬ ПО
		|	ДополнительныеПараметрыПолигоновМаршрутизацииСрезПоследних.НомерПолигона";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НомерПолигона");
	
КонецФункции	