
Функция warehousePOST(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	ИмяМетода = Запрос.ПараметрыURL.Получить("ИмяМетода");
	ТекстЗапроса = Запрос.ПолучитьТелоКакСтроку();	
	
	Попытка
		Если ИмяМетода = "addCarriage" Тогда
			ВходныеДанные = ПриходЗаказовНаСкладСервер.ДанныеJSONВСтруктуру(ТекстЗапроса, "date");
			ОтветМетода = ПриходЗаказовНаСкладСервер.ДобавитьПриход(ВходныеДанные);
			СтрокаJSON = ПриходЗаказовНаСкладСервер.СформироватьСтрокуJSON(ОтветМетода);
			
		КонецЕсли;
		
		Ответ.УстановитьТелоИзСтроки(СтрокаJSON);
	Исключение
		СписокПолучателей = Новый Массив;
		//СписокПолучателей.Добавить("n.stepanov@strizh-logistic.ru");
		СписокПолучателей.Добавить("evgeniy.marochkin@strizh-logistic.ru");
		
		lem.ОтправитьСообщение(СписокПолучателей, "Ошибка при вызове метода warehouseService_" + ИмяМетода, ОписаниеОшибки() , , "Логистическая компания ""Стриж""");
	КонецПопытки;
	
	Возврат Ответ;
КонецФункции
