
Процедура ПередЗаписью(Отказ, Замещение)
	
	//Переварюха В.В. Задача № 3535 2019.09.27 12:20
	Для каждого ЗаписьРегистра Из ЭтотОбъект Цикл
		
	    РейсСсылка = ЗаписьРегистра.Рейс;
		
		СписокФизЛиц = УчетОборудованияСервер.ПолучитьСписокФизЛицПоРейсу(РейсСсылка);
		
		ВодительФизЛицо = СписокФизЛиц.ВодительФизЛицо;
		ЭкспедиторФизЛицо = СписокФизЛиц.ЭкспедиторФизЛицо;
		
		Если ЗначениеЗаполнено(ВодительФизЛицо) Тогда
			
			Если ВодительФизЛицо <> ЗаписьРегистра.Водитель.ФизЛицо Тогда
			
				Если УчетОборудованияСервер.ПоРейсуИФизЛицуСуществуетВыданноеОборудование(РейсСсылка, ВодительФизЛицо) Тогда
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "У водителя "+ВодительФизЛицо+" имеется выданное оборудование";
					Сообщение.Сообщить();
					
					Отказ = Истина;
					Возврат;
				КонецЕсли;	
			
			КонецЕсли;
			
		КонецЕсли;
	
		Если ЗначениеЗаполнено(ЭкспедиторФизЛицо)Тогда
			
			Если ЭкспедиторФизЛицо <> ЗаписьРегистра.Экспедитор.ФизЛицо Тогда
			
				Если УчетОборудованияСервер.ПоРейсуИФизЛицуСуществуетВыданноеОборудование(РейсСсылка, ЭкспедиторФизЛицо) Тогда
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "У экспедитора "+ЭкспедиторФизЛицо+" имеется выданное оборудование";
					Сообщение.Сообщить();
					
					Отказ = Истина;
					Возврат;
				КонецЕсли;

			КонецЕсли;
			
		КонецЕсли;
								
	КонецЦикла;
	//Переварюха В.В. Задача № 3535 2019.09.27 12:20
	
КонецПроцедуры
