Функция ПолучитьЦветИзСтиляПлатформы(рЦветКакЭлементСтиля) Экспорт
	Попытка
    	т=Новый ТабличныйДокумент;
    	т.Область(1,1,1,1).ЦветФона=рЦветКакЭлементСтиля;
    	вф=ПолучитьИмяВременногоФайла("htm");
    	т.Записать(вф,ТипФайлаТабличногоДокумента.HTML);
    	// читаем грубо, без ДокументHTML
    	рКодПоиска="tr.R0 td.R0C0{ background-color:"; // если 1С изменит формат, эту строку придётся поменять
    	т=Новый ТекстовыйДокумент;
    	т.Прочитать(вф);
    	стро=т.ПолучитьТекст();
    	пози=Найти(стро,рКодПоиска);
    	Если пози<>0 Тогда
	        Возврат ВРег(Сред(стро,пози+СтрДлина(рКодПоиска),8));
    	КонецЕсли;
    	Возврат "";
	Исключение
    	Сообщить("ПолучитьЦветИзСтиляПлатформы, ошибка: "+ОписаниеОшибки(),СтатусСообщения.Важное);
    	Возврат "";
	КонецПопытки;
КонецФункции