
&НаКлиенте
Процедура ЗаказПриИзменении(Элемент)
	Если Не Объект.Заказ.Пустая() Тогда
		ФлагВозможностиЗакрытия = ЗаказПриИзмененииНаСервере();
		Если Не ФлагВозможностиЗакрытия Тогда
			ОчиститьРеквизиты();
			НадписьСтатус = "ЗАКАЗ НЕ МОЖЕТ БЫТЬ ПРЕДВАРИТЕЛЬНО ЗАКРЫТ/ОТКРЫТ";
		Иначе
			НадписьСтатус = "";
		КонецеСли;	
	КонецеСли;	
КонецПроцедуры

&НаСервере
Функция ЗаказПриИзмененииНаСервере()
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	СтатусыЗаказов.Заказ,
	            |	МАКСИМУМ(СтатусыЗаказов.Период) КАК Период
	            |ПОМЕСТИТЬ ВТВремяТекущегоСтатуса
	            |ИЗ
	            |	РегистрСведений.СтатусыЗаказов КАК СтатусыЗаказов
	            |ГДЕ
	            |	СтатусыЗаказов.Заказ = &Заказ
	            |
	            |СГРУППИРОВАТЬ ПО
	            |	СтатусыЗаказов.Заказ
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ ПЕРВЫЕ 1
	            |	ВТВремяТекущегоСтатуса.Заказ,
	            |	СтатусыЗаказов.Статус
	            |ПОМЕСТИТЬ ВТТекущийСтатус
	            |ИЗ
	            |	ВТВремяТекущегоСтатуса КАК ВТВремяТекущегоСтатуса
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЗаказов КАК СтатусыЗаказов
	            |		ПО ВТВремяТекущегоСтатуса.Заказ = СтатусыЗаказов.Заказ
	            |			И ВТВремяТекущегоСтатуса.Период = СтатусыЗаказов.Период
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	ФинальныеСтатусыЗаказов.Заказ,
	            |	МАКСИМУМ(ФинальныеСтатусыЗаказов.Период) КАК Период
	            |ПОМЕСТИТЬ ВТВремяФинальногоСтатуса
	            |ИЗ
	            |	РегистрСведений.ФинальныеСтатусыЗаказов КАК ФинальныеСтатусыЗаказов
	            |ГДЕ
	            |	ФинальныеСтатусыЗаказов.Заказ = &Заказ
	            |
	            |СГРУППИРОВАТЬ ПО
	            |	ФинальныеСтатусыЗаказов.Заказ
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ ПЕРВЫЕ 1
	            |	ВТВремяФинальногоСтатуса.Заказ,
	            |	ФинальныеСтатусыЗаказов.Статус
	            |ПОМЕСТИТЬ ВТФинальныйСтатус
	            |ИЗ
	            |	ВТВремяФинальногоСтатуса КАК ВТВремяФинальногоСтатуса
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ФинальныеСтатусыЗаказов КАК ФинальныеСтатусыЗаказов
	            |		ПО ВТВремяФинальногоСтатуса.Заказ = ФинальныеСтатусыЗаказов.Заказ
	            |			И ВТВремяФинальногоСтатуса.Период = ФинальныеСтатусыЗаказов.Период
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	ДополнительныеПараметрыЗаказа.ПредварительноеЗакрытие,
	            |	СостоянияЗаказовСрезПоследних.ПричинаНеВыполнения,
	            |	СостоянияЗаказовСрезПоследних.ПричинаОтказа,
	            |	СтатусыЗаказов.Ссылка КАК ФинальныйСтатус,
	            |	СтатусыЗаказов1.Ссылка КАК ТекущийСтатус,
	            |	СтатусыЗакрытияЗаказовСрезПоследних.СтатусЗакрытия КАК СтатусПредварительногоЗакрытия,
	            |	ДополнительныеПараметрыЗаказа.Заказ,
	            |	ВТТекущийСтатус.Статус,
	            |	ВТФинальныйСтатус.Статус КАК Статус1
	            |ИЗ
	            |	РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
	            |		ЛЕВОЕ СОЕДИНЕНИЕ ВТФинальныйСтатус КАК ВТФинальныйСтатус
	            |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтатусыЗаказов КАК СтатусыЗаказов
	            |			ПО ВТФинальныйСтатус.Статус = СтатусыЗаказов.Код
	            |		ПО ДополнительныеПараметрыЗаказа.Заказ = ВТФинальныйСтатус.Заказ
	            |		ЛЕВОЕ СОЕДИНЕНИЕ ВТТекущийСтатус КАК ВТТекущийСтатус
	            |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтатусыЗаказов КАК СтатусыЗаказов1
	            |			ПО ВТТекущийСтатус.Статус = СтатусыЗаказов1.Код
	            |		ПО ДополнительныеПараметрыЗаказа.Заказ = ВТТекущийСтатус.Заказ
	            |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказов.СрезПоследних(&ДатаЗапроса, ) КАК СостоянияЗаказовСрезПоследних
	            |		ПО ДополнительныеПараметрыЗаказа.Заказ = СостоянияЗаказовСрезПоследних.Заказ
	            |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЗакрытияЗаказов.СрезПоследних(&ДатаЗапроса, ) КАК СтатусыЗакрытияЗаказовСрезПоследних
	            |		ПО ДополнительныеПараметрыЗаказа.Заказ = СтатусыЗакрытияЗаказовСрезПоследних.Заказ
	            |ГДЕ
	            |	ДополнительныеПараметрыЗаказа.Заказ.Ссылка = &Заказ";
	Зап.УстановитьПараметр("Заказ", Объект.Заказ);			
	Зап.УстановитьПараметр("ДатаЗапроса", КонецДня(Объект.Дата));			
	Рез = Зап.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда
		Если Рез.ПредварительноеЗакрытие Тогда
			ЗаполнитьЗначенияСвойств(Объект, Рез, "СтатусПредварительногоЗакрытия, ПричинаНеВыполнения, ПричинаОтказа, ТекущийСтатус, ФинальныйСтатус, СтатусПредварительногоЗакрытия");
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецеСли;	
	Иначе
		Возврат Ложь;
	КонецеСли;	
КонецФункции

&НаКлиенте
Процедура ОчиститьРеквизиты()
	Объект.Заказ = "";
	Объект.ФинальныйСтатус = "";
	Объект.ТекущийСтатус = "";
	Объект.ПричинаНеВыполнения = "";
	Объект.ПричинаОтказа = "";
	Объект.СтатусПредварительногоЗакрытия = "";
КонецпРоцедуры	

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Не Объект.ДокументВнесенВРучномРежиме Тогда
		Отказ = Истина;
		Сообщить("Нельзя записывать автоматически созданные документы!", СтатусСообщения.ОченьВажное);
	Иначе
		Если Объект.НовыйСтатусПредварительногоЗакрытия.Пустая() Тогда
			Сообщить("Укажите новый статус!", СтатусСообщения.ОченьВажное);
			Отказ = Истина;
		КонецеСли;	
	КонецеСли;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ДокументВнесенВРучномРежиме = Истина;
		Объект.ТерминалОбработки = ПараметрыСеанса.ТерминалДоставки;  //  Задача № 3049 
	ИначеЕсли Не Объект.ДокументВнесенВРучномРежиме Тогда
		ТолькоПросмотр = Истина;
	КонецеСли;	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// Вставить содержимое обработчика.
	Если Не Объект.ДокументВнесенВРучномРежиме Тогда
		Отказ = Истина;
		//Сообщить("Нельзя записывать автоматически созданные документы!");
	КонецеСли;	
	
КонецПроцедуры
