
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПолучитьСписокОбъектовБухгалтерии(Параметры.ИмяОбъектаБухгалтерии, Параметры.Свойство("БезГрупп"), Параметры.Свойство("НепомеченныеНаУдаление"));
	
	//Отладка формы
	//НоваяСтрока = ОбъектыБухгалтерии.Добавить();
	//НоваяСтрока.Код = "00000001";
	//НоваяСтрока.Представление = "Чушь какая-то";
	//НоваяСтрока.Идентификатор = Новый УникальныйИдентификатор();
КонецПроцедуры

&НаСервере
Функция ПолучитьИ(ЕстьУсловие)
	ТекстИ = ?(ЕстьУсловие, " И ", "");
	ЕстьУсловие = Истина;
	Возврат ТекстИ;
КонецФункции

&НаСервере
Процедура ПолучитьСписокОбъектовБухгалтерии(ИмяОбъектаБухгалтерии, БезГрупп = Ложь, НепомеченныеНаУдаление = Ложь)
	
	ОбъектыБухгалтерии.Очистить();
	
	СтруктураCOM = ПлатежиКомитентамСервер.ПолучитьСоединениеСБазой(Параметры.ИсточникДанных);
	
	Если СтруктураCOM = Неопределено Тогда
		Сообщить("Не удалось установить соединение для организации " + Параметры.Организация);
		Возврат;
	КонецЕсли; 
	
	Соединение = СтруктураCOM.Соединение;
	БазаБух = СтруктураCOM.БазаБух;
	
	ДанныеОбъектаЗапроса = СтрРазделить(ИмяОбъектаБухгалтерии,".");
	
	СтрокаЗапросаКод = ?(ДанныеОбъектаЗапроса[0] = "Справочник","_ОбъектБух.Код","""""");
	СтрокаЗапросаПредставление = ?(ДанныеОбъектаЗапроса[0] = "Справочник","_ОбъектБух.Представление","Представление(_ОбъектБух.Ссылка)");
	СтрокаЗапросаПометкаУдаления = ?(ДанныеОбъектаЗапроса[0] = "Справочник","_ОбъектБух.ПометкаУдаления","Ложь");
	
	ЕстьУсловие = Ложь;
	
	Запрос = БазаБух.NewObject("Запрос");
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	_ОбъектБух.Ссылка КАК Ссылка,
	|	" + СтрокаЗапросаКод + " КАК Код,
	|	" + СтрокаЗапросаПредставление + " КАК Представление,
	|	" + СтрокаЗапросаПометкаУдаления + " КАК ПометкаУдаления
	|ИЗ
	|	" + ДанныеОбъектаЗапроса[0] + "." + ДанныеОбъектаЗапроса[1] + " КАК _ОбъектБух" + ?(БезГрупп Или НепомеченныеНаУдаление, " ГДЕ ","") + ?(БезГрупп, ПолучитьИ(ЕстьУсловие) + "НЕ _ОбъектБух.ЭтоГруппа", "") + ?(НепомеченныеНаУдаление, ПолучитьИ(ЕстьУсловие) + "НЕ _ОбъектБух.ПометкаУдаления", "");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = ОбъектыБухгалтерии.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		
		Если ДанныеОбъектаЗапроса[0] = "Справочник" тогда
			НоваяСтрока.Идентификатор = Новый УникальныйИдентификатор(БазаБух.String(ВыборкаДетальныеЗаписи.Ссылка.УникальныйИдентификатор()));
		КонецЕсли;	
	КонецЦикла;	
	
	
	Соединение = Неопределено;
	БазаБух = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыБухгалтерииВыборЗначения(Элемент, Значение, СтандартнаяОбработка)

	ТекущиеДанные = Элементы.ОбъектыБухгалтерии.ТекущиеДанные;
	
	ПараметрыВыбораСтроки = Новый Структура("Представление, Идентификатор",ТекущиеДанные.Представление,ТекущиеДанные.Идентификатор);
	ОповеститьОВыборе(ПараметрыВыбораСтроки);
	
КонецПроцедуры
