Процедура Сформировать() Экспорт
	Таб = Новый ТабличныйДокумент;
	
	Мак = ПолучитьМакет("Макет");
	
	Обл = Мак.ПолучитьОбласть("Строка");
	
	Выб = РегистрыСведений.НастройкиОперацийТСД.Выбрать();
	Пока Выб.Следующий() Цикл
		Если Не Выб.РежимАктивен Тогда
			Продолжить;
		КонецеСли;	
		Обл.Параметры.Операция = Выб.Операция;
		Обл.Рисунки.D1.Объект.barcode = Выб.Штрихкод;
		Таб.Вывести(Обл);
	КонецЦикла;	
	
	Выб = РегистрыСведений.ПользователиТСД.Выбрать();
	Пока Выб.Следующий() Цикл
		Обл.Параметры.Операция = Выб.Пользователь.Наименование;
		Обл.Рисунки.D1.Объект.barcode = Выб.Пароль;
		Таб.Вывести(Обл);
	КонецЦикла;	
	
	
	Таб.ПолеСверху = 3;
	Таб.ПолеСлева = 3;
	Таб.ПолеСправа = 3;
	Таб.ПолеСнизу = 3;
	Таб.ТолькоПросмотр = Истина;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОтображатьСетку = Ложь;
	
	Таб.Показать();
КонецПроцедуры	