
&НаКлиенте
Процедура ОК(Команда)
	Пр = Получитьпароль();
	Если Пароль = Пр Тогда
		Авторизован = Истина;
		Если Не Админ Тогда
			ОбщегоНазначения.СохранитьДанныеАвтологина(Пароль);
		КонецеСли;	
		Закрыть("Ok");
	Иначе
		Предупреждение("Неверный пароль!");
	КонецеСли;	
КонецПроцедуры



Функция ПолучитьПароль() Экспорт
	Если Админ Тогда
		Возврат Константы.ПарольАдмина.Получить();
	Иначе	
		Возврат Константы.Пароль.Получить();
	КонецеСли;	
КонецФункции

Функция ВернутьИмя()
	Если Не Админ Тогда
		Если Константы.ВариантПривязкиТелефона.Получить() = Перечисления.ВариантыПривязкиТелефона.КВодителю Тогда
			Возврат СокрЛП(Константы.Водитель.Получить().Наименование);
		ИначеЕсли Константы.ВариантПривязкиТелефона.Получить() = Перечисления.ВариантыПривязкиТелефона.КТранспорту Тогда	
			Возврат СокрЛП(Константы.Транспорт.Получить().Наименование);
		КонецеСли;	
	Иначе
		Возврат "Администратор";
	КонецеСли;
КонецФункции	


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Константы.НомерТелефона.Получить()) Тогда
		Заголовок = Константы.НомерТелефона.Получить();
	Иначе	
		Заголовок = "Авторизация";
	конецеСли;
	
	Если Не Админ Тогда
		Админ = Параметры.Администратор;
	КонецеСли;	
КонецПроцедуры


Функция ПолучитьТелефонЛогиста() Экспорт
	//Возврат Константы.ТелефонЛогиста.Получить();
	Возврат Константы.ТекущийРегион.Получить().НомерТелефонаСтаршегоЛогиста;
КонецФункции



&НаКлиенте
Процедура ЗвонокЛогисту(Команда)
	Тел = ПолучитьТелефонЛогиста();                                                                                       
	если Не ЗначениеЗаполнено(Тел) Тогда
		Предупреждение("Не указан телефон логиста!");
		Возврат;
	КонецеСли;	
	ЗапуститьПриложение("tel:" + Тел);
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИмяПользователя = ВернутьИмя();
	если Админ Тогда
		Элементы.ЗвонокЛогисту.Видимость = ложь;
	КонецеСлИ;	
КонецПроцедуры

