
Функция СформироватьОтправитьПоПочте(НачПериода, КонПериода, Терминал = Неопределено) Экспорт
	
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	Настройки = КомпоновщикНастроек.Настройки;
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода", НачПериода);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ОкончаниеПериода", КонецДня(КонПериода));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ТерминалДоставки", Терминал);
	
	//Если ЗначениеЗаполнено(Терминал) Тогда
	//	ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТерминалОбработки");
	//	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//	ЭлементОтбора.ПравоеЗначение = Терминал;
	//	ЭлементОтбора.Использование = Истина;
	//КонецЕсли;
	
	Настройки 					= КомпоновщикНастроек.Настройки;
	КомпоновщикМакета 			= Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки 			= КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки);	
	ПроцессорКомпоновкиДанных 	= Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,,, Истина);
	
	Результат 		= Новый ТабличныйДокумент;
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	//Сообщить("ВысотаТаблицы " + Результат.ВысотаТаблицы);
	//Сообщить("ФиксацияСверху " + Результат.ФиксацияСверху);
	Если Результат.ВысотаТаблицы - Результат.ФиксацияСверху > 0 Тогда
		Возврат Результат;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции
