
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК Поле1
	|ИЗ
	|	РегистрСведений.упрСостоянияПлатежей КАК упрСостоянияПлатежей
	|ГДЕ
	|	упрСостоянияПлатежей.ДокументРегистратор = &Ссылка";
	
	Если Не Запрос.Выполнить().Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Сейчас = ТекущаяДата();
	
	Для Каждого СтрокаПП Из ПлатежныеПоручения Цикл
		ЗаписьРегистра = РегистрыСведений.упрСостоянияПлатежей.СоздатьМенеджерЗаписи();
		ЗаписьРегистра.Период = Сейчас;
		ЗаписьРегистра.Платеж = СтрокаПП.ПлатежноеПоручение;
		ЗаписьРегистра.СостояниеПлатежа = СтрокаПП.СостояниеПлатежа;
		ЗаписьРегистра.ДокументРегистратор = Ссылка;
		ЗаписьРегистра.Записать();
	КонецЦикла;
	
КонецПроцедуры
