
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТолькоПросмотр = Истина;
	Товары.Параметры.УстановитьЗначениеПараметра("Заказ", "");
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	Контрагенты.Ссылка КАК Контрагент,
	            |	Контрагенты.Родитель.ОсновнойМагазин КАК Агрегатор
	            |ПОМЕСТИТЬ ВТ_Агрегаторы
	            |ИЗ
	            |	Справочник.Контрагенты КАК Контрагенты
	            |ГДЕ
	            |	Контрагенты.Родитель.ОсновнойМагазин <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	РеализацияТоваровУслугУслуги.Ссылка КАК Заказ,
	            |	СУММА(РеализацияТоваровУслугУслуги.Сумма) КАК Сумма
	            |ПОМЕСТИТЬ ВТ_ИтогоПоУслугам
	            |ИЗ
	            |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	            |ГДЕ
	            |	РеализацияТоваровУслугУслуги.Ссылка.Номер = &НомерЗаказа
	            |
	            |СГРУППИРОВАТЬ ПО
	            |	РеализацияТоваровУслугУслуги.Ссылка
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	РеализацияТоваровУслугТовары.Ссылка КАК Заказ,
	            |	СУММА(РеализацияТоваровУслугТовары.Сумма) КАК Сумма
	            |ПОМЕСТИТЬ ВТ_ИтогоПоТоварам
	            |ИЗ
	            |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	            |ГДЕ
	            |	РеализацияТоваровУслугТовары.Ссылка.Номер = &НомерЗаказа
	            |
	            |СГРУППИРОВАТЬ ПО
	            |	РеализацияТоваровУслугТовары.Ссылка
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	РеализацияТоваровУслуг.Номер КАК НомерЗаказа,
	            |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа КАК НомерЗаказаИМ,
	            |	РеализацияТоваровУслуг.ВладелецТовара КАК Магазин,
	            |	ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации КАК Полигон,
	            |	ДополнительныеПараметрыЗаказа.ЛогистическийБрейк КАК ЛогистическийБрейк,
	            |	ВТ_ИтогоПоТоварам.Сумма КАК СуммаТоваров,
	            |	ВТ_ИтогоПоУслугам.Сумма КАК СуммаДоставки,
	            |	ВТ_ИтогоПоТоварам.Сумма + ВТ_ИтогоПоУслугам.Сумма КАК Итого,
	            |	РеализацияТоваровУслуг.Ссылка КАК Заказ,
	            |	новаМестнаяДоставка.ТочкаПрибытия.Адрес.Наименование КАК Адрес,
	            |	ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка) КАК ТипЗаказа,
	            |	0 КАК ОбъемЗабора,
	            |	ВТ_Агрегаторы.Агрегатор КАК Агрегатор,
	            |	новаМестнаяДоставка.ВремяПрибытияС КАК ИнтервалВремениС,
	            |	новаМестнаяДоставка.ВремяПрибытияПо КАК ИнтервалВремениПо,
	            |	ВЫБОР
	            |		КОГДА ДополнительныеПараметрыЗаказа.ТарифицируемыйВес = 0
	            |			ТОГДА РеализацияТоваровУслуг.ОбщийВес
	            |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ТарифицируемыйВес
	            |	КОНЕЦ КАК ВесЗаказа,
	            |	РеализацияТоваровУслуг.ОбъёмЗаказа КАК ОбъемЗаказа
	            |ИЗ
	            |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	            |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
	            |		ПО РеализацияТоваровУслуг.Ссылка = ДополнительныеПараметрыЗаказа.Заказ.Ссылка
	            |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтогоПоТоварам КАК ВТ_ИтогоПоТоварам
	            |		ПО РеализацияТоваровУслуг.Ссылка = ВТ_ИтогоПоТоварам.Заказ.Ссылка
	            |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПолигоныМаршрутизацииЗаказов.СрезПоследних(, СхемаМаршрутизации.Ссылка = &СхемаМаршрутизации) КАК ПолигоныМаршрутизацииЗаказовСрезПоследних
	            |		ПО (РеализацияТоваровУслуг.Ссылка = ВЫРАЗИТЬ(ПолигоныМаршрутизацииЗаказовСрезПоследних.Заказ КАК Документ.РеализацияТоваровУслуг).Ссылка)
	            |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтогоПоУслугам КАК ВТ_ИтогоПоУслугам
	            |		ПО РеализацияТоваровУслуг.Ссылка = ВТ_ИтогоПоУслугам.Заказ.Ссылка
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БизнесПроцесс.новаМестнаяДоставка КАК новаМестнаяДоставка
	            |		ПО (ДополнительныеПараметрыЗаказа.Доставка = новаМестнаяДоставка.Ссылка)
	            |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Агрегаторы КАК ВТ_Агрегаторы
	            |		ПО РеализацияТоваровУслуг.ВладелецТовара.Ссылка = ВТ_Агрегаторы.Контрагент.Ссылка
	            |ГДЕ
	            |	РеализацияТоваровУслуг.Номер = &НомерЗаказа
	            |
	            |ОБЪЕДИНИТЬ ВСЕ
	            |
	            |ВЫБРАТЬ
	            |	ЗаборТовара.Номер,
	            |	ЗаборТовара.НомерВнешнегоЗаказа,
	            |	ЗаборТовара.Контрагент,
	            |	ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации,
	            |	"""",
	            |	0,
	            |	0,
	            |	0,
	            |	ЗаборТовара.Ссылка,
	            |	ЗаборТовара.ТочкаДоставки.Адрес.Наименование,
	            |	ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор),
	            |	ЗаборТовара.ОбъемЗабора,
	            |	ВТ_Агрегаторы.Агрегатор,
	            |	NULL,
	            |	NULL,
	            |	0,
	            |	0
	            |ИЗ
	            |	Документ.ЗаборТовара КАК ЗаборТовара
	            |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПолигоныМаршрутизацииЗаказов.СрезПоследних(, СхемаМаршрутизации.Ссылка = &СхемаМаршрутизации) КАК ПолигоныМаршрутизацииЗаказовСрезПоследних
	            |		ПО (ЗаборТовара.Ссылка = ВЫРАЗИТЬ(ПолигоныМаршрутизацииЗаказовСрезПоследних.Заказ КАК Документ.ЗаборТовара).Ссылка)
	            |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Агрегаторы КАК ВТ_Агрегаторы
	            |		ПО ЗаборТовара.Контрагент.Ссылка = ВТ_Агрегаторы.Контрагент.Ссылка
	            |ГДЕ
	            |	ЗаборТовара.Номер = &НомерЗаказа";
	
	Зап.УстановитьПараметр("НомерЗаказа", НомерЗаказа);
	Зап.УстановитьПараметр("СхемаМаршрутизации", СхемаМаршрутизации);
	Выб = Зап.Выполнить().Выбрать();
	Если Выб.Следующий() Тогда
		Магазин = Выб.Магазин;
		НомерЗаказа = Выб.НомерЗаказа;
		НомерЗаказаМагазина = Выб.НомерЗаказаИМ;
		Полигон = Выб.Полигон;
		ЛогистическийБрейк = Выб.ЛогистическийБрейк;
		СтоимостьТоваров = Выб.СуммаТоваров;
		СтоимостьДоставки = Выб.СуммаДоставки;
		СтоимостьИтого = Выб.Итого;
		Адрес = Выб.Адрес;
		ТипЗаказа = Выб.ТипЗаказа;
		ОбъемЗабора = Выб.ОбъемЗабора;
		Агрегатор = Выб.Агрегатор;
		ИнтервалВремениС = Выб.ИнтервалВремениС;
		ИнтервалВремениПо = Выб.ИнтервалВремениПо;
		ВесЗаказа = Выб.ВесЗаказа;
		ОбъемЗаказа = Выб.ОбъемЗаказа;
	КонецеСли;	
	ВидимостьГрупп();
	Товары.Параметры.УстановитьЗначениеПараметра("Заказ", Выб.Заказ);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВидимостьГрупп()
	Если ТипЗаказа = Перечисления.ТипыЗаказов.Доставка Тогда
		Элементы.ГруппаПараметрыЗабора.Видимость = Ложь;
	ИначеЕсли ТипЗаказа = Перечисления.ТипыЗаказов.Забор Тогда	
		Элементы.ГруппаСтоимость.Видимость = Ложь;
		Элементы.ГруппаПараметрыЗаказа.Видимость = Ложь;
	КонецеСли;	
КонецПроцедуры	
