
Процедура ЗавершениеПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	обВедущаяЗадача = ВедущаяЗадача.ПолучитьОбъект();
	Попытка
	обВедущаяЗадача.ДоставкаЗавершена = ДоставкаЗавершена;
исключение
	Возврат;
КонецПопытки;
	обВедущаяЗадача.ДоставкаВыполнена = ДоставкаВыполнена;
	обВедущаяЗадача.ДоставкаВыполненаЧастично = ДоставкаВыполненаЧастично;
	обВедущаяЗадача.РезультатДоставки = РезультатДоставки;
	обВедущаяЗадача.Записать();
КонецПроцедуры

Процедура ВводОтчетаОДоставкеПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	ДоставкаЗавершена = Задача.ДоставкаЗавершена;
	ДоставкаВыполнена = Задача.ДоставкаВыполнена;
	ДоставкаВыполненаЧастично = Задача.ДоставкаВыполненаЧастично;
	РезультатДоставки = Задача.РезультатДоставки;
КонецПроцедуры
