//+++ БАО 07.07.2017 №1250
//----Функция ПолучитьРасстояниеПоДорогам_GoogleAPI(Широта1, Долгота1, Широта2, Долгота2)  Экспорт
Функция ПолучитьРасстояниеПоДорогам_GoogleAPI(Широта1, Долгота1, Широта2, Долгота2, НомерПотока = "")  Экспорт
//--- БАО 07.07.2017 №1250 	
	
	
	Если ЗначениеЗаполнено(Широта1) И ЗначениеЗаполнено(Долгота1) И ЗначениеЗаполнено(Широта2) И ЗначениеЗаполнено(Долгота2) Тогда			
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
	GoogleKey = "AIzaSyCXAMWZXJkw_AM3Rodslq-KS813ryVNM_M";
	
	ТекстТочкаОтправления = "" + Формат(Широта1, "ЧЦ=9; ЧДЦ=6; ЧРД=.") + "," + Формат(Долгота1, "ЧЦ=9; ЧДЦ=6; ЧРД=.");
	ТекстТочкаПрибытия = "" + Формат(Широта2, "ЧЦ=9; ЧДЦ=6; ЧРД=.") + "," + Формат(Долгота2, "ЧЦ=9; ЧДЦ=6; ЧРД=.");
	
	ТекстЗапроса = "https://maps.googleapis.com/maps/api/distancematrix/json?origins=";
	ТекстЗапроса = ТекстЗапроса + ТекстТочкаОтправления + "&destinations=" + ТекстТочкаПрибытия + "&mode=driving&key=" + GoogleKey;	
	
	Попытка 		
		XMLHttp    = GetCOMObject("",    "Microsoft.XMLHTTP"); 
	Исключение 
		Возврат Неопределено; 
	КонецПопытки;	
	
	Попытка 
		XMLHttp.Open("GET", ТекстЗапроса, Ложь); 
	Исключение 
		#Если Клиент Тогда
			Ошибка = ОписаниеОшибки(); 
		#КонецЕсли
		Возврат Неопределено; 
	КонецПопытки; 
	
	//Отправка запроса 
	Попытка
		XMLHttp.Send();	
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	
	Если НЕ XMLHttp.Status = 200 Тогда 
		Возврат Неопределено;     
	КонецЕсли;	
	
	ОтветХМЛ = XMLHttp.ResponseText;
	//+++ БАО 07.07.2017 №1250
	//---ПутьКФайлу = КаталогВременныхФайлов() +  "\" + Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd") + ".json";
	ПутьКФайлу = КаталогВременныхФайлов() +  "\" + Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd") + НомерПотока +".json";
	//--- БАО 07.07.2017 №1250 
	
	ФайлОтвета = новый ТекстовыйДокумент;
	ФайлОтвета.ДобавитьСтроку(ОтветХМЛ);
	Попытка
	ФайлОтвета.Записать(ПутьКФайлу);
Исключение
	Возврат Неопределено;
	КонецПопытки;
	
	тЧтение = Новый ЧтениеJSON;
	тЧтение.ОткрытьФайл(ПутьКФайлу);
	тДанные = ПрочитатьJSON(тЧтение, Ложь);
	
	Если тДанные.status = "OK" Тогда
		Если тДанные.rows[0].elements[0].status = "OK" Тогда
			Расстояние = тДанные.rows[0].elements[0].distance.value/1000;	
			Возврат Окр(Расстояние,3);	
		КонецЕсли;
	КонецЕсли;	
	
	Возврат Неопределено;
	
КонецФункции // ()



Функция Геокодирование_GoogleAPI(СтрокаАдреса)  Экспорт
	
	
	Если ЗначениеЗаполнено(СтрокаАдреса) Тогда			
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
	GoogleKey = "AIzaSyD119yoR6SkMVlpf7KufCp-yivKSN1sOdI";
	
	ПутьКФайлу = КаталогВременныхФайлов() +  "\" + Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd") + ".json";
	
	Попытка
		Соединение = Новый HTTPСоединение("maps.googleapis.com",,,,,, Новый ЗащищенноеСоединениеOpenSSL(Новый СертификатКлиентаWindows(), Новый СертификатыУдостоверяющихЦентровWindows()));	
		Отв = Соединение.Получить("/maps/api/geocode/json?address=" + СтрЗаменить(СтрокаАдреса, " ", "%20")  + "&key=" + GoogleKey, ПутьКФайлу);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	
	тЧтение = Новый ЧтениеJSON;
	тЧтение.ОткрытьФайл(ПутьКФайлу);
	тДанные = ПрочитатьJSON(тЧтение, Ложь);
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Широта", );
	СтруктураВозврата.Вставить("Долгота", );
	
	Если тДанные.status = "OK" Тогда
		Если тДанные.results[0].geometry.location_type = "ROOFTOP" Тогда
			СтруктураВозврата = Новый Структура;
			СтруктураВозврата.Вставить("Широта", тДанные.results[0].geometry.location.lat);
			СтруктураВозврата.Вставить("Долгота", тДанные.results[0].geometry.location.lng);
			
			Возврат СтруктураВозврата;
		КонецеСли;	
	КонецЕсли;	
	
	Возврат Неопределено;
	
КонецФункции // ()

