#Область ПрограммныйИнтерфейс
#Область ПолучениеСтруктурДанных
// Получить структуру данные установки результата доставки.
// 
// Параметры:
//  Заказ - СправочникСсылка.Заказы - Заказ
//  Рейс - СправочникСсылка.Рейсы - Рейс
//  РезультатДоставки - СправочникСсылка.РезультатыДоставки - Результат доставки
//  ПричинаОтказаПереноса - СправочникСсылка.ПричиныОтказаПереноса, Неопределено - Причина отказа переноса
// 
// Возвращаемое значение:
//  Структура - Получить структуру данные установки результата доставки:
// * РезультатДоставки - СправочникСсылка.РезультатыДоставки
// * ПричинаОтказаПереноса - СправочникСсылка.ПричиныОтказаПереноса, Неопределено - Причина отказа переноса
// * Заказ - СправочникСсылка.Заказы
// * Рейс - СправочникСсылка.Рейсы
// * Основание - СправочникСсылка.Заказы
Функция ПолучитьСтруктуруДанныеУстановкиРезультатаДоставки(Заказ, Рейс, РезультатДоставки, ПричинаОтказаПереноса = Неопределено) Экспорт
	ПараметрыСтатуса = Новый Структура;
	ПараметрыСтатуса.Вставить("РезультатДоставки", РезультатДоставки);
	ПараметрыСтатуса.Вставить("ПричинаОтказаПереноса", ПричинаОтказаПереноса);
	ПараметрыСтатуса.Вставить("Заказ", Заказ);
	ПараметрыСтатуса.Вставить("Рейс", Рейс);
	ПараметрыСтатуса.Вставить("Основание", Заказ);
	
	Возврат ПараметрыСтатуса;
КонецФункции	

// Получить структуру данные получения сведений о подъеме заказа.
// 
// Параметры:
//  НомерЗаказа - Строка - Номер заказа
//  ВидПодъема - ПеречислениеСсылка.ВидыПодъемовЗаказаНаЭтаж - Вид подъема
//  Этаж - Число - Этаж
//  ВесЗаказа - Число - Вес заказа
// 
// Возвращаемое значение:
//  Структура - Получить структуру данные получения сведений о подъеме заказа:
// * ВидПодъема - ПеречислениеСсылка.ВидыПодъемовЗаказаНаЭтаж - Вид подъема 
// * Этаж - Число - Этаж 
// * НомерЗаказа - Строка - Номер заказа 
// * КоличествоХодокНаЭтаж - Число - 
// * ВесЗаказа - Число - Вес заказа 
Функция ПолучитьСтруктуруДанныеПолученияСведенийОПодъемеЗаказа(НомерЗаказа, ВидПодъема, Этаж, ВесЗаказа) Экспорт
	ДанныеПодъема = Новый Структура;
	ДанныеПодъема.Вставить("ВидПодъема", ВидПодъема);
	ДанныеПодъема.Вставить("Этаж", Этаж);
	ДанныеПодъема.Вставить("НомерЗаказа", НомерЗаказа);
	ДанныеПодъема.Вставить("КоличествоХодокНаЭтаж", 1);
	ДанныеПодъема.Вставить("ВесЗаказа", ВесЗаказа);
	
	Возврат ДанныеПодъема;
КонецФункции
#КонецОбласти
#КонецОбласти