
&НаКлиенте
Процедура СписокЗакрытиеЗаказовПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.СписокЗакрытиеЗаказов.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ЗаполнитьЗаказы(ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаказы(ЗакрытиеЗаказов)
	
	СписокЗаказы.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗакрытиеЗаказовЗаказы.Номер,
	|	ЗакрытиеЗаказовЗаказы.Водитель,
	|	ЗакрытиеЗаказовЗаказы.Экспедитор,
	|	ЗакрытиеЗаказовЗаказы.Реализация КАК Заказ
	|ИЗ
	|	Документ.ЗакрытиеЗаказов.Заказы КАК ЗакрытиеЗаказовЗаказы
	|ГДЕ
	|	ЗакрытиеЗаказовЗаказы.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ЗакрытиеЗаказов);
	
	Результат = Запрос.Выполнить();
	ТЗ = Результат.Выгрузить();
	Для каждого СтрокаТЗ Из ТЗ Цикл
		НоваяСтрокаЗаказы = СписокЗаказы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаЗаказы, СтрокаТЗ);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗаказыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СписокЗаказы.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ОповеститьОВыборе(ТекущиеДанные.Заказ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ТерминалДоставки) Тогда
		Отбор = СписокЗакрытиеЗаказов.Отбор.Элементы;
		УсловиеОтбора = Отбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		УсловиеОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТерминалДоставки");
		УсловиеОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		УсловиеОтбора.ПравоеЗначение = Параметры.ТерминалДоставки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Вставить содержимое обработчика
КонецПроцедуры
