
#Область ПрограммныйИнтерфейс
// Получить имя провайдера.
// 
// Возвращаемое значение:
//  Строка - Получить имя провайдера
Функция ПолучитьИмяПровайдера() Экспорт
	#Если МобильноеПриложениеКлиент Тогда
	Данные = ГеопозиционированиеСервер.ПолучитьИмяПровайдера();
	Провайдер = Неопределено;
	Если Данные.Выбор = ПредопределенноеЗначение("Перечисление.ИспользуемыйПровайдерГеопозиционирования.СамыйЭкономичныйПровайдер") Тогда
		Провайдер = СредстваГеопозиционирования.ПолучитьСамогоЭнергоЭкономичногоПровайдера();
	ИначеЕсли Данные.Выбор = ПредопределенноеЗначение("Перечисление.ИспользуемыйПровайдерГеопозиционирования.СамыйТочныйПровайдер") Тогда
		Провайдер = СредстваГеопозиционирования.ПолучитьСамогоТочногоПровайдера();
		Если Провайдер = Неопределено Тогда
			//берем первого попавшегося провайдера
			МасПровайдеров = СредстваГеопозиционирования.ПолучитьПровайдеров();
			Для Каждого ТекПровайдер Из МасПровайдеров Цикл
				Провайдер = ТекПровайдер;
				Прервать;
			КонецЦикла;
		КонецЕсли;	
	Иначе
		Если Не ЗначениеЗаполнено(Данные.Имя) Тогда
	        Ответ = Вопрос(НСтр("ru = ""Не выбран провайдер геопозиционирования. Установить его сейчас?"";"), РежимДиалогаВопрос.ДаНет, 0);
	        Если Ответ = КодВозвратаДиалога.Да Тогда
				ПараметрыФормы = Новый Структура("Геопозиционирование", Истина); 
	            ОткрытьФормуМодально("ОбщаяФорма.ФормаКонстант", ПараметрыФормы);
				Возврат ПолучитьИмяПровайдера();
	        Иначе
	            Возврат "";
	        КонецЕсли;
		КонецЕсли;
		Провайдер = СредстваГеопозиционирования.ПолучитьПровайдера(Данные.Имя);
		Если Провайдер = Неопределено Тогда
	        Ответ = Вопрос(НСтр("ru = ""Не доступен провайдер геопозиционирования. Изменить установки?"";"), РежимДиалогаВопрос.ДаНет, 0);
	        Если Ответ = КодВозвратаДиалога.Да Тогда
				ПараметрыФормы = Новый Структура("Геопозиционирование", Истина); 
	            ОткрытьФормуМодально("ОбщаяФорма.ФормаКонстант", ПараметрыФормы);
				Возврат ПолучитьИмяПровайдера();
	        Иначе
	            Возврат "";
	        КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если Провайдер <> Неопределено Тогда
		Возврат Провайдер.Имя;
	КонецЕсли;
	#КонецЕсли
	Возврат "";

КонецФункции


// Обновить местоположение.
// 
// Параметры:
//  ИмяПровайдера - Строка - Имя провайдера
// 
// Возвращаемое значение:
//  Булево - Обновить местоположение
Функция ОбновитьМестоположение(ИмяПровайдера = "") Экспорт   
	#Если МобильноеПриложениеКлиент Тогда
	
	СписокПровайдеров = СредстваГеопозиционирования.ПолучитьПровайдеров(Истина);
	
	Если СписокПровайдеров.Количество() = 0 Или СписокПровайдеров.Количество() = 1  Тогда
		Предупреждение("Отсутствуют провайдеры геопозиционирования!", 60);
		Возврат Ложь;
	Иначе
		//ИмяПровайдера = СписокПровайдеров[1].Имя;
	КонецеСли;	
	
	ТекущиеНастройкиПровайдера = ГеопозиционированиеСервер.ПолучитьИмяПровайдера();
	Если Не ЗначениеЗаполнено(ТекущиеНастройкиПровайдера.Имя) Тогда
		ЛокацияПолучена = Ложь;
		КоличествоПровайдеровГеопозиционирования = СписокПровайдеров.Количество();

		
		ИмяПроверяемогоПровайдера = "";
		ТипПроверяемогоПровайдера = "";
		
		Пока Не ЛокацияПолучена Цикл
			Если Не ЗначениеЗаполнено(ТипПроверяемогоПровайдера) Тогда
				ТипПроверяемогоПровайдера = "Точный";
				Провайдер = СредстваГеопозиционирования.ПолучитьСамогоТочногоПровайдера();
			ИначеЕсли ТипПроверяемогоПровайдера = "Точный" Тогда
				ТипПроверяемогоПровайдера = "Экономный";
				Провайдер = СредстваГеопозиционирования.ПолучитьСамогоЭнергоЭкономичногоПровайдера();
			Иначе
				Прервать;
			КонецЕсли;	
								
			Если Провайдер = Неопределено Тогда
				Продолжить;
			Иначе
				ИмяПроверяемогоПровайдера = Провайдер.Имя;
			КонецеСли;	
								
			Если СредстваГеопозиционирования.ОбновитьМестоположение(ИмяПроверяемогоПровайдера, 10) Тогда
				ЛокацияПолучена = Истина;				
				ГеопозиционированиеСервер.УстановитьДанныеПровайдераГеопозиционированияВКонстантах(ИмяПроверяемогоПровайдера);				
				Прервать;
			КонецЕсли;	
		КонецЦикла;	
		
		// поиск провайдеров перебором
		Если Не ЛокацияПолучена Тогда
			Для ИндексТекущегоПроверяемогоПровайдера = 0 По КоличествоПровайдеровГеопозиционирования - 1 Цикл
				ИмяПроверяемогоПровайдера = СписокПровайдеров[ИндексТекущегоПроверяемогоПровайдера].Имя;
				Если СредстваГеопозиционирования.ОбновитьМестоположение(ИмяПроверяемогоПровайдера, 10) Тогда
					ЛокацияПолучена = Истина;				
					ГеопозиционированиеСервер.УстановитьДанныеПровайдераГеопозиционированияВКонстантах(ИмяПроверяемогоПровайдера);				
					Прервать;
				КонецЕсли;					
			КонецЦикла;	 
		КонецЕсли;
	Иначе
		//Провайдер был ранее найден
		Если СредстваГеопозиционирования.ОбновитьМестоположение(ТекущиеНастройкиПровайдера.Имя, 10) Тогда
			ЛокацияПолучена = Истина;				
		КонецЕсли;	
		// TODO: Добавить поиск провайдера по выбранному типу.					
	КонецЕсли;		
		
	Если ЛокацияПолучена Тогда
		Возврат Истина;
	Иначе
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не могу определить местоположение!";
		Сообщение.Сообщить();
		Возврат Ложь;
	КонецЕсли;
	#КонецЕсли
	Возврат Ложь;  
КонецФункции

// Текущие координаты.
// 
// Возвращаемое значение:
//  Неопределено, ДанныеМестоположения - Текущие координаты
Функция ТекущиеКоординаты() Экспорт
	#Если МобильноеПриложениеКлиент Тогда
		Если ОбновитьМестоположение() Тогда
			ТекущиеНастройкиПровайдера = ГеопозиционированиеСервер.ПолучитьИмяПровайдера();
			ИмяПровайдера = ТекущиеНастройкиПровайдера.Имя;
			ДанныеМестоположения = СредстваГеопозиционирования.ПолучитьПоследнееМестоположение(ИмяПровайдера);
			Возврат ДанныеМестоположения;
		КонецЕсли;
	#КонецЕсли
	Возврат Неопределено;
КонецФункции


// Получить и зафиксировать регион работы МП.
Процедура ПолучитьИЗафиксироватьРегионРаботыМП() Экспорт
	ДанныеМестоположения = ТекущиеКоординаты();
	ПолученныйПоКоординатамРегион = Неопределено;
	Если ДанныеМестоположения <> Неопределено Тогда
		СтруктураМестоположение = Новый Структура("Широта, Долгота", ДанныеМестоположения.Координаты.Широта, ДанныеМестоположения.Координаты.Долгота);
		ПолученныйПоКоординатамРегион = ГеопозиционированиеСервер.ПолучитьТекущийРегион(СтруктураМестоположение);
	КонецеСли;	
	
	Если ПолученныйПоКоординатамРегион = Неопределено Тогда
		Если ГеопозиционированиеСервер.ВозможноИНеобходимоВыбратьРегионРаботыМП() Тогда
			//ВыбранныйРегион = ВыбратьРегионРаботыМПВПользовательскомРежиме();
			ВыбратьРегионРаботыМПВПользовательскомРежиме();
		КонецеСли;
	Иначе
		ГеопозиционированиеСервер.УстановитьТекущийРегион(ПолученныйПоКоординатамРегион);
	КонецеСли;	
КонецПроцедуры
#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс
// Выбрать регион работы МПВПользовательском режиме.
// 
Асинх Процедура ВыбратьРегионРаботыМПВПользовательскомРежиме() Экспорт
//	ВыбранноеЗначение = Неопределено;
//	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборРегионаРаботыМПОкончание", ГеопозиционированиеКлиент);
//	ПоказатьВводЗначения(ОписаниеОповещения, ВыбранноеЗначение, "Регион доставки...", Тип("СправочникСсылка.РегиональныеТерминалы"))

	СписокВыбора = ОбщегоНазначенияСервер.ПолучитьСписокЗначенийРегиональныхТерминалов();
	ВыбРегион = СписокВыбора[0];
    ВыбРегион = Ждать СписокВыбора.ВыбратьЭлементАсинх("Регион доставки...", ВыбРегион);
    
	Если ВыбРегион <> Неопределено Тогда
		ГеопозиционированиеСервер.УстановитьТекущийРегион(ВыбРегион.Значение);
	КонецЕсли;    
 
КонецПроцедуры

//Процедура ВыборРегионаРаботыМПОкончание(Результат, Параметры) Экспорт
//	Если ЗначениеЗаполнено(Результат) Тогда
//		ГеопозиционированиеСервер.УстановитьТекущийРегион(Результат);
//	КонецеСли;		
//КонецПроцедуры	
#КонецОбласти		
	

