
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Соединение = Евген.СоздатьПодключениеКИнтернетМагазину();
	
	//1. Выставлять статусинтернетмагазина на реализации = 4
	РеализацияОбъект = Заказ.ПолучитьОбъект();
	РеализацияОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	РеализацияОбъект.СтатусИнтернетМагазина = 4;
	
	
	//2. Помечать док на удаление		
	РеализацияОбъект.ПометкаУдаления = Истина;
	РеализацияОбъект.ОбменДанными.Загрузка = Истина;
	РеализацияОбъект.Записать(РежимЗаписиДокумента.Запись);
		
	
	//3. Делать записи в РН Закрытые заказы по подобию документа Закрытие
	ЗакрытыеЗаказы();
	
	
	//4. Делать записи в РС СтатусыСкладскогоУчета по подобию загрузки отклоненного заказа в обработке ЗагрузкаИзИнтернетМагазина
	Движения.СтатусыСкладскогоУчета.Записывать = Истина;
	
	Если smv.ЗаказПодтвержденПриходом(Заказ, ТекущаяДата(), Справочники.СтатусыСкладскогоУчета.ПриходПроверен) И smv.НебылоВозврата(Заказ) Тогда		
		Движение = Движения.СтатусыСкладскогоУчета.Добавить();
		Движение.Заказ = Заказ;
		Движение.Период = Дата;
		Движение.Регистратор = ЭтотОбъект.Ссылка;    
		Движение.ТипЗаказа = Перечисления.ТипыЗаказов.Доставка;
		
		Если СтатусAxiomus = 81 Тогда  // предотмена			
			Движение.СтатусСкладскогоУчета = Справочники.СтатусыСкладскогоУчета.Возврат1;	
		ИначеЕсли СтатусAxiomus = 120 Тогда  // полный отказ
		    Движение.СтатусСкладскогоУчета = Справочники.СтатусыСкладскогоУчета.Возврат2;
		КонецЕсли;		
   	КонецЕсли;
	
		
	
	//5. Обновлять статус заказа в админке, опять же, по подобию документа ЗакрытиеЗаказов
	
	//ЗаписьЖурналаРегистрации("Отмена заказа", УровеньЖурналаРегистрации.Информация, Метаданные.Документы.РеализацияТоваровУслуг, Заказ, ""+БылСтатус+" -> 4");
	
	Комм = Лев(СокрЛП(Заказ.КомментарийСД), 100);	
	ReasonRefusalID = ?(ЗначениеЗаполнено(ПричинаОтклоненияЗаказаВСистеме.Код), Прав(ПричинаОтклоненияЗаказаВСистеме.Код,1), 0);
    orderID = СокрЛП(Заказ.Номер);
    who = ПараметрыСеанса.ТекущийПользователь;
    completeDate = Евген.ДатаВSQL(Заказ.Дата, Ложь);
	//serviceDC = Формат(Стр.Показатель1 + Стр.Показатель2 + Стр.Показатель3 + Стр.Показатель4 + Стр.Показатель5 + Стр.Показатель6, "ЧРД=.; ЧН=0; ЧГ=");
	//serviceDCclean = Формат(Стр.УслугиСДЧистые, "ЧРД=.; ЧН=0; ЧГ=");	
	serviceDC = Формат(0, "ЧРД=.; ЧН=0; ЧГ=");
	serviceDCclean = Формат(0, "ЧРД=.; ЧН=0; ЧГ=");	
    comment = СтрЗаменить(Комм, "'", """");
    isRefusal = 0;
	//ReasonRefusal = ?(Стр.ПричинаОтказа.Пустая(), "", СокрЛП(Стр.ПричинаОтказа.Наименование));
	ReasonRefusal = "";
    deliveryPrice = "NULL";
    payType  = "NULL";
							
	// Отключено в рамках Задача № 2586						
	//ТекстЗапроса = "
	//|DECLARE @t TSetOrderStatus
	//|INSERT INTO @t ([orderID],[statusId],[who],[completeDate],serviceDC,serviceDCclean,comment, isRefusal, ReasonRefusal, deliveryPrice, payType, ReasonRefusalID) VALUES (" +
	//orderID +", 4, '" +who+"', '"+completeDate+"', "+serviceDC+"," +serviceDCclean+",'" +comment+"', "+isRefusal+ ", '" +ReasonRefusal+"'," +deliveryPrice+ "," +payType+","+ReasonRefusalID+")
	//|EXEC import_setOrderStatusFrom1C @t
	//|";
	//Евген.ЗапросКИнтернетМагазину(ТекстЗапроса, Соединение);
	
	// Задача № 2586
	
	closeFlag = ?(РежимПроведения = РежимЗаписиДокумента.Проведение, 1, 0);
	
	mas.ОтправитьФинальныйСтатусВАдминку(orderID, 4, comment,
	who,
	Заказ.Дата,
	serviceDC,
	serviceDCclean,
	IsRefusal,
	,
	,
	,
	ReasonRefusalID,
	,
	closeFlag,
	Заказ.ТерминалДоставки.Код);
	// Задача № 2586
	
	
КонецПроцедуры

// Движение по РН ЗакрытыеЗаказы
Процедура ЗакрытыеЗаказы()

	Движения.ЗакрытыеЗаказы.БлокироватьДляИзменения = Истина;
    Движения.ЗакрытыеЗаказы.Записать();	
	
		
	Нов = Движения.ЗакрытыеЗаказы.Добавить();
	                    
	Нов.ПричинаОтклоненияЗаказа = ПричинаОтклоненияЗаказаВСистеме;
	Нов.Период = Заказ.Дата;
	
	//Нов.БанковскаяКомиссия = ;
	//Нов.СтраховойСбор      = ;                
	//Нов.ПричинаОтклоненияЗаказа = ;
	//Нов.Возврат = ;
	//Нов.Доставка = ;
	Нов.ИнтернетМагазин = Заказ.ВладелецТовара;
	//Нов.КассовоеОбслуживание = ;	
	Нов.Клиент = Заказ.Контрагент;
	//Нов.Оприходование = ;
	//Нов.Перемещение = ;
	//Нов.УслугиСДЧистые =;
	//Нов.Поступление = ;
	//Нов.ПричинаНевыполнения = ;
	Нов.Реализация = Заказ;
	//Нов.Списание = ;
	//Нов.СтатусЗаказа = ;
	//Нов.VIPДоставка = ;
	Нов.ПредоплатаПоКредиту = Заказ.ПредоплатаПоКредиту;
	Нов.ЗонаТарификации = Заказ.ЗонаТарификации;		
	Нов.ТерминалДоставки = Заказ.ТерминалДоставки;
	Нов.ТерминалПриёма = Заказ.ТерминалПриема;
	//Нов.ФактическийВес = Заказ.ФактическийВес;
	Нов.СтатусИнтернетМагазина = Справочники.СтатусЗаказаИнтернетМагазина.ЗаказОтклонен;	
	//Нов.СуммаДоставкиДоМКАД = ;
	//Нов.СуммаДоставкиЗаМКАД = ;
		
	//ОбновитьОтказСЗаездомПоЗаказуВАдминке(СокрЛП(Тек.Реализация.Номер));
	
	Нов.СуммаОценочная = Заказ.Товары.Итог("Сумма");
	Нов.СуммаПолученная = Заказ.Товары.Итог("Сумма");
	Нов.КатегорияДоставки = Заказ.КатегорияДоставки;

	//Нов.ТипОплаты = Заказ.ТипОплаты;
	Нов.ТипЗаказа = Перечисления.ТипыЗаказов.Доставка;
	//Нов.УслугиСД = ;
	//Нов.Масса = ;
	//Нов.Экспедитор = ;
	//Нов.Водитель = ;
	//Нов.АгентскоеВознаграждение = Заказ.АгентскоеВознаграждение;
	//Нов.Транспорт = ;
	//Нов.ПризнакВозврата = ;	
	//Нов.ЮрЛицо = ;	
	//Нов.ТарифнаяСетка = Заказ.ТарифнаяСетка;
	//Нов.ТарифнаяСеткаПартнера = Заказ.ТарифнаяСеткаПартнера;
	//Нов.РасчетныйБрейк = Заказ.РасчетныйБрейк;				
	//Нов.ОценочнаяСтоимость = ;
	
	Если ЗначениеЗаполнено(Заказ.ВладелецТовара) Тогда 
		Если Не Заказ.ВладелецТовара.Родитель.ОсновнойМагазин.Пустая() Тогда
			Нов.Партнер = Заказ.ВладелецТовара.Родитель.ОсновнойМагазин;
		Иначе
			Нов.Партнер = Заказ.ВладелецТовара;
		КонецеСли;
	КонецЕсли;	
	
    Движения.ЗакрытыеЗаказы.БлокироватьДляИзменения = Истина;
    Движения.ЗакрытыеЗаказы.Записать();

КонецПроцедуры
