
//Асеев 03.10.2023 (Задача № 5137)>>>
Функция ВыполнятьИзменениеДатыДоставки(ОтчетВодителя) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ОтчетВодителя);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИСТИНА КАК Поле1
	|ИЗ
	|	Документ.новаОтчетВодителя КАК новаОтчетВодителя
	|ГДЕ
	|	новаОтчетВодителя.Ссылка = &Ссылка
	|	И новаОтчетВодителя.Транспорт.Код В (""000838"", ""000082"", ""001067"", ""000098"", ""000681"", ""000917"", ""000694"", ""000837"", ""001075"", ""001074"", ""001071"", ""001073"", ""001098"", ""001049"", ""001081"", ""001050"", ""000735"")";
	
	Возврат Запрос.Выполнить().Пустой();
	
КонецФункции
//Асеев 03.10.2023 (Задача № 5137)<<<



