Процедура ЭмуляцияВводаДанныхВодителемПоИнициативеПартнера(Заказ, РезультатДоставки, ДатаПереноса = "") Экспорт
	НовыйДок = СоздатьДокумент();
	НовыйДок.Дата = ТекущаяДата();
	НовыйДок.Реализация = Заказ;
	НовыйДок.РезультатДоставки = РезультатДоставки;
	НовыйДок.ДатаПереноса = ДатаПереноса;
	НовыйДок.ТипОплаты = Заказ.ТипОплаты;
	
	
	НовыйДок.СуммаДоставка = Заказ.СуммаДоставка;
			
	Для каждого Тек Из Заказ.Товары Цикл
		НовТов = НовыйДок.ДоставленныеТовары.Добавить();
		НовТов.Номенклатура = Тек.Товар;
		НовТов.КоличествоДоставлено = Тек.Количество;
		НовТов.Цена = Тек.Цена;
		НовТов.Сумма = Тек.Сумма;
		НовТов.СтавкаНДС = Тек.СтавкаНДС;
		НовТов.ШтрихкодТовара = Тек.ШтрихкодТовара;
		НовТов.КодМаркировки = Тек.КодМаркировки;
		НовТов.ПоставщикТовара = Тек.ПоставщикТовара;
	КонецЦикла;	
	
	Если НовыйДок.ТипОплаты = Справочники.ТипыОплат.Наличные Или НовыйДок.ТипОплаты = Справочники.ТипыОплат.Терминал Тогда
		НовыйДок.СуммаНал = НовыйДок.СуммаДоставка + НовыйДок.ДоставленныеТовары.Итог("Сумма");
	КонецеСли;	
	
	НовыйДок.ТестоваяСреда = Константы.ТестоваяСреда.Получить();
	
	НовыйДок.Записать(РежимЗаписиДокумента.Запись);
	ПланыОбмена.УдалитьРегистрациюИзменений(Константы.УзелПланаОбмена.Получить(), НовыйДок.Ссылка);
КонецПроцедуры	