
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
  ////   //ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
  ////  //СхемаКомпоновкиДанных = ОтчетОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
  ////  СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
  //////Схема = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
  ////  
  ////  //...и настройки
  ////   КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных();
  ////  
  ////  Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
  ////  
  ////  КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
  ////  Настройки = КомпоновщикНастроек.ПолучитьНастройки();
  ////  //ДанныеРасшифровки 	= Новый ДанныеРасшифровкиКомпоновкиДанных;
  ////  
  ////  НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
  ////  //КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[0].Значение = Контрагент;
  ////  //КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[3].Значение = Период; 
  ////  НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("ВладелецТовара",		КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[0].Значение);	
  ////  НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("ПериодОтчета",	КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[3].Значение);
  //  
  //  СтандартнаяОбработка = Ложь;
  //  
  //  Макет = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
  //  
  //  НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
  //  //НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНачала",		КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[2].Значение);	
  //  //НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаОкончания",	КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[3].Значение);
  //  НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("ВладелецТовара",		КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[0].Значение);	
  //  НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("ПериодОтчета",	КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[3].Значение);
  //  
  //  КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиОтчета);
  //  
  //  КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
  //  МакетКомпоновки = КомпоновщикМакета.Выполнить(
  //  СхемаКомпоновкиДанных,
  //  КомпоновщикНастроек.Настройки,
  //  ДанныеРасшифровки);
  //  
  //  ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
  //  ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);
  //  
  //  ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
  //  ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
  //  ПроцессорВывода.Вывести(ПроцессорКомпоновки);

КонецПроцедуры

