
//**** Обработчики событий объекта ****//

//Расчёт рёбер
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	Ребра.Очистить();
	
	КоличествоТочек = Точки.Количество() - 1;
	Если КоличествоТочек < 2 Тогда Возврат; КонецЕсли;
	
	ПредШирота = Точки[0].Широта;
	ПредДолгота = Точки[0].Долгота;
	
	Для ъ = 1 По КоличествоТочек Цикл
		стрРебро = Ребра.Добавить();
		стрРебро.Широта1 = ПредШирота;
		стрРебро.Долгота1 = ПредДолгота;
		стрРебро.Широта2 = Точки[ъ].Широта;
		стрРебро.Долгота2 = Точки[ъ].Долгота;
		
		ПредШирота = Точки[ъ].Широта;
		ПредДолгота = Точки[ъ].Долгота;
	КонецЦикла;
	
	ъ = 0;
	стрРебро = Ребра.Добавить();
	стрРебро.Широта1 = ПредШирота;
	стрРебро.Долгота1 = ПредДолгота;
	стрРебро.Широта2 = Точки[ъ].Широта;
	стрРебро.Долгота2 = Точки[ъ].Долгота;
КонецПроцедуры

//Расчёт принадлежности адресов к георайону, синхронизация с КСЛ
//
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	

	//Сообщить("Начало обновления привязки адресов к районам...");
	//
	//тзАдресаРайонов = новаКарты.РассчитатьГеоРайоныАдресов(Ссылка,,, Истина);
	//НаборЗаписей = РегистрыСведений.новаРайоныАдресов.СоздатьНаборЗаписей();
	//НаборЗаписей.Отбор.Район.Установить(Ссылка);
	//НаборЗаписей.Отбор.УказанВручную.Установить(Ложь);
	//НаборЗаписей.Загрузить(тзАдресаРайонов);
	//НаборЗаписей.Записать();
	//
	//Сообщить("Обновление районов адресов завершено...");
	
	Попытка
		новаОбменКСЛ.СохранитьГеоРайон(ЭтотОбъект);
	Исключение
		#Если Клиент Тогда			
			новаОбщиеПроцедуры.СообщитьПользователюОбОшибке("ВнутренняОшибкаСервера", ОписаниеОшибки());
		#КонецЕсли
		Отказ = Истина;
	КонецПопытки;
	
КонецПроцедуры

//Синхронизация с КСЛ
//
Процедура ПередУдалением(Отказ)
	
	Попытка
		новаОбменКСЛ.УдалитьГеоРайон(ЭтотОбъект);
	Исключение
		#Если Клиент Тогда			
			новаОбщиеПроцедуры.СообщитьПользователюОбОшибке("ВнутренняОшибкаСервера", ОписаниеОшибки());
		#КонецЕсли
		Отказ = Истина;
	КонецПопытки;
	
КонецПроцедуры
