
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Подкл = Евген.СоздатьПодключениеКИнтернетМагазину();
	ТекД = ТекущаяДата();
	
	МассивСтатусов = Неопределено;// Задача № 2813

	// РС СтатусыЗаказов		
	Для Каждого ТекЗаказ Из СтатусыЗаказов Цикл
	   	    
		Набор = РегистрыСведений.СтатусыЗаказов.СоздатьНаборЗаписей();
		Набор.Отбор.Заказ.Установить(ТекЗаказ.Заказ);
		Набор.Отбор.Период.Установить(ТекД);
		Набор.Прочитать();
		
		НЗапись = Набор.Добавить();
		НЗапись.Период = ТекД;
		НЗапись.Заказ = ТекЗаказ.Заказ;
		НЗапись.Статус = ТекЗаказ.Статус.Код;
		НЗапись.ДокументРегистратор = Ссылка;		
		//НЗапись.Терминал = ТекЗаказ.Заказ.ТерминалДоставки;
		НЗапись.Терминал = ТерминалОбработки; // Задача № 3027
		Набор.Записать();
			
	   
		//СтрЗапроса = "EXEC import_setOrderStatusIDFrom1C " + Формат(Сокрлп(ТекЗаказ.Заказ.Номер), "ЧГ=") + "," + Число(Статус.Код) + ",'Заказ на магистрали'";
		//Евген.ЗапросКИнтернетМагазину(СтрЗапроса, Подкл);
		
		// Задача № 2813
		
		ДопПараметрыСтатуса = mas.ДобавитьДополнительныйПараметрСтатуса("ProcessingTerminal", Число(ТерминалОбработки.Код));// Задача № 3027

		//Асеев 07.04.2021 (Задача № 4529)>>>
		//МассивСтатусов = mas.ДобавитьПараметрыЗаказаДляУстановкиСтатуса(ТекЗаказ.Заказ.Номер, Статус.Код, "Заказ на магистрали",,,МассивСтатусов, ДопПараметрыСтатуса);
		МассивСтатусов = mas.ДобавитьПараметрыЗаказаДляУстановкиСтатуса(ТекЗаказ.Заказ.Номер, ТекЗаказ.Статус.Код, "Заказ на магистрали",,,МассивСтатусов, ДопПараметрыСтатуса);
		//Асеев 07.04.2021 (Задача № 4529)<<<

	КонецЦикла;
	
	СтруктураВозврата = mas.ОтправитьМассивСтатусовЗаказов(МассивСтатусов);// Задача № 2813	
	
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Отказ = Истина;	
	
КонецПроцедуры
