
&НаКлиенте
Процедура ЗаказПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ПолучитьДанныеЭкипажа();
КонецПроцедуры

Процедура ПолучитьДанныеЭкипажа()
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	новаЗаданияРейсов.Рейс,
	            |	новаЗаданияРейсов.Рейс.Транспорт КАК Транспорт,
	            |	новаЗаданияРейсов.Рейс.Водитель КАК Водитель,
	            |	новаЗаданияРейсов.Рейс.Экспедитор КАК Экспедитор,
	            |	ТипыОплат.Ссылка КАК ТипОплатыДо,
	            |	ТипыОплат.Ссылка КАК ТипОплатыПосле
	            |ИЗ
	            |	РегистрСведений.новаЗаданияРейсов КАК новаЗаданияРейсов
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	            |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТипыОплат КАК ТипыОплат
	            |			ПО РеализацияТоваровУслуг.ТипОплаты = ТипыОплат.Код
	            |		ПО новаЗаданияРейсов.Доставка.Номер = РеализацияТоваровУслуг.Номер
	            |ГДЕ
	            |	новаЗаданияРейсов.МаршрутСопровождения = ЛОЖЬ
	            |	И новаЗаданияРейсов.Вид = ЗНАЧЕНИЕ(Перечисление.новаВидыЗаданийРейсаМестнойДоставки.разгрузка)
	            |	И новаЗаданияРейсов.Доставка.Номер = &Доставка
	            |	И новаЗаданияРейсов.Рейс.РейсОтменен = ЛОЖЬ
	            |	И новаЗаданияРейсов.Рейс.РейсВыполнен = ЛОЖЬ
	            |
	            |СГРУППИРОВАТЬ ПО
	            |	новаЗаданияРейсов.Рейс,
	            |	новаЗаданияРейсов.Рейс.Транспорт,
	            |	новаЗаданияРейсов.Рейс.Водитель,
	            |	новаЗаданияРейсов.Рейс.Экспедитор,
	            |	ТипыОплат.Ссылка,
	            |	ТипыОплат.Ссылка
	            |
	            |УПОРЯДОЧИТЬ ПО
	            |	новаЗаданияРейсов.Рейс.Дата УБЫВ";
				
	Зап.УстановитьПараметр("Доставка", Объект.Заказ.Номер);	
	Рез = Зап.Выполнить().Выгрузить();
	Если Рез.количество() >= 1 Тогда
		ЗаполнитьЗначенияСвойств(Объект, Рез[0]);
	Иначе
		Объект.Рейс = "";
		Объект.Транспорт = "";
		Объект.Водитель = "";
		Объект.Экспедитор = "";
		Объект.ТипОплатыДо = "";
		Объект.ТипОплатыПосле = "";
	КонецеСли;
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ГруппаТипОплаты.Доступность = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "ПравоМенятьТипОплаты");
	Элементы.ТипОплатыДо.Доступность = Ложь;
	Элементы.ГруппаТипОплаты.Доступность = Ложь;
	
	если Объект.Оператор.Пустая() Тогда
		Объект.Оператор = ПараметрыСеанса.ТекущийПользователь;
	КонецеСли;	
	
	Если Объект.СформированАвтоматически Тогда
		ТолькоПросмотр = Истина;
	КонецеСли;	
КонецПроцедуры
