Функция ИнициализироватьДополнительныеПараметры(ФизЛицо) Экспорт
	
	СтруктураПараметров = Новый Структура();
	
	Для каждого Поле Из Метаданные.РегистрыСведений.ДополнительныеПараметрыФизЛиц.Измерения Цикл
		СтруктураПараметров.Вставить(Поле.Имя);
	КонецЦикла; 
	
	Для каждого Поле Из Метаданные.РегистрыСведений.ДополнительныеПараметрыФизЛиц.Ресурсы Цикл
		СтруктураПараметров.Вставить(Поле.Имя);
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеПараметрыФизЛицСрезПоследних.ФизЛицо КАК ФизЛицо,
		|	ДополнительныеПараметрыФизЛицСрезПоследних.ОсновнаяРольСотрудника КАК ОсновнаяРольСотрудника
		|ИЗ
		|	РегистрСведений.ДополнительныеПараметрыФизЛиц.СрезПоследних(, ФизЛицо = &ФизЛицо) КАК ДополнительныеПараметрыФизЛицСрезПоследних";
	
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураПараметров, ВыборкаДетальныеЗаписи);
	КонецЦикла;
		
	Возврат СтруктураПараметров;
	
КонецФункции // ()
 
Процедура ДобавлениеИзменениеПараметровФизЛица(ФизЛицо, ОсновнаяРоль) Экспорт

	Набор = РегистрыСведений.ДополнительныеПараметрыФизЛиц.СоздатьНаборЗаписей();
	Набор.Отбор.ФизЛицо.Установить(ФизЛицо);

	Набор.Прочитать();
	
	Запись							= Набор.Добавить();
	Запись.Период					= ТекущаяДата();
	Запись.ФизЛицо					= ФизЛицо;
	Запись.ОсновнаяРольСотрудника	= ОсновнаяРоль;
	Запись.Пользователь				= ПараметрыСеанса.ТекущийПользователь;
	
	Набор.Записать();
	
КонецПроцедуры
