
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    СКД = Обработки.ВыгрузкаМашинВВероут.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
    АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СКД, УникальныйИдентификатор);
    КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных));
    
    Строка  = РеквизитыОбъекта.Добавить();
    Строка.Представление = "МаксимальнаяСкорость";
    Строка.Изменять = Истина;
    Строка.Значение = 0;
    Строка  = РеквизитыОбъекта.Добавить();
    Строка.Представление = "ЦенаЗаКилометр";
    Строка.Изменять = Истина;
    Строка.Значение = 0;
    
    
КонецПроцедуры

&НаСервере
Процедура ИзменитьНаСервере()
    //Результат = новый ТаблицаЗначений;
    ТаблицаТранспорта = СформироватьТаблицуТранспорта(); 
    Для каждого Стр Из ТаблицаТранспорта Цикл
        ТранспортОбъект = Стр.Ссылка.ПолучитьОбъект();
        Для каждого Реквизит Из РеквизитыОбъекта Цикл
            Если Реквизит.Изменять Тогда
                ТранспортОбъект[Реквизит.Представление] = Реквизит.Значение;
            КонецЕсли;
        КонецЦикла;
        ТранспортОбъект.Записать();
    КонецЦикла;
КонецПроцедуры

&НаСервере
Функция  СформироватьТаблицуТранспорта() 
    
    СКД = Обработки.ВыгрузкаМашинВВероут.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
    КомпоновщикНастроек2 = Новый КомпоновщикНастроекКомпоновкиДанных;
    КомпоновщикНастроек2.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СКД));
    КомпоновщикНастроек2.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);    
    
    НастройкиКомпоновщика = КомпоновщикНастроек2.Настройки;
    ПараметрыНастройки = НастройкиКомпоновщика.ПараметрыДанных;
    
    Для каждого Стр Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
        НовыйЭлементОтбора = НастройкиКомпоновщика.Отбор.Элементы.
        Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
        ЗаполнитьЗначенияСвойств(НовыйЭлементОтбора,Стр);
    КонецЦикла; 
    
    
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СКД, НастройкиКомпоновщика,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
    
    ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных);
    
    ТаблицаРезультат = Новый ТаблицаЗначений;
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
    
    ПроцессорВывода.УстановитьОбъект(ТаблицаРезультат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
    
    Возврат ТаблицаРезультат;
КонецФункции

&НаКлиенте
Процедура Изменить(Команда)
    ИзменитьНаСервере();
КонецПроцедуры

