Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	Описание.Имя    = "КассовыйСервер";
	Описание.Версия = "2.0.1.1";
	Описание.ИдентификаторИнтернетПоддержки = "CSS";
	Описание.РежимВыполненияОтложенныхОбработчиков = "Параллельно";
	Описание.ПараллельноеОтложенноеОбновлениеСВерсии = "2.0.1.1";
КонецПроцедуры	

Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры	

Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
КонецПроцедуры	

Процедура ПередОбновлениемИнформационнойБазы() Экспорт
	
КонецПроцедуры

Процедура ПослеОбновленияИнформационнойБазы(
				ПредыдущаяВерсия,
				Версия,
				ВыполненныеОбработчики,
				ВыводитьОписаниеОбновлений,
				ОперативноеОбновление) Экспорт
				
КонецПроцедуры	
			
Процедура ПриПодготовкеМакетаОписанияОбновлений(ДокументОписаниеОбновлений) Экспорт
	
КонецПроцедуры	