
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка=ЛОжь;
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,Настройки,ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,,,Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	ПроцессорВывода.НачатьВывод();
	
	//Обл = ДокументРезультат.Область("R9:R11");
	//ДокументРезультат.ПовторятьПриПечатиСтроки = Обл;
	
	ДокументРезультат.Автомасштаб = истина;
	ЭлементРезультата = ПроцессорКомпоновки.Следующий();

	Пока ЭлементРезультата <> Неопределено Цикл
		Если ЭлементРезультата.ЗначенияПараметров.Количество()=1 Тогда
			Если ЭлементРезультата.ЗначенияПараметров[0].Значение = "Разорвать" Тогда
				ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
		КонецЕсли;
		ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
		ЭлементРезультата = ПроцессорКомпоновки.Следующий();
	КонецЦикла;
	ПроцессорВывода.ЗакончитьВывод();
КонецПроцедуры
//Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
//СтандартнаяОбработка=ЛОжь;

//Настройки = КомпоновщикНастроек.ПолучитьНастройки();

//КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
//МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,Настройки,ДанныеРасшифровки);

//ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
//ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);

//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
//ПроцессорВывода.УстановитьДокумент(ДокументРезультат);

//ПроцессорВывода.НачатьВывод();

//ЭлементРезультата = ПроцессорКомпоновки.Следующий();
//Пока ЭлементРезультата <> Неопределено Цикл
//	Если ЭлементРезультата.ЗначенияПараметров.Количество()=1 Тогда
//			Если ЭлементРезультата.ЗначенияПараметров[0].Значение = "Разорвать" Тогда
//			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
//		КонецЕсли;
//	КонецЕсли;
//	ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
//	ЭлементРезультата = ПроцессорКомпоновки.Следующий();
//КонецЦикла;
//ПроцессорВывода.ЗакончитьВывод();
//КонецПроцедуры

//Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
//	// Вставить содержимое обработчика.
//КонецПроцедуры
