
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Струк = Новый Структура;
	Стр = "";
	ВвестиСтроку(Стр);
	Струк.Вставить("ordernum", Стр);
	Струк.Вставить("orderdate", Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy"));
	Струк.Вставить("merchant_id", 778533);
	Струк.Вставить("login", "life_mobile");
	Струк.Вставить("password", "lifE2mobile");
	
	СтрокаJSON = МодульОбмен_http.СформироватьСтрокуJSON(Струк);
	Сообщить(СтрокаJSON);
	ИнтеграцияAssistКлиент.ВызватьПрослойкуAssist(СтрокаJSON, "Отмена");
	
КонецПроцедуры
