
Функция UTPOST(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	
	ИмяМетода = Запрос.ПараметрыURL.Получить("ИмяМетода");
	ТекстЗапроса = Запрос.ПолучитьТелоКакСтроку();
	
	СтруктураОтвета = Новый Структура;
	
	Попытка
		Если ИмяМетода = "unloadBarcodes" Тогда
			МассивДанных = скан_ОбменДаннымСервер.ДанныеJSONВСтруктуру(ТекстЗапроса, "deliveryDate");
			СтруктураОтвета = скан_СерверСканирования.ЗагрузитьШКВСерверСканирования(МассивДанных);
			
			СтрокаJSON = скан_ОбменДаннымСервер.СформироватьСтрокуJSON(СтруктураОтвета);
			Ответ.УстановитьТелоИзСтроки(СтрокаJSON);
		ИначеЕсли ИмяМетода = "uploadScanDocuments" Тогда	
			МассивДанных = скан_ОбменДаннымСервер.ДанныеJSONВСтруктуру(ТекстЗапроса);
			СтруктураОтвета = скан_СерверСканирования.ВыгрузитьДокументыСканированияВБазуУТ();
			
			СтрокаJSON = скан_ОбменДаннымСервер.СформироватьСтрокуJSON(СтруктураОтвета);
			Ответ.УстановитьТелоИзСтроки(СтрокаJSON);
		ИначеЕсли ИмяМетода = "unloadWeighers" Тогда	
			МассивДанных = скан_ОбменДаннымСервер.ДанныеJSONВСтруктуру(ТекстЗапроса);
			СтруктураОтвета = скан_СерверСканирования.ЗагрузитьЭлектронныеВесыВСерверСканирования(МассивДанных);
			
			СтрокаJSON = скан_ОбменДаннымСервер.СформироватьСтрокуJSON(СтруктураОтвета);
			Ответ.УстановитьТелоИзСтроки(СтрокаJSON);
		//Асеев 14.12.2022 (Задача № 4951)>>>
		ИначеЕсли ИмяМетода = "unloadShops" Тогда	
			МассивДанных = скан_ОбменДаннымСервер.ДанныеJSONВСтруктуру(ТекстЗапроса);
			СтруктураОтвета = скан_СерверСканирования.ЗагрузитьМагазины(МассивДанных);
			
			СтрокаJSON = скан_ОбменДаннымСервер.СформироватьСтрокуJSON(СтруктураОтвета);
			Ответ.УстановитьТелоИзСтроки(СтрокаJSON);
		ИначеЕсли ИмяМетода = "unloadWarehouse" Тогда	
			МассивДанных = скан_ОбменДаннымСервер.ДанныеJSONВСтруктуру(ТекстЗапроса);
			СтруктураОтвета = скан_СерверСканирования.ЗагрузитьСкладыМагазинов(МассивДанных);
			
			СтрокаJSON = скан_ОбменДаннымСервер.СформироватьСтрокуJSON(СтруктураОтвета);
			Ответ.УстановитьТелоИзСтроки(СтрокаJSON);
		
		//Асеев 14.12.2022 (Задача № 4951)<<<
		ИначеЕсли ИмяМетода = "unloadSectors" Тогда	
			МассивДанных = скан_ОбменДаннымСервер.ДанныеJSONВСтруктуру(ТекстЗапроса);
			СтруктураОтвета = скан_СерверСканирования.ЗагрузитьГруппыРайонов(МассивДанных);
			
			СтрокаJSON = скан_ОбменДаннымСервер.СформироватьСтрокуJSON(СтруктураОтвета);
			Ответ.УстановитьТелоИзСтроки(СтрокаJSON);		
		ИначеЕсли ИмяМетода = "unregisterReferences" Тогда
			ВходныеДанные = скан_ОбменДаннымСервер.ДанныеJSONВСтруктуру(ТекстЗапроса);
			СтруктураОтвета = скан_СерверСканирования.ОчиститьРегистрациюДанных(ВходныеДанные);
			
			СтрокаJSON = скан_ОбменДаннымСервер.СформироватьСтрокуJSON(СтруктураОтвета);
			Ответ.УстановитьТелоИзСтроки(СтрокаJSON);			
		КонецеСли;
		
	Исключение
		СтруктураВозврата = Новый Структура;
		ТекстОшибки = ОписаниеОшибки();
		ПараметрыОтправки = Новый Структура("Кому,Тема,Тело","n.stepanov@strizh-logistic.ru,evgeniy.marochkin@strizh-logistic.ru","При выполнении метода " + ИмяМетода + " произошла ошибка!" ,ТекстОшибки);
		РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты,ПараметрыОтправки);	
		СтруктураВозврата.Вставить("result", "error");
		СтруктураВозврата.Вставить("errorDescr", ТекстОшибки);
		СтрокаJSON =скан_ОбменДаннымСервер.СформироватьСтрокуJSON(СтруктураВозврата);
		Ответ.УстановитьТелоИзСтроки(СтрокаJSON);
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции
