
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр мгУчетЗарплаты 
	//Движения.мгУчетЗарплаты.Записывать = Истина;
	//Движения.мгУчетЗарплаты.Очистить();
	//Для Каждого ТекСтрокаДанные Из Данные Цикл
	//	Движение = Движения.мгУчетЗарплаты.Добавить();
	//	Движение.Период = ПериодРегистрации;
	//	Движение.Организация = Организация;
	//	Движение.Терминал = Терминал;
	//	Движение.НачислениеУдержание = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.НачислениеСдельнойОплаты");
	//	Движение.Сотрудник = ТекСтрокаДанные.Сотрудник;
	//	Движение.Сумма = ТекСтрокаДанные.СуммаОплаты;
	//КонецЦикла;

	Движения.мгЗарплатаНачисления.Записывать = Истина;
	Движения.мгЗарплатаНачисления.Очистить();
	Для каждого ТекСтрокаДанные Из Данные Цикл
		Движение = Движения.мгЗарплатаНачисления.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ПериодРегистрации;
		Движение.Организация = ТекСтрокаДанные.Организация;
		Движение.Терминал = Терминал;
		Движение.ВидНачисления = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.Премия");
		Движение.Сотрудник = ТекСтрокаДанные.Сотрудник;
		Движение.Тариф = ТекСтрокаДанные.Сумма;
	КонецЦикла;

КонецПроцедуры
