
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТолькоПросмотр = Истина;
	
	Если Объект.Ссылка.Пустая() Тогда
		Если Объект.Регион.Пустая() Тогда
			Объект.Регион = ПараметрыСеанса.ТерминалДоставки;
			Если Объект.Регион.Пустая() Тогда
				РегионыВыбора = УчетОборудованияСервер.ПолучитьРегионыВыбора();
				Если РегионыВыбора <> Неопределено Тогда
					Регионы.ЗагрузитьЗначения(РегионыВыбора);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Ссылка.Пустая() Тогда
		Если Объект.Регион.Пустая() И Регионы.Количество() Тогда
			Регионы.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ВыборРегионаЗавершение", ЭтотОбъект), "Регион");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборРегионаЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Регионы.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ВыборРегионаЗавершение", ЭтотОбъект), "Регион");
	Иначе
		Объект.Регион = РезультатВыбора.Значение;
	КонецЕсли;
	
КонецПроцедуры