
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Если ЗначениеЗаполнено(Параметры.РежимВыбора) Тогда
        Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	КонецЕсли;
	
	// Михушкин - 02.06.2017 - Разбиение по терминалам --->> 
	ТекТерминал = ПараметрыСеанса.ТерминалДоставки;
	Если НЕ ЗначениеЗаполнено(ТекТерминал) Тогда	
		ТекТерминал = Справочники.РегиональныеТерминалы.МоскваСтриж;		
	КонецЕсли;
	Список.Параметры.УстановитьЗначениеПараметра("ТерминалДоставки", ТекТерминал);
	// <<--- Михушкин 
	
	Список.Параметры.УстановитьЗначениеПараметра("ДатаНач", НачалоДня(Параметры.ДатаРейса));
	Список.Параметры.УстановитьЗначениеПараметра("ДатаКон", КонецДня(Параметры.ДатаРейса));
	Список.Параметры.УстановитьЗначениеПараметра("ДатаКон2", ТекущаяДата());
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	// Вставить содержимое обработчика.
    СтандартнаяОбработка = Ложь; 
		
    Если Не Элементы.Список.ТекущиеДанные.ТранспортОформлениеЯчейки.ИспользованиеЦветаФона Тогда
        Струк = Новый Структура;
        Струк.Вставить("Транспорт", Элементы.Список.ТекущиеДанные.Транспорт);
        Струк.Вставить("Водитель", Элементы.Список.ТекущиеДанные.Водитель);
        Струк.Вставить("Экспедитор", Элементы.Список.ТекущиеДанные.Экспедитор);
        Струк.Вставить("Рейс", Элементы.Список.ТекущиеДанные.Рейс);
        Струк.Вставить("ПоменятьМестами", Ложь);
        
        ЭтаФорма.Закрыть(Струк);
    Иначе
        От = Вопрос("Машина уже выбрана на рейсе!. Хотите поменять местами машины в рейсах?", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
        Если От = КодВозвратаДиалога.Да Тогда
            Струк = Новый Структура;
            Струк.Вставить("Транспорт", Элементы.Список.ТекущиеДанные.Транспорт);
            Струк.Вставить("Водитель", Элементы.Список.ТекущиеДанные.Водитель);
            Струк.Вставить("Экспедитор", Элементы.Список.ТекущиеДанные.Экспедитор);
            Струк.Вставить("Рейс", Элементы.Список.ТекущиеДанные.Рейс);
            Струк.Вставить("ПоменятьМестами", Истина);
            ЭтаФорма.Закрыть(Струк);
        КонецЕсли;
        //Предупреждение("Машина уже выбрана на рейсе!");
    КонецеСли;	
КонецПроцедуры
