&НаСервере
Процедура СформироватьОтчетНаСервере(ТекушийВариант)
	
	СоответствиеЗакрепления = Новый Структура;
	СоответствиеЗакрепления.Вставить("ПоКатегориямЗаказа", 10);
	СоответствиеЗакрепления.Вставить("ПоВесуЗаказа", 10);
	СоответствиеЗакрепления.Вставить("ПоГеографииЗаказа", 11);
	СоответствиеЗакрепления.Вставить("ПоОплатамКлиентов", 10);

	
	ПараметрТекушийВариант = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ТекущийВариант"));
	ТекушийВариант = ПараметрТекушийВариант.Значение;
	Текущийрезультат = "Результат" + ТекушийВариант;
	
	СкомпоноватьРезультат();
	ЭтотОбъект[Текущийрезультат].Очистить();
	ЭтотОбъект[Текущийрезультат].Вывести(Результат);
	Результат = Новый ТабличныйДокумент;
	
	ЭтотОбъект[Текущийрезультат].Автомасштаб = Истина;
	ЭтотОбъект[Текущийрезультат].ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ЭтотОбъект[Текущийрезультат].ФиксацияСверху = СоответствиеЗакрепления[ТекушийВариант];

КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	ТекушийВариант = "";
	СформироватьОтчетНаСервере(ТекушийВариант);
	Элементы.РезультатыФормирования.ТекущаяСтраница = Элементы[ТекушийВариант];	
	
КонецПроцедуры

// Красиво, но теряется управление пользовательскиминастройками
//&НаСервере
//Функция ПолучитьВариантНастройки(ИмяВарианта)
//	
//	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
//	
//	Для каждого Настройка Из ОтчетОбъект.СхемаКомпоновкиДанных.ВариантыНастроек Цикл
//		
//		Если  Настройка.Имя = ИмяВарианта тогда
//			
//			Возврат  Настройка.Настройки;
//						
//		КонецЕсли;
//		
//	КонецЦикла;
//	
//	Возврат Неопределено;
//КонецФункции	

//&НаКлиенте
//Процедура РезультатыФормированияПриСменеСтраницы(Элемент, ТекущаяСтраница)
//	
//	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(ПолучитьВариантНастройки(ТекущаяСтраница.Имя));
//	ЭтаФорма.Заголовок = "Отчет по выполненным заказам (" + ТекущаяСтраница.Заголовок + ")";

//КонецПроцедуры
