
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	Если (ЭтотОбъект.Ссылка = Справочники.ГруппыРайонов.СектораТарификации ИЛИ ЭтотОбъект.Родитель = Справочники.ГруппыРайонов.СектораТарификации ИЛИ ЭтотОбъект.Родитель.Родитель = Справочники.ГруппыРайонов.СектораТарификации) И РольДоступна("Логист") Тогда	
		Отказ = Истина;		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоГруппа Тогда
		Узел = РаботаССервисомСканированияСервер.ПолучитьУзелОбменаССерверомСканированияПоКоду();
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, Ссылка);
	КонецеСли;	
КонецПроцедуры


