
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ДополнительныеПараметрыТранспортаСрезПоследних.КассовыйСервер КАК КассовыйСервер
		|ИЗ
		|	РегистрСведений.ДополнительныеПараметрыТранспорта.СрезПоследних(, Транспорт = &ГруппаТранспорта) КАК ДополнительныеПараметрыТранспортаСрезПоследних";
		Запрос.УстановитьПараметр("ГруппаТранспорта", Объект.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
			КассовыйСервер = Выборка.КассовыйСервер;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если КассовыйСерверИзменен Тогда 
		Транспорт = Объект.Ссылка;
		НаборЗаписей = РегистрыСведений.ДополнительныеПараметрыТранспорта.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Транспорт.Установить(Транспорт);
		Запись = НаборЗаписей.Добавить();
		Запись.Период = ТекущаяДата();
		Запись.Транспорт = Транспорт; 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ДополнительныеПараметрыТранспортаСрезПоследних.УдаленноеЗакрытиеРейсов КАК УдаленноеЗакрытиеРейсов,
		|	ДополнительныеПараметрыТранспортаСрезПоследних.РежимПечатиЧеков КАК РежимПечатиЧеков,
		|	ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации КАК МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации,
		|	ДополнительныеПараметрыТранспортаСрезПоследних.ОсновнаяРольТранспорта КАК ОсновнаяРольТранспорта,
		|	ДополнительныеПараметрыТранспортаСрезПоследних.КассовыйСервер КАК КассовыйСервер
		|ИЗ
		|	РегистрСведений.ДополнительныеПараметрыТранспорта.СрезПоследних(, Транспорт = &ГруппаТранспорта) КАК ДополнительныеПараметрыТранспортаСрезПоследних";
		Запрос.УстановитьПараметр("ГруппаТранспорта", Транспорт);	
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
			Если Выборка.КассовыйСервер <> КассовыйСервер Тогда 
				ЗаполнитьЗначенияСвойств(Запись,Выборка,,"КассовыйСервер");	
				Запись.КассовыйСервер = КассовыйСервер;
			Иначе
				Возврат;
			КонецЕсли;	
		КонецЕсли;
		НаборЗаписей.Записать(Ложь);		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КассовыйСерверПриИзменении(Элемент)
	КассовыйСерверИзменен = Истина;
КонецПроцедуры


