&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ПогрузкаВАвто") Тогда
		Рейс = Параметры.ПогрузкаВАвто.Рейс;
		СформироватьНаСервере();
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	СформироватьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	Если НЕ ЗначениеЗаполнено(Рейс) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтотОб = РеквизитФормыВЗначение("Отчет");
	Результат = ЭтотОб.СформироватьИзРМК(Рейс);
	
КонецПроцедуры

