
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ПроизводитьОпросСостоянияОплаты Тогда
		ПодключитьОбработчикОжидания("ПроверкаСостоянияОплаты", ИнтервалОпросаСостоянияОплаты);
	КонецеСли;	
КонецПроцедуры

&НаСервере
Функция ПроверкаСостоянияОплатыНаСервере()
	ОтветВызоваМетода = Новый Структура;
	ОтветВызова = СистемаБыстрыхПлатежейСервер.ПроверитьОплатуВСБП(Заказ, ID_QR);
	СчетчикПроверок = СчетчикПроверок + 1;
	Если ОтветВызова.РезультатВызова Тогда
		СтатусПроверки = "Проверка " + Формат(СчетчикПроверок, "ЧГ=") + " от " + Формат(ТекущаяДата(), "ДЛФ=DT") + " прошла успешно.";
		ОтветВызоваМетода.Вставить("РезультатВызова", Истина);
		ОтветВызоваМетода.Вставить("СтатусПлатежа", ОтветВызова.СтатусПлатежа);
	Иначе
		СтатусПроверки = "Проверка " + Формат(СчетчикПроверок, "ЧГ=") + " от " + Формат(ТекущаяДата(), "ДЛФ=DT") + " прошла неудачно, ошибка " + ОтветВызова.ОписаниеОшибки;
		ОтветВызоваМетода.Вставить("РезультатВызова", Ложь);
	КонецеСли;	
	
	Возврат ОтветВызоваМетода;
КонецФункции	

&НаКлиенте
Процедура ПроверкаСостоянияОплаты() Экспорт
	ОтветВызова = ПроверкаСостоянияОплатыНаСервере();
	Если ОтветВызова.РезультатВызова Тогда
		ЭтаФорма.Элементы.СтатусПроверки.ЦветТекста = Новый Цвет();
		Если ОтветВызова.СтатусПлатежа = ПредопределенноеЗначение("Перечисление.СтатусыПлатежаСБП.SUCCESS") Тогда
			ЭтаФорма.Элементы.СтатусПроверки.ЦветТекста = WebЦвета.ЦветМорскойВолны;
			ОтключитьОбработчикОжидания("ПроверкаСостоянияОплаты");
			ЭтаФорма.Элементы.URL_QR.Видимость = Ложь;
			ЭтаФорма.Элементы.ДекорацияСтатусПроверки.Видимость = Истина;
			СтатусОплаты = "ОПЛАЧЕНО";
			ЭтаФорма.Элементы.СтатусОплаты.ЦветТекста = WebЦвета.ЦветМорскойВолны;
			ЗакрытиеИзОбработчика = Истина;
			ПодключитьОбработчикОжидания("ЗакрытиеФормыПослеУспешнойОплаты", 1);
			Сигнал();
		Иначе
			//ЭтаФорма.Элементы.СтатусОплаты.ЦветТекста = WebЦвета.Кирпичный;
		КонецеСли;	
	Иначе
		ЭтаФорма.Элементы.СтатусПроверки.ЦветТекста = WebЦвета.Кирпичный;
	КонецеСли;	
Конецпроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнтервалОпросаСостоянияОплаты = Константы.ИнтервалОпросаСостоянияОплатыСБП.Получить();
	Если ИнтервалОпросаСостоянияОплаты = 0 Тогда
		ИнтервалОпросаСостоянияОплаты = 5;
	КонецеСли;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеФормыПослеУспешнойОплаты() Экспорт
	Попытка
		ОтключитьОбработчикОжидания("ЗакрытиеФормыПослеУспешнойОплаты");
		Закрыть(Истина);
	Исключение
		
	КонецПопытки;	
КонецПроцедуры	

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Если Не ЗакрытиеИзОбработчика Тогда
		От = Вопрос("Статус оплаты ""НЕ ОПЛАЧЕНО"". Вы действительно хотите отменить процесс оплаты СБП?", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
		Если От <> КодВозвратаДиалога.Да Тогда
			Отказ = Истина;
			Возврат;
		КонецеСли;	
	КонецеСли;	
КонецПроцедуры

