
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//СписокОтбора = Новый СписокЗначений;
	СписокОтбора = Новый Массив;
	
	//ТекТерминал = ПараметрыСеанса.ТерминалДоставки;
	СписокОтбора.Добавить(ПараметрыСеанса.ТерминалДоставки);
	//Если НЕ ЗначениеЗаполнено(ТекТерминал) Тогда	
	Если НЕ ЗначениеЗаполнено(ПараметрыСеанса.ТерминалДоставки) Тогда	
		//ТекТерминал = Справочники.РегиональныеТерминалы.МоскваСтриж;
		СписокОтбора.Добавить(Справочники.РегиональныеТерминалы.МоскваСтриж);
		СписокОтбора.Добавить(Справочники.РегиональныеТерминалы.СПбСтриж);
	КонецЕсли;	
	//Список.Параметры.УстановитьЗначениеПараметра("ТерминалДоставки", ТекТерминал);
	Список.Параметры.УстановитьЗначениеПараметра("ТерминалДоставки", СписокОтбора);
КонецПроцедуры
