
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	//Асеев 01.08.2024 (Задача № 5299)>>>
	Если Не Параметры.Отбор.Свойство("НачислениеНеАктуально") Тогда
		Параметры.Отбор.Вставить("НачислениеНеАктуально", Ложь);
	КонецЕсли;
	//Асеев 01.08.2024 (Задача № 5299)<<<

КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	//Асеев 01.08.2024 (Задача № 5299)>>>
	Если ВидФормы = "ФормаВыбора" Тогда 
		ПараметрИзменен = Ложь;  
		Если Не Параметры.Свойство("Отбор") Тогда
			Параметры.Вставить("Отбор", Новый Структура("НачислениеНеАктуально", Ложь));
			ПараметрИзменен = Истина;
		ИначеЕсли Не Параметры.Отбор.Свойство("НачислениеНеАктуально") Тогда
			Параметры.Отбор.Вставить("НачислениеНеАктуально", Ложь);
			ПараметрИзменен = Истина;
		КонецЕсли;
		
		// Этот код нужен, чтобы были использованы измененные нами значения параметров
		Если ПараметрИзменен Тогда  
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = "ФормаВыбора"; // передаем имя формы выбора
		КонецЕсли;
	КонецЕсли;
	//Асеев 01.08.2024 (Задача № 5299)<<<
	
КонецПроцедуры
