Процедура СформироватьСтрокуСоединения() Экспорт
	//файловая: Параметры = "File=" + Каталог + ";Usr=" + Пользователь + ";Pwd=" + Пароль + ";";	
	//серверная: Параметры = "Srvr=" + Сервер + ";Ref=" + База + ";Usr=" + Логин + ";Pwd=" + Пароль + ";";	
	Если ФТипБазыФайловая Тогда 
		СтрокаСоединения = "File=" + СокрлП(РасположениеБазы)+ ";Usr=" + СокрлП(Логин) + ";Pwd=" + СокрлП(Пароль) + ";";
	Иначе
		СтрокаСоединения = "Srvr=" + СокрлП(Сервер) + ";Ref=" + СокрлП(База) + ";Usr=" + СокрлП(ЛогинСерв) + ";Pwd=" + СокрлП(ПарольСерв) + ";";
	КонецЕсли;
КонецПроцедуры

Функция РазложитьСтрокуВМассивПодстрокЛокально(Знач Стр, Разделитель = ",") Экспорт	
	МассивСтрок = Новый Массив();
	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = СокрЛ(Сред(Стр,Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = Сред(Стр,Поз+ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
КонецФункции 


