
Процедура ОбработкаПроведения(Отказ, Режим)
	НаборЗаписей = РегистрыСведений.новаКалендарьВозможныхРейсов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ЗаявкаПеревозчика.Установить(Ссылка);
	
	Запись = НаборЗаписей.Добавить();
	Запись.Транспорт = Транспорт;
	Запись.Водитель = Водитель;
	Запись.НачалоПериода = ДоступенС;
	Запись.КонецПериода = ДоступенПо;
	Запись.ЗаявкаПеревозчика = Ссылка;
	Запись.НачалоРейса = Гараж.ТочкаДоставки;
	Запись.Перевозчик = Контрагент;
	Запись.Договор = Договор;
	Запись.КонтактноеЛицо = КонтактноеЛицо;
	Запись.Направление = Направление;
	
	НаборЗаписей.Записать();
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	НаборЗаписей = РегистрыСведений.новаКалендарьВозможныхРейсов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ЗаявкаПеревозчика.Установить(Ссылка);
	
	НаборЗаписей.Записать();
	
КонецПроцедуры
