
Функция ФормированиеТаблицыШКДляСервераСканирования(НачалоПериода,КонецПериода,МассивТерминалов,УдалятьДублиШК = Ложь) Экспорт
	
	Если Час(ТекущаяДата()) >= 21 Тогда 
		АктуальнаяДатаДоставки = НачалоДня(ТекущаяДата()) + 86400;
	Иначе
		АктуальнаяДатаДоставки = НачалоДня(ТекущаяДата());
	КонецЕсли;	
	
	Зап = Новый Запрос;
	
	Зап.Текст =
	"ВЫБРАТЬ
	|	РейсЗаказы.Заказ.Номер КАК НомерЗаказа,
	|	МАКСИМУМ(РейсЗаказы.Ссылка.ДатаРейса) КАК ДатаРейса
	|ПОМЕСТИТЬ ВТМаксимальныеДатыРейсов
	|ИЗ
	|	Документ.Рейс.Заказы КАК РейсЗаказы
	|ГДЕ
	|	ВЫРАЗИТЬ(РейсЗаказы.Заказ КАК Документ.РеализацияТоваровУслуг).Дата МЕЖДУ &НачДата И &КонДата
	|	И РейсЗаказы.Ссылка.ДатаРейса МЕЖДУ &НачДата И &КонДата
	|	И НЕ РейсЗаказы.УдаленИзРейса
	|	И РейсЗаказы.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	РейсЗаказы.Заказ.Номер
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерЗаказа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТМаксимальныеДатыРейсов.НомерЗаказа КАК НомерЗаказа,
	|	МАКСИМУМ(РейсЗаказы.Ссылка.Дата) КАК Дата,
	|	ВТМаксимальныеДатыРейсов.ДатаРейса КАК ДатаРейса
	|ПОМЕСТИТЬ втПоследниеРейсы
	|ИЗ
	|	ВТМаксимальныеДатыРейсов КАК ВТМаксимальныеДатыРейсов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Рейс.Заказы КАК РейсЗаказы
	|		ПО ВТМаксимальныеДатыРейсов.ДатаРейса = РейсЗаказы.Ссылка.ДатаРейса
	|			И (ВТМаксимальныеДатыРейсов.НомерЗаказа = ВЫРАЗИТЬ(РейсЗаказы.Заказ КАК Документ.РеализацияТоваровУслуг).Номер)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТМаксимальныеДатыРейсов.НомерЗаказа,
	|	ВТМаксимальныеДатыРейсов.ДатаРейса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ПривязкаМашинКРейсамСрезПоследних.Транспорт, &ПустойТранспорт) КАК Транспорт,
	|	ВЫРАЗИТЬ(РейсЗаказы.Заказ КАК Документ.РеализацияТоваровУслуг).ВладелецТовара КАК Контрагент,
	|	ВЫРАЗИТЬ(РейсЗаказы.Заказ КАК Документ.РеализацияТоваровУслуг).Номер КАК НомерЗаказа,
	|	ВЫБОР
	|		КОГДА РейсЗаказы.Ссылка.ДатаРейса = &АктуальнаяДатаДоставки
	|			ТОГДА РейсЗаказы.Ссылка.НомерПалетты
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НомерПалетты,
	|	РейсЗаказы.Заказ КАК Заказ,
	|	РейсЗаказы.Ссылка КАК Ссылка,
	|	РейсЗаказы.Ссылка.ПометкаУдаления КАК ПометкаУдаления,
	|	РейсЗаказы.Ссылка.Проведен КАК Проведен
	|ПОМЕСТИТЬ ВТТранспорт
	|ИЗ
	|	Документ.Рейс.Заказы КАК РейсЗаказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних(&КонДата, ) КАК ПривязкаМашинКРейсамСрезПоследних
	|		ПО РейсЗаказы.Ссылка = ПривязкаМашинКРейсамСрезПоследних.Рейс
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПоследниеРейсы КАК втПоследниеРейсы
	|		ПО РейсЗаказы.Ссылка.Дата = втПоследниеРейсы.Дата
	|			И РейсЗаказы.Ссылка.ДатаРейса = втПоследниеРейсы.ДатаРейса
	|			И (ВЫРАЗИТЬ(РейсЗаказы.Заказ КАК Документ.РеализацияТоваровУслуг).Номер = втПоследниеРейсы.НомерЗаказа)
	|ГДЕ
	|	ВЫРАЗИТЬ(РейсЗаказы.Заказ КАК Документ.РеализацияТоваровУслуг).Дата МЕЖДУ &НачДата И &КонДата
	|	И РейсЗаказы.Ссылка.ДатаРейса МЕЖДУ &НачДата И &КонДата
	|	И НЕ РейсЗаказы.УдаленИзРейса
	|	И РейсЗаказы.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫРАЗИТЬ(РейсЗаказы.Заказ КАК Документ.РеализацияТоваровУслуг).ВладелецТовара,
	|	ВЫРАЗИТЬ(РейсЗаказы.Заказ КАК Документ.РеализацияТоваровУслуг).Номер,
	|	РейсЗаказы.Заказ,
	|	ЕСТЬNULL(ПривязкаМашинКРейсамСрезПоследних.Транспорт, &ПустойТранспорт),
	|	РейсЗаказы.Ссылка.ПометкаУдаления,
	|	РейсЗаказы.Ссылка.Проведен,
	|	РейсЗаказы.Ссылка,
	|	ВЫБОР
	|		КОГДА РейсЗаказы.Ссылка.ДатаРейса = &АктуальнаяДатаДоставки
	|			ТОГДА РейсЗаказы.Ссылка.НомерПалетты
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерЗаказа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	новаМестнаяДоставка.СтоимостьДоставкиДоМКАД + новаМестнаяДоставка.СтоимостьДоставкиЗаМКАД КАК СтоимостьДоставки_,
	|	новаМестнаяДоставка.Номер КАК НомерЗаказа,
	|	ВТТранспорт.Транспорт КАК Транспорт,
	|	новаМестнаяДоставка.Оплачен КАК ДоставкаОплачен,
	|	ВТТранспорт.Контрагент КАК Контрагент,
	|	новаМестнаяДоставка.ТочкаПрибытия.Адрес.Ссылка КАК Адрес,
	|	ВТТранспорт.НомерПалетты КАК НомерПалетты,
	|	ЕСТЬNULL(ГруппыРайоновРайоны.Ссылка.Код, (ЗНАЧЕНИЕ(Справочник.ГруппыРайонов.БезСектора)).Код) КАК НомерСектора
	|ПОМЕСТИТЬ ВТЗаказы
	|ИЗ
	|	БизнесПроцесс.новаМестнаяДоставка КАК новаМестнаяДоставка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.новаРайоныАдресов КАК новаРайоныАдресов
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыРайонов.Районы КАК ГруппыРайоновРайоны
	|			ПО новаРайоныАдресов.Район.Ссылка = ГруппыРайоновРайоны.Район.Ссылка
	|				И (ГруппыРайоновРайоны.Ссылка.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ГруппыРайонов.СектораПрихода)))
	|		ПО (новаРайоныАдресов.Адрес.Ссылка = новаМестнаяДоставка.ТочкаПрибытия.Адрес.Ссылка)
	|			И (новаРайоныАдресов.Классификатор.Код = ""000000006"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТранспорт КАК ВТТранспорт
	|		ПО (ВТТранспорт.НомерЗаказа = новаМестнаяДоставка.Номер)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО новаМестнаяДоставка.Номер = РеализацияТоваровУслуг.Номер
	|ГДЕ
	|	новаМестнаяДоставка.Дата >= &НачДата
	|	И РеализацияТоваровУслуг.ТерминалДоставки В(&МассивТерминаловДоставки)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТТранспорт.Транспорт,
	|	ВТТранспорт.Контрагент,
	|	новаМестнаяДоставка.ТочкаПрибытия.Адрес.Ссылка,
	|	новаМестнаяДоставка.Оплачен,
	|	новаМестнаяДоставка.СтоимостьДоставкиДоМКАД + новаМестнаяДоставка.СтоимостьДоставкиЗаМКАД,
	|	ВТТранспорт.НомерПалетты,
	|	ЕСТЬNULL(ГруппыРайоновРайоны.Ссылка.Код, (ЗНАЧЕНИЕ(Справочник.ГруппыРайонов.БезСектора)).Код),
	|	новаМестнаяДоставка.Номер
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	новаМестнаяДоставка.СтоимостьДоставкиДоМКАД + новаМестнаяДоставка.СтоимостьДоставкиЗаМКАД,
	|	новаМестнаяДоставка.Номер,
	|	ВТТранспорт.Транспорт,
	|	новаМестнаяДоставка.Оплачен,
	|	ВТТранспорт.Контрагент,
	|	новаМестнаяДоставка.ТочкаПрибытия.Адрес.Ссылка,
	|	ВТТранспорт.НомерПалетты,
	|	ЕСТЬNULL(ГруппыРайоновРайоны.Ссылка.Код, (ЗНАЧЕНИЕ(Справочник.ГруппыРайонов.БезСектора)).Код)
	|ИЗ
	|	БизнесПроцесс.новаМестнаяДоставка КАК новаМестнаяДоставка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.новаРайоныАдресов КАК новаРайоныАдресов
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыРайонов.Районы КАК ГруппыРайоновРайоны
	|			ПО новаРайоныАдресов.Район.Ссылка = ГруппыРайоновРайоны.Район.Ссылка
	|		ПО (новаРайоныАдресов.Адрес.Ссылка = новаМестнаяДоставка.ТочкаПрибытия.Адрес.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТранспорт КАК ВТТранспорт
	|		ПО (ВТТранспорт.НомерЗаказа = новаМестнаяДоставка.Номер)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
	|		ПО (ДополнительныеПараметрыЗаказа.Доставка = новаМестнаяДоставка.Ссылка)
	|ГДЕ
	|	ДополнительныеПараметрыЗаказа.Заказ.ТерминалДоставки.Ссылка = ЗНАЧЕНИЕ(справочник.региональныеТерминалы.СпбСтриж)
	|	И новаРайоныАдресов.Классификатор.Код = ""000000006""
	|	И новаМестнаяДоставка.Дата >= &НачДата
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТТранспорт.Транспорт,
	|	ВТТранспорт.Контрагент,
	|	новаМестнаяДоставка.ТочкаПрибытия.Адрес.Ссылка,
	|	новаМестнаяДоставка.Оплачен,
	|	новаМестнаяДоставка.СтоимостьДоставкиДоМКАД + новаМестнаяДоставка.СтоимостьДоставкиЗаМКАД,
	|	ВТТранспорт.НомерПалетты,
	|	ЕСТЬNULL(ГруппыРайоновРайоны.Ссылка.Код, (ЗНАЧЕНИЕ(Справочник.ГруппыРайонов.БезСектора)).Код),
	|	новаМестнаяДоставка.Номер
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерЗаказа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЗаказы.НомерЗаказа КАК НомерЗаказа,
	|	РеализацияТоваровУслуг.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
	|	РеализацияТоваровУслуг.Дата КАК ДатаДоставки,
	|	ВТЗаказы.Транспорт КАК Транспорт,
	|	ТипыОплат.КодОплаты КАК КодОплаты,
	|	ВТЗаказы.Контрагент КАК Контрагент,
	|	ВТЗаказы.НомерПалетты КАК НомерЛог,
	|	ЕСТЬNULL(Накладная003Заказы.КоличествоМест, РеализацияТоваровУслуг.КоличествоМест) КАК КоличествоМест,
	|	РеализацияТоваровУслуг.ТерминалДоставки.Код КАК ТерминалКод,
	|	РеализацияТоваровУслуг.ТерминалДоставки.Наименование КАК ТерминалНаименование,
	|	ВТЗаказы.НомерСектора КАК НомерСектора,
	|	ВТЗаказы.Транспорт.НомерГосударственнойРегистрации КАК ТранспортНомерГосударственнойРегистрации,
	|	ВТЗаказы.Контрагент.Код КАК КонтрагентКод,
	|	ВТЗаказы.Контрагент.Родитель.Код КАК КонтрагентРодительКод,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.СтатусИнтернетМагазина = 2
	|			ТОГДА 1
	|		КОГДА РеализацияТоваровУслуг.СтатусИнтернетМагазина = 4
	|			ТОГДА 2
	|		КОГДА РеализацияТоваровУслуг.СтатусИнтернетМагазина = 3
	|			ТОГДА 3
	|		КОГДА РеализацияТоваровУслуг.СтатусИнтернетМагазина = 1
	|			ТОГДА 4
	|	КОНЕЦ КАК tag,
	|	РеализацияТоваровУслуг.Ссылка КАК Заказ,
	|	РеализацияТоваровУслуг.ТерминалПриема.Код КАК ТерминалПриемаКод,
	|	ВТЗаказы.НомерПалетты КАК НомерПалетты,
	|	РеализацияТоваровУслуг.СтатусИнтернетМагазина КАК СтатусИнтернетМагазина,
	|	РеализацияТоваровУслуг.ТерминалДоставки.Код КАК ТерминалДоставкиКод,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.ВладелецТовара.Родитель.ОсновнойМагазин = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.ВладелецТовара.Код
	|		ИНАЧЕ РеализацияТоваровУслуг.ВладелецТовара.Родитель.ОсновнойМагазин.Код
	|	КОНЕЦ КАК КодПартнера,
	|	РеализацияТоваровУслуг.ДоставкаДеньВДень КАК ДеньВДень,
	|	РеализацияТоваровУслуг.ВладелецТовара КАК ВладелецТовара,
	|	РеализацияТоваровУслуг.ТерминалДоставки КАК Терминал,
	|	РеализацияТоваровУслуг.ВладелецТовара.Код КАК ВладелецТовараКод
	|ПОМЕСТИТЬ втЗаказыКВыгрузке
	|ИЗ
	|	ВТЗаказы КАК ВТЗаказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыОплат КАК ТипыОплат
	|			ПО РеализацияТоваровУслуг.ТипОплаты = ТипыОплат.Код
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Накладная003.Заказы КАК Накладная003Заказы
	|			ПО (РеализацияТоваровУслуг.Ссылка = ВЫРАЗИТЬ(Накладная003Заказы.Заказ КАК Документ.РеализацияТоваровУслуг).Ссылка)
	|		ПО ВТЗаказы.НомерЗаказа = РеализацияТоваровУслуг.Номер
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТЗаказы.НомерЗаказа,
	|	РеализацияТоваровУслуг.Ссылка.НомерВнешнегоЗаказа,
	|	РеализацияТоваровУслуг.Ссылка.Дата,
	|	ВТЗаказы.Транспорт,
	|	ТипыОплат.КодОплаты,
	|	ВТЗаказы.Контрагент,
	|	ВТЗаказы.НомерПалетты,
	|	СУММА(ЕСТЬNULL(Накладная003Заказы.КоличествоМест, РеализацияТоваровУслуг.КоличествоМест)),
	|	РеализацияТоваровУслуг.ТерминалДоставки.Код,
	|	РеализацияТоваровУслуг.ТерминалДоставки.Наименование,
	|	ВТЗаказы.НомерСектора,
	|	ВТЗаказы.Транспорт.НомерГосударственнойРегистрации,
	|	ВТЗаказы.Контрагент.Код,
	|	ВТЗаказы.Контрагент.Родитель.Код,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.СтатусИнтернетМагазина = 2
	|			ТОГДА 1
	|		КОГДА РеализацияТоваровУслуг.СтатусИнтернетМагазина = 4
	|			ТОГДА 2
	|		КОГДА РеализацияТоваровУслуг.СтатусИнтернетМагазина = 3
	|			ТОГДА 3
	|		КОГДА РеализацияТоваровУслуг.СтатусИнтернетМагазина = 1
	|			ТОГДА 4
	|	КОНЕЦ,
	|	РеализацияТоваровУслуг.Ссылка,
	|	РеализацияТоваровУслуг.ТерминалПриема.Код,
	|	ВТЗаказы.НомерПалетты,
	|	РеализацияТоваровУслуг.СтатусИнтернетМагазина,
	|	NULL,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.ВладелецТовара.Родитель.ОсновнойМагазин = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.ВладелецТовара.Код
	|		ИНАЧЕ РеализацияТоваровУслуг.ВладелецТовара.Родитель.ОсновнойМагазин.Код
	|	КОНЕЦ,
	|	РеализацияТоваровУслуг.ДоставкаДеньВДень,
	|	РеализацияТоваровУслуг.ВладелецТовара,
	|	РеализацияТоваровУслуг.ТерминалДоставки,
	|	РеализацияТоваровУслуг.ВладелецТовара.Код
	|ИЗ
	|	ВТЗаказы КАК ВТЗаказы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыОплат КАК ТипыОплат
	|				ПО РеализацияТоваровУслуг.ТипОплаты = ТипыОплат.Код
	|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.Накладная003.Заказы КАК Накладная003Заказы
	|				ПО (РеализацияТоваровУслуг.Ссылка = ВЫРАЗИТЬ(Накладная003Заказы.Заказ КАК Документ.РеализацияТоваровУслуг).Ссылка)
	|			ПО ВозвратТоваровОтПокупателя.Номер = РеализацияТоваровУслуг.Номер
	|		ПО ВТЗаказы.НомерЗаказа = ВозвратТоваровОтПокупателя.Номер
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТЗаказы.НомерЗаказа,
	|	РеализацияТоваровУслуг.Ссылка.НомерВнешнегоЗаказа,
	|	РеализацияТоваровУслуг.Ссылка.Дата,
	|	ВТЗаказы.Транспорт,
	|	ТипыОплат.КодОплаты,
	|	ВТЗаказы.Контрагент,
	|	ВТЗаказы.НомерПалетты,
	|	РеализацияТоваровУслуг.ТерминалДоставки.Код,
	|	РеализацияТоваровУслуг.ТерминалДоставки.Наименование,
	|	ВТЗаказы.НомерСектора,
	|	ВТЗаказы.Транспорт.НомерГосударственнойРегистрации,
	|	ВТЗаказы.Контрагент.Код,
	|	ВТЗаказы.Контрагент.Родитель.Код,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.СтатусИнтернетМагазина = 2
	|			ТОГДА 1
	|		КОГДА РеализацияТоваровУслуг.СтатусИнтернетМагазина = 4
	|			ТОГДА 2
	|		КОГДА РеализацияТоваровУслуг.СтатусИнтернетМагазина = 3
	|			ТОГДА 3
	|		КОГДА РеализацияТоваровУслуг.СтатусИнтернетМагазина = 1
	|			ТОГДА 4
	|	КОНЕЦ,
	|	РеализацияТоваровУслуг.Ссылка,
	|	РеализацияТоваровУслуг.ТерминалПриема.Код,
	|	РеализацияТоваровУслуг.СтатусИнтернетМагазина,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.ВладелецТовара.Родитель.ОсновнойМагазин = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.ВладелецТовара.Код
	|		ИНАЧЕ РеализацияТоваровУслуг.ВладелецТовара.Родитель.ОсновнойМагазин.Код
	|	КОНЕЦ,
	|	РеализацияТоваровУслуг.ДоставкаДеньВДень,
	|	РеализацияТоваровУслуг.ВладелецТовара,
	|	РеализацияТоваровУслуг.ТерминалДоставки,
	|	РеализацияТоваровУслуг.ВладелецТовара.Код,
	|	ВТЗаказы.НомерПалетты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втЗаказыКВыгрузке.Заказ КАК Заказ,
	|	МАКСИМУМ(СтатусыЗаказов.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_МаксПериодыСтатусов
	|ИЗ
	|	втЗаказыКВыгрузке КАК втЗаказыКВыгрузке
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЗаказов КАК СтатусыЗаказов
	|		ПО втЗаказыКВыгрузке.Заказ = СтатусыЗаказов.Заказ
	|
	|СГРУППИРОВАТЬ ПО
	|	втЗаказыКВыгрузке.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АктивнаяСхемаПолигональнойМаршрутизацииСрезПоследних.РегиональныйТерминал КАК РегиональныйТерминал,
	|	АктивнаяСхемаПолигональнойМаршрутизацииСрезПоследних.СхемаПолигональнойМаршрутизации КАК СхемаПолигональнойМаршрутизации
	|ПОМЕСТИТЬ ВТ_АктивныеСхемыМаршрутизации
	|ИЗ
	|	РегистрСведений.АктивнаяСхемаПолигональнойМаршрутизации.СрезПоследних(, ) КАК АктивнаяСхемаПолигональнойМаршрутизацииСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втЗаказыКВыгрузке.Заказ КАК Заказ,
	|	ВТ_АктивныеСхемыМаршрутизации.СхемаПолигональнойМаршрутизации КАК СхемаПолигональнойМаршрутизации
	|ПОМЕСТИТЬ ВТ_СхемыМаршрутизацииЗаказов
	|ИЗ
	|	втЗаказыКВыгрузке КАК втЗаказыКВыгрузке
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_АктивныеСхемыМаршрутизации КАК ВТ_АктивныеСхемыМаршрутизации
	|		ПО втЗаказыКВыгрузке.Терминал = ВТ_АктивныеСхемыМаршрутизации.РегиональныйТерминал
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПолигоныМаршрутизацииЗаказовСрезПоследних.Заказ КАК Заказ,
	|	ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации КАК ПолигонМаршрутизации
	|ПОМЕСТИТЬ ВТ_ПолигоныМаршрутизацииЗаказов
	|ИЗ
	|	РегистрСведений.ПолигоныМаршрутизацииЗаказов.СрезПоследних(
	|			,
	|			(Заказ, СхемаМаршрутизации) В
	|				(ВЫБРАТЬ
	|					ВТ_СхемыМаршрутизацииЗаказов.Заказ КАК Заказ,
	|					ВТ_СхемыМаршрутизацииЗаказов.СхемаПолигональнойМаршрутизации КАК СхемаПолигональнойМаршрутизации
	|				ИЗ
	|					ВТ_СхемыМаршрутизацииЗаказов КАК ВТ_СхемыМаршрутизацииЗаказов)) КАК ПолигоныМаршрутизацииЗаказовСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(втЗаказыКВыгрузке.НомерЗаказа, """") КАК НомерЗаказаСтриж,
	|	ЕСТЬNULL(втЗаказыКВыгрузке.НомерВнешнегоЗаказа, """") КАК НомерЗаказаИМ,
	|	ЕСТЬNULL(втЗаказыКВыгрузке.ДатаДоставки, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаДоставки,
	|	ЕСТЬNULL(втЗаказыКВыгрузке.Транспорт, ЗНАЧЕНИЕ(Справочник.новаТранспорт.ПустаяСсылка)) КАК Транспорт,
	|	ЕСТЬNULL(втЗаказыКВыгрузке.КодОплаты, 0) КАК КодОплаты,
	|	ЕСТЬNULL(втЗаказыКВыгрузке.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
	|	ЕСТЬNULL(втЗаказыКВыгрузке.НомерЛог, 0) КАК НомерЛог,
	|	ЕСТЬNULL(втЗаказыКВыгрузке.КоличествоМест, 0) КАК КоличествоМест,
	|	ЕСТЬNULL(втЗаказыКВыгрузке.ТерминалКод, 0) КАК ТерминалКод,
	|	ЕСТЬNULL(втЗаказыКВыгрузке.ТерминалНаименование, """") КАК ТерминалНаименование,
	|	МАКСИМУМ(ЕСТЬNULL(втЗаказыКВыгрузке.НомерСектора, """")) КАК НомерСектора,
	|	ЕСТЬNULL(втЗаказыКВыгрузке.ТранспортНомерГосударственнойРегистрации, """") КАК ТранспортНомерГосударственнойРегистрации,
	|	ЕСТЬNULL(втЗаказыКВыгрузке.КонтрагентКод, """") КАК КонтрагентКод,
	|	ЕСТЬNULL(втЗаказыКВыгрузке.КонтрагентРодительКод, """") КАК КонтрагентРодительКод,
	|	ЕСТЬNULL(втЗаказыКВыгрузке.tag, 0) КАК tag,
	|	ЕСТЬNULL(втЗаказыКВыгрузке.ТерминалПриемаКод, 0) КАК ТерминалПриемаКод,
	|	ЕСТЬNULL(втЗаказыКВыгрузке.НомерПалетты, 0) КАК НомерПалетты,
	|	ЕСТЬNULL(втЗаказыКВыгрузке.СтатусИнтернетМагазина, 0) КАК СтатусЗаказа,
	|	ЕСТЬNULL(ШтрихкодыЗаказов.Штрихкод, """") КАК Штрихкод,
	|	ЕСТЬNULL(ШтрихкодыЗаказов.ШКПереданПартнером, ЛОЖЬ) КАК ПереданПартнером,
	|	ЕСТЬNULL(втЗаказыКВыгрузке.КодПартнера, """") КАК КодКонтрагента,
	|	1 КАК ТипЗаказа,
	|	ЕСТЬNULL(втЗаказыКВыгрузке.ДеньВДень, ЛОЖЬ) КАК ДеньВДень,
	|	ЕСТЬNULL(ДополнительныеПараметрыЗаказа.Смена.НомерСмены, 0) КАК НомерСмены,
	|	ЕСТЬNULL(ПараметрыКонтрагентовСрезПоследних.АвтоматическоеИсключениеЧастичноПринятыхНаСкладЗаказовПриПогрузкеВАвто, ЛОЖЬ) КАК ЗапрашиватьОперативныеДанные,
	|	ЕСТЬNULL(ВТ_ПолигоныМаршрутизацииЗаказов.ПолигонМаршрутизации.Порядок, 0) КАК ПолигонМаршрутизации,
	|	ЕСТЬNULL(втЗаказыКВыгрузке.ВладелецТовараКод, """") КАК ВладелецТовараКод,
	|	ЕСТЬNULL(ДополнительныеПараметрыЗаказа.СкладМагазина.Код, 0) КАК СкладМагазинаКод,
	|	ЕСТЬNULL(СтатусыЗаказов.Статус, 0) КАК Статус,
	|	НЕ СтатусыПредварительногоЗакрытияРейсовСрезПоследних.Заказ ЕСТЬ NULL КАК ПредварительноеЗакрытие
	|ПОМЕСТИТЬ втШтрихкодыЗаказов
	|ИЗ
	|	втЗаказыКВыгрузке КАК втЗаказыКВыгрузке
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыЗаказов КАК ШтрихкодыЗаказов
	|		ПО втЗаказыКВыгрузке.Заказ = ШтрихкодыЗаказов.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
	|		ПО втЗаказыКВыгрузке.Заказ = ДополнительныеПараметрыЗаказа.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыКонтрагентов.СрезПоследних(
	|				,
	|				Контрагент В
	|					(ВЫБРАТЬ
	|						втЗаказыКВыгрузке.ВладелецТовара КАК ВладелецТовара
	|					ИЗ
	|						втЗаказыКВыгрузке КАК втЗаказыКВыгрузке)) КАК ПараметрыКонтрагентовСрезПоследних
	|		ПО втЗаказыКВыгрузке.ВладелецТовара = ПараметрыКонтрагентовСрезПоследних.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПолигоныМаршрутизацииЗаказов КАК ВТ_ПолигоныМаршрутизацииЗаказов
	|		ПО втЗаказыКВыгрузке.Заказ = ВТ_ПолигоныМаршрутизацииЗаказов.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МаксПериодыСтатусов КАК ВТ_МаксПериодыСтатусов
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЗаказов КАК СтатусыЗаказов
	|			ПО ВТ_МаксПериодыСтатусов.Период = СтатусыЗаказов.Период
	|				И ВТ_МаксПериодыСтатусов.Заказ = СтатусыЗаказов.Заказ
	|		ПО втЗаказыКВыгрузке.Заказ = ВТ_МаксПериодыСтатусов.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПредварительногоЗакрытияРейсов.СрезПоследних КАК СтатусыПредварительногоЗакрытияРейсовСрезПоследних
	|		ПО втЗаказыКВыгрузке.Заказ = СтатусыПредварительногоЗакрытияРейсовСрезПоследних.Заказ
	|			И (СтатусыПредварительногоЗакрытияРейсовСрезПоследних.СтатусПредварительногоЗакрытияРейса = ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытПредварительно))
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(втЗаказыКВыгрузке.НомерЗаказа, """"),
	|	ЕСТЬNULL(втЗаказыКВыгрузке.НомерВнешнегоЗаказа, """"),
	|	ЕСТЬNULL(втЗаказыКВыгрузке.ДатаДоставки, ДАТАВРЕМЯ(1, 1, 1)),
	|	ЕСТЬNULL(втЗаказыКВыгрузке.Транспорт, ЗНАЧЕНИЕ(Справочник.новаТранспорт.ПустаяСсылка)),
	|	ЕСТЬNULL(втЗаказыКВыгрузке.КодОплаты, 0),
	|	ЕСТЬNULL(втЗаказыКВыгрузке.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)),
	|	ЕСТЬNULL(втЗаказыКВыгрузке.НомерЛог, 0),
	|	ЕСТЬNULL(втЗаказыКВыгрузке.КоличествоМест, 0),
	|	ЕСТЬNULL(втЗаказыКВыгрузке.ТерминалКод, 0),
	|	ЕСТЬNULL(втЗаказыКВыгрузке.ТерминалНаименование, """"),
	|	ЕСТЬNULL(втЗаказыКВыгрузке.ТранспортНомерГосударственнойРегистрации, """"),
	|	ЕСТЬNULL(втЗаказыКВыгрузке.КонтрагентКод, """"),
	|	ЕСТЬNULL(втЗаказыКВыгрузке.КонтрагентРодительКод, """"),
	|	ЕСТЬNULL(втЗаказыКВыгрузке.tag, 0),
	|	ЕСТЬNULL(втЗаказыКВыгрузке.ТерминалПриемаКод, 0),
	|	ЕСТЬNULL(втЗаказыКВыгрузке.НомерПалетты, 0),
	|	ЕСТЬNULL(втЗаказыКВыгрузке.СтатусИнтернетМагазина, 0),
	|	ЕСТЬNULL(ШтрихкодыЗаказов.Штрихкод, """"),
	|	ЕСТЬNULL(ШтрихкодыЗаказов.ШКПереданПартнером, ЛОЖЬ),
	|	ЕСТЬNULL(втЗаказыКВыгрузке.КодПартнера, """"),
	|	ЕСТЬNULL(втЗаказыКВыгрузке.ДеньВДень, ЛОЖЬ),
	|	ЕСТЬNULL(ДополнительныеПараметрыЗаказа.Смена.НомерСмены, 0),
	|	ЕСТЬNULL(ПараметрыКонтрагентовСрезПоследних.АвтоматическоеИсключениеЧастичноПринятыхНаСкладЗаказовПриПогрузкеВАвто, ЛОЖЬ),
	|	ЕСТЬNULL(ВТ_ПолигоныМаршрутизацииЗаказов.ПолигонМаршрутизации.Порядок, 0),
	|	ЕСТЬNULL(втЗаказыКВыгрузке.ВладелецТовараКод, """"),
	|	ЕСТЬNULL(ДополнительныеПараметрыЗаказа.СкладМагазина.Код, 0),
	|	ЕСТЬNULL(СтатусыЗаказов.Статус, 0),
	|	НЕ СтатусыПредварительногоЗакрытияРейсовСрезПоследних.Заказ ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КодКонтрагента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втШтрихкодыЗаказов.НомерЗаказаСтриж КАК НомерЗаказаСтриж,
	|	втШтрихкодыЗаказов.НомерЗаказаИМ КАК НомерЗаказаИМ,
	|	втШтрихкодыЗаказов.ДатаДоставки КАК ДатаДоставки,
	|	втШтрихкодыЗаказов.Транспорт КАК Транспорт,
	|	втШтрихкодыЗаказов.КодОплаты КАК КодОплаты,
	|	втШтрихкодыЗаказов.Контрагент КАК Контрагент,
	|	втШтрихкодыЗаказов.НомерЛог КАК НомерЛог,
	|	втШтрихкодыЗаказов.КоличествоМест КАК КоличествоМест,
	|	втШтрихкодыЗаказов.ТерминалКод КАК ТерминалКод,
	|	втШтрихкодыЗаказов.ТерминалНаименование КАК ТерминалНаименование,
	|	втШтрихкодыЗаказов.НомерСектора КАК НомерСектора,
	|	втШтрихкодыЗаказов.ТранспортНомерГосударственнойРегистрации КАК ТранспортНомерГосударственнойРегистрации,
	|	втШтрихкодыЗаказов.КонтрагентКод КАК КонтрагентКод,
	|	втШтрихкодыЗаказов.КонтрагентРодительКод КАК КонтрагентРодительКод,
	|	втШтрихкодыЗаказов.tag КАК tag,
	|	втШтрихкодыЗаказов.ТерминалПриемаКод КАК ТерминалПриемаКод,
	|	втШтрихкодыЗаказов.НомерПалетты КАК НомерПалетты,
	|	втШтрихкодыЗаказов.СтатусЗаказа КАК СтатусЗаказа,
	|	втШтрихкодыЗаказов.Штрихкод КАК Штрихкод,
	|	втШтрихкодыЗаказов.ПереданПартнером КАК ПереданПартнером,
	|	втШтрихкодыЗаказов.КодКонтрагента КАК КодКонтрагента,
	|	втШтрихкодыЗаказов.ТипЗаказа КАК ТипЗаказа,
	|	втШтрихкодыЗаказов.ДеньВДень КАК ДеньВДень,
	|	втШтрихкодыЗаказов.НомерСмены КАК НомерСмены,
	|	втШтрихкодыЗаказов.ЗапрашиватьОперативныеДанные КАК ЗапрашиватьОперативныеДанные,
	|	втШтрихкодыЗаказов.ПолигонМаршрутизации КАК ПолигонМаршрутизации,
	|	втШтрихкодыЗаказов.ВладелецТовараКод КАК ВладелецТовараКод,
	|	втШтрихкодыЗаказов.СкладМагазинаКод КАК СкладМагазинаКод,
	|	втШтрихкодыЗаказов.Статус КАК Статус,
	|	втШтрихкодыЗаказов.ПредварительноеЗакрытие КАК ПредварительноеЗакрытие
	|ИЗ
	|	втШтрихкодыЗаказов КАК втШтрихкодыЗаказов
	|ГДЕ
	|	втШтрихкодыЗаказов.КодКонтрагента В (""Shop_757"", ""Shop_752"", ""Shop_601"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втШтрихкодыЗаказов.НомерЗаказаСтриж КАК НомерЗаказаСтриж,
	|	втШтрихкодыЗаказов.НомерЗаказаИМ КАК НомерЗаказаИМ,
	|	втШтрихкодыЗаказов.ДатаДоставки КАК ДатаДоставки,
	|	втШтрихкодыЗаказов.Транспорт КАК Транспорт,
	|	втШтрихкодыЗаказов.КодОплаты КАК КодОплаты,
	|	втШтрихкодыЗаказов.Контрагент КАК Контрагент,
	|	втШтрихкодыЗаказов.НомерЛог КАК НомерЛог,
	|	втШтрихкодыЗаказов.КоличествоМест КАК КоличествоМест,
	|	втШтрихкодыЗаказов.ТерминалКод КАК ТерминалКод,
	|	втШтрихкодыЗаказов.ТерминалНаименование КАК ТерминалНаименование,
	|	втШтрихкодыЗаказов.НомерСектора КАК НомерСектора,
	|	втШтрихкодыЗаказов.ТранспортНомерГосударственнойРегистрации КАК ТранспортНомерГосударственнойРегистрации,
	|	втШтрихкодыЗаказов.КонтрагентКод КАК КонтрагентКод,
	|	втШтрихкодыЗаказов.КонтрагентРодительКод КАК КонтрагентРодительКод,
	|	втШтрихкодыЗаказов.tag КАК tag,
	|	втШтрихкодыЗаказов.ТерминалПриемаКод КАК ТерминалПриемаКод,
	|	втШтрихкодыЗаказов.НомерПалетты КАК НомерПалетты,
	|	втШтрихкодыЗаказов.СтатусЗаказа КАК СтатусЗаказа,
	|	втШтрихкодыЗаказов.Штрихкод КАК Штрихкод,
	|	втШтрихкодыЗаказов.ПереданПартнером КАК ПереданПартнером,
	|	втШтрихкодыЗаказов.КодКонтрагента КАК КодКонтрагента,
	|	втШтрихкодыЗаказов.ТипЗаказа КАК ТипЗаказа,
	|	втШтрихкодыЗаказов.ДеньВДень КАК ДеньВДень,
	|	втШтрихкодыЗаказов.НомерСмены КАК НомерСмены,
	|	втШтрихкодыЗаказов.ЗапрашиватьОперативныеДанные КАК ЗапрашиватьОперативныеДанные,
	|	втШтрихкодыЗаказов.ПолигонМаршрутизации КАК ПолигонМаршрутизации,
	|	втШтрихкодыЗаказов.ВладелецТовараКод КАК ВладелецТовараКод,
	|	втШтрихкодыЗаказов.СкладМагазинаКод КАК СкладМагазинаКод,
	|	втШтрихкодыЗаказов.Статус КАК Статус,
	|	втШтрихкодыЗаказов.ПредварительноеЗакрытие КАК ПредварительноеЗакрытие
	|ИЗ
	|	втШтрихкодыЗаказов КАК втШтрихкодыЗаказов
	|ГДЕ
	|	втШтрихкодыЗаказов.КодКонтрагента = ""Shop_180""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втШтрихкодыЗаказов.НомерЗаказаСтриж КАК НомерЗаказаСтриж,
	|	втШтрихкодыЗаказов.НомерЗаказаИМ КАК НомерЗаказаИМ,
	|	втШтрихкодыЗаказов.ДатаДоставки КАК ДатаДоставки,
	|	втШтрихкодыЗаказов.Транспорт КАК Транспорт,
	|	втШтрихкодыЗаказов.КодОплаты КАК КодОплаты,
	|	втШтрихкодыЗаказов.Контрагент КАК Контрагент,
	|	втШтрихкодыЗаказов.НомерЛог КАК НомерЛог,
	|	втШтрихкодыЗаказов.КоличествоМест КАК КоличествоМест,
	|	втШтрихкодыЗаказов.ТерминалКод КАК ТерминалКод,
	|	втШтрихкодыЗаказов.ТерминалНаименование КАК ТерминалНаименование,
	|	втШтрихкодыЗаказов.НомерСектора КАК НомерСектора,
	|	втШтрихкодыЗаказов.ТранспортНомерГосударственнойРегистрации КАК ТранспортНомерГосударственнойРегистрации,
	|	втШтрихкодыЗаказов.КонтрагентКод КАК КонтрагентКод,
	|	втШтрихкодыЗаказов.КонтрагентРодительКод КАК КонтрагентРодительКод,
	|	втШтрихкодыЗаказов.tag КАК tag,
	|	втШтрихкодыЗаказов.ТерминалПриемаКод КАК ТерминалПриемаКод,
	|	втШтрихкодыЗаказов.НомерПалетты КАК НомерПалетты,
	|	втШтрихкодыЗаказов.СтатусЗаказа КАК СтатусЗаказа,
	|	втШтрихкодыЗаказов.Штрихкод КАК Штрихкод,
	|	втШтрихкодыЗаказов.ПереданПартнером КАК ПереданПартнером,
	|	втШтрихкодыЗаказов.КодКонтрагента КАК КодКонтрагента,
	|	втШтрихкодыЗаказов.ТипЗаказа КАК ТипЗаказа,
	|	втШтрихкодыЗаказов.ДеньВДень КАК ДеньВДень,
	|	втШтрихкодыЗаказов.НомерСмены КАК НомерСмены,
	|	втШтрихкодыЗаказов.ЗапрашиватьОперативныеДанные КАК ЗапрашиватьОперативныеДанные,
	|	втШтрихкодыЗаказов.ПолигонМаршрутизации КАК ПолигонМаршрутизации,
	|	втШтрихкодыЗаказов.ВладелецТовараКод КАК ВладелецТовараКод,
	|	втШтрихкодыЗаказов.СкладМагазинаКод КАК СкладМагазинаКод,
	|	втШтрихкодыЗаказов.Статус КАК Статус,
	|	втШтрихкодыЗаказов.ПредварительноеЗакрытие КАК ПредварительноеЗакрытие
	|ИЗ
	|	втШтрихкодыЗаказов КАК втШтрихкодыЗаказов
	|ГДЕ
	|	втШтрихкодыЗаказов.КодКонтрагента = ""Shop_428""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втШтрихкодыЗаказов.НомерЗаказаСтриж КАК НомерЗаказаСтриж,
	|	втШтрихкодыЗаказов.НомерЗаказаИМ КАК НомерЗаказаИМ,
	|	втШтрихкодыЗаказов.ДатаДоставки КАК ДатаДоставки,
	|	втШтрихкодыЗаказов.Транспорт КАК Транспорт,
	|	втШтрихкодыЗаказов.КодОплаты КАК КодОплаты,
	|	втШтрихкодыЗаказов.Контрагент КАК Контрагент,
	|	втШтрихкодыЗаказов.НомерЛог КАК НомерЛог,
	|	втШтрихкодыЗаказов.КоличествоМест КАК КоличествоМест,
	|	втШтрихкодыЗаказов.ТерминалКод КАК ТерминалКод,
	|	втШтрихкодыЗаказов.ТерминалНаименование КАК ТерминалНаименование,
	|	втШтрихкодыЗаказов.НомерСектора КАК НомерСектора,
	|	втШтрихкодыЗаказов.ТранспортНомерГосударственнойРегистрации КАК ТранспортНомерГосударственнойРегистрации,
	|	втШтрихкодыЗаказов.КонтрагентКод КАК КонтрагентКод,
	|	втШтрихкодыЗаказов.КонтрагентРодительКод КАК КонтрагентРодительКод,
	|	втШтрихкодыЗаказов.tag КАК tag,
	|	втШтрихкодыЗаказов.ТерминалПриемаКод КАК ТерминалПриемаКод,
	|	втШтрихкодыЗаказов.НомерПалетты КАК НомерПалетты,
	|	втШтрихкодыЗаказов.СтатусЗаказа КАК СтатусЗаказа,
	|	втШтрихкодыЗаказов.Штрихкод КАК Штрихкод,
	|	втШтрихкодыЗаказов.ПереданПартнером КАК ПереданПартнером,
	|	втШтрихкодыЗаказов.КодКонтрагента КАК КодКонтрагента,
	|	втШтрихкодыЗаказов.ТипЗаказа КАК ТипЗаказа,
	|	втШтрихкодыЗаказов.ДеньВДень КАК ДеньВДень,
	|	втШтрихкодыЗаказов.НомерСмены КАК НомерСмены,
	|	втШтрихкодыЗаказов.ЗапрашиватьОперативныеДанные КАК ЗапрашиватьОперативныеДанные,
	|	втШтрихкодыЗаказов.ПолигонМаршрутизации КАК ПолигонМаршрутизации,
	|	втШтрихкодыЗаказов.ВладелецТовараКод КАК ВладелецТовараКод,
	|	втШтрихкодыЗаказов.СкладМагазинаКод КАК СкладМагазинаКод,
	|	втШтрихкодыЗаказов.Статус КАК Статус,
	|	втШтрихкодыЗаказов.ПредварительноеЗакрытие КАК ПредварительноеЗакрытие
	|ИЗ
	|	втШтрихкодыЗаказов КАК втШтрихкодыЗаказов
	|ГДЕ
	|	втШтрихкодыЗаказов.КодКонтрагента = ""Shop_197""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втШтрихкодыЗаказов.НомерЗаказаСтриж КАК НомерЗаказаСтриж,
	|	втШтрихкодыЗаказов.НомерЗаказаИМ КАК НомерЗаказаИМ,
	|	втШтрихкодыЗаказов.ДатаДоставки КАК ДатаДоставки,
	|	втШтрихкодыЗаказов.Транспорт КАК Транспорт,
	|	втШтрихкодыЗаказов.КодОплаты КАК КодОплаты,
	|	втШтрихкодыЗаказов.Контрагент КАК Контрагент,
	|	втШтрихкодыЗаказов.НомерЛог КАК НомерЛог,
	|	втШтрихкодыЗаказов.КоличествоМест КАК КоличествоМест,
	|	втШтрихкодыЗаказов.ТерминалКод КАК ТерминалКод,
	|	втШтрихкодыЗаказов.ТерминалНаименование КАК ТерминалНаименование,
	|	втШтрихкодыЗаказов.НомерСектора КАК НомерСектора,
	|	втШтрихкодыЗаказов.ТранспортНомерГосударственнойРегистрации КАК ТранспортНомерГосударственнойРегистрации,
	|	втШтрихкодыЗаказов.КонтрагентКод КАК КонтрагентКод,
	|	втШтрихкодыЗаказов.КонтрагентРодительКод КАК КонтрагентРодительКод,
	|	втШтрихкодыЗаказов.tag КАК tag,
	|	втШтрихкодыЗаказов.ТерминалПриемаКод КАК ТерминалПриемаКод,
	|	втШтрихкодыЗаказов.НомерПалетты КАК НомерПалетты,
	|	втШтрихкодыЗаказов.СтатусЗаказа КАК СтатусЗаказа,
	|	втШтрихкодыЗаказов.Штрихкод КАК Штрихкод,
	|	втШтрихкодыЗаказов.ПереданПартнером КАК ПереданПартнером,
	|	втШтрихкодыЗаказов.КодКонтрагента КАК КодКонтрагента,
	|	втШтрихкодыЗаказов.ТипЗаказа КАК ТипЗаказа,
	|	втШтрихкодыЗаказов.ДеньВДень КАК ДеньВДень,
	|	втШтрихкодыЗаказов.НомерСмены КАК НомерСмены,
	|	втШтрихкодыЗаказов.ЗапрашиватьОперативныеДанные КАК ЗапрашиватьОперативныеДанные,
	|	втШтрихкодыЗаказов.ПолигонМаршрутизации КАК ПолигонМаршрутизации,
	|	втШтрихкодыЗаказов.ВладелецТовараКод КАК ВладелецТовараКод,
	|	втШтрихкодыЗаказов.СкладМагазинаКод КАК СкладМагазинаКод,
	|	втШтрихкодыЗаказов.Статус КАК Статус,
	|	втШтрихкодыЗаказов.ПредварительноеЗакрытие КАК ПредварительноеЗакрытие
	|ИЗ
	|	втШтрихкодыЗаказов КАК втШтрихкодыЗаказов
	|ГДЕ
	|	втШтрихкодыЗаказов.КодКонтрагента = ""Shop_795""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втШтрихкодыЗаказов.НомерЗаказаСтриж КАК НомерЗаказаСтриж,
	|	втШтрихкодыЗаказов.НомерЗаказаИМ КАК НомерЗаказаИМ,
	|	втШтрихкодыЗаказов.ДатаДоставки КАК ДатаДоставки,
	|	втШтрихкодыЗаказов.Транспорт КАК Транспорт,
	|	втШтрихкодыЗаказов.КодОплаты КАК КодОплаты,
	|	втШтрихкодыЗаказов.Контрагент КАК Контрагент,
	|	втШтрихкодыЗаказов.НомерЛог КАК НомерЛог,
	|	втШтрихкодыЗаказов.КоличествоМест КАК КоличествоМест,
	|	втШтрихкодыЗаказов.ТерминалКод КАК ТерминалКод,
	|	втШтрихкодыЗаказов.ТерминалНаименование КАК ТерминалНаименование,
	|	втШтрихкодыЗаказов.НомерСектора КАК НомерСектора,
	|	втШтрихкодыЗаказов.ТранспортНомерГосударственнойРегистрации КАК ТранспортНомерГосударственнойРегистрации,
	|	втШтрихкодыЗаказов.КонтрагентКод КАК КонтрагентКод,
	|	втШтрихкодыЗаказов.КонтрагентРодительКод КАК КонтрагентРодительКод,
	|	втШтрихкодыЗаказов.tag КАК tag,
	|	втШтрихкодыЗаказов.ТерминалПриемаКод КАК ТерминалПриемаКод,
	|	втШтрихкодыЗаказов.НомерПалетты КАК НомерПалетты,
	|	втШтрихкодыЗаказов.СтатусЗаказа КАК СтатусЗаказа,
	|	втШтрихкодыЗаказов.Штрихкод КАК Штрихкод,
	|	втШтрихкодыЗаказов.ПереданПартнером КАК ПереданПартнером,
	|	втШтрихкодыЗаказов.КодКонтрагента КАК КодКонтрагента,
	|	втШтрихкодыЗаказов.ТипЗаказа КАК ТипЗаказа,
	|	втШтрихкодыЗаказов.ДеньВДень КАК ДеньВДень,
	|	втШтрихкодыЗаказов.НомерСмены КАК НомерСмены,
	|	втШтрихкодыЗаказов.ЗапрашиватьОперативныеДанные КАК ЗапрашиватьОперативныеДанные,
	|	втШтрихкодыЗаказов.ПолигонМаршрутизации КАК ПолигонМаршрутизации,
	|	втШтрихкодыЗаказов.ВладелецТовараКод КАК ВладелецТовараКод,
	|	втШтрихкодыЗаказов.СкладМагазинаКод КАК СкладМагазинаКод,
	|	втШтрихкодыЗаказов.Статус КАК Статус,
	|	втШтрихкодыЗаказов.ПредварительноеЗакрытие КАК ПредварительноеЗакрытие
	|ИЗ
	|	втШтрихкодыЗаказов КАК втШтрихкодыЗаказов
	|ГДЕ
	|	втШтрихкодыЗаказов.КодКонтрагента = ""Shop_976""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втШтрихкодыЗаказов.НомерЗаказаСтриж КАК НомерЗаказаСтриж,
	|	втШтрихкодыЗаказов.НомерЗаказаИМ КАК НомерЗаказаИМ,
	|	втШтрихкодыЗаказов.ДатаДоставки КАК ДатаДоставки,
	|	втШтрихкодыЗаказов.Транспорт КАК Транспорт,
	|	втШтрихкодыЗаказов.КодОплаты КАК КодОплаты,
	|	втШтрихкодыЗаказов.Контрагент КАК Контрагент,
	|	втШтрихкодыЗаказов.НомерЛог КАК НомерЛог,
	|	втШтрихкодыЗаказов.КоличествоМест КАК КоличествоМест,
	|	втШтрихкодыЗаказов.ТерминалКод КАК ТерминалКод,
	|	втШтрихкодыЗаказов.ТерминалНаименование КАК ТерминалНаименование,
	|	втШтрихкодыЗаказов.НомерСектора КАК НомерСектора,
	|	втШтрихкодыЗаказов.ТранспортНомерГосударственнойРегистрации КАК ТранспортНомерГосударственнойРегистрации,
	|	втШтрихкодыЗаказов.КонтрагентКод КАК КонтрагентКод,
	|	втШтрихкодыЗаказов.КонтрагентРодительКод КАК КонтрагентРодительКод,
	|	втШтрихкодыЗаказов.tag КАК tag,
	|	втШтрихкодыЗаказов.ТерминалПриемаКод КАК ТерминалПриемаКод,
	|	втШтрихкодыЗаказов.НомерПалетты КАК НомерПалетты,
	|	втШтрихкодыЗаказов.СтатусЗаказа КАК СтатусЗаказа,
	|	втШтрихкодыЗаказов.Штрихкод КАК Штрихкод,
	|	втШтрихкодыЗаказов.ПереданПартнером КАК ПереданПартнером,
	|	втШтрихкодыЗаказов.КодКонтрагента КАК КодКонтрагента,
	|	втШтрихкодыЗаказов.ТипЗаказа КАК ТипЗаказа,
	|	втШтрихкодыЗаказов.ДеньВДень КАК ДеньВДень,
	|	втШтрихкодыЗаказов.НомерСмены КАК НомерСмены,
	|	втШтрихкодыЗаказов.ЗапрашиватьОперативныеДанные КАК ЗапрашиватьОперативныеДанные,
	|	втШтрихкодыЗаказов.ПолигонМаршрутизации КАК ПолигонМаршрутизации,
	|	втШтрихкодыЗаказов.ВладелецТовараКод КАК ВладелецТовараКод,
	|	втШтрихкодыЗаказов.СкладМагазинаКод КАК СкладМагазинаКод,
	|	втШтрихкодыЗаказов.Статус КАК Статус,
	|	втШтрихкодыЗаказов.ПредварительноеЗакрытие КАК ПредварительноеЗакрытие
	|ИЗ
	|	втШтрихкодыЗаказов КАК втШтрихкодыЗаказов
	|ГДЕ
	|	НЕ втШтрихкодыЗаказов.КодКонтрагента В (""Shop_757"", ""Shop_752"", ""Shop_601"", ""Shop_180"", ""Shop_428"", ""Shop_197"", ""Shop_795"", ""Shop_976"")";
	
	//без товаров	
	Зап.УстановитьПараметр("НачДата", НачалоПериода);			
	Зап.УстановитьПараметр("КонДата", КонецПериода);
	Зап.УстановитьПараметр("МассивТерминаловДоставки",МассивТерминалов);
	Зап.УстановитьПараметр("ПустойТранспорт",ПустойТранспорт());
	Зап.УстановитьПараметр("АктуальнаяДатаДоставки",АктуальнаяДатаДоставки);
	
	МассивРезультатов = Зап.ВыполнитьПакет();
	ВыборкаShop_757  = МассивРезультатов[10].Выбрать();
	ВыборкаShop_180  = МассивРезультатов[11].Выбрать();
	ВыборкаShop_428  = МассивРезультатов[12].Выбрать();
	ВыборкаShop_197  = МассивРезультатов[13].Выбрать();
	ВыборкаShop_795  = МассивРезультатов[14].Выбрать();
	ВыборкаShop_976  = МассивРезультатов[15].Выбрать();
	ВыборкаОстальные = МассивРезультатов[16].Выбрать();
	
	
	
	ТаблицаШК = Новый ТаблицаЗначений;
	ТаблицаШК.Колонки.Добавить("НомерЗаказаСтриж",Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(11, ДопустимаяДлина.Переменная)));
	ТаблицаШК.Колонки.Добавить("НомерЗаказаИМ",Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(50, ДопустимаяДлина.Переменная)));
	ТаблицаШК.Колонки.Добавить("ТерминалПриемаКод",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(9, 0, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаШК.Колонки.Добавить("ТерминалКод",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(9, 0, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаШК.Колонки.Добавить("КоличествоМест",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(3, 0, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаШК.Колонки.Добавить("ДатаДоставки",Новый ОписаниеТипов("Дата", , ,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТаблицаШК.Колонки.Добавить("ТранспортНомерГосударственнойРегистрации",Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(15, ДопустимаяДлина.Переменная)));
	ТаблицаШК.Колонки.Добавить("НомерПалетты",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(5, 0, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаШК.Колонки.Добавить("НомерСектора",Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(11, ДопустимаяДлина.Переменная)));
	ТаблицаШК.Колонки.Добавить("СтатусЗаказа",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(2, 0, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаШК.Колонки.Добавить("КодКонтрагента",Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(9, ДопустимаяДлина.Переменная)));
	ТаблицаШК.Колонки.Добавить("ТипЗаказа",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(1, 0, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаШК.Колонки.Добавить("Штрихкод",Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(30, ДопустимаяДлина.Переменная)));
	ТаблицаШК.Колонки.Добавить("ПереданПартнером",Новый ОписаниеТипов("Булево"));
	ТаблицаШК.Колонки.Добавить("ДеньВДень",Новый ОписаниеТипов("Булево"));
	ТаблицаШК.Колонки.Добавить("НомерСмены",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(1, 0, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаШК.Колонки.Добавить("ЗапрашиватьОперативныеДанные", Новый ОписаниеТипов("Булево")); 
	//Асеев 17.09.2021 (Задача № 4671)>>>
	ТаблицаШК.Колонки.Добавить("ПолигонМаршрутизации", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(5, 0, ДопустимыйЗнак.Неотрицательный)));
	//Асеев 17.09.2021 (Задача № 4671)<<<
	//Асеев 18.01.2022 (Задача № 4973)>>>
	ТаблицаШК.Колонки.Добавить("ВладелецТовараКод", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(9, ДопустимаяДлина.Переменная)));
	ТаблицаШК.Колонки.Добавить("СкладМагазинаКод", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(9, 0, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаШК.Колонки.Добавить("Статус", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(3, 0, ДопустимыйЗнак.Неотрицательный)));
	//Асеев 18.01.2022 (Задача № 4973)<<<
	//Асеев 19.01.2024 (Задача № 5205)>>>
	ТаблицаШК.Колонки.Добавить("ПредварительноеЗакрытие", Новый ОписаниеТипов("Булево"));
	//Асеев 19.01.2024 (Задача № 5205)<<<

	ДобавитьСтрокиДоставок_Shop_757(ВыборкаShop_757, ТаблицаШК);	
	ДобавитьСтрокиДоставок_Shop_180(ВыборкаShop_180, ТаблицаШК);
	ДобавитьСтрокиДоставок_Shop_428(ВыборкаShop_428, ТаблицаШК);
	ДобавитьСтрокиДоставок_Shop_197(ВыборкаShop_197, ТаблицаШК);
	ДобавитьСтрокиДоставок_Shop_795(ВыборкаShop_795, ТаблицаШК);
	ДобавитьСтрокиДоставок_Shop_976(ВыборкаShop_976, ТаблицаШК);
	ДобавитьСтрокиДоставок(ВыборкаОстальные, ТаблицаШК);
	
	ЗапСам = Новый Запрос;
	ЗапСам.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Реализация,
	|	РеализацияТоваровУслуг.СтатусИнтернетМагазина КАК СтатусЗаказа,
	|	РеализацияТоваровУслуг.Номер КАК Номер,
	|	РеализацияТоваровУслуг.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	РеализацияТоваровУслуг.СуммаДокумента КАК Сумма,
	|	РеализацияТоваровУслуг.КомментарийСД КАК КомментарийСД,
	|	РеализацияТоваровУслуг.КомментарийСД КАК ИсходныйКомментарийСД,
	|	ЕСТЬNULL(новаМестнаяДоставка.Ссылка, ИСТИНА) КАК Доставлен,
	|	ЛОЖЬ КАК Закрыть,
	|	новаМестнаяДоставка.Ссылка КАК Доставка,
	|	новаМестнаяДоставка.ДоставкаИзмененаНаСамовывоз КАК ДоставкаИзмененаНаСамовывоз,
	|	РеализацияТоваровУслуг.ВладелецТовара.Ссылка КАК ВладелецТовара,
	|	новаМестнаяДоставка.СуммаБанковскойКомиссии КАК БанковскаяКомиссия,
	|	новаМестнаяДоставка.СуммаКассовогоОбслуживания КАК КассовоеОбслуживание,
	|	новаМестнаяДоставка.СтоимостьДоставкиДоМКАД КАК СуммаДоставкиДоМКАД,
	|	новаМестнаяДоставка.СтоимостьДоставкиЗаМКАД КАК СуммаДоставкиЗаМКАД,
	|	РеализацияТоваровУслуг.ТерминалДоставки.Код КАК ТерминалКод,
	|	РеализацияТоваровУслуг.ТерминалДоставки.Наименование КАК ТерминалНаименование,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.СтатусИнтернетМагазина = 2
	|			ТОГДА 1
	|		КОГДА РеализацияТоваровУслуг.СтатусИнтернетМагазина = 4
	|			ТОГДА 2
	|		КОГДА РеализацияТоваровУслуг.СтатусИнтернетМагазина = 3
	|			ТОГДА 3
	|		КОГДА РеализацияТоваровУслуг.СтатусИнтернетМагазина = 1
	|			ТОГДА 4
	|	КОНЕЦ КАК tag,
	|	РеализацияТоваровУслуг.ТерминалПриема.Код КАК ТерминалПриемаКод,
	|	РеализацияТоваровУслуг.Дата КАК ДатаДоставки,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.ВладелецТовара.Родитель.ОсновнойМагазин = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.ВладелецТовара.Код
	|		ИНАЧЕ РеализацияТоваровУслуг.ВладелецТовара.Родитель.ОсновнойМагазин.Код
	|	КОНЕЦ КАК КодПартнера,
	|	РеализацияТоваровУслуг.КоличествоМест КАК КоличествоМестРеализации,
	|	РеализацияТоваровУслуг.ДоставкаДеньВДень КАК ДеньВДень,
	|	РеализацияТоваровУслуг.ВладелецТовара.Код КАК ВладелецТовараКод
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.новаМестнаяДоставка КАК новаМестнаяДоставка
	|		ПО РеализацияТоваровУслуг.Номер = новаМестнаяДоставка.Номер
	|ГДЕ
	|	РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка,
	|	РеализацияТоваровУслуг.СтатусИнтернетМагазина,
	|	РеализацияТоваровУслуг.Номер,
	|	РеализацияТоваровУслуг.НомерВнешнегоЗаказа,
	|	РеализацияТоваровУслуг.Контрагент,
	|	РеализацияТоваровУслуг.СуммаДокумента,
	|	РеализацияТоваровУслуг.КомментарийСД,
	|	РеализацияТоваровУслуг.КомментарийСД,
	|	ЕСТЬNULL(новаМестнаяДоставка.Ссылка, ИСТИНА),
	|	ЛОЖЬ,
	|	новаМестнаяДоставка.Ссылка,
	|	новаМестнаяДоставка.ДоставкаИзмененаНаСамовывоз,
	|	РеализацияТоваровУслуг.ВладелецТовара.Ссылка,
	|	новаМестнаяДоставка.СуммаБанковскойКомиссии,
	|	новаМестнаяДоставка.СуммаКассовогоОбслуживания,
	|	новаМестнаяДоставка.СтоимостьДоставкиДоМКАД,
	|	новаМестнаяДоставка.СтоимостьДоставкиЗаМКАД,
	|	РеализацияТоваровУслуг.ТерминалДоставки.Код,
	|	РеализацияТоваровУслуг.ТерминалДоставки.Наименование,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.СтатусИнтернетМагазина = 2
	|			ТОГДА 1
	|		КОГДА РеализацияТоваровУслуг.СтатусИнтернетМагазина = 4
	|			ТОГДА 2
	|		КОГДА РеализацияТоваровУслуг.СтатусИнтернетМагазина = 3
	|			ТОГДА 3
	|		КОГДА РеализацияТоваровУслуг.СтатусИнтернетМагазина = 1
	|			ТОГДА 4
	|	КОНЕЦ,
	|	РеализацияТоваровУслуг.ТерминалПриема.Код,
	|	РеализацияТоваровУслуг.Дата,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.ВладелецТовара.Родитель.ОсновнойМагазин = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.ВладелецТовара.Код
	|		ИНАЧЕ РеализацияТоваровУслуг.ВладелецТовара.Родитель.ОсновнойМагазин.Код
	|	КОНЕЦ,
	|	РеализацияТоваровУслуг.КоличествоМест,
	|	РеализацияТоваровУслуг.ДоставкаДеньВДень,
	|	РеализацияТоваровУслуг.ВладелецТовара.Код
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.новаМестнаяДоставка КАК новаМестнаяДоставка
	|		ПО РеализацияТоваровУслуг.Номер = новаМестнаяДоставка.Номер
	|ГДЕ
	|	РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачСтарые И &ДатаНач
	|	И РеализацияТоваровУслуг.СтатусИнтернетМагазина <> 3
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Реализация КАК Реализация,
	|	ВТ.СтатусЗаказа КАК СтатусЗаказа,
	|	ВТ.Номер КАК Номер,
	|	ВТ.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
	|	ВТ.Контрагент КАК Контрагент,
	|	ВТ.Сумма КАК Сумма,
	|	ВТ.КомментарийСД КАК КомментарийСД,
	|	ВТ.ИсходныйКомментарийСД КАК ИсходныйКомментарийСД,
	|	ВТ.Доставлен КАК Доставлен,
	|	ВТ.Закрыть КАК Закрыть,
	|	ВТ.Доставка КАК Доставка,
	|	ВТ.ДоставкаИзмененаНаСамовывоз КАК ДоставкаИзмененаНаСамовывоз,
	|	ВТ.ВладелецТовара КАК ВладелецТовара,
	|	ВТ.БанковскаяКомиссия КАК БанковскаяКомиссия,
	|	ВТ.КассовоеОбслуживание КАК КассовоеОбслуживание,
	|	ВТ.СуммаДоставкиДоМКАД КАК СуммаДоставкиДоМКАД,
	|	ВТ.СуммаДоставкиЗаМКАД КАК СуммаДоставкиЗаМКАД,
	|	ЕСТЬNULL(ЕСТЬNULL(Накладная003Заказы.КоличествоМест, ВЫРАЗИТЬ(Накладная003Заказы.Заказ КАК Документ.РеализацияТоваровУслуг).КоличествоМест), ВТ.КоличествоМестРеализации) КАК КоличествоМест,
	|	ВТ.ТерминалНаименование КАК ТерминалНаименование,
	|	ВТ.ТерминалКод КАК ТерминалКод,
	|	ПРЕДСТАВЛЕНИЕ(ЗНАЧЕНИЕ(Справочник.ГруппыРайонов.БезСектора)) КАК НомерСектора,
	|	ВТ.Контрагент.Код КАК КонтрагентКод,
	|	ВТ.Контрагент.Родитель.Код КАК КонтрагентРодительКод,
	|	ВТ.tag КАК tag,
	|	ВТ.ТерминалПриемаКод КАК ТерминалПриемаКод,
	|	ВТ.ДатаДоставки КАК ДатаДоставки,
	|	ВТ.КодПартнера КАК КодПартнера,
	|	ВТ.ДеньВДень КАК ДеньВДень,
	|	ВТ.ВладелецТовараКод КАК ВладелецТовараКод
	|ПОМЕСТИТЬ втЗаказыКВыгрузке
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Накладная003.Заказы КАК Накладная003Заказы
	|		ПО (ВТ.Реализация.Ссылка = ВЫРАЗИТЬ(Накладная003Заказы.Заказ КАК Документ.РеализацияТоваровУслуг).Ссылка)
	|ГДЕ
	|	ВТ.Доставлен = ИСТИНА
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Реализация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втЗаказыКВыгрузке.Реализация КАК Реализация,
	|	МАКСИМУМ(СтатусыЗаказов.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_МаксПериодыСтатусов
	|ИЗ
	|	втЗаказыКВыгрузке КАК втЗаказыКВыгрузке
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЗаказов КАК СтатусыЗаказов
	|		ПО втЗаказыКВыгрузке.Реализация = СтатусыЗаказов.Заказ
	|
	|СГРУППИРОВАТЬ ПО
	|	втЗаказыКВыгрузке.Реализация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(втЗаказыКВыгрузке.Номер, """") КАК НомерЗаказаСтриж,
	|	ЕСТЬNULL(втЗаказыКВыгрузке.НомерВнешнегоЗаказа, """") КАК НомерЗаказаИМ,
	|	ЕСТЬNULL(втЗаказыКВыгрузке.ТерминалКод, 0) КАК ТерминалКод,
	|	ЕСТЬNULL(втЗаказыКВыгрузке.ТерминалПриемаКод, 0) КАК ТерминалПриемаКод,
	|	ЕСТЬNULL(втЗаказыКВыгрузке.КоличествоМест, 0) КАК КоличествоМест,
	|	ЕСТЬNULL(втЗаказыКВыгрузке.ДатаДоставки, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаДоставки,
	|	ЕСТЬNULL(втЗаказыКВыгрузке.СтатусЗаказа, 0) КАК СтатусЗаказа,
	|	ЕСТЬNULL(ШтрихкодыЗаказов.Штрихкод, """") КАК Штрихкод,
	|	ЕСТЬNULL(ШтрихкодыЗаказов.ШКПереданПартнером, ЛОЖЬ) КАК ПереданПартнером,
	|	ЕСТЬNULL(втЗаказыКВыгрузке.КодПартнера, """") КАК КодКонтрагента,
	|	ЕСТЬNULL(втЗаказыКВыгрузке.ВладелецТовара, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК ВладелецТовара,
	|	ЕСТЬNULL(втЗаказыКВыгрузке.КонтрагентКод, """") КАК КодВладельцаТоваров,
	|	2 КАК ТипЗаказа,
	|	"""" КАК ТранспортНомерГосударственнойРегистрации,
	|	0 КАК НомерПалетты,
	|	0 КАК НомерСектора,
	|	ЕСТЬNULL(втЗаказыКВыгрузке.ДеньВДень, ЛОЖЬ) КАК ДеньВДень,
	|	ЕСТЬNULL(ДополнительныеПараметрыЗаказа.Смена.НомерСмены, 0) КАК НомерСмены,
	|	ЕСТЬNULL(ПараметрыКонтрагентовСрезПоследних.АвтоматическоеИсключениеЧастичноПринятыхНаСкладЗаказовПриПогрузкеВАвто, ЛОЖЬ) КАК ЗапрашиватьОперативныеДанные,
	|	ЕСТЬNULL(втЗаказыКВыгрузке.ВладелецТовараКод, """") КАК ВладелецТовараКод,
	|	ЕСТЬNULL(ДополнительныеПараметрыЗаказа.СкладМагазина.Код, 0) КАК СкладМагазинаКод,
	|	ЕСТЬNULL(СтатусыЗаказов.Статус, 0) КАК Статус
	|ПОМЕСТИТЬ втШтрихКодыЗаказов
	|ИЗ
	|	втЗаказыКВыгрузке КАК втЗаказыКВыгрузке
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыЗаказов КАК ШтрихкодыЗаказов
	|		ПО втЗаказыКВыгрузке.Реализация = ШтрихкодыЗаказов.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
	|		ПО втЗаказыКВыгрузке.Реализация = ДополнительныеПараметрыЗаказа.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыКонтрагентов.СрезПоследних(
	|				,
	|				Контрагент В
	|					(ВЫБРАТЬ
	|						втЗаказыКВыгрузке.ВладелецТовара КАК ВладелецТовара
	|					ИЗ
	|						втЗаказыКВыгрузке КАК втЗаказыКВыгрузке)) КАК ПараметрыКонтрагентовСрезПоследних
	|		ПО втЗаказыКВыгрузке.ВладелецТовара = ПараметрыКонтрагентовСрезПоследних.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МаксПериодыСтатусов КАК ВТ_МаксПериодыСтатусов
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЗаказов КАК СтатусыЗаказов
	|			ПО ВТ_МаксПериодыСтатусов.Период = СтатусыЗаказов.Период
	|				И ВТ_МаксПериодыСтатусов.Реализация = СтатусыЗаказов.Заказ
	|		ПО втЗаказыКВыгрузке.Реализация = ВТ_МаксПериодыСтатусов.Реализация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втШтрихКодыЗаказов.НомерЗаказаСтриж КАК НомерЗаказаСтриж,
	|	втШтрихКодыЗаказов.НомерЗаказаИМ КАК НомерЗаказаИМ,
	|	втШтрихКодыЗаказов.ТерминалКод КАК ТерминалКод,
	|	втШтрихКодыЗаказов.ТерминалПриемаКод КАК ТерминалПриемаКод,
	|	втШтрихКодыЗаказов.КоличествоМест КАК КоличествоМест,
	|	втШтрихКодыЗаказов.ДатаДоставки КАК ДатаДоставки,
	|	втШтрихКодыЗаказов.СтатусЗаказа КАК СтатусЗаказа,
	|	втШтрихКодыЗаказов.Штрихкод КАК Штрихкод,
	|	втШтрихКодыЗаказов.ПереданПартнером КАК ПереданПартнером,
	|	втШтрихКодыЗаказов.КодКонтрагента КАК КодКонтрагента,
	|	втШтрихКодыЗаказов.ВладелецТовара КАК ВладелецТовара,
	|	втШтрихКодыЗаказов.КодВладельцаТоваров КАК КодВладельцаТоваров,
	|	втШтрихКодыЗаказов.ТипЗаказа КАК ТипЗаказа,
	|	втШтрихКодыЗаказов.ТранспортНомерГосударственнойРегистрации КАК ТранспортНомерГосударственнойРегистрации,
	|	втШтрихКодыЗаказов.НомерПалетты КАК НомерПалетты,
	|	втШтрихКодыЗаказов.НомерСектора КАК НомерСектора,
	|	втШтрихКодыЗаказов.ДеньВДень КАК ДеньВДень,
	|	втШтрихКодыЗаказов.НомерСмены КАК НомерСмены,
	|	втШтрихКодыЗаказов.ЗапрашиватьОперативныеДанные КАК ЗапрашиватьОперативныеДанные,
	|	0 КАК ПолигонМаршрутизации,
	|	втШтрихКодыЗаказов.ВладелецТовараКод КАК ВладелецТовараКод,
	|	втШтрихКодыЗаказов.СкладМагазинаКод КАК СкладМагазинаКод,
	|	втШтрихКодыЗаказов.Статус КАК Статус,
	|	ЛОЖЬ КАК ПредварительноеЗакрытие
	|ИЗ
	|	втШтрихКодыЗаказов КАК втШтрихКодыЗаказов
	|ГДЕ
	|	втШтрихКодыЗаказов.КодКонтрагента В (""Shop_757"", ""Shop_752"", ""Shop_601"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втШтрихКодыЗаказов.НомерЗаказаСтриж КАК НомерЗаказаСтриж,
	|	втШтрихКодыЗаказов.НомерЗаказаИМ КАК НомерЗаказаИМ,
	|	втШтрихКодыЗаказов.ТерминалКод КАК ТерминалКод,
	|	втШтрихКодыЗаказов.ТерминалПриемаКод КАК ТерминалПриемаКод,
	|	втШтрихКодыЗаказов.КоличествоМест КАК КоличествоМест,
	|	втШтрихКодыЗаказов.ДатаДоставки КАК ДатаДоставки,
	|	втШтрихКодыЗаказов.СтатусЗаказа КАК СтатусЗаказа,
	|	втШтрихКодыЗаказов.Штрихкод КАК Штрихкод,
	|	втШтрихКодыЗаказов.ПереданПартнером КАК ПереданПартнером,
	|	втШтрихКодыЗаказов.КодКонтрагента КАК КодКонтрагента,
	|	втШтрихКодыЗаказов.ВладелецТовара КАК ВладелецТовара,
	|	втШтрихКодыЗаказов.КодВладельцаТоваров КАК КодВладельцаТоваров,
	|	втШтрихКодыЗаказов.ТипЗаказа КАК ТипЗаказа,
	|	втШтрихКодыЗаказов.ТранспортНомерГосударственнойРегистрации КАК ТранспортНомерГосударственнойРегистрации,
	|	втШтрихКодыЗаказов.НомерПалетты КАК НомерПалетты,
	|	втШтрихКодыЗаказов.НомерСектора КАК НомерСектора,
	|	втШтрихКодыЗаказов.ДеньВДень КАК ДеньВДень,
	|	втШтрихКодыЗаказов.НомерСмены КАК НомерСмены,
	|	втШтрихКодыЗаказов.ЗапрашиватьОперативныеДанные КАК ЗапрашиватьОперативныеДанные,
	|	0 КАК ПолигонМаршрутизации,
	|	втШтрихКодыЗаказов.ВладелецТовараКод КАК ВладелецТовараКод,
	|	втШтрихКодыЗаказов.СкладМагазинаКод КАК СкладМагазинаКод,
	|	втШтрихКодыЗаказов.Статус КАК Статус,
	|	ЛОЖЬ КАК ПредварительноеЗакрытие
	|ИЗ
	|	втШтрихКодыЗаказов КАК втШтрихКодыЗаказов
	|ГДЕ
	|	втШтрихКодыЗаказов.КодКонтрагента = ""Shop_180""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втШтрихКодыЗаказов.НомерЗаказаСтриж КАК НомерЗаказаСтриж,
	|	втШтрихКодыЗаказов.НомерЗаказаИМ КАК НомерЗаказаИМ,
	|	втШтрихКодыЗаказов.ТерминалКод КАК ТерминалКод,
	|	втШтрихКодыЗаказов.ТерминалПриемаКод КАК ТерминалПриемаКод,
	|	втШтрихКодыЗаказов.КоличествоМест КАК КоличествоМест,
	|	втШтрихКодыЗаказов.ДатаДоставки КАК ДатаДоставки,
	|	втШтрихКодыЗаказов.СтатусЗаказа КАК СтатусЗаказа,
	|	втШтрихКодыЗаказов.Штрихкод КАК Штрихкод,
	|	втШтрихКодыЗаказов.ПереданПартнером КАК ПереданПартнером,
	|	втШтрихКодыЗаказов.КодКонтрагента КАК КодКонтрагента,
	|	втШтрихКодыЗаказов.ВладелецТовара КАК ВладелецТовара,
	|	втШтрихКодыЗаказов.КодВладельцаТоваров КАК КодВладельцаТоваров,
	|	втШтрихКодыЗаказов.ТипЗаказа КАК ТипЗаказа,
	|	втШтрихКодыЗаказов.ТранспортНомерГосударственнойРегистрации КАК ТранспортНомерГосударственнойРегистрации,
	|	втШтрихКодыЗаказов.НомерПалетты КАК НомерПалетты,
	|	втШтрихКодыЗаказов.НомерСектора КАК НомерСектора,
	|	втШтрихКодыЗаказов.ДеньВДень КАК ДеньВДень,
	|	втШтрихКодыЗаказов.НомерСмены КАК НомерСмены,
	|	втШтрихКодыЗаказов.ЗапрашиватьОперативныеДанные КАК ЗапрашиватьОперативныеДанные,
	|	0 КАК ПолигонМаршрутизации,
	|	втШтрихКодыЗаказов.ВладелецТовараКод КАК ВладелецТовараКод,
	|	втШтрихКодыЗаказов.СкладМагазинаКод КАК СкладМагазинаКод,
	|	втШтрихКодыЗаказов.Статус КАК Статус,
	|	ЛОЖЬ КАК ПредварительноеЗакрытие
	|ИЗ
	|	втШтрихКодыЗаказов КАК втШтрихКодыЗаказов
	|ГДЕ
	|	втШтрихКодыЗаказов.КодКонтрагента = ""Shop_428""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втШтрихКодыЗаказов.НомерЗаказаСтриж КАК НомерЗаказаСтриж,
	|	втШтрихКодыЗаказов.НомерЗаказаИМ КАК НомерЗаказаИМ,
	|	втШтрихКодыЗаказов.ТерминалКод КАК ТерминалКод,
	|	втШтрихКодыЗаказов.ТерминалПриемаКод КАК ТерминалПриемаКод,
	|	втШтрихКодыЗаказов.КоличествоМест КАК КоличествоМест,
	|	втШтрихКодыЗаказов.ДатаДоставки КАК ДатаДоставки,
	|	втШтрихКодыЗаказов.СтатусЗаказа КАК СтатусЗаказа,
	|	втШтрихКодыЗаказов.Штрихкод КАК Штрихкод,
	|	втШтрихКодыЗаказов.ПереданПартнером КАК ПереданПартнером,
	|	втШтрихКодыЗаказов.КодКонтрагента КАК КодКонтрагента,
	|	втШтрихКодыЗаказов.ВладелецТовара КАК ВладелецТовара,
	|	втШтрихКодыЗаказов.КодВладельцаТоваров КАК КодВладельцаТоваров,
	|	втШтрихКодыЗаказов.ТипЗаказа КАК ТипЗаказа,
	|	втШтрихКодыЗаказов.ТранспортНомерГосударственнойРегистрации КАК ТранспортНомерГосударственнойРегистрации,
	|	втШтрихКодыЗаказов.НомерПалетты КАК НомерПалетты,
	|	втШтрихКодыЗаказов.НомерСектора КАК НомерСектора,
	|	втШтрихКодыЗаказов.ДеньВДень КАК ДеньВДень,
	|	втШтрихКодыЗаказов.НомерСмены КАК НомерСмены,
	|	втШтрихКодыЗаказов.ЗапрашиватьОперативныеДанные КАК ЗапрашиватьОперативныеДанные,
	|	0 КАК ПолигонМаршрутизации,
	|	втШтрихКодыЗаказов.ВладелецТовараКод КАК ВладелецТовараКод,
	|	втШтрихКодыЗаказов.СкладМагазинаКод КАК СкладМагазинаКод,
	|	втШтрихКодыЗаказов.Статус КАК Статус,
	|	ЛОЖЬ КАК ПредварительноеЗакрытие
	|ИЗ
	|	втШтрихКодыЗаказов КАК втШтрихКодыЗаказов
	|ГДЕ
	|	втШтрихКодыЗаказов.КодКонтрагента = ""Shop_197""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втШтрихКодыЗаказов.НомерЗаказаСтриж КАК НомерЗаказаСтриж,
	|	втШтрихКодыЗаказов.НомерЗаказаИМ КАК НомерЗаказаИМ,
	|	втШтрихКодыЗаказов.ТерминалКод КАК ТерминалКод,
	|	втШтрихКодыЗаказов.ТерминалПриемаКод КАК ТерминалПриемаКод,
	|	втШтрихКодыЗаказов.КоличествоМест КАК КоличествоМест,
	|	втШтрихКодыЗаказов.ДатаДоставки КАК ДатаДоставки,
	|	втШтрихКодыЗаказов.СтатусЗаказа КАК СтатусЗаказа,
	|	втШтрихКодыЗаказов.Штрихкод КАК Штрихкод,
	|	втШтрихКодыЗаказов.ПереданПартнером КАК ПереданПартнером,
	|	втШтрихКодыЗаказов.КодКонтрагента КАК КодКонтрагента,
	|	втШтрихКодыЗаказов.ВладелецТовара КАК ВладелецТовара,
	|	втШтрихКодыЗаказов.КодВладельцаТоваров КАК КодВладельцаТоваров,
	|	втШтрихКодыЗаказов.ТипЗаказа КАК ТипЗаказа,
	|	втШтрихКодыЗаказов.ТранспортНомерГосударственнойРегистрации КАК ТранспортНомерГосударственнойРегистрации,
	|	втШтрихКодыЗаказов.НомерПалетты КАК НомерПалетты,
	|	втШтрихКодыЗаказов.НомерСектора КАК НомерСектора,
	|	втШтрихКодыЗаказов.ДеньВДень КАК ДеньВДень,
	|	втШтрихКодыЗаказов.НомерСмены КАК НомерСмены,
	|	втШтрихКодыЗаказов.ЗапрашиватьОперативныеДанные КАК ЗапрашиватьОперативныеДанные,
	|	0 КАК ПолигонМаршрутизации,
	|	втШтрихКодыЗаказов.ВладелецТовараКод КАК ВладелецТовараКод,
	|	втШтрихКодыЗаказов.СкладМагазинаКод КАК СкладМагазинаКод,
	|	втШтрихКодыЗаказов.Статус КАК Статус,
	|	ЛОЖЬ КАК ПредварительноеЗакрытие
	|ИЗ
	|	втШтрихКодыЗаказов КАК втШтрихКодыЗаказов
	|ГДЕ
	|	втШтрихКодыЗаказов.КодКонтрагента = ""Shop_795""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втШтрихКодыЗаказов.НомерЗаказаСтриж КАК НомерЗаказаСтриж,
	|	втШтрихКодыЗаказов.НомерЗаказаИМ КАК НомерЗаказаИМ,
	|	втШтрихКодыЗаказов.ТерминалКод КАК ТерминалКод,
	|	втШтрихКодыЗаказов.ТерминалПриемаКод КАК ТерминалПриемаКод,
	|	втШтрихКодыЗаказов.КоличествоМест КАК КоличествоМест,
	|	втШтрихКодыЗаказов.ДатаДоставки КАК ДатаДоставки,
	|	втШтрихКодыЗаказов.СтатусЗаказа КАК СтатусЗаказа,
	|	втШтрихКодыЗаказов.Штрихкод КАК Штрихкод,
	|	втШтрихКодыЗаказов.ПереданПартнером КАК ПереданПартнером,
	|	втШтрихКодыЗаказов.КодКонтрагента КАК КодКонтрагента,
	|	втШтрихКодыЗаказов.ВладелецТовара КАК ВладелецТовара,
	|	втШтрихКодыЗаказов.КодВладельцаТоваров КАК КодВладельцаТоваров,
	|	втШтрихКодыЗаказов.ТипЗаказа КАК ТипЗаказа,
	|	втШтрихКодыЗаказов.ТранспортНомерГосударственнойРегистрации КАК ТранспортНомерГосударственнойРегистрации,
	|	втШтрихКодыЗаказов.НомерПалетты КАК НомерПалетты,
	|	втШтрихКодыЗаказов.НомерСектора КАК НомерСектора,
	|	втШтрихКодыЗаказов.ДеньВДень КАК ДеньВДень,
	|	втШтрихКодыЗаказов.НомерСмены КАК НомерСмены,
	|	втШтрихКодыЗаказов.ЗапрашиватьОперативныеДанные КАК ЗапрашиватьОперативныеДанные,
	|	0 КАК ПолигонМаршрутизации,
	|	втШтрихКодыЗаказов.ВладелецТовараКод КАК ВладелецТовараКод,
	|	втШтрихКодыЗаказов.СкладМагазинаКод КАК СкладМагазинаКод,
	|	втШтрихКодыЗаказов.Статус КАК Статус,
	|	ЛОЖЬ КАК ПредварительноеЗакрытие
	|ИЗ
	|	втШтрихКодыЗаказов КАК втШтрихКодыЗаказов
	|ГДЕ
	|	втШтрихКодыЗаказов.КодКонтрагента = ""Shop_976""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втШтрихКодыЗаказов.НомерЗаказаСтриж КАК НомерЗаказаСтриж,
	|	втШтрихКодыЗаказов.НомерЗаказаИМ КАК НомерЗаказаИМ,
	|	втШтрихКодыЗаказов.ТерминалКод КАК ТерминалКод,
	|	втШтрихКодыЗаказов.ТерминалПриемаКод КАК ТерминалПриемаКод,
	|	втШтрихКодыЗаказов.КоличествоМест КАК КоличествоМест,
	|	втШтрихКодыЗаказов.ДатаДоставки КАК ДатаДоставки,
	|	втШтрихКодыЗаказов.СтатусЗаказа КАК СтатусЗаказа,
	|	втШтрихКодыЗаказов.Штрихкод КАК Штрихкод,
	|	втШтрихКодыЗаказов.ПереданПартнером КАК ПереданПартнером,
	|	втШтрихКодыЗаказов.КодКонтрагента КАК КодКонтрагента,
	|	втШтрихКодыЗаказов.ВладелецТовара КАК ВладелецТовара,
	|	втШтрихКодыЗаказов.КодВладельцаТоваров КАК КодВладельцаТоваров,
	|	втШтрихКодыЗаказов.ТипЗаказа КАК ТипЗаказа,
	|	втШтрихКодыЗаказов.ТранспортНомерГосударственнойРегистрации КАК ТранспортНомерГосударственнойРегистрации,
	|	втШтрихКодыЗаказов.НомерПалетты КАК НомерПалетты,
	|	втШтрихКодыЗаказов.НомерСектора КАК НомерСектора,
	|	втШтрихКодыЗаказов.ДеньВДень КАК ДеньВДень,
	|	втШтрихКодыЗаказов.НомерСмены КАК НомерСмены,
	|	втШтрихКодыЗаказов.ЗапрашиватьОперативныеДанные КАК ЗапрашиватьОперативныеДанные,
	|	0 КАК ПолигонМаршрутизации,
	|	втШтрихКодыЗаказов.ВладелецТовараКод КАК ВладелецТовараКод,
	|	втШтрихКодыЗаказов.СкладМагазинаКод КАК СкладМагазинаКод,
	|	втШтрихКодыЗаказов.Статус КАК Статус,
	|	ЛОЖЬ КАК ПредварительноеЗакрытие
	|ИЗ
	|	втШтрихКодыЗаказов КАК втШтрихКодыЗаказов
	|ГДЕ
	|	НЕ втШтрихКодыЗаказов.КодКонтрагента В (""Shop_757"", ""Shop_752"", ""Shop_601"", ""Shop_180"", ""Shop_428"", ""Shop_197"", ""Shop_795"", ""Shop_976"")"; 
	
	
	
	ЗапСам.УстановитьПараметр("ДатаНач", НачалоПериода);
	ЗапСам.УстановитьПараметр("ДатаНачСтарые", НачалоПериода - 7*86400);	
	ЗапСам.УстановитьПараметр("ДатаКон", КонецПериода);
	
	МассивРезультатов = ЗапСам.ВыполнитьПакет();
	ВыборкаShop_757 = МассивРезультатов[4].Выбрать();
	ВыборкаShop_180 = МассивРезультатов[5].Выбрать();
	ВыборкаShop_428 = МассивРезультатов[6].Выбрать();
	ВыборкаShop_197 = МассивРезультатов[7].Выбрать();
	ВыборкаShop_795 = МассивРезультатов[8].Выбрать();
	ВыборкаShop_976 = МассивРезультатов[9].Выбрать();
	Выборка         = МассивРезультатов[10].Выбрать();
	
	ДобавитьСтрокиДоставок_Shop_757(ВыборкаShop_757, ТаблицаШК, Истина);	
	ДобавитьСтрокиДоставок_Shop_180(ВыборкаShop_180, ТаблицаШК, Истина);
	ДобавитьСтрокиДоставок_Shop_428(ВыборкаShop_428, ТаблицаШК, Истина);
	ДобавитьСтрокиДоставок_Shop_197(ВыборкаShop_197, ТаблицаШК, Истина);
	ДобавитьСтрокиДоставок_Shop_795(ВыборкаShop_795, ТаблицаШК, Истина);
	ДобавитьСтрокиДоставок_Shop_976(ВыборкаShop_976, ТаблицаШК, Истина);
	ДобавитьСтрокиДоставок(Выборка, ТаблицаШК,Истина);
	
	ТаблицаШК.Сортировать("НомерЗаказаСтриж");
	//Асеев 17.09.2021 (Задача № 4671)>>>
	//ТаблицаШК.Свернуть("НомерЗаказаСтриж, НомерЗаказаИМ,ТерминалПриемаКод,ТерминалКод,КоличествоМест,ДатаДоставки,ТранспортНомерГосударственнойРегистрации,НомерПалетты,НомерСектора,СтатусЗаказа,КодКонтрагента,ТипЗаказа,Штрихкод,ДеньВДень,НомерСмены, ЗапрашиватьОперативныеДанные","ПереданПартнером");	
	//ТаблицаШК.Свернуть("НомерЗаказаСтриж, НомерЗаказаИМ,ТерминалПриемаКод,ТерминалКод,КоличествоМест,ДатаДоставки,ТранспортНомерГосударственнойРегистрации,НомерПалетты,НомерСектора,СтатусЗаказа,КодКонтрагента,ТипЗаказа,Штрихкод,ДеньВДень,НомерСмены, ЗапрашиватьОперативныеДанные,ПолигонМаршрутизации","ПереданПартнером");
	//Асеев 17.09.2021 (Задача № 4671)<<<
	//Асеев 18.01.2022 (Задача № 4973)>>>
	//ТаблицаШК.Свернуть("НомерЗаказаСтриж, НомерЗаказаИМ,ТерминалПриемаКод,ТерминалКод,КоличествоМест,ДатаДоставки,ТранспортНомерГосударственнойРегистрации,НомерПалетты,НомерСектора,СтатусЗаказа,КодКонтрагента,ТипЗаказа,Штрихкод,ДеньВДень,НомерСмены, ЗапрашиватьОперативныеДанные,ПолигонМаршрутизации,ВладелецТовараКод,СкладМагазинаКод,Статус","ПереданПартнером");
	//Асеев 18.01.2022 (Задача № 4973)<<<
	//Асеев 19.01.2024 (Задача № 5205)>>>
	ТаблицаШК.Свернуть("НомерЗаказаСтриж, НомерЗаказаИМ,ТерминалПриемаКод,ТерминалКод,КоличествоМест,ДатаДоставки,ТранспортНомерГосударственнойРегистрации,НомерПалетты,НомерСектора,СтатусЗаказа,КодКонтрагента,ТипЗаказа,Штрихкод,ДеньВДень,НомерСмены, ЗапрашиватьОперативныеДанные,ПолигонМаршрутизации,ВладелецТовараКод,СкладМагазинаКод,Статус,ПредварительноеЗакрытие","ПереданПартнером");
	//Асеев 19.01.2024 (Задача № 5205)<<<
	ТекстПисьма = "";
	Если УдалятьДублиШК Тогда
		КопияТаблицыШК = ТаблицаШК.Скопировать(,"НомерЗаказаСтриж,Штрихкод");
		КопияТаблицыШК.Колонки.Добавить("КоличествоШК",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(1, 0, ДопустимыйЗнак.Неотрицательный)));
		КопияТаблицыШК.ЗаполнитьЗначения(1,"КоличествоШК");
		КопияТаблицыШК.Свернуть("НомерЗаказаСтриж,Штрихкод","КоличествоШК");
		КопияТаблицыШК.Сортировать("КоличествоШК Убыв");
		ЗаказыСДублямиШК = Новый Соответствие;
		Для Сч = 0 По КопияТаблицыШК.Количество() - 1 Цикл
			СтрокаТаблицы = КопияТаблицыШК[Сч];
			Если СтрокаТаблицы.КоличествоШК > 1 Тогда 
				МассивШКЗаказа = ЗаказыСДублямиШК.Получить(СтрокаТаблицы.НомерЗаказаСтриж);
				Если МассивШКЗаказа = Неопределено Тогда
					МассивШКЗаказа = Новый Массив;
					МассивШКЗаказа.Добавить(СтрокаТаблицы.Штрихкод);
					ЗаказыСДублямиШК.Вставить(СтрокаТаблицы.НомерЗаказаСтриж,МассивШКЗаказа);
				Иначе
					МассивШКЗаказа.Добавить(СтрокаТаблицы.Штрихкод);
				КонецЕсли;
			Иначе		
				Прервать;
			КонецЕсли;	
		КонецЦикла;	
		Если ЗаказыСДублямиШК.Количество() Тогда
			Для Каждого Заказ Из ЗаказыСДублямиШК Цикл
				Если ПустаяСтрока(ТекстПисьма) Тогда
					ТекстПисьма = ТекстПисьма + "Заказ " + Заказ.Ключ;
				Иначе
					ТекстПисьма = ТекстПисьма + Символы.ПС + "Заказ " + Заказ.Ключ;
				КонецЕсли;	
				Для Каждого ШК Из Заказ.Значение Цикл
					ТекстПисьма = ТекстПисьма + Символы.ПС + Символы.Таб + ШК;
					Сообщить("Заказ " + Заказ.Ключ + " Дублирующийся ШК: " + ШК);
				КонецЦикла;	
				СтрокиКУдалению = ТаблицаШК.НайтиСтроки(Новый Структура("НомерЗаказаСтриж",Заказ.Ключ));
				Для Каждого СтрокаТЗ Из СтрокиКУдалению Цикл
					ТаблицаШК.Удалить(СтрокаТЗ);
				КонецЦикла;	
			КонецЦикла;	
		КонецЕсли;	
		КопияТаблицыШК = ТаблицаШК.Скопировать(,"НомерЗаказаСтриж,Штрихкод");
		КопияТаблицыШК.Колонки.Добавить("КоличествоШК",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(1, 0, ДопустимыйЗнак.Неотрицательный)));
		Для Каждого СтрокаТЗ Из КопияТаблицыШК Цикл
			СтрокаТЗ.Штрихкод = ВРег(СтрокаТЗ.Штрихкод);
		КонецЦикла;	
		КопияТаблицыШК.ЗаполнитьЗначения(1,"КоличествоШК");
		КопияТаблицыШК.Свернуть("НомерЗаказаСтриж,Штрихкод","КоличествоШК");
		КопияТаблицыШК.Сортировать("КоличествоШК Убыв");
		ЗаказыСДублямиШК = Новый Соответствие;
		Для Сч = 0 По КопияТаблицыШК.Количество() - 1 Цикл
			СтрокаТаблицы = КопияТаблицыШК[Сч];
			Если СтрокаТаблицы.КоличествоШК > 1 Тогда 
				МассивШКЗаказа = ЗаказыСДублямиШК.Получить(СтрокаТаблицы.НомерЗаказаСтриж);
				Если МассивШКЗаказа = Неопределено Тогда
					МассивШКЗаказа = Новый Массив;
					МассивШКЗаказа.Добавить(СтрокаТаблицы.Штрихкод);
					ЗаказыСДублямиШК.Вставить(СтрокаТаблицы.НомерЗаказаСтриж,МассивШКЗаказа);
				Иначе
					МассивШКЗаказа.Добавить(СтрокаТаблицы.Штрихкод);
				КонецЕсли;
			Иначе		
				Прервать;
			КонецЕсли;	
		КонецЦикла;	
		Если ЗаказыСДублямиШК.Количество() Тогда
			Для Каждого Заказ Из ЗаказыСДублямиШК Цикл
				Если ПустаяСтрока(ТекстПисьма) Тогда
					ТекстПисьма = ТекстПисьма + "Заказ " + Заказ.Ключ + " (В ШК буквы в разных регистрах)";
				Иначе
					ТекстПисьма = ТекстПисьма + Символы.ПС + "Заказ " + Заказ.Ключ + " (В ШК буквы в разных регистрах)";
				КонецЕсли;	
				Для Каждого ШК Из Заказ.Значение Цикл
					ТекстПисьма = ТекстПисьма + Символы.ПС + Символы.Таб + ШК;
					Сообщить("Заказ " + Заказ.Ключ + " Дублирующийся ШК: " + ШК);
				КонецЦикла;	
				СтрокиКУдалению = ТаблицаШК.НайтиСтроки(Новый Структура("НомерЗаказаСтриж",Заказ.Ключ));
				Для Каждого СтрокаТЗ Из СтрокиКУдалению Цикл
					ТаблицаШК.Удалить(СтрокаТЗ);
				КонецЦикла;	
			КонецЦикла;	
		КонецЕсли;	
	КонецЕсли;
	
	Если Не ПустаяСтрока(ТекстПисьма) Тогда 
		МассивПолучателей = Новый Массив;
		МассивПолучателей.Добавить("m.aseev@strizh-logistic.ru");
		Если Не СтрНайти(ТекстПисьма, "В ШК буквы в разных регистрах") Тогда
			МассивПолучателей.Добавить("sklad1@strizh-logistic.ru");
		КонецЕсли;	
		МассивПолучателей.Добавить("evgeniy.marochkin@strizh-logistic.ru");
		lem.ОтправитьСообщение(МассивПолучателей,"Заказы с дублями ШК",ТекстПисьма);
	КонецЕсли;
	
	МассивДанных = СформироватьМассивДанных(ТаблицаШК);
	Возврат СформироватьСтрокуJSON(МассивДанных);
	
КонецФункции

Функция ПолучитьДанныеШК(ВходныеДанные) Экспорт	
	//+Степанов Задача № 3949 В структуру ответа и в запрос додавлено поле partiallyAcceptedOrderExcludedFromTrip
	СтруктураОтвета = Новый Структура("barcode, orderId, orderIdExt, numberOfPlaces, deliveryDate, carRegNumber, paleteNumber, orderState, deliveryTerminalId, receivingTerminalId, orderType, sectorName, partiallyAcceptedOrderExcludedFromTrip, polygonRouting, shopName, stockIDRoute, stockName, stockAddress, stockRegion, orderStatus, preliminaryClosedRoute");
	Запрос = Новый Запрос;
	//Асеев 28.09.2021 (Задача № 4671)>>>//Асеев 28.09.2021 (Задача № 4671)<<<
	//Асеев 19.01.2024 (Задача № 5205)>>>//Асеев 19.01.2024 (Задача № 5205)<<<
	//Асеев 23.01.2024 (Задача № 5215)>>>//Асеев 23.01.2024 (Задача № 5215)<<<
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.ТерминалДоставки КАК Терминал,
	|	РеализацияТоваровУслуг.ВладелецТовара КАК ВладелецТовара
	|ПОМЕСТИТЬ втНайденныйЗаказ
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Номер = &Номер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АктивнаяСхемаПолигональнойМаршрутизацииСрезПоследних.РегиональныйТерминал КАК РегиональныйТерминал,
	|	АктивнаяСхемаПолигональнойМаршрутизацииСрезПоследних.СхемаПолигональнойМаршрутизации КАК СхемаПолигональнойМаршрутизации
	|ПОМЕСТИТЬ ВТ_АктивныеСхемыМаршрутизации
	|ИЗ
	|	РегистрСведений.АктивнаяСхемаПолигональнойМаршрутизации.СрезПоследних(
	|			,
	|			РегиональныйТерминал В
	|				(ВЫБРАТЬ
	|					втНайденныйЗаказ.Терминал КАК Терминал
	|				ИЗ
	|					втНайденныйЗаказ КАК втНайденныйЗаказ)) КАК АктивнаяСхемаПолигональнойМаршрутизацииСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втНайденныйЗаказ.Ссылка КАК Заказ,
	|	ВТ_АктивныеСхемыМаршрутизации.СхемаПолигональнойМаршрутизации КАК СхемаПолигональнойМаршрутизации
	|ПОМЕСТИТЬ ВТ_СхемыМаршрутизацииЗаказов
	|ИЗ
	|	втНайденныйЗаказ КАК втНайденныйЗаказ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_АктивныеСхемыМаршрутизации КАК ВТ_АктивныеСхемыМаршрутизации
	|		ПО втНайденныйЗаказ.Терминал = ВТ_АктивныеСхемыМаршрутизации.РегиональныйТерминал
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПолигоныМаршрутизацииЗаказовСрезПоследних.Заказ КАК Заказ,
	|	ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации КАК ПолигонМаршрутизации
	|ПОМЕСТИТЬ ВТ_ПолигоныМаршрутизацииЗаказов
	|ИЗ
	|	РегистрСведений.ПолигоныМаршрутизацииЗаказов.СрезПоследних(
	|			,
	|			(Заказ, СхемаМаршрутизации) В
	|				(ВЫБРАТЬ
	|					ВТ_СхемыМаршрутизацииЗаказов.Заказ КАК Заказ,
	|					ВТ_СхемыМаршрутизацииЗаказов.СхемаПолигональнойМаршрутизации КАК СхемаПолигональнойМаршрутизации
	|				ИЗ
	|					ВТ_СхемыМаршрутизацииЗаказов КАК ВТ_СхемыМаршрутизацииЗаказов)) КАК ПолигоныМаршрутизацииЗаказовСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	РейсЗаказы.Ссылка КАК Рейс,
	|	втНайденныйЗаказ.Ссылка КАК Заказ,
	|	РейсЗаказы.УдаленИзРейса КАК УдаленИзРейса,
	|	РейсЗаказы.Ссылка.НомерПалетты КАК НомерПалетты,
	|	РейсЗаказы.Ссылка.ДатаРейса КАК ДатаРейса
	|ПОМЕСТИТЬ втПоследнийРейс
	|ИЗ
	|	Документ.Рейс.Заказы КАК РейсЗаказы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втНайденныйЗаказ КАК втНайденныйЗаказ
	|		ПО РейсЗаказы.Заказ = втНайденныйЗаказ.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	РейсЗаказы.Ссылка.Дата УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УчетПоступленияМногоместныхЗаказовСрезПоследних.Заказ КАК Заказ,
	|	УчетПоступленияМногоместныхЗаказовСрезПоследних.ПолностьюПоступил КАК ПолностьюПоступил
	|ПОМЕСТИТЬ втСтатусы
	|ИЗ
	|	РегистрСведений.УчетПоступленияМногоместныхЗаказов.СрезПоследних(
	|			,
	|			Заказ В
	|				(ВЫБРАТЬ
	|					втНайденныйЗаказ.Ссылка КАК Ссылка
	|				ИЗ
	|					втНайденныйЗаказ КАК втНайденныйЗаказ)) КАК УчетПоступленияМногоместныхЗаказовСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Номер КАК orderId,
	|	РеализацияТоваровУслуг.НомерВнешнегоЗаказа КАК orderIdExt,
	|	РеализацияТоваровУслуг.КоличествоМест КАК numberOfPlaces,
	|	ВЫБОР
	|		КОГДА НЕ СтатусыПредварительногоЗакрытияРейсовСрезПоследних.Заказ ЕСТЬ NULL
	|			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(РеализацияТоваровУслуг.Дата, ДЕНЬ), ДЕНЬ, 1)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(РеализацияТоваровУслуг.Дата, ДЕНЬ)
	|	КОНЕЦ КАК deliveryDate,
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(РеализацияТоваровУслуг.Дата, ДЕНЬ) <> втПоследнийРейс.ДатаРейса
	|				ИЛИ ЕСТЬNULL(втПоследнийРейс.УдаленИзРейса, ЛОЖЬ)
	|			ТОГДА """"
	|		ИНАЧЕ ЕСТЬNULL(ПривязкаМашинКРейсамСрезПоследних.Транспорт.НомерГосударственнойРегистрации, """")
	|	КОНЕЦ КАК carRegNumber,
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(РеализацияТоваровУслуг.Дата, ДЕНЬ) <> втПоследнийРейс.ДатаРейса
	|				ИЛИ ЕСТЬNULL(втПоследнийРейс.УдаленИзРейса, ЛОЖЬ)
	|			ТОГДА """"
	|		ИНАЧЕ ЕСТЬNULL(втПоследнийРейс.НомерПалетты, """")
	|	КОНЕЦ КАК paleteNumber,
	|	РеализацияТоваровУслуг.СтатусИнтернетМагазина КАК orderState,
	|	РеализацияТоваровУслуг.ТерминалДоставки.Код КАК deliveryTerminalId,
	|	РеализацияТоваровУслуг.ТерминалПриема.Код КАК receivingTerminalId,
	|	ВЫБОР
	|		КОГДА новаМестнаяДоставка.Ссылка ЕСТЬ NULL
	|			ТОГДА ""Самовывоз""
	|		ИНАЧЕ ""Доставка""
	|	КОНЕЦ КАК orderType,
	|	"""" КАК sectorName,
	|	НЕ ЕСТЬNULL(втСтатусы.ПолностьюПоступил, ЛОЖЬ)
	|		И ЕСТЬNULL(ПараметрыКонтрагентовСрезПоследних.АвтоматическоеИсключениеЧастичноПринятыхНаСкладЗаказовПриПогрузкеВАвто, ЛОЖЬ) КАК partiallyAcceptedOrderExcludedFromTrip,
	|	ЕСТЬNULL(ВТ_ПолигоныМаршрутизацииЗаказов.ПолигонМаршрутизации.Порядок, 0) КАК polygonRouting,
	|	0 КАК orderStatus,
	|	РеализацияТоваровУслуг.ВладелецТовара.Наименование КАК shopName,
	|	ЕСТЬNULL(ДополнительныеПараметрыЗаказа.СкладМагазина.ИдентификаторНаправления, """") КАК stockIDRoute,
	|	ЕСТЬNULL(ДополнительныеПараметрыЗаказа.СкладМагазина.Наименование, """") КАК stockName,
	|	ЕСТЬNULL(ДополнительныеПараметрыЗаказа.СкладМагазина.Адрес, """") КАК stockAddress,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.СкладМагазина, """") = """"
	|			ТОГДА """"
	|		КОГДА ДополнительныеПараметрыЗаказа.СкладМагазина.Регион.Код = 1
	|			ТОГДА ""МСК""
	|		КОГДА ДополнительныеПараметрыЗаказа.СкладМагазина.Регион.Код = 2
	|			ТОГДА ""СПб""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК stockRegion,
	|	НЕ СтатусыПредварительногоЗакрытияРейсовСрезПоследних.Заказ ЕСТЬ NULL КАК preliminaryClosedRoute
	|ИЗ
	|	втНайденныйЗаказ КАК втНайденныйЗаказ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|			ЛЕВОЕ СОЕДИНЕНИЕ втПоследнийРейс КАК втПоследнийРейс
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних(
	|						,
	|						Рейс В
	|							(ВЫБРАТЬ
	|								втПоследнийРейс.Рейс КАК Рейс
	|							ИЗ
	|								втПоследнийРейс КАК втПоследнийРейс)) КАК ПривязкаМашинКРейсамСрезПоследних
	|				ПО втПоследнийРейс.Рейс = ПривязкаМашинКРейсамСрезПоследних.Рейс
	|			ПО (втПоследнийРейс.Заказ = РеализацияТоваровУслуг.Ссылка)
	|			ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.новаМестнаяДоставка КАК новаМестнаяДоставка
	|			ПО РеализацияТоваровУслуг.Номер = новаМестнаяДоставка.Номер
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
	|			ПО РеализацияТоваровУслуг.Ссылка = ДополнительныеПараметрыЗаказа.Заказ.Ссылка
	|		ПО втНайденныйЗаказ.Ссылка = РеализацияТоваровУслуг.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыКонтрагентов.СрезПоследних(
	|				,
	|				Контрагент В
	|					(ВЫБРАТЬ
	|						втНайденныйЗаказ.ВладелецТовара КАК ВладелецТовара
	|					ИЗ
	|						втНайденныйЗаказ КАК втНайденныйЗаказ)) КАК ПараметрыКонтрагентовСрезПоследних
	|		ПО втНайденныйЗаказ.ВладелецТовара = ПараметрыКонтрагентовСрезПоследних.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСтатусы КАК втСтатусы
	|		ПО втНайденныйЗаказ.Ссылка = втСтатусы.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПолигоныМаршрутизацииЗаказов КАК ВТ_ПолигоныМаршрутизацииЗаказов
	|		ПО втНайденныйЗаказ.Ссылка = ВТ_ПолигоныМаршрутизацииЗаказов.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПредварительногоЗакрытияРейсов.СрезПоследних КАК СтатусыПредварительногоЗакрытияРейсовСрезПоследних
	|		ПО втНайденныйЗаказ.Ссылка = СтатусыПредварительногоЗакрытияРейсовСрезПоследних.Заказ
	|			И (СтатусыПредварительногоЗакрытияРейсовСрезПоследних.СтатусПредварительногоЗакрытияРейса = ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительногоЗакрытияРейсов.РейсЗакрытПредварительно))";

	Запрос.УстановитьПараметр("Номер", ВходныеДанные.orderId);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураОтвета, Выборка);
		СтруктураОтвета.barcode = ВходныеДанные.barcode;
	КонецЕсли;	
	Возврат СтруктураОтвета
КонецФункции	

Функция СформироватьМассивДанных(ТаблицаШК)
	МассивДанных = Новый Массив();
	НомерПервойСтроки = 0;
	Для Каждого СтрокаШК Из ТаблицаШК Цикл 
		Если Не ПустаяСтрока(СтрокаШК.НомерЗаказаСтриж) Тогда 
			НомерПервойСтроки = ТаблицаШК.Индекс(СтрокаШК);	
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
	НомерЗаказа = Неопределено;
	Данные = Неопределено;
	МассивШтрихкодов = Новый Массив;
	Для Сч = НомерПервойСтроки По ТаблицаШК.Количество() - 1 Цикл
		ОбрабатываемаяСтрока = ТаблицаШК[Сч];
		Если ОбрабатываемаяСтрока.НомерЗаказаСтриж <> НомерЗаказа Тогда
			Если Данные <> Неопределено И МассивШтрихкодов <> Неопределено Тогда 
				Данные.Вставить("barCodes",МассивШтрихКодов);
				МассивДанных.Добавить(Данные);
			КонецЕсли;	
			НомерЗаказа =  ОбрабатываемаяСтрока.НомерЗаказаСтриж;
			Данные = Новый Структура;	
			Данные.Вставить("orderNumber",Число(ОбрабатываемаяСтрока.НомерЗаказаСтриж));
			Данные.Вставить("orderNumberIM",ОбрабатываемаяСтрока.НомерЗаказаИМ);
			Данные.Вставить("receivingTerminalNumber",ОбрабатываемаяСтрока.ТерминалПриемаКод);
			Данные.Вставить("deliveryTerminalNumber",ОбрабатываемаяСтрока.ТерминалКод);
			Данные.Вставить("quantityOfPlaces",ОбрабатываемаяСтрока.КоличествоМест);
			Данные.Вставить("deliveryDate",ОбрабатываемаяСтрока.ДатаДоставки);
			Данные.Вставить("autoRegistrationNumber",ОбрабатываемаяСтрока.ТранспортНомерГосударственнойРегистрации);
			Данные.Вставить("paletteNumber",ОбрабатываемаяСтрока.НомерПалетты);
			Данные.Вставить("sectorNumber",ОбрабатываемаяСтрока.НомерСектора);
			//Асеев 18.01.2022 (Задача № 4973)>>>
			//Данные.Вставить("orderStatus",ОбрабатываемаяСтрока.СтатусЗаказа);
			Данные.Вставить("orderFinalStatus",ОбрабатываемаяСтрока.СтатусЗаказа);
			//Асеев 18.01.2022 (Задача № 4973)<<<
			Данные.Вставить("partnerCode",ОбрабатываемаяСтрока.КодКонтрагента);
			Данные.Вставить("orderType",ОбрабатываемаяСтрока.ТипЗаказа);
			Данные.Вставить("dayToDay",ОбрабатываемаяСтрока.ДеньВДень);
			Данные.Вставить("shiftNumber",ОбрабатываемаяСтрока.НомерСмены);
			Данные.Вставить("operationalDataRequest",ОбрабатываемаяСтрока.ЗапрашиватьОперативныеДанные);
			//Асеев 17.09.2021 (Задача № 4671)>>>
			Данные.Вставить("polygonRouting",ОбрабатываемаяСтрока.ПолигонМаршрутизации);
			//Асеев 17.09.2021 (Задача № 4671)<<<
			//Асеев 18.01.2022 (Задача № 4973)>>>
			Данные.Вставить("shopId", ОбрабатываемаяСтрока.ВладелецТовараКод);
			Данные.Вставить("warehouseId", ОбрабатываемаяСтрока.СкладМагазинаКод);
			Данные.Вставить("orderStatus", ОбрабатываемаяСтрока.Статус);
			//Асеев 18.01.2022 (Задача № 4973)<<<
			//Асеев 19.01.2024 (Задача № 5205)>>>
			Данные.Вставить("preliminaryClosedRoute", ОбрабатываемаяСтрока.ПредварительноеЗакрытие);
			//Асеев 19.01.2024 (Задача № 5205)<<<
			МассивШтрихкодов = Новый Массив;
			МассивШтрихкодов.Добавить(Новый Структура("barCode,sentByPartner",ОбрабатываемаяСтрока.Штрихкод,ОбрабатываемаяСтрока.ПереданПартнером));
		Иначе
			МассивШтрихкодов.Добавить(Новый Структура("barCode,sentByPartner",ОбрабатываемаяСтрока.Штрихкод,ОбрабатываемаяСтрока.ПереданПартнером));
			Если сч = ТаблицаШК.Количество() - 1 Тогда 
				Данные.Вставить("barCodes",МассивШтрихКодов);
				МассивДанных.Добавить(Данные);
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
	Возврат МассивДанных
КонецФункции	

Процедура ДобавитьСтрокиДоставок_Shop_757(ВыборкаШК,ТаблицаШК, Самовывоз = Ложь)  
	Пока ВыборкаШК.Следующий() Цикл				
		Если Самовывоз Тогда 
			Штрихкод = "37" + Формат((Число(ВыборкаШК.НомерЗаказаСтриж)), "ЧЦ=10; ЧВН=; ЧГ=");
			Штрихкод = Штрихкод + КонтрольныйСимволEAN(ШтрихКод, 13);
			ДобавитьШКВтаблицу(Штрихкод,ТаблицаШК,ВыборкаШК);
		КонецЕсли;	
		ДобавитьШКВтаблицу(ВыборкаШК.Штрихкод,ТаблицаШК,ВыборкаШК,ВыборкаШК.ПереданПартнером);	
		ДобавитьШКВтаблицу(ВыборкаШК.НомерЗаказаСтриж,ТаблицаШК,ВыборкаШК);
		ДобавитьШКВтаблицу(ВыборкаШК.НомерЗаказаИМ,ТаблицаШК,ВыборкаШК);
	КонецЦикла;
КонецПроцедуры

Процедура ДобавитьСтрокиДоставок_Shop_180(ВыборкаШК,ТаблицаШК, Самовывоз = Ложь)  
	
	Пока ВыборкаШК.Следующий() Цикл
		Если Самовывоз Тогда 
			Штрихкод = "37" + Формат((Число(ВыборкаШК.НомерЗаказаСтриж)), "ЧЦ=10; ЧВН=; ЧГ=");
			Штрихкод = Штрихкод + КонтрольныйСимволEAN(ШтрихКод, 13);
			ДобавитьШКВтаблицу(Штрихкод,ТаблицаШК,ВыборкаШК);
		КонецЕсли;
		ДобавитьШКВтаблицу(ВыборкаШК.Штрихкод,ТаблицаШК,ВыборкаШК,ВыборкаШК.ПереданПартнером);	
		Если Не ВыборкаШК.ПереданПартнером Тогда 	 	
			Штрихкод = Лев(ВыборкаШК.НомерЗаказаИМ, 6) + "110001";
			ШК = Штрихкод + КонтрольныйСимволEAN(ШтрихКод, 13); 
			ДобавитьШКВтаблицу(ШК,ТаблицаШК,ВыборкаШК);
			ДобавитьНашНомер = Истина;
			Если СтрДлина(ВыборкаШК.НомерВнешнегоЗаказа) > 6 Тогда
				Штрихкод = "23" + Сред(ВыборкаШК.НомерЗаказаИМ,2, 6) + "1101";
				ДобавитьШКВтаблицу(Штрихкод,ТаблицаШК,ВыборкаШК);	
			КонецЕсли;
			
			Штрихкод  = Лев(ВыборкаШК.НомерЗаказаИМ, 6) + "130001";
			Штрихкод  = Штрихкод + КонтрольныйСимволEAN(ШтрихКод, 13); 
			ДобавитьШКВтаблицу(Штрихкод,ТаблицаШК,ВыборкаШК);			
			
			Штрихкод = Лев(ВыборкаШК.НомерЗаказаИМ, 6) + "150001";
			Штрихкод = Штрихкод + КонтрольныйСимволEAN(ШтрихКод, 13);
			ДобавитьШКВтаблицу(Штрихкод,ТаблицаШК,ВыборкаШК);
			
			Штрихкод = Лев(ВыборкаШК.НомерЗаказаИМ, 6) + "300001";
			Штрихкод = Штрихкод + КонтрольныйСимволEAN(ШтрихКод, 13); 
			ДобавитьШКВтаблицу(Штрихкод,ТаблицаШК,ВыборкаШК);
			
			Штрихкод = "23" + Лев(ВыборкаШК.НомерЗаказаИМ, 6) + "1101";
			Штрихкод = Штрихкод + КонтрольныйСимволEAN(ШтрихКод, 13);
			ДобавитьШКВтаблицу(Штрихкод,ТаблицаШК,ВыборкаШК);
			
			Для Сч = 2 По 10 Цикл			
				Штрихкод = Лев(СокрЛП(ВыборкаШК.НомерЗаказаИМ), 6) + "1100" + Формат(Сч, "ЧЦ=2; ЧВН=");
				ДобавитьШКВтаблицу(Штрихкод,ТаблицаШК,ВыборкаШК);
				Штрихкод = Лев(СокрЛП(ВыборкаШК.НомерЗаказаИМ), 6) + "1300" + Формат(Сч, "ЧЦ=2; ЧВН=");
				Штрихкод = Штрихкод + КонтрольныйСимволEAN(ШтрихКод, 13); 
				ДобавитьШКВтаблицу(Штрихкод,ТаблицаШК,ВыборкаШК);
				Штрихкод = Лев(СокрЛП(ВыборкаШК.НомерЗаказаИМ), 6) + "1500" + Формат(Сч, "ЧЦ=2; ЧВН=");
				Штрихкод = Штрихкод + КонтрольныйСимволEAN(ШтрихКод, 13);
				ДобавитьШКВтаблицу(Штрихкод,ТаблицаШК,ВыборкаШК);
				Штрихкод = "23" + Лев(СокрЛП(ВыборкаШК.НомерЗаказаИМ), 6) + "11" + Формат(Сч, "ЧЦ=2; ЧВН=");
				Штрихкод = Штрихкод + КонтрольныйСимволEAN(ШтрихКод, 13); 
				ДобавитьШКВтаблицу(Штрихкод,ТаблицаШК,ВыборкаШК);
				Если СтрДлина(ВыборкаШК.НомерЗаказаИМ) > 6 Тогда
					Штрихкод  = "23" + Сред(СокрЛП(ВыборкаШК.НомерЗаказаИМ),2, 6) + "11" + Формат(Сч, "ЧЦ=2; ЧВН=");					
					ШтрихКод = Штрихкод + КонтрольныйСимволEAN(ШтрихКод, 13); 
					ДобавитьШКВтаблицу(Штрихкод,ТаблицаШК,ВыборкаШК);	
				КонецЕсли;				
			КонецЦикла;		
		КонецЕсли;	
		ДобавитьШКВтаблицу(ВыборкаШК.НомерЗаказаСтриж,ТаблицаШК,ВыборкаШК);		
		ДобавитьШКВтаблицу(ВыборкаШК.НомерЗаказаИМ,ТаблицаШК,ВыборкаШК);		
	КонецЦикла;
КонецПроцедуры

Процедура ДобавитьСтрокиДоставок_Shop_428(ВыборкаШК, ТаблицаШК, Самовывоз = Ложь)  
	
	Пока ВыборкаШК.Следующий() Цикл
		Если Самовывоз Тогда 
			Штрихкод = "37" + Формат((Число(ВыборкаШК.НомерЗаказаСтриж)), "ЧЦ=10; ЧВН=; ЧГ=");
			Штрихкод = Штрихкод + КонтрольныйСимволEAN(ШтрихКод, 13);
			ДобавитьШКВтаблицу(Штрихкод,ТаблицаШК,ВыборкаШК);
		КонецЕсли;
		
		ДобавитьШКВтаблицу(ВыборкаШК.Штрихкод,ТаблицаШК,ВыборкаШК,ВыборкаШК.ПереданПартнером);	
		Если Не ВыборкаШК.ПереданПартнером Тогда 	 	
			Штрихкод = "000" + ВыборкаШК.НомерЗаказаИМ + "01";
			ДобавитьШКВтаблицу(Штрихкод,ТаблицаШК,ВыборкаШК);
			Штрихкод = ВыборкаШК.НомерЗаказаИМ + "01";//Штрихкод + lem.КонтрольныйСимволEAN(ШтрихКод, 13);;
			ДобавитьШКВтаблицу(Штрихкод,ТаблицаШК,ВыборкаШК);	
			Для Сч = 2 По 10 Цикл			
				Штрихкод = "000" + СокрЛП(ВыборкаШК.НомерЗаказаИМ) + Формат(Сч, "ЧЦ=2; ЧВН=");//Прав(СокрЛП(ВыборкаШК.НомерВнешнегоЗаказа), 7) + "02";//Штрихкод + lem.КонтрольныйСимволEAN(ШтрихКод, 13);;
				ДобавитьШКВтаблицу(Штрихкод,ТаблицаШК,ВыборкаШК);
				Штрихкод = СокрЛП(ВыборкаШК.НомерЗаказаИМ) + Формат(Сч, "ЧЦ=2; ЧВН=");//Прав(СокрЛП(ВыборкаШК.НомерВнешнегоЗаказа), 7) + "02";//Штрихкод + lem.КонтрольныйСимволEAN(ШтрихКод, 13);;				
				ДобавитьШКВтаблицу(Штрихкод,ТаблицаШК,ВыборкаШК);
			КонецЦикла;	
		КонецЕсли;	
		ДобавитьШКВтаблицу(ВыборкаШК.НомерЗаказаСтриж,ТаблицаШК,ВыборкаШК);
		ДобавитьШКВтаблицу(ВыборкаШК.НомерЗаказаИМ,ТаблицаШК,ВыборкаШК);	
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьСтрокиДоставок_Shop_197(ВыборкаШК, ТаблицаШК, Самовывоз = Ложь)  	
	
	Пока ВыборкаШК.Следующий() Цикл
		Если Самовывоз Тогда 
			Штрихкод = "37" + Формат((Число(ВыборкаШК.НомерЗаказаСтриж)), "ЧЦ=10; ЧВН=; ЧГ=");
			Штрихкод = Штрихкод + КонтрольныйСимволEAN(ШтрихКод, 13);
			ДобавитьШКВтаблицу(Штрихкод,ТаблицаШК,ВыборкаШК);
		КонецЕсли;
		ДобавитьШКВтаблицу(ВыборкаШК.Штрихкод,ТаблицаШК,ВыборкаШК,ВыборкаШК.ПереданПартнером);	
		Если Не ВыборкаШК.ПереданПартнером Тогда	 	
			Если СтрДлина(ВыборкаШК.НомерЗаказаИМ) = 5 Тогда
				Штрихкод = "0000" + ВыборкаШК.НомерЗаказаИМ;//Штрихкод + lem.КонтрольныйСимволEAN(ШтрихКод, 13);;
			ИначеЕсли СтрДлина(ВыборкаШК.НомерЗаказаИМ) = 6 Тогда	
				Штрихкод  = "000" + ВыборкаШК.НомерЗаказаИМ;//Штрихкод + lem.КонтрольныйСимволEAN(ШтрихКод, 13);;
			КонецЕсли;		
			ДобавитьШКВтаблицу(Штрихкод,ТаблицаШК,ВыборкаШК);		
		КонецЕсли;	
		ДобавитьШКВтаблицу(ВыборкаШК.НомерЗаказаСтриж,ТаблицаШК,ВыборкаШК);
		ДобавитьШКВтаблицу(ВыборкаШК.НомерЗаказаИМ,ТаблицаШК,ВыборкаШК);	
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьСтрокиДоставок(ВыборкаШК, ТаблицаШК, Самовывоз = Ложь)  	
	Пока ВыборкаШК.Следующий() Цикл
		Если Самовывоз Тогда 
			Штрихкод = "37" + Формат((Число(ВыборкаШК.НомерЗаказаСтриж)), "ЧЦ=10; ЧВН=; ЧГ=");
			Штрихкод = Штрихкод + КонтрольныйСимволEAN(ШтрихКод, 13);
			ДобавитьШКВтаблицу(Штрихкод,ТаблицаШК,ВыборкаШК);
		КонецЕсли;
		ДобавитьШКВтаблицу(ВыборкаШК.Штрихкод,ТаблицаШК,ВыборкаШК,ВыборкаШК.ПереданПартнером);				
		ДобавитьШКВтаблицу(ВыборкаШК.НомерЗаказаСтриж,ТаблицаШК,ВыборкаШК);
		ДобавитьШКВтаблицу(ВыборкаШК.НомерЗаказаИМ,ТаблицаШК,ВыборкаШК);
	КонецЦикла;
КонецПроцедуры

Процедура ДобавитьСтрокиДоставок_Shop_795(ВыборкаШК, ТаблицаШК, Самовывоз = Ложь)  	
	Пока ВыборкаШК.Следующий() Цикл
		Если Самовывоз Тогда 
			Штрихкод = "37" + Формат((Число(ВыборкаШК.НомерЗаказаСтриж)), "ЧЦ=10; ЧВН=; ЧГ=");
			Штрихкод = Штрихкод + КонтрольныйСимволEAN(ШтрихКод, 13);
			ДобавитьШКВтаблицу(Штрихкод,ТаблицаШК,ВыборкаШК);
		КонецЕсли;
		ДобавитьШКВтаблицу(ВыборкаШК.Штрихкод,ТаблицаШК,ВыборкаШК,ВыборкаШК.ПереданПартнером);				
		ДобавитьШКВтаблицу(ВыборкаШК.НомерЗаказаСтриж,ТаблицаШК,ВыборкаШК);
		//без внешних номеров
		//ДобавитьШКВтаблицу(ВыборкаШК.НомерЗаказаИМ,ТаблицаШК,ВыборкаШК);
	КонецЦикла;
КонецПроцедуры

Процедура ДобавитьСтрокиДоставок_Shop_976(ВыборкаШК, ТаблицаШК, Самовывоз = Ложь)  	
	Пока ВыборкаШК.Следующий() Цикл
		Если Самовывоз Тогда 
			Штрихкод = "37" + Формат((Число(ВыборкаШК.НомерЗаказаСтриж)), "ЧЦ=10; ЧВН=; ЧГ=");
			Штрихкод = Штрихкод + КонтрольныйСимволEAN(ШтрихКод, 13);
			ДобавитьШКВтаблицу(Штрихкод,ТаблицаШК,ВыборкаШК);
		КонецЕсли;
		ДобавитьШКВтаблицу(ВыборкаШК.Штрихкод,ТаблицаШК,ВыборкаШК,ВыборкаШК.ПереданПартнером);				
		Если ВыборкаШК.ПереданПартнером Тогда
			ДобавитьШКВтаблицу(Прав(СокрЛП(ВыборкаШК.Штрихкод), 18),ТаблицаШК,ВыборкаШК,ВыборкаШК.ПереданПартнером);				
		КонецЕсли;
		ДобавитьШКВтаблицу(ВыборкаШК.НомерЗаказаСтриж,ТаблицаШК,ВыборкаШК);
		ДобавитьШКВтаблицу(ВыборкаШК.НомерЗаказаИМ,ТаблицаШК,ВыборкаШК);
	КонецЦикла;
КонецПроцедуры


Процедура ДобавитьШКВТаблицу(ШК,ТаблицаШК,Выборка,ПереданПартнером = Ложь)
	Штрихкод = СокрЛП(ШК);
	Если Не ПустаяСтрока(Штрихкод) Тогда
		НоваяСтрока = ТаблицаШК.Добавить();
		НоваяСтрока.ДатаДоставки = Выборка.ДатаДоставки;
		НоваяСтрока.КодКонтрагента = Выборка.КодКонтрагента;
		НоваяСтрока.КоличествоМест = Выборка.КоличествоМест;
		НоваяСтрока.НомерЗаказаИМ = Выборка.НомерЗаказаИМ;
		НоваяСтрока.НомерЗаказаСтриж = Выборка.НомерЗаказаСтриж;
		НоваяСтрока.НомерПалетты = Выборка.НомерПалетты;
		НоваяСтрока.НомерСектора = Выборка.НомерСектора;
		НоваяСтрока.ПереданПартнером = ПереданПартнером;
		НоваяСтрока.СтатусЗаказа = Выборка.СтатусЗаказа;
		НоваяСтрока.ТерминалКод = Выборка.ТерминалКод;
		НоваяСтрока.ТерминалПриемаКод = Выборка.ТерминалПриемаКод;
		НоваяСтрока.ТипЗаказа = Выборка.ТипЗаказа;
		НоваяСтрока.ТранспортНомерГосударственнойРегистрации = Выборка.ТранспортНомерГосударственнойРегистрации;
		НоваяСтрока.Штрихкод = Штрихкод;	
		НоваяСтрока.ДеньВДень = Выборка.ДеньВДень; 
		НоваяСтрока.НомерСмены = Выборка.НомерСмены;
		НоваяСтрока.ЗапрашиватьОперативныеДанные = Выборка.ЗапрашиватьОперативныеДанные;
		//Асеев 17.09.2021 (Задача № 4671)>>>
		НоваяСтрока.ПолигонМаршрутизации = Выборка.ПолигонМаршрутизации;
		//Асеев 17.09.2021 (Задача № 4671)<<<
		//Асеев 18.01.2022 (Задача № 4973)>>>
		НоваяСтрока.ВладелецТовараКод = Выборка.ВладелецТовараКод;
		НоваяСтрока.СкладМагазинаКод = Выборка.СкладМагазинаКод;
		НоваяСтрока.Статус = Выборка.Статус;
		//Асеев 18.01.2022 (Задача № 4973)<<<
		//Асеев 19.01.2024 (Задача № 5205)>>>
		НоваяСтрока.ПредварительноеЗакрытие = Выборка.ПредварительноеЗакрытие;
		//Асеев 19.01.2024 (Задача № 5205)<<<
		Если ТипШтрихкодаEAN13ТО(Штрихкод) Тогда
			ДополнительныйШК = Сред(Штрихкод,1,12);
			НоваяСтрока = ТаблицаШК.Добавить();
			НоваяСтрока.ДатаДоставки = Выборка.ДатаДоставки;
			НоваяСтрока.КодКонтрагента = Выборка.КодКонтрагента;
			НоваяСтрока.КоличествоМест = Выборка.КоличествоМест;
			НоваяСтрока.НомерЗаказаИМ = Выборка.НомерЗаказаИМ;
			НоваяСтрока.НомерЗаказаСтриж = Выборка.НомерЗаказаСтриж;
			НоваяСтрока.НомерПалетты = Выборка.НомерПалетты;
			НоваяСтрока.НомерСектора = Выборка.НомерСектора;
			НоваяСтрока.ПереданПартнером = Ложь;
			НоваяСтрока.СтатусЗаказа = Выборка.СтатусЗаказа;
			НоваяСтрока.ТерминалКод = Выборка.ТерминалКод;
			НоваяСтрока.ТерминалПриемаКод = Выборка.ТерминалПриемаКод;
			НоваяСтрока.ТипЗаказа = Выборка.ТипЗаказа;
			НоваяСтрока.ТранспортНомерГосударственнойРегистрации = Выборка.ТранспортНомерГосударственнойРегистрации;
			НоваяСтрока.Штрихкод = ДополнительныйШК;	
			НоваяСтрока.ДеньВДень = Выборка.ДеньВДень; 
			НоваяСтрока.НомерСмены = Выборка.НомерСмены;
			НоваяСтрока.ЗапрашиватьОперативныеДанные = Выборка.ЗапрашиватьОперативныеДанные;
			//Асеев 17.09.2021 (Задача № 4671)>>>
			НоваяСтрока.ПолигонМаршрутизации = Выборка.ПолигонМаршрутизации;
			//Асеев 17.09.2021 (Задача № 4671)<<<
			//Асеев 18.01.2022 (Задача № 4973)>>>
			НоваяСтрока.ВладелецТовараКод = Выборка.ВладелецТовараКод;
			НоваяСтрока.СкладМагазинаКод = Выборка.СкладМагазинаКод;
			НоваяСтрока.Статус = Выборка.Статус;
			//Асеев 18.01.2022 (Задача № 4973)<<<
			//Асеев 19.01.2024 (Задача № 5205)>>>
			НоваяСтрока.ПредварительноеЗакрытие = Выборка.ПредварительноеЗакрытие;
			//Асеев 19.01.2024 (Задача № 5205)<<<
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры	

Функция КонтрольныйСимволEAN(ШтрихКод, Тип) 
	
	Четн   = 0;
	Нечетн = 0;
	
	КоличествоИтераций = ?(Тип = 13, 6, 4);
	
	Для Индекс = 1 По КоличествоИтераций Цикл
		Если (Тип = 8) и (Индекс = КоличествоИтераций) Тогда
		Иначе
			//попытка
			Четн   = Четн   + Сред(ШтрихКод, 2 * Индекс, 1);
			//исключение
			//	пр = 1;
			//	конецпопытки;
		КонецЕсли;
		Нечетн = Нечетн + Сред(ШтрихКод, 2 * Индекс - 1, 1);
	КонецЦикла;
	
	Если Тип = 13 Тогда
		Четн = Четн * 3;
	Иначе
		Нечетн = Нечетн * 3;
	КонецЕсли;
	
	КонтЦифра = 10 - (Четн + Нечетн) % 10;
	
	Возврат ?(КонтЦифра = 10, "0", Строка(КонтЦифра));
	
КонецФункции // КонтрольныйСимволEAN()

Функция ПолучитьОписаниеЗаказа(ДатаДоставки, СтрокаТовара)
	Если СтрокаТовара.tag = 2 Тогда
		Возврат "ОТКАЗ";
	КонецеСли;
	
	Если Началодня(СтрокаТовара.ДатаДоставки) > Началодня(ДатаДоставки) Тогда
		СтрокаТовара.tag = 8;
		Возврат "БУДУЩАЯ ДАТА: " + Формат(СтрокаТовара.ДатаДоставки, "ДЛФ=D");
	ИначеЕсли Началодня(СтрокаТовара.ДатаДоставки) < Началодня(ДатаДоставки) Тогда
		СтрокаТовара.tag = 9;
		Возврат "ПРОШЛАЯ ДАТА: " + Формат(СтрокаТовара.ДатаДоставки, "ДЛФ=D");
	КонецеСли;
КонецФункции	

Функция СформироватьКонтрольноеЧислоЗаббери(Штрихкод)
	Сум = 0;
	Попытка
		Для Сч = 1 По СтрДлина(Штрихкод) Цикл
			Сум = Сум + Число(Сред(Штрихкод, Сч, 1));
		КонецЦикла;	
	Исключение
		Возврат 0;
	КонецПопытки;
	Возврат Сум;
КонецФункции	

Функция ОписаниеТиповСтрока()
	Возврат Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(10));
КонецФункции	

Функция ПустойТранспорт() Экспорт
	Возврат Справочники.новаТранспорт.НайтиПоКоду("000152").Ссылка;
КонецФункции

Функция СформироватьСтрокуJSON(СтруктураJSON) Экспорт
	НастройкиСериализации = Новый НастройкиСериализацииJSON;
	НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.Microsoft;
	НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.УниверсальнаяДата;	
	
	
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураJSON, НастройкиСериализации);
	СтрокаJSON = ЗаписьJSON.Закрыть();
	Возврат СтрокаJSON;
КонецФункции

Функция ПолучитьДанныеРейса(НомерПалетты) Экспорт
	
	СтруктураДанныхРейса = Новый Структура("routeNumber,transportRegistrationNumber,ordersNumbers");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Рейс.Ссылка КАК Ссылка,
	|	Рейс.Номер КАК Номер
	|ПОМЕСТИТЬ втРейс
	|ИЗ
	|	Документ.Рейс КАК Рейс
	|ГДЕ
	|	Рейс.Проведен
	|	И Рейс.ДатаРейса = &ДатаРейса
	|	И Рейс.НомерПалетты = &НомерПалетты
	|	И Рейс.ТерминалДоставки = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.МоскваСтриж)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ПривязкаМашинКРейсамСрезПоследних.Транспорт.НомерГосударственнойРегистрации, """") КАК ГосНомерТА,
	|	втРейс.Номер КАК НомерРейса,
	|	ВЫРАЗИТЬ(РейсЗаказы.Заказ КАК Документ.РеализацияТоваровУслуг).Номер КАК НомерЗаказа
	|ИЗ
	|	втРейс КАК втРейс
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Рейс.Заказы КАК РейсЗаказы
	|		ПО втРейс.Ссылка = РейсЗаказы.Ссылка,
	|	РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних(
	|			,
	|			Рейс В
	|				(ВЫБРАТЬ
	|					втРейс.Ссылка
	|				ИЗ
	|					втРейс КАК втРейс)) КАК ПривязкаМашинКРейсамСрезПоследних
	|ГДЕ
	|	НЕ РейсЗаказы.УдаленИзРейса
	|	И РейсЗаказы.Заказ ССЫЛКА Документ.РеализацияТоваровУслуг
	|ИТОГИ
	|	МАКСИМУМ(ГосНомерТА)
	|ПО
	|	НомерРейса";
	
	Если ПараметрыСеанса.ЭтоТестоваяСреда Тогда
		Запрос.УстановитьПараметр("ДатаРейса", НачалоДня(ТекущаяДата()));    //НачалоДня(ТекущаяДата())        НачалоДня(Дата("20190904000001"))
	Иначе	
		Запрос.УстановитьПараметр("ДатаРейса", НачалоДня(ТекущаяДата()));    //НачалоДня(ТекущаяДата())        НачалоДня(Дата("20190904000001"))
	Конецесли;	
	Запрос.УстановитьПараметр("НомерПалетты", НомерПалетты);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНомерРейса = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНомерРейса.Следующий() Цикл
		
		СтруктураДанныхРейса.routeNumber = ВыборкаНомерРейса.НомерРейса;
		СтруктураДанныхРейса.transportRegistrationNumber = ВыборкаНомерРейса.ГосНомерТА;
		
		ВыборкаДетальныеЗаписи = ВыборкаНомерРейса.Выбрать();
		
		МассивНомеровЗаказов = Новый Массив;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			МассивНомеровЗаказов.Добавить(Число(СокрП(ВыборкаДетальныеЗаписи.НомерЗаказа)));
		КонецЦикла;
		
		СтруктураДанныхРейса.ordersNumbers = МассивНомеровЗаказов;
		
	КонецЦикла;
	
	Возврат СтруктураДанныхРейса	
	
КонецФункции

Функция ВыгрузитьШКНаСерверСканирования(НачалоПериода, КонецПериода, МассивТерминалов,УдалятьДублиШК = Ложь) Экспорт
	СтрокаJSON = ФормированиеТаблицыШКДляСервераСканирования(НачалоПериода, КонецПериода, МассивТерминалов,УдалятьДублиШК);
	Ответ = ВызватьФункциюHTTPСервиса(СтрокаJSON, "unloadBarcodes");
	Попытка
		СтруктураОтвета = ДанныеJSONВСтруктуру(Ответ);
	Исключение
		СтруктураОтвета = Новый Структура("result", "Error");
		СтруктураОтвета.Вставить("errorDescr", Ответ);
		СписокПолучателей = Новый Массив;
		СписокПолучателей.Добавить("m.aseev@strizh-logistic.ru");
		СписокПолучателей.Добавить("evgeniy.marochkin@strizh-logistic.ru");
		Тема = "Не удалось загрузить ШК на сервер сканирования!";
		lem.ОтправитьСообщение(СписокПолучателей,Тема,Ответ);
	КонецПопытки;	
	
	//CeHbKA 10.12.2019
	//запись лога
	ПараметрыЛога = ВнешнееЛогированиеСервер.ПараметрыЗаписиЛогаСервиса(Справочники.API.ScanServer, Справочники.МетодыAPI.unloadBarcodes);
	ПараметрыЛога.requestXML = СтрокаJSON;
	ПараметрыЛога.responseXML = Ответ;
	
	Попытка
		ПараметрыЛога.isError = (СтруктураОтвета.result <> "OK");
	Исключение
		ПараметрыЛога.isError = Истина;
	КонецПопытки;
	
	ВнешнееЛогированиеСервер.ЗаписатьСтрокуЛогаСервиса(ПараметрыЛога);		
	//CeHbKA 10.12.2019
	
	Возврат СтруктураОтвета
	
КонецФункции

Функция ПолучитьУзелОбменаССерверомСканированияПоКоду(КодУзла = "ScanSrv") Экспорт
	Возврат ПланыОбмена.ОбменССерверомСканирования.НайтиПоКоду(КодУзла); 
КонецФункции	

#Область ВыгрузкаСправочникаЭлектронныеВесы
Процедура ВыгрузкаЭлектронныхВесов() Экспорт
	УзелОбмена = ПолучитьУзелОбменаССерверомСканированияПоКоду();
	МассивДанных = ПолучитьИзменененныеЭлементыСправочникаЭлектронныеВесы(УзелОбмена);
	СтрокаJSON = СформироватьСтрокуJSON(МассивДанных); 	
	Ответ = ВызватьФункциюHTTPСервиса(СтрокаJSON, "unloadWeighers");
	МассивКодов = ДанныеJSONВСтруктуру(Ответ);
	МассивУзлов = Новый Массив;
	МассивУзлов.Добавить(УзелОбмена);
	УдалениеРегистрацииКОбменуЭлектронныхВесов(МассивУзлов,МассивКодов);
КонецПроцедуры

Функция ПолучитьИзменененныеЭлементыСправочникаЭлектронныеВесы(УзелОбмена)
	МассивДанных = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЭлектронныеВесы.Код КАК id,
	|	ЭлектронныеВесы.Наименование КАК name,
	|	ЭлектронныеВесы.АдресВесов КАК IPAdress
	|ИЗ
	|	Справочник.ЭлектронныеВесы.Изменения КАК ЭлектронныеВесыИзменения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭлектронныеВесы КАК ЭлектронныеВесы
	|		ПО ЭлектронныеВесыИзменения.Ссылка = ЭлектронныеВесы.Ссылка
	|ГДЕ
	|	ЭлектронныеВесыИзменения.Узел = &Узел";
	Запрос.УстановитьПараметр("Узел",УзелОбмена);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураДанных = Новый Структура("id,name,IPAdress");
		ЗаполнитьЗначенияСвойств(СтруктураДанных,Выборка);
		МассивДанных.Добавить(СтруктураДанных);
	КонецЦикла;
	Возврат МассивДанных
КонецФункции

Процедура УдалениеРегистрацииКОбменуЭлектронныхВесов(МассивУзлов,МассивКодов)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЭлектронныеВесы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЭлектронныеВесы КАК ЭлектронныеВесы
	|ГДЕ
	|	ЭлектронныеВесы.Код В(&МассивКодов)";
	Запрос.УстановитьПараметр("МассивКодов", МассивКодов);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПланыОбмена.УдалитьРегистрациюИзменений(МассивУзлов,Выборка.Ссылка);	
	КонецЦикла;		
КонецПроцедуры	
#КонецОбласти

//Асеев 15.12.2022 (Задача № 4953)>>>
Процедура ВыгрузкаМагазинов() Экспорт
	УзелОбмена = ПолучитьУзелОбменаССерверомСканированияПоКоду();
	МассивДанных = ПолучитьИзменененныеЭлементыСправочникаКонтрагенты(УзелОбмена);
	Если МассивДанных.Количество() Тогда
		СтрокаJSON = СформироватьСтрокуJSON(МассивДанных); 	
		Ответ = ВызватьФункциюHTTPСервиса(СтрокаJSON, "unloadShops");
		МассивКодов = ДанныеJSONВСтруктуру(Ответ);
		МассивУзлов = Новый Массив;
		МассивУзлов.Добавить(УзелОбмена);
		УдалениеРегистрацииКОбменуКонтрагентов(МассивУзлов, МассивКодов);
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьИзменененныеЭлементыСправочникаКонтрагенты(УзелОбмена)
	
	МассивДанных = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("УзелОбмена", УзелОбмена);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Контрагенты.Код КАК id,
	|	Контрагенты.Наименование КАК name
	|ИЗ
	|	Справочник.Контрагенты.Изменения КАК КонтрагентыИзменения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (КонтрагентыИзменения.Узел = &УзелОбмена)
	|			И КонтрагентыИзменения.Ссылка = Контрагенты.Ссылка";
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		ШаблонДанных = Новый ФиксированнаяСтруктура("id,name");
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтруктураДанных = Новый Структура(ШаблонДанных);
			ЗаполнитьЗначенияСвойств(СтруктураДанных, Выборка);
			МассивДанных.Добавить(СтруктураДанных);
		КонецЦикла;
	КонецЕсли;
	Возврат МассивДанных;
	
КонецФункции

Процедура УдалениеРегистрацииКОбменуКонтрагентов(МассивУзлов, МассивКодов)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивКодов", МассивКодов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Код В(&МассивКодов)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПланыОбмена.УдалитьРегистрациюИзменений(МассивУзлов, Выборка.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыгрузкаСкладовМагазинов() Экспорт
	УзелОбмена = ПолучитьУзелОбменаССерверомСканированияПоКоду();
	МассивДанных = ПолучитьИзменененныеЭлементыСправочникаСкладыМагазинов(УзелОбмена);
	Если МассивДанных.Количество() Тогда
		СтрокаJSON = СформироватьСтрокуJSON(МассивДанных); 	
		Ответ = ВызватьФункциюHTTPСервиса(СтрокаJSON, "unloadWarehouse");
		МассивКодов = ДанныеJSONВСтруктуру(Ответ);
		МассивУзлов = Новый Массив;
		МассивУзлов.Добавить(УзелОбмена);
		УдалениеРегистрацииКОбменуСкладовМагазинов(МассивУзлов, МассивКодов);
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьИзменененныеЭлементыСправочникаСкладыМагазинов(УзелОбмена)
	
	МассивДанных = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("УзелОбмена", УзелОбмена);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СкладыМагазинов.Код КАК id,
	|	СкладыМагазинов.Наименование КАК name,
	|	СкладыМагазинов.Владелец.Код КАК idShop,
	|	СкладыМагазинов.ИдентификаторНаправления КАК idDirection,
	|	СкладыМагазинов.Адрес КАК address,
	|	СкладыМагазинов.КонтактнаяИнформация КАК contactInf,
	|	СкладыМагазинов.ОграниченияПоВозвратам КАК restrictionsOfReturn,
	|	СкладыМагазинов.ГрафикРаботы КАК sheduleOfWork,
	|	СкладыМагазинов.ТелефонныйНомерПриЗабореТовара КАК phoneNumber,
	|	ЕСТЬNULL(СкладыМагазинов.Регион.Код, 0) КАК idRegion
	|ИЗ
	|	Справочник.СкладыМагазинов.Изменения КАК СкладыМагазиновИзменения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СкладыМагазинов КАК СкладыМагазинов
	|		ПО (СкладыМагазиновИзменения.Узел = &УзелОбмена)
	|			И СкладыМагазиновИзменения.Ссылка = СкладыМагазинов.Ссылка";
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		ШаблонДанных = Новый ФиксированнаяСтруктура("id,name,idShop,idDirection,address,contactInf,restrictionsOfReturn,sheduleOfWork,phoneNumber,idRegion");
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтруктураДанных = Новый Структура(ШаблонДанных);
			ЗаполнитьЗначенияСвойств(СтруктураДанных, Выборка);
			МассивДанных.Добавить(СтруктураДанных);
		КонецЦикла;
	КонецЕсли;
	Возврат МассивДанных;
	
КонецФункции

Процедура УдалениеРегистрацииКОбменуСкладовМагазинов(МассивУзлов, МассивКодов)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивКодов", МассивКодов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СкладыМагазинов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СкладыМагазинов КАК СкладыМагазинов
	|ГДЕ
	|	СкладыМагазинов.Код В(&МассивКодов)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПланыОбмена.УдалитьРегистрациюИзменений(МассивУзлов, Выборка.Ссылка);
	КонецЦикла;
	
КонецПроцедуры
//Асеев 15.12.2022 (Задача № 4953)<<<

#Область ВыгрузкаСправочникаГруппыРайонов
Процедура ВыгрузкаГруппРайонов() Экспорт
	УзелОбмена = ПолучитьУзелОбменаССерверомСканированияПоКоду();
	МассивДанных = ПолучитьИзмененныеЭлементыСправочникаГруппыРайонов(УзелОбмена);
	СтрокаJSON = СформироватьСтрокуJSON(МассивДанных); 	
	Ответ = ВызватьФункциюHTTPСервиса(СтрокаJSON, "unloadSectors");
	МассивКодов = ДанныеJSONВСтруктуру(Ответ);
	МассивУзлов = Новый Массив;
	МассивУзлов.Добавить(УзелОбмена);
	УдалениеРегистрацииКОбменуГруппРайонов(МассивУзлов,МассивКодов);
КонецПроцедуры	

Функция ПолучитьИзмененныеЭлементыСправочникаГруппыРайонов(УзелОбмена)
	МассивДанных = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ГруппыРайонов.Наименование КАК name,
	|	ГруппыРайонов.Код КАК id
	|ИЗ
	|	Справочник.ГруппыРайонов.Изменения КАК ГруппыРайоновИзменения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыРайонов КАК ГруппыРайонов
	|		ПО ГруппыРайоновИзменения.Ссылка = ГруппыРайонов.Ссылка
	|ГДЕ
	|	ГруппыРайоновИзменения.Узел = &Узел";
	Запрос.УстановитьПараметр("Узел",УзелОбмена);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураДанных = Новый Структура("id,name");
		ЗаполнитьЗначенияСвойств(СтруктураДанных,Выборка);
		МассивДанных.Добавить(СтруктураДанных);
	КонецЦикла;
	Возврат МассивДанных
КонецФункции	

Процедура УдалениеРегистрацииКОбменуГруппРайонов(МассивУзлов, МассивКодов)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ГруппыРайонов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ГруппыРайонов КАК ГруппыРайонов
	|ГДЕ
	|	ГруппыРайонов.Код В(&МассивКодов)";
	Запрос.УстановитьПараметр("МассивКодов", МассивКодов);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПланыОбмена.УдалитьРегистрациюИзменений(МассивУзлов,Выборка.Ссылка);	
	КонецЦикла;	
КонецПроцедуры	
#КонецОбласти

#Область РаботаСHTTPСервисом
Функция ВызватьФункциюHTTPСервиса(СтрокаJSON, МетодHTTPСервиса) Экспорт
	ЗаголовокЗапроса = Новый Соответствие;
	ЗаголовокЗапроса.Вставить("Content-Type", "application/json");
	ЗаголовокЗапроса.Вставить("Authorization", "55555");
	
	
	Если ПараметрыСеанса.ЭтоТестоваяСреда Тогда
		HTTPСоединение = Новый HTTPСоединение("192.168.5.104");
		СтрокаСоединения = СтрокаСоединенияИнформационнойБазы();
		Если СтрНайти(СтрокаСоединения,"logist_copy_on_kosov") Тогда
			СтрокаРесурса = "ScanServer_copy_stepanov/hs/ExchangeUT/V1/" + МетодHTTPСервиса; 	
		Иначе
			СтрокаРесурса = "scan_server_copy_lem/hs/ExchangeUT/V1/" + МетодHTTPСервиса; //getbc;
		КонецЕсли;
	Иначе
		HTTPСоединение = Новый HTTPСоединение("192.168.5.150");
		СтрокаРесурса = "ScanServer/hs/ExchangeUT/V1/" + МетодHTTPСервиса; //getbc;
	КонецеСли;	
	
	
	HTTPЗапрос = Новый HTTPЗапрос(СтрокаРесурса, ЗаголовокЗапроса);
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON);
	
	
	Результат = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);	
	ТекстОтвета = Результат.ПолучитьТелоКакСтроку("UTF-8");	
	Возврат ТекстОтвета;
КонецФункции	


Функция СформироватьФайлJSON(СтруктураJSON) Экспорт
	ЗаписьJSON = Новый ЗаписьJSON;
	
	НастройкиСериализации = Новый НастройкиСериализацииJSON;
	НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.Microsoft;
	НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.УниверсальнаяДата;	
	
	ФайлJSON = ПолучитьИмяВременногоФайла("json");
	ЗаписьJSON.ОткрытьФайл(ФайлJSON);
	
	ЗаписатьJSON(ЗаписьJSON, СтруктураJSON, НастройкиСериализации);
	ЗаписьJSON.Закрыть();	
	
	Возврат ФайлJSON;
КонецФункции	

Функция ДанныеJSONВСтруктуру(ДанныеJSON, ИменаСвойствСоЗначениямиДата = "") Экспорт
	Чт = Новый ЧтениеJSON;
	Чт.УстановитьСтроку(ДанныеJSON);
	СтруктураДанных = ПрочитатьJSON(Чт, Ложь, ИменаСвойствСоЗначениямиДата, ФорматДатыJSON.Microsoft);
	Возврат СтруктураДанных;
КонецФункции
#КонецОбласти

Функция ЗагрузкаДокументовИзСервераСканирования() Экспорт
	СтруктураJSON = Новый Структура;
	СтрокаJSON = СформироватьСтрокуJSON(СтруктураJSON);
	Ответ = ВызватьФункциюHTTPСервиса(СтрокаJSON, "uploadScanDocuments");
	МассивПолейСТипомДата = Новый Массив;
	МассивПолейСТипомДата.Добавить("dateDoc");
	МассивПолейСТипомДата.Добавить("deliveryDate");
	МассивПолейСТипомДата.Добавить("scanTime");
	МассивПолейСТипомДата.Добавить("ignoredBarcodedeliveryDate");
	МассивПолейСТипомДата.Добавить("ignoredBarcodescanTime");
	МассивДокументов = ДанныеJSONВСтруктуру(Ответ,МассивПолейСТипомДата);
	СерверСканирования = Справочники.СерверыWiFiТСД.СерверСканирования;
	
	РезультатЗагрузки = Новый Массив;
	Ошибки = Новый Массив;
	СписокПолучателей = Новый Массив;
	СписокПолучателей.Добавить("m.aseev@strizh-logistic.ru");
	СписокПолучателей.Добавить("evgeniy.marochkin@strizh-logistic.ru");
	//Асеев 22.09.2020 (Задача № 4267)>>>
	//СписокПолучателей.Добавить("dmitry.sherbinkin@strizh-logistic.ru");
	//Асеев 22.09.2020 (Задача № 4267)<<<
	СписокПолучателей.Добавить("s.skakunov@strizh-logistic.ru");
	
	
	ТаблицаРеквизитовЗагрузокСТСД = Новый ТаблицаЗначений;
	ТаблицаРеквизитовЗагрузокСТСД.Колонки.Добавить("Ид_Документа",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50)));
	ТаблицаРеквизитовЗагрузокСТСД.Колонки.Добавить("КодРегиона",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(9, 0, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаРеквизитовЗагрузокСТСД.Колонки.Добавить("РежимСканирования",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(1, 0, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаРеквизитовЗагрузокСТСД.Колонки.Добавить("КодЭлектронныхВесов",Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(9, ДопустимаяДлина.Переменная)));	
	ТаблицаРеквизитовЗагрузокСТСД.Колонки.Добавить("СчитыватьВес",Новый ОписаниеТипов("Булево"));
	ТаблицаРеквизитовЗагрузокСТСД.Колонки.Добавить("ДатаДокумента",Новый ОписаниеТипов("Дата", , ,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТаблицаРеквизитовЗагрузокСТСД.Колонки.Добавить("НомерТСД",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаРеквизитовЗагрузокСТСД.Колонки.Добавить("НомерПалеты",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаРеквизитовЗагрузокСТСД.Колонки.Добавить("НомерРейса",Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(9, ДопустимаяДлина.Переменная)));
	ТаблицаСтрокТЧШтрихкодыПоискПоНомеруЗаказа = Новый ТаблицаЗначений;
	ТаблицаСтрокТЧШтрихкодыПоискПоНомеруЗаказа.Колонки.Добавить("Ид_Документа",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50)));
	ТаблицаСтрокТЧШтрихкодыПоискПоНомеруЗаказа.Колонки.Добавить("Штрихкод",Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(50, ДопустимаяДлина.Переменная)));
	ТаблицаСтрокТЧШтрихкодыПоискПоНомеруЗаказа.Колонки.Добавить("НомерЗаказа",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50)));
	ТаблицаСтрокТЧШтрихкодыПоискПоНомеруЗаказа.Колонки.Добавить("ДатаВремя",Новый ОписаниеТипов("Дата", , ,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТаблицаСтрокТЧШтрихкодыПоискПоНомеруЗаказа.Колонки.Добавить("Вес",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой)));
	ТаблицаСтрокТЧШтрихкодыПоискПоНомеруЗаказа.Колонки.Добавить("НомерПалеты",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Любой)));
	ТаблицаСтрокТЧШтрихкодыПоискПоНомеруЗаказа.Колонки.Добавить("ИсключитьЧастичноПринятыйЗаказИзРейса",Новый ОписаниеТипов("Булево"));
	ТаблицаСтрокТЧШтрихкодыПоискПоШтрихкоду = Новый ТаблицаЗначений;
	ТаблицаСтрокТЧШтрихкодыПоискПоШтрихкоду.Колонки.Добавить("Ид_Документа",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50)));
	ТаблицаСтрокТЧШтрихкодыПоискПоШтрихкоду.Колонки.Добавить("Штрихкод",Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(50, ДопустимаяДлина.Переменная)));
	ТаблицаСтрокТЧШтрихкодыПоискПоШтрихкоду.Колонки.Добавить("НомерЗаказа",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50)));
	ТаблицаСтрокТЧШтрихкодыПоискПоШтрихкоду.Колонки.Добавить("ДатаВремя",Новый ОписаниеТипов("Дата", , ,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТаблицаСтрокТЧШтрихкодыПоискПоШтрихкоду.Колонки.Добавить("Вес",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой)));
	ТаблицаСтрокТЧШтрихкодыПоискПоШтрихкоду.Колонки.Добавить("НомерПалеты",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Любой)));
	ТаблицаСтрокТЧШтрихкодыПоискПоШтрихкоду.Колонки.Добавить("ИсключитьЧастичноПринятыйЗаказИзРейса",Новый ОписаниеТипов("Булево"));
	ТаблицаСтрокТЧЗаказыРейса = Новый ТаблицаЗначений;
	ТаблицаСтрокТЧЗаказыРейса.Колонки.Добавить("Ид_Документа",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50)));
	ТаблицаСтрокТЧЗаказыРейса.Колонки.Добавить("НомерЗаказа",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50)));
	ТаблицаИгнорируемыхШтрихКодовПоискПоНомеруЗаказа = Новый ТаблицаЗначений;
	ТаблицаИгнорируемыхШтрихКодовПоискПоНомеруЗаказа.Колонки.Добавить("Ид_Документа",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50)));
	ТаблицаИгнорируемыхШтрихКодовПоискПоНомеруЗаказа.Колонки.Добавить("Штрихкод", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(50, ДопустимаяДлина.Переменная)));
	ТаблицаИгнорируемыхШтрихКодовПоискПоНомеруЗаказа.Колонки.Добавить("НомерЗаказа",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50)));
	ТаблицаИгнорируемыхШтрихКодовПоискПоНомеруЗаказа.Колонки.Добавить("НомерПалеты",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Любой)));
	ТаблицаИгнорируемыхШтрихКодовПоискПоНомеруЗаказа.Колонки.Добавить("ВремяСканирования",Новый ОписаниеТипов("Дата", , ,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТаблицаИгнорируемыхШтрихКодовПоискПоНомеруЗаказа.Колонки.Добавить("Вес",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой)));
	ТаблицаИгнорируемыхШтрихКодовПоискПоШтрихкоду = Новый ТаблицаЗначений;
	ТаблицаИгнорируемыхШтрихКодовПоискПоШтрихкоду.Колонки.Добавить("Ид_Документа",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50)));
	ТаблицаИгнорируемыхШтрихКодовПоискПоШтрихкоду.Колонки.Добавить("Штрихкод", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(50, ДопустимаяДлина.Переменная)));
	ТаблицаИгнорируемыхШтрихКодовПоискПоШтрихкоду.Колонки.Добавить("НомерЗаказа",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50)));
	ТаблицаИгнорируемыхШтрихКодовПоискПоШтрихкоду.Колонки.Добавить("НомерПалеты",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Любой)));
	ТаблицаИгнорируемыхШтрихКодовПоискПоШтрихкоду.Колонки.Добавить("ВремяСканирования",Новый ОписаниеТипов("Дата", , ,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТаблицаИгнорируемыхШтрихКодовПоискПоШтрихкоду.Колонки.Добавить("Вес",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой)));
	Для Каждого СтруктураДанныхДокумента Из МассивДокументов Цикл
		Ид_Документа = СтруктураДанныхДокумента.numberDoc; 
		НоваяСтрокаРеквизитовЗагрузкиСТСД = ТаблицаРеквизитовЗагрузокСТСД.Добавить();
		НоваяСтрокаРеквизитовЗагрузкиСТСД.Ид_Документа = Ид_Документа;
		НоваяСтрокаРеквизитовЗагрузкиСТСД.КодРегиона = СтруктураДанныхДокумента.regionID;
		НоваяСтрокаРеквизитовЗагрузкиСТСД.РежимСканирования = СтруктураДанныхДокумента.scanMode;
		НоваяСтрокаРеквизитовЗагрузкиСТСД.КодЭлектронныхВесов = СтруктураДанныхДокумента.weigherId;
		НоваяСтрокаРеквизитовЗагрузкиСТСД.СчитыватьВес = СтруктураДанныхДокумента.requestForWeight;
		НоваяСтрокаРеквизитовЗагрузкиСТСД.ДатаДокумента = СтруктураДанныхДокумента.dateDoc;
		НоваяСтрокаРеквизитовЗагрузкиСТСД.НомерТСД = СтруктураДанныхДокумента.TSDNumber;
		НоваяСтрокаРеквизитовЗагрузкиСТСД.НомерПалеты = СтруктураДанныхДокумента.paleteNumber;
		НоваяСтрокаРеквизитовЗагрузкиСТСД.НомерРейса = СтруктураДанныхДокумента.tripId;
		МассивНомеровЗаказов = Новый Массив;
		Для Каждого СтруктураСтрокиТЧШтрихкоды Из СтруктураДанныхДокумента.barcodes Цикл
			Штрихкод = СтруктураСтрокиТЧШтрихкоды.barcode;
			Если ПустаяСтрока(Штрихкод) Тогда
				Продолжить;
			КонецЕсли;	
			НомерЗаказа = Формат(СтруктураСтрокиТЧШтрихкоды.orderId,"ЧГ=0");
			Если ПустаяСтрока(НомерЗаказа) Тогда
				НоваяСтрока = ТаблицаСтрокТЧШтрихкодыПоискПоШтрихкоду.Добавить();
			Иначе
				НоваяСтрока = ТаблицаСтрокТЧШтрихкодыПоискПоНомеруЗаказа.Добавить();
			КонецЕсли;		
			НоваяСтрока.Ид_Документа = Ид_Документа;
			НоваяСтрока.Штрихкод = Штрихкод;
			НоваяСтрока.НомерЗаказа = НомерЗаказа;
			НоваяСтрока.ДатаВремя = СтруктураСтрокиТЧШтрихкоды.scanTime;
			НоваяСтрока.Вес = СтруктураСтрокиТЧШтрихкоды.Weight;
			НоваяСтрока.НомерПалеты = СтруктураСтрокиТЧШтрихкоды.paleteNumber;
			НоваяСтрока.ИсключитьЧастичноПринятыйЗаказИзРейса = СтруктураСтрокиТЧШтрихкоды.partiallyAcceptedOrderExcludedFromTrip;
		КонецЦикла;
		Для Каждого СтруктураСтрокиТЧЗаказыРейса Из СтруктураДанныхДокумента.loadingOrders Цикл
			НомерЗаказа = Формат(СтруктураСтрокиТЧЗаказыРейса.orderId,"ЧГ=0");
			Если Не ПустаяСтрока(НомерЗаказа) Тогда
				НоваяСтрока = ТаблицаСтрокТЧЗаказыРейса.Добавить();
				НоваяСтрока.Ид_Документа = Ид_Документа;
				НоваяСтрока.НомерЗаказа = НомерЗаказа;
			КонецЕсли;
		КонецЦикла;	
		Для Каждого СтруктураСтрокиТЧИгнорируемыхШК Из СтруктураДанныхДокумента.ignoredBarcodes Цикл
			Штрихкод = СтруктураСтрокиТЧИгнорируемыхШК.ignoredBarcodeBarcode;
			Если ПустаяСтрока(Штрихкод) Тогда
				Продолжить;
			КонецЕсли;	
			НомерЗаказа = Формат(СтруктураСтрокиТЧИгнорируемыхШК.ignoredBarcodeorderId,"ЧГ=0");
			Если ПустаяСтрока(НомерЗаказа) Тогда
				НоваяСтрока = ТаблицаИгнорируемыхШтрихКодовПоискПоШтрихкоду.Добавить();
			Иначе                                      
				НоваяСтрока = ТаблицаИгнорируемыхШтрихКодовПоискПоНомеруЗаказа.Добавить();
			КонецЕсли;		
			НоваяСтрока.Ид_Документа = Ид_Документа;
			НоваяСтрока.Штрихкод = Штрихкод;
			НоваяСтрока.НомерЗаказа = НомерЗаказа;
			НоваяСтрока.ВремяСканирования = СтруктураСтрокиТЧИгнорируемыхШК.ignoredBarcodescanTime;
			НоваяСтрока.Вес = СтруктураСтрокиТЧИгнорируемыхШК.ignoredBarcodeweight;
			НоваяСтрока.НомерПалеты = СтруктураСтрокиТЧИгнорируемыхШК.ignoredBarcodePaleteNumber;	
		КонецЦикла;	
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаНомеровЗагрузокСТСД.Ид_Документа КАК Ид_Документа,
	               |	ТаблицаНомеровЗагрузокСТСД.КодРегиона КАК КодРегиона,
	               |	ТаблицаНомеровЗагрузокСТСД.РежимСканирования КАК РежимСканирования,
	               |	ТаблицаНомеровЗагрузокСТСД.КодЭлектронныхВесов КАК КодЭлектронныхВесов,
	               |	ТаблицаНомеровЗагрузокСТСД.СчитыватьВес КАК СчитыватьВес,
	               |	ТаблицаНомеровЗагрузокСТСД.ДатаДокумента КАК ДатаДокумента,
	               |	ТаблицаНомеровЗагрузокСТСД.НомерТСД КАК НомерТСД,
	               |	ТаблицаНомеровЗагрузокСТСД.НомерПалеты КАК НомерПалеты,
	               |	ТаблицаНомеровЗагрузокСТСД.НомерРейса КАК НомерРейса
	               |ПОМЕСТИТЬ втРеквизитыЗагрузокСТСД
	               |ИЗ
	               |	&ТаблицаРеквизитовЗагрузокСТСД КАК ТаблицаНомеровЗагрузокСТСД
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаШтрихкодовПоискПоНомеру.Штрихкод КАК Штрихкод,
	               |	ТаблицаШтрихкодовПоискПоНомеру.НомерЗаказа КАК НомерЗаказа,
	               |	ТаблицаШтрихкодовПоискПоНомеру.ДатаВремя КАК ДатаВремя,
	               |	ТаблицаШтрихкодовПоискПоНомеру.Вес КАК Вес,
	               |	ТаблицаШтрихкодовПоискПоНомеру.Ид_Документа КАК Ид_Документа,
	               |	ТаблицаШтрихкодовПоискПоНомеру.НомерПалеты КАК НомерПалеты,
	               |	ТаблицаШтрихкодовПоискПоНомеру.ИсключитьЧастичноПринятыйЗаказИзРейса КАК ИсключитьЧастичноПринятыйЗаказИзРейса
	               |ПОМЕСТИТЬ втШтрихкодыПоискПоНомеру
	               |ИЗ
	               |	&ТаблицаШтрихкодовПоискПоНомеру КАК ТаблицаШтрихкодовПоискПоНомеру
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаШтрихкодовПоискПоШтрихкоду.НомерЗаказа КАК НомерЗаказа,
	               |	ТаблицаШтрихкодовПоискПоШтрихкоду.Штрихкод КАК Штрихкод,
	               |	ТаблицаШтрихкодовПоискПоШтрихкоду.ДатаВремя КАК ДатаВремя,
	               |	ТаблицаШтрихкодовПоискПоШтрихкоду.Вес КАК Вес,
	               |	ТаблицаШтрихкодовПоискПоШтрихкоду.Ид_Документа КАК Ид_Документа,
	               |	ТаблицаШтрихкодовПоискПоШтрихкоду.НомерПалеты КАК НомерПалеты,
	               |	ТаблицаШтрихкодовПоискПоШтрихкоду.ИсключитьЧастичноПринятыйЗаказИзРейса КАК ИсключитьЧастичноПринятыйЗаказИзРейса
	               |ПОМЕСТИТЬ втШтрихкодыПоискПоШтрихкоду
	               |ИЗ
	               |	&ТаблицаШтрихкодовПоискПоШтрихкоду КАК ТаблицаШтрихкодовПоискПоШтрихкоду
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЗИгнорируемыхШКПоискПоНомеру.Ид_Документа КАК Ид_Документа,
	               |	ТЗИгнорируемыхШКПоискПоНомеру.Штрихкод КАК Штрихкод,
	               |	ТЗИгнорируемыхШКПоискПоНомеру.НомерЗаказа КАК НомерЗаказа,
	               |	ТЗИгнорируемыхШКПоискПоНомеру.Вес КАК Вес,
	               |	ТЗИгнорируемыхШКПоискПоНомеру.НомерПалеты КАК НомерПалеты,
	               |	ТЗИгнорируемыхШКПоискПоНомеру.ВремяСканирования КАК ВремяСканирования
	               |ПОМЕСТИТЬ втИгнорируемыеШКПоискПоНомеру
	               |ИЗ
	               |	&ТаблицаИгнорируемыеШКПоискПоНомеру КАК ТЗИгнорируемыхШКПоискПоНомеру
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЗИгнорируемыхШКПоискПоШтрихкоду.Ид_Документа КАК Ид_Документа,
	               |	ТЗИгнорируемыхШКПоискПоШтрихкоду.Штрихкод КАК Штрихкод,
	               |	ТЗИгнорируемыхШКПоискПоШтрихкоду.НомерЗаказа КАК НомерЗаказа,
	               |	ТЗИгнорируемыхШКПоискПоШтрихкоду.Вес КАК Вес,
	               |	ТЗИгнорируемыхШКПоискПоШтрихкоду.НомерПалеты КАК НомерПалеты,
	               |	ТЗИгнорируемыхШКПоискПоШтрихкоду.ВремяСканирования КАК ВремяСканирования
	               |ПОМЕСТИТЬ втИгнорируемыеШКПоискПоШтрихкоду
	               |ИЗ
	               |	&ТаблицаИгнорируемыеШКПоискПоШтрихкоду КАК ТЗИгнорируемыхШКПоискПоШтрихкоду
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втИгнорируемыеШКПоискПоНомеру.Ид_Документа КАК Ид_Документа,
	               |	втИгнорируемыеШКПоискПоНомеру.Штрихкод КАК Штрихкод,
	               |	втИгнорируемыеШКПоискПоНомеру.Вес КАК Вес,
	               |	втИгнорируемыеШКПоискПоНомеру.НомерПалеты КАК НомерПалеты,
	               |	РеализацияТоваровУслуг.Ссылка КАК ЗаказПоНомеруСтриж,
	               |	РеализацияТоваровУслуг1.Ссылка КАК ЗаказПоНомеруИМ,
	               |	втИгнорируемыеШКПоискПоНомеру.ВремяСканирования КАК ВремяСканирования
	               |ПОМЕСТИТЬ втИгнорируемыеНайденныеПоНомеру
	               |ИЗ
	               |	втИгнорируемыеШКПоискПоНомеру КАК втИгнорируемыеШКПоискПоНомеру
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |		ПО втИгнорируемыеШКПоискПоНомеру.НомерЗаказа = РеализацияТоваровУслуг.Номер
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг1
	               |		ПО втИгнорируемыеШКПоискПоНомеру.НомерЗаказа = РеализацияТоваровУслуг1.НомерВнешнегоЗаказа
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	втИгнорируемыеНайденныеПоНомеру.Ид_Документа КАК Ид_Документа,
	               |	втИгнорируемыеНайденныеПоНомеру.Штрихкод КАК Штрихкод,
	               |	втИгнорируемыеНайденныеПоНомеру.Вес КАК Вес,
	               |	втИгнорируемыеНайденныеПоНомеру.НомерПалеты КАК НомерПалеты,
	               |	ВЫБОР
	               |		КОГДА втИгнорируемыеНайденныеПоНомеру.ЗаказПоНомеруСтриж ЕСТЬ NULL
	               |			ТОГДА втИгнорируемыеНайденныеПоНомеру.ЗаказПоНомеруИМ
	               |		ИНАЧЕ втИгнорируемыеНайденныеПоНомеру.ЗаказПоНомеруСтриж
	               |	КОНЕЦ КАК Заказ,
	               |	втИгнорируемыеНайденныеПоНомеру.ВремяСканирования КАК ВремяСканирования
	               |ПОМЕСТИТЬ втИгнорируемыеНайденныеПоНомеруПослеОбработки
	               |ИЗ
	               |	втИгнорируемыеНайденныеПоНомеру КАК втИгнорируемыеНайденныеПоНомеру
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втИгнорируемыеШКПоискПоШтрихкоду.Ид_Документа КАК Ид_Документа,
	               |	втИгнорируемыеШКПоискПоШтрихкоду.Штрихкод КАК Штрихкод,
	               |	втИгнорируемыеШКПоискПоШтрихкоду.Вес КАК Вес,
	               |	втИгнорируемыеШКПоискПоШтрихкоду.НомерПалеты КАК НомерПалеты,
	               |	МАКСИМУМ(ШтрихкодыЗаказов.Заказ) КАК Заказ,
	               |	втИгнорируемыеШКПоискПоШтрихкоду.ВремяСканирования КАК ВремяСканирования
	               |ПОМЕСТИТЬ втИгнорируемыеНайденныеПоШтрихкоду
	               |ИЗ
	               |	втИгнорируемыеШКПоискПоШтрихкоду КАК втИгнорируемыеШКПоискПоШтрихкоду
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыЗаказов КАК ШтрихкодыЗаказов
	               |		ПО втИгнорируемыеШКПоискПоШтрихкоду.Штрихкод = ШтрихкодыЗаказов.Штрихкод
				   //Асеев 22.06.2021 (по письму 4780308)>>>
				   |		И ШтрихкодыЗаказов.Заказ.Дата >= &НачалоПоискаПоШК
				   //Асеев 22.06.2021 (по письму 4780308)<<<
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	втИгнорируемыеШКПоискПоШтрихкоду.Ид_Документа,
	               |	втИгнорируемыеШКПоискПоШтрихкоду.Штрихкод,
	               |	втИгнорируемыеШКПоискПоШтрихкоду.Вес,
	               |	втИгнорируемыеШКПоискПоШтрихкоду.НомерПалеты,
	               |	втИгнорируемыеШКПоискПоШтрихкоду.ВремяСканирования
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЧЗаказыРейса.Ид_Документа КАК Ид_Документа,
	               |	ТЧЗаказыРейса.НомерЗаказа КАК НомерЗаказа
	               |ПОМЕСТИТЬ втЗаказыРейса
	               |ИЗ
	               |	&ТЧЗаказыРейса КАК ТЧЗаказыРейса
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	втШтрихкодыПоискПоНомеру.Штрихкод КАК Штрихкод,
	               |	втШтрихкодыПоискПоНомеру.ДатаВремя КАК ДатаВремя,
	               |	втШтрихкодыПоискПоНомеру.Вес КАК Вес,
	               |	РеализацияТоваровУслуг.Ссылка КАК ЗаказПоНомеруСтриж,
	               |	втШтрихкодыПоискПоНомеру.Ид_Документа КАК Ид_Документа,
	               |	РеализацияТоваровУслуг1.Ссылка КАК ЗаказПоНомеруИМ,
	               |	втШтрихкодыПоискПоНомеру.НомерПалеты КАК НомерПалеты,
	               |	втШтрихкодыПоискПоНомеру.ИсключитьЧастичноПринятыйЗаказИзРейса КАК ИсключитьЧастичноПринятыйЗаказИзРейса
	               |ПОМЕСТИТЬ втНайденныеПоНомеру
	               |ИЗ
	               |	втШтрихкодыПоискПоНомеру КАК втШтрихкодыПоискПоНомеру
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |		ПО втШтрихкодыПоискПоНомеру.НомерЗаказа = РеализацияТоваровУслуг.Номер
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг1
	               |		ПО втШтрихкодыПоискПоНомеру.НомерЗаказа = РеализацияТоваровУслуг1.НомерВнешнегоЗаказа
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втНайденныеПоНомеру.Штрихкод КАК Штрихкод,
	               |	втНайденныеПоНомеру.ДатаВремя КАК ДатаВремя,
	               |	втНайденныеПоНомеру.Вес КАК Вес,
	               |	втНайденныеПоНомеру.Ид_Документа КАК Ид_Документа,
	               |	ВЫБОР
	               |		КОГДА втНайденныеПоНомеру.ЗаказПоНомеруСтриж ЕСТЬ NULL
	               |			ТОГДА втНайденныеПоНомеру.ЗаказПоНомеруИМ
	               |		ИНАЧЕ втНайденныеПоНомеру.ЗаказПоНомеруСтриж
	               |	КОНЕЦ КАК ЗаказПоНомеруСтриж,
	               |	втНайденныеПоНомеру.НомерПалеты КАК НомерПалеты,
	               |	втНайденныеПоНомеру.ИсключитьЧастичноПринятыйЗаказИзРейса КАК ИсключитьЧастичноПринятыйЗаказИзРейса
	               |ПОМЕСТИТЬ втНайденныеПоНомеруПослеОбработки
	               |ИЗ
	               |	втНайденныеПоНомеру КАК втНайденныеПоНомеру
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втШтрихкодыПоискПоШтрихкоду.Штрихкод КАК Штрихкод,
	               |	втШтрихкодыПоискПоШтрихкоду.ДатаВремя КАК ДатаВремя,
	               |	втШтрихкодыПоискПоШтрихкоду.Вес КАК Вес,
	               |	МАКСИМУМ(ШтрихкодыЗаказов.Заказ) КАК Заказ,
	               |	втШтрихкодыПоискПоШтрихкоду.Ид_Документа КАК Ид_Документа,
	               |	втШтрихкодыПоискПоШтрихкоду.НомерПалеты КАК НомерПалеты,
	               |	втШтрихкодыПоискПоШтрихкоду.ИсключитьЧастичноПринятыйЗаказИзРейса КАК ИсключитьЧастичноПринятыйЗаказИзРейса
	               |ПОМЕСТИТЬ втНайденныеПоШтрихкоду
	               |ИЗ
	               |	втШтрихкодыПоискПоШтрихкоду КАК втШтрихкодыПоискПоШтрихкоду
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыЗаказов КАК ШтрихкодыЗаказов
	               |		ПО втШтрихкодыПоискПоШтрихкоду.Штрихкод = ШтрихкодыЗаказов.Штрихкод
				   //Асеев 22.06.2021 (по письму 4780308)>>>
				   |		И ШтрихкодыЗаказов.Заказ.Дата >= &НачалоПоискаПоШК
				   //Асеев 22.06.2021 (по письму 4780308)<<<
				   |
	               |СГРУППИРОВАТЬ ПО
	               |	втШтрихкодыПоискПоШтрихкоду.Штрихкод,
	               |	втШтрихкодыПоискПоШтрихкоду.ДатаВремя,
	               |	втШтрихкодыПоискПоШтрихкоду.Вес,
	               |	втШтрихкодыПоискПоШтрихкоду.Ид_Документа,
	               |	втШтрихкодыПоискПоШтрихкоду.НомерПалеты,
	               |	втШтрихкодыПоискПоШтрихкоду.ИсключитьЧастичноПринятыйЗаказИзРейса
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втРеквизитыЗагрузокСТСД.Ид_Документа КАК Ид_Документа,
	               |	ЗагрузкаСТСД.Ссылка КАК Ссылка,
	               |	ВЫБОР
	               |		КОГДА втРеквизитыЗагрузокСТСД.РежимСканирования = 1
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗагрузкиТСД.ПриходWiFiVeeRoute)
	               |		КОГДА втРеквизитыЗагрузокСТСД.РежимСканирования = 2
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗагрузкиТСД.ПогрузкаВАвто)
	               |		КОГДА втРеквизитыЗагрузокСТСД.РежимСканирования = 3
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗагрузкиТСД.ПогрузкаВАвтоНезагруженныеЗаказы)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗагрузкиТСД.ПустаяСсылка)
	               |	КОНЕЦ КАК ТипЗагрузкиТСД,
	               |	РегиональныеТерминалы.Ссылка КАК ТерминалПриема,
	               |	РегиональныеТерминалы.Ссылка КАК ТерминалДоставки,
	               |	спрЭлектронныеВесы.Ссылка КАК ЭлектронныеВесы,
	               |	втРеквизитыЗагрузокСТСД.СчитыватьВес КАК СчитыватьВес,
	               |	втРеквизитыЗагрузокСТСД.ДатаДокумента КАК ДатаДокумента,
	               |	втРеквизитыЗагрузокСТСД.НомерТСД КАК НомерТСД,
	               |	втРеквизитыЗагрузокСТСД.НомерПалеты КАК НомерПалеты,
	               |	докРейс.Ссылка КАК Рейс
	               |ИЗ
	               |	втРеквизитыЗагрузокСТСД КАК втРеквизитыЗагрузокСТСД
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗагрузкаСТСД КАК ЗагрузкаСТСД
	               |		ПО втРеквизитыЗагрузокСТСД.Ид_Документа = ЗагрузкаСТСД.Ид_Документа
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РегиональныеТерминалы КАК РегиональныеТерминалы
	               |		ПО втРеквизитыЗагрузокСТСД.КодРегиона = РегиональныеТерминалы.Код
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭлектронныеВесы КАК спрЭлектронныеВесы
	               |		ПО втРеквизитыЗагрузокСТСД.КодЭлектронныхВесов = спрЭлектронныеВесы.Код
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Рейс КАК докРейс
	               |		ПО втРеквизитыЗагрузокСТСД.НомерРейса = докРейс.Номер
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	втНайденныеПоНомеруПослеОбработки.Штрихкод КАК Штрихкод,
	               |	втНайденныеПоНомеруПослеОбработки.ДатаВремя КАК ДатаВремя,
	               |	втНайденныеПоНомеруПослеОбработки.Вес КАК Вес,
	               |	втНайденныеПоНомеруПослеОбработки.Ид_Документа КАК Ид_Документа,
	               |	РеализацияТоваровУслуг.ВладелецТовара КАК Контрагент,
	               |	СостоянияЗаказовСрезПоследних.РезультатДоставки КАК РезультатДоставки,
	               |	СостоянияЗаказовСрезПоследних.ПричинаНеВыполнения КАК ПричинаНеВыполнения,
	               |	ВЫБОР
	               |		КОГДА ДополнительныеПараметрыЗаказа.Доставка ЕСТЬ NULL
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Самовывоз)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
	               |	КОНЕЦ КАК ТипЗаказа,
	               |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа КАК ВнешнийНомерЗаказа,
	               |	1 КАК КоличествоМест,
	               |	МестаПоЗаказам.Ссылка КАК МестоЗаказа,
	               |	втНайденныеПоНомеруПослеОбработки.ЗаказПоНомеруСтриж КАК Заказ,
	               |	втНайденныеПоНомеруПослеОбработки.НомерПалеты КАК НомерПалеты,
	               |	втНайденныеПоНомеруПослеОбработки.ИсключитьЧастичноПринятыйЗаказИзРейса КАК ИсключитьЧастичноПринятыйЗаказИзРейса
	               |ИЗ
	               |	втНайденныеПоНомеруПослеОбработки КАК втНайденныеПоНомеруПослеОбработки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |		ПО втНайденныеПоНомеруПослеОбработки.ЗаказПоНомеруСтриж = РеализацияТоваровУслуг.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказов.СрезПоследних(
	               |				,
	               |				Заказ В
	               |					(ВЫБРАТЬ
	               |						втНайденныеПоНомеру.ЗаказПоНомеруСтриж
	               |					ИЗ
	               |						втНайденныеПоНомеру)) КАК СостоянияЗаказовСрезПоследних
	               |		ПО втНайденныеПоНомеруПослеОбработки.ЗаказПоНомеруСтриж = СостоянияЗаказовСрезПоследних.Заказ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
	               |		ПО втНайденныеПоНомеруПослеОбработки.ЗаказПоНомеруСтриж = ДополнительныеПараметрыЗаказа.Заказ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МестаПоЗаказам КАК МестаПоЗаказам
	               |		ПО втНайденныеПоНомеруПослеОбработки.ЗаказПоНомеруСтриж = МестаПоЗаказам.Заказ
	               |			И втНайденныеПоНомеруПослеОбработки.Штрихкод = МестаПоЗаказам.Штрихкод
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	втНайденныеПоШтрихкоду.Штрихкод КАК Штрихкод,
	               |	втНайденныеПоШтрихкоду.ДатаВремя КАК ДатаВремя,
	               |	втНайденныеПоШтрихкоду.Вес КАК Вес,
	               |	втНайденныеПоШтрихкоду.Ид_Документа КАК Ид_Документа,
	               |	РеализацияТоваровУслуг.ВладелецТовара КАК Контрагент,
	               |	СостоянияЗаказовСрезПоследних.РезультатДоставки КАК РезультатДоставки,
	               |	СостоянияЗаказовСрезПоследних.ПричинаНеВыполнения КАК ПричинаНеВыполнения,
	               |	ВЫБОР
	               |		КОГДА ДополнительныеПараметрыЗаказа.Доставка ЕСТЬ NULL
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Самовывоз)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
	               |	КОНЕЦ КАК ТипЗаказа,
	               |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа КАК ВнешнийНомерЗаказа,
	               |	1 КАК КоличествоМест,
	               |	МестаПоЗаказам.Ссылка КАК МестоЗаказа,
	               |	втНайденныеПоШтрихкоду.Заказ КАК Заказ,
	               |	втНайденныеПоШтрихкоду.НомерПалеты КАК НомерПалеты,
	               |	втНайденныеПоШтрихкоду.ИсключитьЧастичноПринятыйЗаказИзРейса КАК ИсключитьЧастичноПринятыйЗаказИзРейса
	               |ИЗ
	               |	втНайденныеПоШтрихкоду КАК втНайденныеПоШтрихкоду
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |		ПО втНайденныеПоШтрихкоду.Заказ = РеализацияТоваровУслуг.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказов.СрезПоследних(
	               |				,
	               |				Заказ В
	               |					(ВЫБРАТЬ
	               |						втНайденныеПоШтрихкоду.Заказ
	               |					ИЗ
	               |						втНайденныеПоШтрихкоду)) КАК СостоянияЗаказовСрезПоследних
	               |		ПО втНайденныеПоШтрихкоду.Заказ = СостоянияЗаказовСрезПоследних.Заказ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
	               |		ПО втНайденныеПоШтрихкоду.Заказ = ДополнительныеПараметрыЗаказа.Заказ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МестаПоЗаказам КАК МестаПоЗаказам
	               |		ПО втНайденныеПоШтрихкоду.Заказ = МестаПоЗаказам.Заказ
	               |			И втНайденныеПоШтрихкоду.Штрихкод = МестаПоЗаказам.Штрихкод
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслуг.Ссылка КАК ЗаказПоНомеруСтриж,
	               |	РеализацияТоваровУслуг1.Ссылка КАК ЗаказПоНомеруИМ,
	               |	втЗаказыРейса.Ид_Документа КАК Ид_Документа
	               |ИЗ
	               |	втЗаказыРейса КАК втЗаказыРейса
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |		ПО втЗаказыРейса.НомерЗаказа = РеализацияТоваровУслуг.Номер
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг1
	               |		ПО втЗаказыРейса.НомерЗаказа = РеализацияТоваровУслуг1.НомерВнешнегоЗаказа
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втИгнорируемыеНайденныеПоШтрихкоду.Ид_Документа КАК Ид_Документа,
	               |	втИгнорируемыеНайденныеПоШтрихкоду.Штрихкод КАК Штрихкод,
	               |	втИгнорируемыеНайденныеПоШтрихкоду.Вес КАК Вес,
	               |	втИгнорируемыеНайденныеПоШтрихкоду.НомерПалеты КАК НомерПалеты,
	               |	втИгнорируемыеНайденныеПоШтрихкоду.Заказ КАК Заказ,
	               |	втИгнорируемыеНайденныеПоШтрихкоду.ВремяСканирования КАК ВремяСканирования
	               |ИЗ
	               |	втИгнорируемыеНайденныеПоШтрихкоду КАК втИгнорируемыеНайденныеПоШтрихкоду
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	втИгнорируемыеНайденныеПоНомеруПослеОбработки.Ид_Документа,
	               |	втИгнорируемыеНайденныеПоНомеруПослеОбработки.Штрихкод,
	               |	втИгнорируемыеНайденныеПоНомеруПослеОбработки.Вес,
	               |	втИгнорируемыеНайденныеПоНомеруПослеОбработки.НомерПалеты,
	               |	втИгнорируемыеНайденныеПоНомеруПослеОбработки.Заказ,
	               |	втИгнорируемыеНайденныеПоНомеруПослеОбработки.ВремяСканирования
	               |ИЗ
	               |	втИгнорируемыеНайденныеПоНомеруПослеОбработки КАК втИгнорируемыеНайденныеПоНомеруПослеОбработки";
	
	//Асеев 22.06.2021 (по письму 4780308)>>>
	Сегодня = НачалоДня(ТекущаяДата());
	Запрос.УстановитьПараметр("НачалоПоискаПоШК", ДобавитьМесяц(Сегодня, -1));
	//Асеев 22.06.2021 (по письму 4780308)<<<

	Запрос.УстановитьПараметр("ТаблицаРеквизитовЗагрузокСТСД",ТаблицаРеквизитовЗагрузокСТСД);
	Запрос.УстановитьПараметр("ТаблицаШтрихкодовПоискПоНомеру",ТаблицаСтрокТЧШтрихкодыПоискПоНомеруЗаказа);
	Запрос.УстановитьПараметр("ТаблицаШтрихкодовПоискПоШтрихкоду",ТаблицаСтрокТЧШтрихкодыПоискПоШтрихкоду);
	Запрос.УстановитьПараметр("ТаблицаИгнорируемыеШКПоискПоНомеру", ТаблицаИгнорируемыхШтрихКодовПоискПоНомеруЗаказа);
	Запрос.УстановитьПараметр("ТаблицаИгнорируемыеШКПоискПоШтрихкоду",ТаблицаИгнорируемыхШтрихКодовПоискПоШтрихкоду);
	Запрос.УстановитьПараметр("ТЧЗаказыРейса",ТаблицаСтрокТЧЗаказыРейса);
	
	МассивРезультатовПакета = Запрос.ВыполнитьПакет();
	ВыборкаРеквизитовДокументов = МассивРезультатовПакета[12].Выбрать();
	СтрокиТЧШтрихкодыПоискПоНомеру = МассивРезультатовПакета[13].Выгрузить();
	СтрокиТЧШтрихкодыПоискПоНомеру.Сортировать("ДатаВремя");	
	СтрокиТЧШтрихкодыПоискПоШтрихкоду = МассивРезультатовПакета[14].Выгрузить();
	СтрокиТЧШтрихкодыПоискПоШтрихкоду.Сортировать("ДатаВремя");
	СтрокиТЧЗаказыРейса = МассивРезультатовПакета[15].Выгрузить();	
	СтрокиТЧИгнорируемыхШК = МассивРезультатовПакета[16].Выгрузить();
	Склад = Справочники.Склады.НайтиПоКоду("000000007");
	
	Пока ВыборкаРеквизитовДокументов.Следующий() Цикл
		
		//Асеев 22.09.2020 (Задача № 4267)>>>
		Если ВыборкаРеквизитовДокументов.Ссылка <> Null Тогда
			Если Не ПараметрыСеанса.ЭтоТестоваяСреда Тогда
				Отпр = lem.ОтправитьСообщение(СписокПолучателей, "Перепроведение уже проведенного документа " + Строка(ВыборкаРеквизитовДокументов.Ссылка) + ", номер ТСД " + Строка(ВыборкаРеквизитовДокументов.НомерТСД),,,"Логистическая компания ""Стриж""");
			КонецЕсли;	
			ЗагрузкаСТСДОбъект = ВыборкаРеквизитовДокументов.Ссылка.ПолучитьОбъект();
			ЗагрузкаСТСДОбъект.Ид_Документа = ЗагрузкаСТСДОбъект.Ид_Документа + "_";
			ЗагрузкаСТСДОбъект.Записать();
		КонецЕсли;
		
		ЗагрузкаСТСДОбъект = Документы.ЗагрузкаСТСД.СоздатьДокумент();
		ЗагрузкаСТСДОбъект.Дата  = ТекущаяДата();
		ЗагрузкаСТСДОбъект.Склад = Склад;
	
		//Если ВыборкаРеквизитовДокументов.Ссылка = Null Тогда 
		//	ЗагрузкаСТСДОбъект = Документы.ЗагрузкаСТСД.СоздатьДокумент();
		//	ЗагрузкаСТСДОбъект.Дата  = ТекущаяДата();
		//	ЗагрузкаСТСДОбъект.Склад = Склад;
		//Иначе
		//	Если Не ПараметрыСеанса.ЭтоТестоваяСреда Тогда
		//		Отпр = lem.ОтправитьСообщение(СписокПолучателей, "Перепроведение уже проведенного документа " + Строка(ВыборкаРеквизитовДокументов.Ссылка) + ", номер ТСД " + Строка(ВыборкаРеквизитовДокументов.НомерТСД),,,"Логистическая компания ""Стриж""");
		//	КонецЕсли;	
		//	Продолжить;
		//	//ЗагрузкаСТСДОбъект = ВыборкаРеквизитовДокументов.Ссылка.ПолучитьОбъект();
		//	//ЗагрузкаСТСДОбъект.Штрихкоды.Очистить();
		//	//ЗагрузкаСТСДОбъект.ЗаказыРейса.Очистить();
		//КонецЕсли;	
		//Асеев 22.09.2020 (Задача № 4267)<<<
		
		ЗаполнитьЗначенияСвойств(ЗагрузкаСТСДОбъект,ВыборкаРеквизитовДокументов);
		ЗагрузкаСТСДОбъект.СерверТСД = СерверСканирования;
		
		СтруктураПоиска = Новый Структура("Ид_Документа",ВыборкаРеквизитовДокументов.Ид_Документа);
		СтрокиТЧШтрихкоды = СтрокиТЧШтрихкодыПоискПоНомеру.НайтиСтроки(СтруктураПоиска);
		Для Каждого СтрокаТЧ Из СтрокиТЧШтрихкоды Цикл
			НоваяСтрока = ЗагрузкаСТСДОбъект.Штрихкоды.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТЧ);
		КонецЦикла;	
		СтрокиТЧШтрихкоды = СтрокиТЧШтрихкодыПоискПоШтрихкоду.НайтиСтроки(СтруктураПоиска);
		Для Каждого СтрокаТЧ Из СтрокиТЧШтрихкоды Цикл
			НоваяСтрока = ЗагрузкаСТСДОбъект.Штрихкоды.Добавить();
			Если СтрДлина(СтрокаТЧ.Штрихкод) > 3 Тогда
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТЧ);
			Иначе
				НоваяСтрока.Штрихкод = СтрокаТЧ.Штрихкод;
				НоваяСтрока.ТипЗаказа = Перечисления.ТипыЗаказов.Самовывоз;
				НоваяСтрока.ДатаВремя = СтрокаТЧ.ДатаВремя;
				НоваяСтрока.НомерПалеты = СтрокаТЧ.НомерПалеты;
				НоваяСтрока.ИсключитьЧастичноПринятыйЗаказИзРейса = СтрокаТЧ.ИсключитьЧастичноПринятыйЗаказИзРейса;
			КонецЕсли;	
		КонецЦикла;
		
		НайденнныеСтрокиИгнорируемыхШК = СтрокиТЧИгнорируемыхШК.НайтиСтроки(СтруктураПоиска);
		Для Каждого СтрокаТЧ Из НайденнныеСтрокиИгнорируемыхШК Цикл
			НоваяСтрока = ЗагрузкаСТСДОбъект.ИгнорируемыеШтрихкоды.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
		КонецЦикла;	
		
		НайденныеСтрокиТЧЗаказыРейса = СтрокиТЧЗаказыРейса.НайтиСтроки(СтруктураПоиска);
		Для Каждого СтрокаТЧ Из НайденныеСтрокиТЧЗаказыРейса Цикл
			НоваяСтрока = ЗагрузкаСТСДОбъект.ЗаказыРейса.Добавить();
			НоваяСтрока.Заказ = ?(СтрокаТЧ.ЗаказПоНомеруСтриж <> Null,СтрокаТЧ.ЗаказПоНомеруСтриж,СтрокаТЧ.ЗаказПоНомеруИМ);
		КонецЦикла;	
		
		ЗагрузкаСТСДОбъект.СтрокФакт = ЗагрузкаСТСДОбъект.Штрихкоды.Количество();
		
		Если ЗагрузкаСТСДОбъект.ТипЗагрузкиТСД = Перечисления.ТипыЗагрузкиТСД.ПогрузкаВАвто Тогда
			ЗагрузкаСТСДОбъект.ВспомогательныйРежимТСД = Перечисления.ТипыЗагрузкиТСД.ПогрузкаВАвто;
		КонецЕсли;
		
		Если ЗагрузкаСТСДОбъект.ТипЗагрузкиТСД = Перечисления.ТипыЗагрузкиТСД.ПогрузкаВАвтоНезагруженныеЗаказы Тогда
			ЗагрузкаСТСДОбъект.ТипЗагрузкиТСД = Перечисления.ТипыЗагрузкиТСД.ПогрузкаВАвто;
			ЗагрузкаСТСДОбъект.ВспомогательныйРежимТСД = Перечисления.ТипыЗагрузкиТСД.ПогрузкаВАвтоНезагруженныеЗаказы;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЗагрузкаСТСДОбъект.ЭлектронныеВесы) Тогда
			ЗагрузкаСТСДОбъект.ТипЗагрузкиТСД = Перечисления.ТипыЗагрузкиТСД.ПриходWiFiVeeRouteСВесом;
		КонецЕсли;	
		
		ЗагрузкаСТСДОбъект.Штрихкоды.Сортировать("ДатаВремя");
		
		ЗагрузкаСТСДОбъект.Записать();	
		//МассивКодовДляОтменыРегистрации = Новый Массив;     с каждым доком делаем новый Массив?
		
		Попытка
			//ЗагрузкаСТСДОбъект.Записать(РежимЗаписиДокумента.Запись);
			РезультатЗагрузки.Добавить(Новый Структура("numberDoc,numberUT",ВыборкаРеквизитовДокументов.Ид_Документа,ЗагрузкаСТСДОбъект.Номер));
			ЗагрузкаСТСДОбъект.Записать(РежимЗаписиДокумента.Проведение);
			////МассивКодовДляОтменыРегистрации.Добавить(ВыборкаРеквизитовДокументов.Ид_Документа);
			//МассивКодовДляОтменыРегистрации.Добавить(ВыборкаРеквизитовДокументов.Ид_Документа);
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			Ошибки.Добавить(Новый Структура("Документ,ОписаниеОшибки",Строка(ЗагрузкаСТСДОбъект), ТекстОшибки));
			//Асеев 23.09.2020 (Задача № 4267)>>>
			pkv.ДобавитьВСписокОтложенногоПроведения(ЗагрузкаСТСДОбъект.Ссылка, "Не удалось провести " + ЗагрузкаСТСДОбъект + " ЗагрузкаДокументовИзСервераСканирования "+ ТекстОшибки);
			//Асеев 23.09.2020 (Задача № 4267)<<<
		КонецПопытки;	
		
		
	КонецЦикла;	
	
	//очистка регистрации на сервере сканирования
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("TSDid", "UTL");
	СтруктураЗапроса.Вставить("metaData", "Документ.скан_СканированиеТСД");
	СтруктураЗапроса.Вставить("arrayOfIDs", РезультатЗагрузки);
	СтрокаJSON = СформироватьСтрокуJSON(СтруктураЗапроса);
	Ответ = ВызватьФункциюHTTPСервиса(СтрокаJSON, "unregisterReferences");
	
	Если Не ПараметрыСеанса.ЭтоТестоваяСреда Тогда
		Если Ошибки.Количество() <> 0 Тогда
			
			Для Каждого СтруктураОшибки Из Ошибки Цикл
				Отпр = lem.ОтправитьСообщение(СписокПолучателей, "Ошибка при проведении  " +СтруктураОшибки.Документ,СтруктураОшибки.ОписаниеОшибки , , "Логистическая компания ""Стриж""");	
			КонецЦикла;	
			
			
		КонецЕсли;
	КонецеСли;
	
	Возврат РезультатЗагрузки
	
КонецФункции	

#Область ОбменССерверомСканирования
Процедура РегламентОбменДаннымиССерверомСканирования() Экспорт
	ВыгрузкаЭлектронныхВесов();
	ВыгрузкаГруппРайонов();
	//Асеев 15.12.2022 (Задача № 4953)>>>
	ВыгрузкаМагазинов();
	ВыгрузкаСкладовМагазинов();
	//Асеев 15.12.2022 (Задача № 4953)<<<
	ЗагрузкаДокументовИзСервераСканирования();
	//Переварюха Задача № 3669
	ОбновитьЗаписьПараметрыРегламентныхЗаданий();
	//Переварюха Задача № 3669
КонецПроцедуры	
//+Степанов Задача № 3927
Процедура РегламентВыгрузкаШКНаСерверСканирования() Экспорт
	СписокПолучателей = Новый Массив;
	СписокПолучателей.Добавить("sklad1@strizh-logistic.ru");
	СписокПолучателей.Добавить("m.aseev@strizh-logistic.ru");
	СписокПолучателей.Добавить("evgeniy.marochkin@strizh-logistic.ru");
	СобытиеКонтроляВремени = Справочники.СобытияКонтроляВремени.ВыгрузкаШКВСерверСканирования;
	ПустойРейс = Документы.Рейс.ПустаяСсылка();
	Если Час(ТекущаяДата()) >= 17 Тогда
		ДатаНачала = НачалоДня(ТекущаяДата()+ 12*60*60) - 9 * 24 * 3600;      //
	Иначе
		ДатаНачала = НачалоДня(ТекущаяДата()) - 9 * 24 * 3600;
	КонецЕсли;
	ДатаОкончания = ДатаНачала + 18 * 3600 * 24;
	МассивТерминалов = Новый Массив;
	МассивТерминалов.Добавить(Справочники.РегиональныеТерминалы.МоскваСтриж);
	МассивТерминалов.Добавить(Справочники.РегиональныеТерминалы.СПбСтриж);
	Для Каждого Терминал Из МассивТерминалов Цикл
		Если Не УчетКонтроляВремениСервер.ПроверитьСостояниеСобытия(СобытиеКонтроляВремени,ПустойРейс,Терминал) Тогда  
			ТемаПисьма = "Выгрузка уже происходит - (выгрузка ШК на сервер сканирования)";
			ТекстПисьма = "";
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	КонтрольВремениСрезПоследних.Период КАК Период,
			               |	КонтрольВремениСрезПоследних.РабочееМесто.Наименование КАК РабочееМестоНаименование,
			               |	КонтрольВремениСрезПоследних.Пользователь.Наименование КАК ПользовательНаименование
			               |ИЗ
			               |	РегистрСведений.КонтрольВремени.СрезПоследних(
			               |			,
			               |			Событие = ЗНАЧЕНИЕ(Справочник.СобытияКонтроляВремени.ВыгрузкаШКВСерверСканирования)
			               |				И НЕ ОкончаниеСобытия
			               |				И Терминал = &Терминал) КАК КонтрольВремениСрезПоследних";
			Запрос.УстановитьПараметр("Терминал",Терминал);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ТекстПисьма = "Начало выгрузки " + Строка(Выборка.Период) + Символы.ПС + "Рабочее место: " + Выборка.РабочееМестоНаименование + Символы.ПС + "Пользователь: " + Выборка.ПользовательНаименование;		
			КонецЕсли;	
			lem.ОтправитьСообщение(СписокПолучателей, ТемаПисьма,ТекстПисьма,,"noreply2@strizh-logistic.ru",,,,,,Ложь);
			Возврат;
		КонецЕсли;	
	КонецЦикла;	
	Для Каждого Терминал Из МассивТерминалов Цикл
		УчетКонтроляВремениСервер.ЗаписатьРСКонтрольВремени(СобытиеКонтроляВремени,,Ложь,,,Терминал);
	КонецЦикла;	
	lem.ОтправитьСообщение(СписокПолучателей, "Начата выгрузка ШК на сервер сканирования","",,"noreply2@strizh-logistic.ru",,,,,,Ложь);
	Попытка
		СтруктураОтвета = ВыгрузитьШКНаСерверСканирования(ДатаНачала,ДатаОкончания,МассивТерминалов,Истина);
		Если СтруктураОтвета.result <> "OK" Тогда
			Для Каждого Терминал Из МассивТерминалов Цикл
				УчетКонтроляВремениСервер.ЗаписатьРСКонтрольВремени(СобытиеКонтроляВремени,,Истина,,,Терминал);
			КонецЦикла;	
			lem.ОтправитьСообщение(СписокПолучателей, "Не удалось выгрузить ШК на сервер сканирования!",СтруктураОтвета.errorDescr,,"noreply2@strizh-logistic.ru",,,,,,Ложь);
			ВызватьИсключение "Не удалось выгрузить ШК! " + СтруктураОтвета.errorDescr;
		КонецЕсли;	
	Исключение
		Для Каждого Терминал Из МассивТерминалов Цикл
			УчетКонтроляВремениСервер.ЗаписатьРСКонтрольВремени(СобытиеКонтроляВремени,,Истина,,,Терминал);
		КонецЦикла;	
		lem.ОтправитьСообщение(СписокПолучателей, "Не удалось выгрузить ШК на сервер сканирования!",ОписаниеОшибки(),,"noreply2@strizh-logistic.ru",,,,,,Ложь);
	КонецПопытки;
	Для Каждого Терминал Из МассивТерминалов Цикл
		УчетКонтроляВремениСервер.ЗаписатьРСКонтрольВремени(СобытиеКонтроляВремени,,Истина,,,Терминал);
	КонецЦикла;
	lem.ОтправитьСообщение(СписокПолучателей, "Выгрузка ШК  на сервер сканирования окончена!","",,"noreply2@strizh-logistic.ru",,,,,,Ложь);
КонецПроцедуры	
#КонецОбласти

Процедура ПроверкаОбменаССерверомСканирования() Экспорт
	
	//Переварюха Задача № 3669
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	|	МылоОдминов.Мыло Как Мыло
	|ИЗ
	|	РегистрСведений.МылоОдминов КАК МылоОдминов";
	Стр = СтрокаСоединенияИнформационнойБазы();
	Таб = Зап.Выполнить().Выгрузить();			
	СпПол = Таб.ВыгрузитьКолонку("Мыло");
	ДатаНач = Неопределено;
	ОтборЗагрузкиССервераСканирования = Новый Структура;
	
	ОтборЗагрузкиССервераСканирования.Вставить("Ключ", "ПоследняяЗагрузкаССервераСканирования");
	
	Запись = РегистрыСведений.ПараметрыРегламентныхЗаданий.Получить(ОтборЗагрузкиССервераСканирования);
	Запись.Свойство("Значение", ДатаНач);
	Если ЗначениеЗаполнено(ДатаНач) Тогда
		Попытка
			ДатаЗапроса = Вычислить("'" + ДатаНач + "'");
		Исключение
			lem.ОтправитьСообщение(СпПол, "Проверка состояния обмена с сервером сканирования). База (" + Стр + ")", "Ошибочное значение даты обмена с сервером сканирования "+ДатаНач);
		КонецПопытки;
	Иначе
		lem.ОтправитьСообщение(СпПол, "Проверка состояния обмена с сервером сканирования). База (" + Стр + ")", "Не задана дата последнего обмена с сервером сканирования (РегистрСведений.ПараметрыРегламентныхЗаданий, Ключ=ПоследняяЗагрузкаССервераСканирования)");
	КонецЕсли;
	
	ПослДата = Неопределено;
	ОтборОбновленияЗагрузок = Новый Структура;
	ОтборОбновленияЗагрузок.Вставить("Ключ", "ПоследняяЗаписаннаяЗагрузкаССервераСканирования");
	Запись = РегистрыСведений.ПараметрыРегламентныхЗаданий.Получить(ОтборОбновленияЗагрузок);
	Запись.Свойство("Значение", ПослДата);
	ПослДата = Дата(ПослДата);
	КоличествоОшибок = 0;
	
	Если ПослДата <> ДатаЗапроса Тогда
		Запись = РегистрыСведений.ПараметрыРегламентныхЗаданий.СоздатьНаборЗаписей();
		Запись.Отбор.Ключ.Установить("ПоследняяЗаписаннаяЗагрузкаССервераСканирования");
		Запись.Прочитать();
		Если Запись.Количество() = 0 Тогда
			НоваяЗапись = Запись.Добавить();
		Иначе
			НоваяЗапись = Запись[0];
		КонецЕсли;
		НоваяЗапись.Ключ = "ПоследняяЗаписаннаяЗагрузкаССервераСканирования";
		НоваяЗапись.Значение = lem.ДатаВСтроку(ДатаЗапроса);
		Попытка
			Запись.Записать();
		Исключение
			lem.ОтправитьСообщение(СпПол, "Проверка состояния обмена с сервером сканирования). База (" + Стр + ")", "Ошибка обновления границы состояния обмена с сервером сканирования");
		КонецПопытки;
	Иначе
		lem.ОтправитьСообщение(СпПол, "Проверка состояния обмена с сервером сканирования). База (" + Стр + ")", "Нет обмена с сервером сканирования начиная с " + Формат(ДатаЗапроса, "ДЛФ=DDT"));
	КонецЕсли;	
	//Переварюха Задача № 3669
	
КонецПроцедуры	

Функция ТипШтрихкодаEAN13ТО(Штрихкод) Экспорт
	
	Результат = (СтрДлина(Штрихкод) = 13
	И КонтрольныйСимволEAN13ТО(Штрихкод) = Прав(Штрихкод, 1));
	
	Возврат Результат;
	
КонецФункции

Функция КонтрольныйСимволEAN13ТО(Штрихкод)
	
	Результат   = "";
	Сумма       = 0;
	Коэффициент = 1;
	
	Индекс = Неопределено;
	Для Индекс = 1 По 12 Цикл
		КодСимв     = КодСимвола(Штрихкод, Индекс);
		Сумма       = Сумма + Коэффициент * (КодСимв - 48);
		Коэффициент = 4 - Коэффициент;
	КонецЦикла;
	Сумма     = (10 - Сумма % 10) % 10;
	Результат = Символ(Сумма + 48);
	
	Возврат Результат;
	
КонецФункции

//Переварюха Задача № 3669
Процедура ОбновитьЗаписьПараметрыРегламентныхЗаданий()
	
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	|	МылоОдминов.Мыло Как Мыло
	|ИЗ
	|	РегистрСведений.МылоОдминов КАК МылоОдминов";
	Стр = СтрокаСоединенияИнформационнойБазы();
	Таб = Зап.Выполнить().Выгрузить();			
	СпПол = Таб.ВыгрузитьКолонку("Мыло");
	
	Стр = СтрокаСоединенияИнформационнойБазы();
	
	Запись = РегистрыСведений.ПараметрыРегламентныхЗаданий.СоздатьНаборЗаписей();
	Запись.Отбор.Ключ.Установить("ПоследняяЗагрузкаССервераСканирования");
	Запись.Прочитать();
	Если Запись.Количество() = 0 Тогда
		НоваяЗапись = Запись.Добавить();
	Иначе
		НоваяЗапись = Запись[0];
	КонецЕсли;
	НоваяЗапись.Ключ = "ПоследняяЗагрузкаССервераСканирования";
	НоваяЗапись.Значение = lem.ДатаВСтроку(ТекущаяДата());
	Попытка
		Запись.Записать();
	Исключение
		lem.ОтправитьСообщение(СпПол, "Проверка состояния обмена с сервером сканирования). База (" + Стр + ")", "Ошибка обновления границы состояния обмена с сервером сканирования");
	КонецПопытки;	
	
КонецПроцедуры
//Переварюха Задача № 3669
