
// Функция проверяет, существуют ли ссылки на Документы новаОтчетВодителя.
// Если есть - требуется сообщить об этом
//
// Параметры:
//  СуществуютСсылки - булево, переменная, в которой сохраняется результат работы функции, чтобы
//                     при последующих вызовах заново не считать функцию.
//
// Возвращаемое значение:
//  Истина - если есть движения, Ложь - если нет.
//
Функция СуществуютСсылки() Экспорт
    Если Не ЗначениеЗаполнено(Ссылка) Тогда
        Возврат Ложь;
    КонецЕсли;

    Запрос = Новый Запрос();
    Запрос.УстановитьПараметр("РезультатДоставки", Ссылка);
    Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|    новаОтчетВодителя.Ссылка
	|ИЗ
	|    Документ.новаОтчетВодителя КАК новаОтчетВодителя
	|ГДЕ
	|    новаОтчетВодителя.Задания.РезультатДоставки = &РезультатДоставки
	|    И новаОтчетВодителя.Проведен = ИСТИНА";

    Возврат Не Запрос.Выполнить().Пустой();
КонецФункции
