
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	
	Движения.УчетВыходаНаРаботуСотрудниковКомпании.Записывать = Истина;
	Движения.УчетВыходаНаРаботуСотрудниковКомпании.Очистить();
		
	Движение = Движения.УчетВыходаНаРаботуСотрудниковКомпании.Добавить();
	Движение.Период = Дата;
	Движение.Сотрудник = Сотрудник;
	Движение.СотрудникВышелНаРаботу = СотрудникВышелНаРаботу;
	
	Запрос = новый Запрос("ВЫБРАТЬ
	                      |	БэйджиСотрудников.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.БэйджиСотрудников КАК БэйджиСотрудников
	                      |ГДЕ
	                      |	БэйджиСотрудников.Владелец = &Владелец");
	Запрос.УстановитьПараметр("Владелец", Сотрудник);
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда
		Движение.БэйджСотрудника = Рез.Ссылка;		
	КонецЕсли;	
		
	
КонецПроцедуры
