
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
                |   ОтработанноеВремяПоТабелю.Регистратор,
                |   ОтработанноеВремяПоТабелю.Сотрудник,
                |   ОтработанноеВремяПоТабелю.Подразделение
                |ИЗ
                |   РегистрНакопления.ОтработанноеВремяПоТабелю КАК ОтработанноеВремяПоТабелю
                |ГДЕ
                |   ОтработанноеВремяПоТабелю.Период МЕЖДУ &ДатаНач И &ДатаКон
                |   И ОтработанноеВремяПоТабелю.Сотрудник В(&Сотрудники)
                |   И ОтработанноеВремяПоТабелю.Подразделение = &Подразделение
                |   И ОтработанноеВремяПоТабелю.Регистратор <> &Регистратор
                |   И ОтработанноеВремяПоТабелю.ВидПериодаРасчета = &ВидПериодаРасчета";
	Таб = ОтработанноеВремя.Выгрузить();			
	Таб.Свернуть("Сотрудник", "ОтработаноЧасов");
	МасСотрудников = Таб.ВыгрузитьКолонку("Сотрудник");
	Зап.УстановитьПараметр("ДатаНач", НачалоМесяца(Период));
	Зап.УстановитьПараметр("ДатаКон", КонецМесяца(Период));
	Зап.УстановитьПараметр("Сотрудники", МасСотрудников);
	Зап.УстановитьПараметр("Подразделение", Подразделение);
	Зап.УстановитьПараметр("Регистратор", Ссылка);
	Зап.УстановитьПараметр("ВидПериодаРасчета", ВидПериодаРасчета);
	
	Если Не Зап.Выполнить().Пустой() Тогда
		#Если Клиент Тогда
			Сообщить("Проведение не может быть выполнено, так в периоде " + ПредставлениеПериода(НачалоМесяца(Период), КонецМесяца(Период), "ДЛФ=DD") + " уже проведен табель учета рабочего времений!");
		#КонецеСли	
		Отказ = истина;
		Возврат;
	КонецеСли;	
	
	
	// регистр ОтработанноеВремяПоТабелю 
	Движения.ОтработанноеВремяПоТабелю.Записывать = Истина;
	Движения.ОтработанноеВремяПоТабелю.Очистить();
	Для Каждого ТекСтрокаОтработанноеВремя Из ОтработанноеВремя Цикл
		Движение = Движения.ОтработанноеВремяПоТабелю.Добавить();
		Движение.Период = Период;
		Движение.Подразделение = Подразделение;
		Движение.Сотрудник = ТекСтрокаОтработанноеВремя.Сотрудник;
		Движение.ДатаПериода = ТекСтрокаОтработанноеВремя.Дата;
		Если ТекСтрокаОтработанноеВремя.ВидОтработанногоВремени.РабочееВремя Тогда
			Движение.Показатель = ТекСтрокаОтработанноеВремя.ОтработаноЧасов;
		КонецеСли;	
		Движение.ВидОтработанногоВремени = ТекСтрокаОтработанноеВремя.ВидОтработанногоВремени;
        Движение.ВидПериодаРасчета = ВидПериодаРасчета;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
