Процедура ЗаполнитьСписокЗначений(Сп)
	Сп.Добавить(Перечисления.СтатусыЗаказаВодитель.Доставлен);
	Сп.Добавить(Перечисления.СтатусыЗаказаВодитель.Перенос);
	Сп.Добавить(Перечисления.СтатусыЗаказаВодитель.ОтказСЗаездом);
	Сп.Добавить(Перечисления.СтатусыЗаказаВодитель.ОтказБезЗаезда);
	Сп.Добавить(Перечисления.СтатусыЗаказаВодитель.ПустаяСсылка(), "К доставке");
КонецПроцедуры	


&НаКлиенте
Процедура ИзменитьСтатус(Команда)
	Сп = Новый СписокЗначений;
	ЗаполнитьСписокЗначений(Сп);
	Выб = Сп.ВыбратьЭлемент("Выберите статус...");
	Если Выб <> Неопределено Тогда
		Объект.СтатусВодитель = Выб.Значение;
		Записать();
	КонецеСли;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.СтатусВодитель = Перечисления.СтатусыЗаказаВодитель.Доставлен Тогда
		Элементы.СтатусВодитель.ЦветФона = WebЦвета.ЦветМорскойВолныНейтральный;
	ИначеЕсли Объект.СтатусВодитель = Перечисления.СтатусыЗаказаВодитель.Перенос Или Не ЗначениеЗаполнено(Объект.СтатусВодитель) Тогда	
		Элементы.СтатусВодитель.ЦветФона = WebЦвета.Хаки;
	Иначе
		Элементы.СтатусВодитель.ЦветФона = WebЦвета.Красный;
	КонецеСли;	
	ТолькоПросмотр = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	ПараметрыОткрытия = Новый Структура("Товар, Количество, Цена, Сумма, СтавкаНДС, ШтрихкодТовара, КодМаркировки, ПоставщикТовара");
	ЗаполнитьЗначенияСвойств(ПараметрыОткрытия, Элементы.Товары.ДанныеСтроки(Элементы.Товары.ТекущаяСтрока));
	ОткрытьФорму("Документ.Заказ.Форма.ФормаПросмотраТоваров", ПараметрыОткрытия, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
