//+Широков 13.07.2021 Задача 2216 
Функция СформироватьОтправитьПоПочте(НачДата, КонДата) Экспорт
		СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	//создадим компоновщик настроек и загрузим настройки по умолчанию, вместо настроек по умолчанию можно использовать восстановленные настройки
	КомпоновщикНастроек2 = Новый КомпоновщикНастроекКомпоновкиДанных();
	КомпоновщикНастроек2.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	КомпоновщикНастроек2.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Настройки = КомпоновщикНастроек2.Настройки;
	
	//установка параметров отчета, без КомпоновщикНастроекКомпоновкиДанных делать это гораздо сложнее
	////Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Период",         Период);
	//Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НачДата",         НачДата);
	//Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КонДата",         КонДата);
	
	//Период = Новый НастройкаПериода;
	//Период.ВариантНастройки = ВариантНастройкиПериода.Интервал;
	//Период.УстановитьПериод(НачалоДня(НачДата), ?(НачалоДня(КонДата) = Дата("00010101000000"), НачалоДня(КонДата), КонецДня(КонДата)));
	//Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Период",         Период);
	
	//КомпоновщикНастроек2 = Отчет.КомпоновщикНастроек;	
	////ГруппаКонтрагентовКомитенты = Справочники.Контрагенты.НайтиПоКоду("000000004"); // Комитенты
	////ПараметрСКД = Настройки.ПараметрыДанных.Элементы.Найти("ГруппаКонтрагентовКомитенты");
	////ПараметрСКД.Использование = Истина;
	////ПараметрСКД.Значение      = ГруппаКонтрагентовКомитенты;
	
	//Помещаем в переменную данные о расшифровке данных - здесь ненужный пункт, но пусть будет.
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	//Формируем макет, с помощью компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	//Передаем в макет компоновки схему, настройки и данные расшифровки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	//Выполним компоновку с помощью процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);
	
	//Очищаем поле табличного документа
	Результат = Новый ТабличныйДокумент();
	//Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Попытка
		//ПутьКФайлу = "c:\My\1С\Задачи\2216\" + Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd") + "_МониторингОтказовПереносовРасширенный" + ".xls";
		//Результат.Записать(ПутьКФайлу, ТипФайлаТабличногоДокумента.XLS);
		ПутьКФайлу = "\\192.168.7.251\Docs\10 Общие документы\Проверка статусов\" + Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd") + "_МониторингОтказовПереносовРасширенный" + ".xls";
		Результат.Записать(ПутьКФайлу, ТипФайлаТабличногоДокумента.XLS);
	Исключение
		ПолучениеФайловИзИнтернета.ЗаписатьОшибкуВЖурналРегистрации(ОписаниеОшибки());
	КонецПопытки;
		
	Возврат Результат;
	
КонецФункции
//-Широков 13.07.2021 Задача 2216 
