&НаКлиенте
Перем ДанныеРасшифровки;

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПериодФормирования.ДатаНачала = НачалоДня(ТекущаяДата());
	ПериодФормирования.ДатаОкончания = КонецДня(ТекущаяДата());
	
КонецПроцедуры

&НаСервере
Функция  СформироватьОтчетНаСервере(ДанныеРасшифровки)
	
	СхемаКомпоновкиДанных = ВнешниеИсточникиданных.ВнешнийЛог.Таблицы.dbo_LogMAExchange.ПолучитьМакет("ДанныеЛогаОбменаМП");

	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
	ПараметрПериодФормирования	= НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПериодФормирования"));
	ПараметрПериодФормирования.Значение = ПериодФормирования;
	ПараметрПериодФормирования.Использование = Истина;

	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиОтчета);

	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных; 
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);	
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных; 
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки); 
	
	ДокументРезультат = новый ТабличныйДокумент;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент; 
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат); 
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);	

	Возврат ДокументРезультат;
	
КонецФункции

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	Результат = СформироватьОтчетНаСервере(ДанныеРасшифровки);
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(Расшифровка) = Тип("ИдентификаторРасшифровкиКомпоновкиДанных") тогда
		ЭлементРасшифровки = ДанныеРасшифровки.Элементы[Расшифровка];
		Если ТипЗнч(ЭлементРасшифровки) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
			Для каждого Поле Из ЭлементРасшифровки.ПолучитьПоля() Цикл
				ОткрытьЗначение(Поле.Значение);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

