
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.зпРасчетЗП.Записывать = Истина;
	Движения.зпРасчетЗП.Очистить();
	
	ВидРасчета = Перечисления.зпВидыРасчетаЗП.Начисление;
	
	Для Каждого СтрокаРасчета Из Начисления Цикл
		
		Движение = Движения.зпРасчетЗП.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, СтрокаРасчета);
		Движение.Период = Дата;
		Движение.Регион = Регион;
		Движение.НачислениеУдержание = СтрокаРасчета.Начисление;
		Движение.ВидРасчета = ВидРасчета;
		
	КонецЦикла;
	
	ВидРасчета = Перечисления.зпВидыРасчетаЗП.Удержание;
	
	Для Каждого СтрокаРасчета Из Удержания Цикл
		
		Движение = Движения.зпРасчетЗП.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, СтрокаРасчета);
		Движение.Период = Дата;
		Движение.Регион = Регион;
		Движение.НачислениеУдержание = СтрокаРасчета.Удержание;
		Движение.ВидРасчета = ВидРасчета;
		Движение.Сумма = -СтрокаРасчета.Сумма;
		
	КонецЦикла;
	
	Движение = РегистрыСведений.зпЗакрытыеРасчетныеПериоды.СоздатьМенеджерЗаписи();
	Движение.Период = ТекущаяДата();
	Движение.Регион = Регион;
	Движение.РасчетныйПериод = ПериодРасчета;
	Движение.ПериодЗакрыт = Истина;
	Движение.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	Движение.Документ = Ссылка;
	Движение.Записать();
	
КонецПроцедуры
