&НаКлиенте
Процедура СформироватьНомераПалеттДействие(Загрузка)
	Если Объект.ФормироватьНомераПалетт Тогда
		Возврат;
	КонецеСли;	
	
	От = Вопрос("Сформировать номера палетт?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
	
	Если От = КодВозвратаДиалога.Да Тогда
		СформироватьНомераПалетт(Объект.Ссылка);
	КонецеСли;	
КонецПроцедуры	

&НаКлиенте
Процедура СформироватьНомераПалетт(Загрузка)
	
	//+++ БАО 27.06.2017 №1180
	
	//Док = Загрузка.ПолучитьОбъект();
	
	//
	//Если Загрузка.РежимНазначенияНомеровПалет = Перечисления.РежимыНазначенияНомеровПалет.ПоМаркеТранспортаИПоВремениОкончанияРейсаПлюсПрефикс Тогда
	//	
	//	//+++ БАО 27.06.2017 №1180
	//	bao.СформироватьНомераПалетПоМаркеТранспортаИПоВремениОкончанияРейсаПлюсПрефикс(Загрузка.Ссылка)
	//	//--- БАО 27.06.2017 №1180
	//	
	//Иначе
	//	
	//	
	//	Зап = Новый Запрос;
	//	Зап.Текст = "ВЫБРАТЬ
	//	|	ЗагрузкаРейсовВероутРейсы.Рейс.Ссылка КАК Рейс
	//	|ИЗ
	//	|	Документ.ЗагрузкаРейсовВероут.Рейсы КАК ЗагрузкаРейсовВероутРейсы
	//	|ГДЕ
	//	|	ЗагрузкаРейсовВероутРейсы.Ссылка.Ссылка = &Док
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	ЗагрузкаРейсовВероутРейсы.Рейс.Транспорт.Наименование";
	//	Зап.УстановитьПараметр("Док", Загрузка.Ссылка);			
	//	
	//	Рез = Зап.Выполнить().Выгрузить();
	//	
	//	НП = 1;
	//	
	//	Для Каждого Тек Из Рез Цикл
	//		Рейс = Тек.Рейс.ПолучитьОбъект();
	//		Рейс.НомерПалетты = НП;
	//		Рейс.Записать(РежимЗаписиДокумента.Запись);
	//		НП = НП + 1;
	//	КонецЦикла;	
	//	
	//	//+++ БАО 27.06.2017 №1180
	//КонецЕсли;
	////--- БАО 27.06.2017 №1180
	//
	//Док.ФормироватьНомераПалетт = Истина;
	//Док.Записать(РежимЗаписиДокумента.Запись);
	//
	baoВызовСервера.СформироватьНомераПалетт(Загрузка);
	
	//--- БАО 06.10.2017 №1180
	
	ЭтаФорма.Прочитать();
	
КонецПроцедуры	
