
Процедура ОбработкаПрофилейРассылки() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрофилиРассылки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПрофилиРассылки КАК ПрофилиРассылки
		|ГДЕ
		|	НЕ ПрофилиРассылки.ПометкаУдаления
		|	И ПрофилиРассылки.ПрофильАктивен";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Справочники.ПрофилиРассылки.ОтправитьРассылку(ВыборкаДетальныеЗаписи.Ссылка);

	КонецЦикла;
	
КонецПроцедуры
