#Область ПрограммныйИнтерфейс
// Выполнить обмен.
Процедура ВыполнитьОбмен() Экспорт
	ОбщееСоединениеHTTP = "";
	IDУзла = ПроцедурыОбменаСЦУ.ПолучитьIDУзла();
	
	ПроцедурыОбменаСЦУ.ВыполнитьОбмен_РегиональныеТерминалы(ОбщееСоединениеHTTP, IDУзла);
	ПроцедурыОбменаСЦУ.ВыполнитьОбмен_СписокСерверовОбмена(ОбщееСоединениеHTTP);
	ПроцедурыОбменаСЦУ.ВыполнитьОбмен_СписокТиповДокументовПрикрепленныеФайлы(ОбщееСоединениеHTTP, IDУзла);
	//TODO: не тестировалось
	ПроцедурыОбменаСЦУ.ВыполнитьОбмен_ВыгрузитьПрикрепленныеФайлы(ОбщееСоединениеHTTP, IDУзла);
	// не тестировалось
	
	ПроцедурыОбменаСЦУ.ВыполнитьОбмен_ПоставщикиТоваров(ОбщееСоединениеHTTP, IDУзла);
	ПроцедурыОбменаСЦУ.ВыполнитьОбмен_ИМ(ОбщееСоединениеHTTP, IDУзла);
	
	ПроцедурыОбменаСЦУ.ВыполнитьОбмен_КалендариДоставок(ОбщееСоединениеHTTP, IDУзла);
	
	ПроцедурыОбменаСЦУ.ВыполнитьОбмен_ПолучитьПараметры(ОбщееСоединениеHTTP, IDУзла);	
	ПроцедурыОбменаСЦУ.ВыполнитьОбмен_ПолучитьСписокОрганизаций(ОбщееСоединениеHTTP, IDУзла);
	
	ПроцедурыОбменаСЦУ.ВыполнитьОбмен_ПолучитьСписокВодителей(ОбщееСоединениеHTTP, IDУзла);
	ПроцедурыОбменаСЦУ.ВыполнитьОбмен_ПолучитьСписокЭкспедиторов(ОбщееСоединениеHTTP, IDУзла);
	ПроцедурыОбменаСЦУ.ВыполнитьОбмен_ПолучитьСписокТранспорта(ОбщееСоединениеHTTP, IDУзла);
	
	ОтветМетодаРейсы = ПроцедурыОбменаСЦУ.ВыполнитьОбмен_ПолучитьСписокРейсов(ОбщееСоединениеHTTP, IDУзла);
	
	ПроцедурыОбменаСЦУ.ВыполнитьОбмен_ПолучитьСписокРезультатовДоставки(ОбщееСоединениеHTTP, IDУзла);
	ПроцедурыОбменаСЦУ.ВыполнитьОбмен_ПричиныОтказаПереноса(ОбщееСоединениеHTTP, IDУзла);
	//выгрузка брейков идет с ограничением по дате заказов, не тестировалось
	ПроцедурыОбменаСЦУ.ВыполнитьОбмен_ПолучитьСписокТарифовИОбъемныхБрейков(ОбщееСоединениеHTTP, IDУзла);
	
	ПроцедурыОбменаСЦУ.ВыполнитьОбмен_УстановитьПараметрыМПВЦУ(ОбщееСоединениеHTTP, IDУзла);
	
	Если ОтветМетодаРейсы.НомерРейсаНаСегодня <> "" Тогда
		ПроцедурыОбменаСЦУ.ВыполнитьОбмен_ПолучитьЗаказыПоРейсу(ОбщееСоединениеHTTP, ОтветМетодаРейсы);
	КонецЕсли;	
	
	УведомленияКлиента.ОтправитьУведомление("ВыполненОбменСЦУ", Неопределено);
КонецПроцедуры

// Выполнить обмен фоновое задание.
Процедура ВыполнитьОбменФоновоеЗадание() Экспорт
	Попытка
		ФоновыеЗадания.Выполнить("ОбменДаннымиЦУВызовСервера.ВыполнитьОбмен", , "КлючЗадания", "ОбменДаныымиСЦУ");
	Исключение
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Обмен уже выполняется!";	
		Сообщение.Сообщить();
	КонецПопытки;		
КонецПроцедуры

// Интервал фонового обмена СЦУ.
// 
// Возвращаемое значение:
//  Число - Интервал фонового обмена СЦУ
Функция ИнтервалФоновогоОбменаСЦУ() Экспорт
	Возврат Константы.ИнтервалОбменаСЦУ.Получить();
КонецФункции		
#КонецОбласти	