Процедура ВыполнитьОбмен() Экспорт
	ОбщееСоединениеHTTP = "";
	IDУзла = ПроцедурыОбменаСЦУ.ПолучитьIDУзла();
	
	ПроцедурыОбменаСЦУ.ВыполнитьОбмен_РегиональныеТерминалы(ОбщееСоединениеHTTP, IDУзла);
	ПроцедурыОбменаСЦУ.ВыполнитьОбмен_СписокСерверовОбмена(ОбщееСоединениеHTTP);
	ПроцедурыОбменаСЦУ.ВыполнитьОбмен_СписокТиповДокументовПрикрепленныеФайлы(ОбщееСоединениеHTTP, IDУзла);
	// не тестировалось
	ПроцедурыОбменаСЦУ.ВыполнитьОбмен_ВыгрузитьПрикрепленныеФайлы(ОбщееСоединениеHTTP, IDУзла);
	// не тестировалось
	
	ПроцедурыОбменаСЦУ.ВыполнитьОбмен_ПоставщикиТоваров(ОбщееСоединениеHTTP, IDУзла);
	// непонятно что это
	//ПроцедурыОбменаСЦУ.ВыполнитьОбмен_КалендариДоставок(ОбщееСоединениеHTTP);
	// непонятно что это
	ПроцедурыОбменаСЦУ.ВыполнитьОбмен_ПолучитьПараметры(ОбщееСоединениеHTTP, IDУзла);	
КонецПроцедуры	