#Область ПрограммныйИнтерфейс
// Выполнить обмен.
Процедура ВыполнитьОбмен() Экспорт
	ОбщееСоединениеHTTP = "";
	IDУзла = ПроцедурыОбменаСЦУ.ПолучитьIDУзла();
	
	ПроцедурыОбменаСЦУ.ВыполнитьОбмен_РегиональныеТерминалы(ОбщееСоединениеHTTP, IDУзла);
	ПроцедурыОбменаСЦУ.ВыполнитьОбмен_СписокСерверовОбмена(ОбщееСоединениеHTTP);
	ПроцедурыОбменаСЦУ.ВыполнитьОбмен_СписокТиповДокументовПрикрепленныеФайлы(ОбщееСоединениеHTTP, IDУзла);
	//TODO: не тестировалось
	ПроцедурыОбменаСЦУ.ВыполнитьОбмен_ВыгрузитьПрикрепленныеФайлы(ОбщееСоединениеHTTP, IDУзла);
	// не тестировалось
	
	ПроцедурыОбменаСЦУ.ВыполнитьОбмен_ПоставщикиТоваров(ОбщееСоединениеHTTP, IDУзла);
	// непонятно что это
	//ПроцедурыОбменаСЦУ.ВыполнитьОбмен_КалендариДоставок(ОбщееСоединениеHTTP);
	// непонятно что это
	ПроцедурыОбменаСЦУ.ВыполнитьОбмен_ПолучитьПараметры(ОбщееСоединениеHTTP, IDУзла);	
	ПроцедурыОбменаСЦУ.ВыполнитьОбмен_ПолучитьСписокОрганизаций(ОбщееСоединениеHTTP, IDУзла);
	
	ПроцедурыОбменаСЦУ.ВыполнитьОбмен_ПолучитьСписокВодителей(ОбщееСоединениеHTTP, IDУзла);
	ПроцедурыОбменаСЦУ.ВыполнитьОбмен_ПолучитьСписокЭкспедиторов(ОбщееСоединениеHTTP, IDУзла);
	ПроцедурыОбменаСЦУ.ВыполнитьОбмен_ПолучитьСписокТранспорта(ОбщееСоединениеHTTP, IDУзла);
	
КонецПроцедуры
#КонецОбласти	