
// Предопределенное свойство. Содержит коллекцию свойств печатной формы.
//
Перем СвойстваПечатнойФормы Экспорт; // <Структура>

// Предопределенная функция. Формирует печатную форму в указанном документе.
//
// Параметры:
//  Форма             <Форма>
//  ТабличныйДокумент <ТабличныйДокумент>
//  Заголовок         <Строка>
//
// Возвращаемое значение:
//  <Булево>: Истина, если печатную форму удалось сформировать.
//
Функция ВывестиНаПечать(Форма, ТабличныйДокумент, Заголовок) Экспорт
	обПечатьМаршрута = Отчеты.новаМаршуртРейсаНаКарте.Создать();
	обПечатьМаршрута.Владелец = Владелец;
	
	ФормаКарты = ПолучитьФорму("ФормаКарты");
	ФормаКарты.Рейс = Форма.Ссылка;
	обПечатьМаршрута.КартинкаКарты = ФормаКарты.ОткрытьМодально();
	
	Если обПечатьМаршрута.КартинкаКарты = Неопределено Тогда Возврат Ложь; КонецЕсли;
	
	Возврат обПечатьМаршрута.ВывестиНаПечать(Форма, ТабличныйДокумент, Заголовок);
КонецФункции

СвойстваПечатнойФормы = Новый Структура("Представление", "Маршрут на карте (интерактивный)");