
Функция ТекущиеКоординаты() Экспорт
	#Если МобильноеПриложениеКлиент Тогда
		Имя = "";		
		Если ГеопозиционированиеКлиент.ОбновитьМестоположение(Имя) Тогда
			ДанныеМестоположения = СредстваГеопозиционирования.ПолучитьПоследнееМестоположение(Имя);
			Возврат ДанныеМестоположения;
		КонецЕсли;
	#КонецЕсли
	Возврат Неопределено;
КонецФункции

Функция ВыбратьРегионВПользовательскомРежиме() Экспорт
	Зн = Неопределено;
	Рез = ВвестиЗначение(Зн, "Регион доставки...", Тип("СправочникСсылка.РегиональныеТерминалы"));
	
	Возврат Зн;
КонецФункции	

