
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Список.Период.ДатаНачала = НачалоДня(ТекущаяДата());
	Элементы.Список.Период.ДатаОкончания = КонецДня(ТекущаяДата());
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЧекаНаМобильномПринтере(Команда)
	Если Элементы.Список.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецеСли;
	
	ТекстЧекаПарам = ПолучитьТекстЧека();
	ТекстЧека = ТекстЧекаПарам.ТекстЧека;
	ШКЧека = ТекстЧекаПарам.СтрокаШК;
	
	ПечатьНаПринтереЧековКлиент.ПечатьТекста(ТекстЧека, ШКЧека, Истина);
	ЗаписатьПризнакРаспечатанностиЧека();
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстЧека()
	Возврат РаботаСЧекамиСервер.СформироватьТекстВозвратногоЧека(Элементы.Список.ТекущаяСтрока);
КонецФункции	

&НаСервере
Процедура ЗаписатьПризнакРаспечатанностиЧека()
	РаботаСЧекамиСервер.ЗаписьСтатусаЧекНапечатан(Элементы.Список.ТекущаяСтрока);
КонецПроцедуры	


