
//Асеев 29.03.2022 (Задача № 4767)>>>
Процедура ОтправитьПисьмаСоСсылкамиНаОтслеживаниеЗаказов(МассивЗаказов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Заказы", МассивЗаказов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДополнительныеПараметрыЗаказа.EmailКлиента КАК EmailКлиента,
	|	ТелоСсылкиЛКПолучателяЗаказа.Значение + ДополнительныеПараметрыЗаказа.СсылкаНаОтслеживание КАК СсылкаНаОтслеживание
	|ИЗ
	|	РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константа.ТелоСсылкиЛКПолучателяЗаказа КАК ТелоСсылкиЛКПолучателяЗаказа
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ДополнительныеПараметрыЗаказа.Заказ В(&Заказы)
	|	И ДополнительныеПараметрыЗаказа.EmailКлиента ПОДОБНО ""%@%""
	|	И ДополнительныеПараметрыЗаказа.СсылкаНаОтслеживание <> """"";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	СписокПолучателей = Новый Массив;
	
	ОбработкаUnione = Обработки.СТРИЖ_ИнтеграцияUniOne.Создать();
	
	ТемаПисьма = "Курьерская служба Стриж";
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СписокПолучателей.Очистить();
		СписокПолучателей.Добавить(Выборка.EmailКлиента);
		
		ТекстПисьма =
		"<html><head></head>
		|<body>
		|<div>Здравствуйте!</div>
		|<div>Мы получили заявку на доставку Вашего заказа и теперь ожидаем поступление товара.</div>
		|<div>Отследить состояние заказа Вы можете по ссылке: <a href=""" + Выборка.СсылкаНаОтслеживание + """>" + Выборка.СсылкаНаОтслеживание + "</a></div>
		|<div>В день доставки Вы получите СМС сообщение на номер телефона, указанный в заявке.</div>
		|<div>&nbsp;</div>
		|<div><i>Данное письмо не требует ответа.</i></div></body></html>";
		
		ОбработкаUnione.ОтправитьEMAIL_HTTP(СписокПолучателей, ТемаПисьма, ТекстПисьма,,,,,,,,,, Ложь);
		
	КонецЦикла;
	
КонецПроцедуры
//Асеев 29.03.2022 (Задача № 4767)<<<


