//Геннадий #4761 22.03.2022 ++
&НаКлиенте
Процедура Изменить(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", Элементы.Список.ТекущаяСтрока.Ссылка);
	
	ОповещениеЗакрытияОкна = Новый ОписаниеОповещения("ОбновитьСписок", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.ШаблоныСМСРассылок.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма, , , , ОповещениеЗакрытияОкна, РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	
	ПараметрыФормы = Новый Структура;
	
	ОповещениеЗакрытияОкна = Новый ОписаниеОповещения("ОбновитьСписок", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.ШаблоныСМСРассылок.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма, , , , ОповещениеЗакрытияОкна, РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Результат, Параметры) Экспорт
	
	Элементы.Список.Обновить();
	
КонецПроцедуры
//Геннадий #4761 22.03.2022 --
