
Функция ТаблицаДвиженийПоРегистру(ТолькоОписанияПолей = Ложь) Экспорт
	
	МассивОписанияПолей = Новый Массив;
	
	ТаблицаДвижений = Новый ТаблицаЗначений;
	
	Для Каждого Измерение Из Метаданные.РегистрыНакопления.ВзаиморасчетыСКомитентами.Измерения Цикл
		
		ТаблицаДвижений.Колонки.Добавить(Измерение.Имя, Новый ОписаниеТипов(Измерение.Тип));
		МассивОписанияПолей.Добавить(Измерение.Имя);
		
	КонецЦикла;	
	
	Для Каждого Реквизит Из Метаданные.РегистрыНакопления.ВзаиморасчетыСКомитентами.Реквизиты Цикл
		
		ТаблицаДвижений.Колонки.Добавить(Реквизит.Имя, Новый ОписаниеТипов(Реквизит.Тип));
		МассивОписанияПолей.Добавить(Реквизит.Имя); 
		
	КонецЦикла;	
	
	Для Каждого Ресурс Из Метаданные.РегистрыНакопления.ВзаиморасчетыСКомитентами.Ресурсы Цикл
		
		ТаблицаДвижений.Колонки.Добавить(Ресурс.Имя, Новый ОписаниеТипов(Ресурс.Тип));
		
	КонецЦикла;	
	
	Если ТолькоОписанияПолей Тогда
		
		Возврат СтрСоединить(МассивОписанияПолей,",");
		
	Иначе
		
		Возврат ТаблицаДвижений;
		
	КОнецЕсли;
	
КонецФункции	