
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Список.Параметры.УстановитьЗначениеПараметра("ВариантТаблицыПодъемов", Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ФормаП = ОткрытьФорму("РегистрСведений.ПодъёмыНаБланкахЗаказа.Форма.ФормаЗаписи");//, Парам);
		ФормаП.Запись.ВариантТаблицыПодъемов = Объект.Ссылка;		
	Иначе
		От = Вопрос("Перед вводом данных необходимо записать объект. Записать?", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да);
		Если От = КодВозвратаДиалога.Да Тогда
			Если ЗначениеЗаполнено(Объект.Наименование) Тогда 
				Записать();
				ФормаП = ОткрытьФорму("РегистрСведений.ПодъёмыНаБланкахЗаказа.Форма.ФормаЗаписи");//, Парам);
				ФормаП.Запись.ВариантТаблицыПодъемов = Объект.Ссылка;
			Иначе
				Предупреждение("Необходимо ввести наименование!", ,"Ошибка");
				Отказ = Истина;	
			КонецЕсли;
		Иначе
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;
	//ФормаП = ОткрытьФорму("РегистрСведений.ПодъёмыНаБланкахЗаказа.Форма.ФормаЗаписи");//, Парам);
	//ФормаП.Запись.ВариантТаблицыПодъемов = Объект.Ссылка;
	
КонецПроцедуры