Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Наименование) Тогда
		Сообщить("Внимание!!! Ошибка записи, введите наименование!");
		Отказ = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТипЗаказа) Тогда
		Сообщить("Внимание!!! Ошибка записи, введите тип заказа!");
		Отказ = Истина;
	КонецЕсли;
	
	Для Каждого строкаТЧ Из ВидыПоказателейКатегорийЗаказов Цикл
		
		Если строкаТЧ.ВидПоказателяДоступен 
			И строкаТЧ.ВидПоказателяКатегорийЗаказов  = Перечисления.зпВидыПоказателейКатегорийЗаказов.ЗначениеРеквизитаЗаказа 
			И Не ЗначениеЗаполнено(строкаТЧ.ИмяРеквизита) Тогда
			Сообщить("Внимание!!! Ошибка записи, введите имя реквизита в табличной части!");
			Отказ = Истина;	
		КонецЕсли;	
		
	КонецЦикла;	
	
	Если Не Ссылка.Пустая() Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("СхемаКатегорийЗаказов", Ссылка);
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК Поле1
		|ИЗ
		|	РегистрСведений.зпИсходныеДанныеРасчетаЗППоЗаказам КАК зпИсходныеДанныеРасчетаЗППоЗаказам
		|ГДЕ
		|	зпИсходныеДанныеРасчетаЗППоЗаказам.КатегорияЗаказа.Владелец = &СхемаКатегорийЗаказов";
		
		Если Не Запрос.Выполнить().Пустой() Тогда
			Отказ = Истина;
			Сообщить("Редактирование запрещено");
			Сообщить("Обнаружены данные по Схеме категорий заказов!");
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры
