Процедура УстановитьСтатусПроверкиДокумента(Параметры) Экспорт
	
	СделатьЗаписьПроверенныеДокументы(Параметры.Документ, Параметры.ДокументПроверен);
	
	Если ТипЗнч(Параметры.Документ) = Тип("ДокументСсылка.ЗакрытиеЗаказов") Тогда
		baoВызовСервера.ДобавитьЗаписьВРегистрДокументыЗакрытыеДляИзменения(Параметры.Документ, Параметры.ДокументПроверен);
	КонецЕсли; 
	
КонецПроцедуры	

Процедура СделатьЗаписьПроверенныеДокументы(Документ, ДокументПроверен) Экспорт

	//Наб = РегистрыСведений.ПроверенныеДокументы.СоздатьНаборЗаписей();
	//
	//Наб.Отбор.Период.Установить(Параметры.Период);
	//Наб.Отбор.Документ.Установить(Параметры.Документ);
	//
	//
	//Нов = Наб.Добавить();
	//ЗаполнитьЗначенияСвойств(Нов, Параметры);
	//
	//Наб.Записать();	

	МенеджерЗаписи = РегистрыСведений.ПроверенныеДокументы.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Документ = Документ;
	МенеджерЗаписи.ДокументПроверен = ДокументПроверен;
	МенеджерЗаписи.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Функция ПолучитьСтатусПроверкиДокумента(Документ) Экспорт
	
	Наб = РегистрыСведений.ПроверенныеДокументы.СрезПоследних(,Новый Структура("Документ", Документ));

	Если Наб.Количество() = 0 Тогда
		Возврат Ложь;
	Иначе
		Возврат Наб[0].ДокументПроверен;
	КонецЕсли; 
	
КонецФункции
 