&НаСервере
Функция ПроверкаНаличияДанныхВРСПолигоныОпределенияСменыМаршрутизации(НомераПолигонов = Неопределено) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПолигоныОпределенияСменыМаршрутизацииСрезПоследних.Период КАК Период,
		|	ПолигоныОпределенияСменыМаршрутизацииСрезПоследних.НомерПолигонаМаршрутизации КАК НомерПолигонаМаршрутизации,
		|	ПолигоныОпределенияСменыМаршрутизацииСрезПоследних.ПолигонУчитывается КАК ПолигонУчитывается
		|ПОМЕСТИТЬ ВТ_Полигоны
		|ИЗ
		|	РегистрСведений.ПолигоныОпределенияСменыМаршрутизации.СрезПоследних КАК ПолигоныОпределенияСменыМаршрутизацииСрезПоследних
		|ГДЕ
		|	ПолигоныОпределенияСменыМаршрутизацииСрезПоследних.НомерПолигонаМаршрутизации В(&СписокПолигонов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Полигоны.НомерПолигонаМаршрутизации КАК НомерПолигонаМаршрутизации
		|ИЗ
		|	ВТ_Полигоны КАК ВТ_Полигоны
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Полигоны КАК ВТ_ПолигоныДоп
		|		ПО ВТ_Полигоны.НомерПолигонаМаршрутизации = ВТ_ПолигоныДоп.НомерПолигонаМаршрутизации
		|			И (ВТ_ПолигоныДоп.Период > ВТ_Полигоны.Период)
		|ГДЕ
		|	ВТ_Полигоны.ПолигонУчитывается
		|	И ВТ_ПолигоныДоп.Период ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("СписокПолигонов", ПолигоныМаршрутизации.ВыгрузитьКолонку("НомерПолигона"));
	
	НомераПолигонов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НомерПолигонаМаршрутизации");
	
	Если НомераПолигонов.Количество() > 0 Тогда
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;	
	
КонецФункции	