
//**** Обработчики событий объекта ****//

//Синхронизация с КСЛ
//
Процедура ПриЗаписи(Отказ)
//херим нова	
	//Попытка
	//	новаОбменКСЛ.СохранитьКонтрагента(ЭтотОбъект);
	//Исключение
	//	#Если Клиент Тогда			
	//		новаОбщиеПроцедуры.СообщитьПользователюОбОшибке("ВнутренняОшибкаСервера", ОписаниеОшибки());
	//	#КонецЕсли
	//	Отказ = Истина;
	//КонецПопытки;
//херим нова	
КонецПроцедуры

//Синхронизация с КСЛ
//
Процедура ПередУдалением(Отказ)
	//херим нова
	//Попытка
	//	новаОбменКСЛ.УдалитьКонтрагента(ЭтотОбъект);
	//Исключение
	//	#Если Клиент Тогда			
	//		новаОбщиеПроцедуры.СообщитьПользователюОбОшибке("ВнутренняОшибкаСервера", ОписаниеОшибки());
	//	#КонецЕсли
	//	Отказ = Истина;
	//КонецПопытки;
//херим нова	
КонецПроцедуры
