
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Добавить("МодельОборудования");
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ)

	Если НЕ Ссылка.Пустая() Тогда
		
		СтараяМодель = Ссылка.МодельОборудования;
		
		Если СтараяМодель <> МодельОборудования Тогда
			
			//Отказ = СтараяМодель.ТипОборудования <> МодельОборудования.ТипОборудования;
			//
			//Если Отказ Тогда
			//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя менять модель оборудования, если тип отличается!",,"МодельОборудования","МодельОборудования",);
			//	Возврат;	
			//КонецЕсли; 
			
			СтатусОборудования = УчетОборудованияСервер.ПолучитьСтатусОборудования(ТекущаяДата(), Ссылка);
			
			Отказ = СтатусОборудования <> Перечисления.СтатусыЕдиницыОборудования.ПустаяСсылка();
			
			Если Отказ Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя менять модель оборудования, по ней ведётся учёт!",,"МодельОборудования","МодельОборудования",);
				Возврат;	
			КонецЕсли;
			
		КонецЕсли; 	
				
	КонецЕсли; 	
	
КонецПроцедуры
 
