&НаКлиенте
Процедура Печать(Команда)
	Результат.АвтоМасштаб = Истина; // уместить на одну страницу
	Результат.ТолькоПросмотр = Истина;
	Результат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Результат.Напечатать(РежимИспользованияДиалогаПечати.Использовать);
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//СтандартнаяОбработка = Ложь;
	// //Якурнов 13.09.2018 17:26:50
	// //Получаем дату из ПМ
	//
	//Если Параметры.Свойство("ДатаВСкд") Тогда
	//	ДатаФормирования =  Параметры.ДатаВСкд.ДатаПланирования;
	//КонецЕсли;
	//+Степанов Устанавливаем терминал, полученный из формы маршрутизатора.
	Отчет.ТерминалДоставки = Параметры.Терминал;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
//	Если ДатаФормирования <> Дата(1,1,1) Тогда
//		ПараметрДатаПланирования = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаПланирования");
//		ПараметрДатаПланирования.Использование = Истина;
//		ПараметрДатаПланирования.Значение  = ДатаФормирования;
//	КонецЕсли;
КонецПроцедуры

