
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.ВидНачисления.ТолькоПросмотр = Ложь;
	КонецеСли;	
	
	Элементы.СуммаПоУмолчаниюВФиксацииНачислений.Видимость = Объект.ДополнительноеНачислениеИспользуетсяВФиксацииНачислений;
	
	//Асеев 01.08.2024 (Задача № 5299)>>>
	Элементы.ДекорацияНачислениеНеАктуально.Видимость = Объект.НачислениеНеАктуально;
	//Асеев 01.08.2024 (Задача № 5299)<<<

КонецПроцедуры

&НаКлиенте
Процедура ВидНачисленияПриИзменении(Элемент)
	Если Объект.ВидНачисления = Перечисления.зпВидыНачислений.ДополнительноеНачисление Тогда
		Элементы.ДополнительноеНачислениеИспользуетсяВФиксацииНачислений.Доступность = Истина;
	Иначе
		Элементы.ДополнительноеНачислениеИспользуетсяВФиксацииНачислений.Доступность = Ложь;
	КонецеСли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Вставить содержимое обработчика.
	ВидНачисленияПриИзменении(Неопределено);
КонецПроцедуры

&НаСервере
Процедура ДополнительноеНачислениеИспользуетсяВФиксацииНачисленийПриИзмененииНаСервере()
	
	Элементы.СуммаПоУмолчаниюВФиксацииНачислений.Видимость = Объект.ДополнительноеНачислениеИспользуетсяВФиксацииНачислений;
	Если Не Объект.ДополнительноеНачислениеИспользуетсяВФиксацииНачислений Тогда
		Объект.СуммаПоУмолчаниюВФиксацииНачислений = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительноеНачислениеИспользуетсяВФиксацииНачисленийПриИзменении(Элемент)
	ДополнительноеНачислениеИспользуетсяВФиксацииНачисленийПриИзмененииНаСервере();
КонецПроцедуры
