Процедура ЗапроситьЖурналЗвонков() Экспорт
	#Если МобильноеПриложениеКлиент Тогда
		ЖурналЗв = СредстваТелефонии.ПолучитьЖурналЗвонков();
		МассивЗаписей = ЖурналЗв.НайтиЗаписи();
		
		Для Каждого Звонок Из МассивЗаписей Цикл
			Типзвонка = 0;
			Если Звонок.ТипЗвонка = ТипЗвонкаЖурналаЗвонков.Входящий Тогда
				ТипЗвонка = 1;
			ИначеЕсли Звонок.ТипЗвонка = ТипЗвонкаЖурналаЗвонков.Исходящий Тогда
				ТипЗвонка = 2;
			ИначеЕсли Звонок.ТипЗвонка = ТипЗвонкаЖурналаЗвонков.Пропущенный Тогда
				ТипЗвонка = 3;
			КонецеСли;
			
			Струк = Новый Структура;
			Струк.Вставить("Дата", Звонок.Дата);
			Струк.Вставить("НомерТелефона", Звонок.НомерТелефона);
			
			ОбщийМодуль.ЗаписатьЗвонокВРегистр(Струк, ТипЗвонка);
		КонецЦикла;
	#КонецЕсли	
КонецПроцедуры	


Процедура СформироватьУведомления(Мас) Экспорт
	#Если МобильноеПриложениеКлиент Тогда
		Для Каждого Тек Из Мас Цикл
			Уведомление = Новый ДоставляемоеУведомление;
			Уведомление.Заголовок = "Нет статуса! Заказ " + СокрЛП(Тек.Номер);
			Уведомление.Данные = "ЗвонокКлиентуПоУведомлениюМП" + СокрЛП(Тек.Номер);//Тек.Телефон;
			Уведомление.Текст = "Нет статуса! Заказ " + СокрЛП(Тек.Номер) + ", срочно созвонитесь с получателем!";
			ДоставляемыеУведомления.ДобавитьЛокальноеУведомление(Уведомление);
		КонецЦикла;
	#КонецЕсли
КонецПроцедуры	
