
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ТипДанных = ТипЗнч(ДанныеЗаполнения);
	Если ТипДанных = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
	Пользователь = ПараметрыСеанса.ТекущийПользователь;
	//ТерминалОбработки = ПараметрыСеанса.ТерминалДоставки;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.СтатусыДвиженияПриложенныхДокументов.Записывать = Истина;
	Движения.СтатусыДвиженияПриложенныхДокументов.Очистить();
	
	//СопроводительныеДокументы = Справочники.ВидыПриложенныхДокументов.СопроводительныеДокументы;
	ДокументыПоступилиВТКОтПартнера = Справочники.СтатусыДвиженияПриложенныхДокументов.ДокументыПоступилиВТКОтПартнера;
	
	Для Каждого СтрокаЗаказа Из Заказы Цикл
		Движение = Движения.СтатусыДвиженияПриложенныхДокументов.Добавить();
		Движение.Период = Дата;
		Движение.Регион = ТерминалОбработки;
		Движение.Заказ = СтрокаЗаказа.Заказ;
		Движение.ВидПриложенногоДокумента = СтрокаЗаказа.ВидПриложенногоДокумента;
		Движение.Статус = ДокументыПоступилиВТКОтПартнера;
		Движение.Рейс = СтрокаЗаказа.Рейс;
	КонецЦикла;
	
КонецПроцедуры
