
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр мгЗарплатаНачисления Приход
	//Движения.мгЗарплатаНачисления.Записывать = Истина;
	//Движения.мгЗарплатаНачисления.Очистить();
	//Для Каждого ТекСтрокаСписокДоставок Из СписокДоставок Цикл
	//	Движение = Движения.мгЗарплатаНачисления.Добавить();
	//	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	//	Движение.Период = Дата;
	//	Движение.Организация = ТекСтрокаСписокДоставок.Организация;
	//	Движение.Терминал = Терминал;
	//	Движение.ВидНачисления = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.ТарифПоКонтрагенту");
	//	Движение.Сотрудник = ТекСтрокаСписокДоставок.Сотрудник;
	//	Движение.Тариф = ТекСтрокаСписокДоставок.Тариф;
	//КонецЦикла;

	// регистр мгНачислениеПоИсключениям
	Движения.мгНачислениеПоИсключениям.Записывать = Истина;
	Движения.мгНачислениеПоИсключениям.Очистить();
	Для Каждого ТекСтрокаСписокДоставок Из СписокДоставок Цикл
		Движение = Движения.мгНачислениеПоИсключениям.Добавить();
		Движение.Период = ТекСтрокаСписокДоставок.ДатаСмены;
		Движение.Терминал = Терминал;
		Движение.Сотрудник = ТекСтрокаСписокДоставок.Сотрудник;
		Движение.Контрагент = ТекСтрокаСписокДоставок.Контрагент;
		Движение.Тариф = ТекСтрокаСписокДоставок.Тариф;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
