Процедура ОбработкаОчередиОтправкиОтчетовРегламент() Экспорт
	
КонецПроцедуры	

Процедура ПоставитьОтчетВОчередь(Контрагент, ВидОтчета, ТипРассылки, ПараметрыОтчета, ПоставленВОчередьЧерезСервис = Ложь) Экспорт
	Наб = РегистрыСведений.ОчередьОтчетовКОтправке.СоздатьНаборЗаписей();
	
	ТекВр = ТекущаяДата();
	
	Наб.Отбор.Партнер.Установить(Контрагент);
	Наб.Отбор.ВидОтправляемогоОтчета.Установить(ВидОтчета);
	Наб.Отбор.Период.Установить(ТекВр);
	
	Нов = Наб.Добавить();
	
	Нов.Партнер = Контрагент;
	Нов.ВидОтправляемогоОтчета = ВидОтчета;
	Нов.ЭтапОтправки = Перечисления.ЭтапыОтправкиОтчетов.ПоставленВОчередьОтправки;
	Нов.ТипРассылки = ТипРассылки;
	
	Нов.Период = ТекВр;
	//Нов.НачалоПериода = ПараметрыОтчета.
КонецПроцедуры	