
Процедура ПриЗаписи(Отказ, Замещение)
		
	Перем ОбновлятьЗначениеГлПеременной;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	КэшНастроекПользователей = глЗначениеПеременной("ЗначенияНастроекПользователей");
	УправлениеПользователями.ИнформироватьОИзмененииНастроекПравАктивныхПользователей(ЭтотОбъект, 
																					  КэшНастроекПользователей, 
																					  "Настройка",
																					  глЗначениеПеременной("глТекущийПользователь"), 
																					  "значения настроек",
																					  ОбновлятьЗначениеГлПеременной);
																					  
	Если ОбновлятьЗначениеГлПеременной Тогда
		глЗначениеПеременнойУстановить("ЗначенияНастроекПользователей", КэшНастроекПользователей, Истина);
	КонецЕсли;																						  
	
КонецПроцедуры
