
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктураЗаписи = Новый Структура("Контрагент, ТипРассылки, Почта, Активна");

	ЭтоВводНового = Истина;
	
	Если ЗначениеЗаполнено(Параметры.Ключ.Контрагент) Тогда
		ЭтоРедактирование = Истина;
		ЭтоКопирование = Ложь;
		ЭтоВводНового = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования.Контрагент) Тогда
		ЭтоРедактирование = Ложь;
		ЭтоКопирование = Истина;
		ЭтоВводНового = Ложь;
	КонецЕсли;	
	
	Если Параметры.Ключ.Период = Дата(1,1,1) Тогда
		Если Параметры.ЗначенияЗаполнения.Свойство("ТипРассылки") Тогда
			Запись.ТипРассылки = Параметры.ЗначенияЗаполнения.ТипРассылки;
			Запись.Активна = Истина;
			ФлагСозданиеИзКонтрагента = Истина;
		КонецЕсли;
	КонецЕсли;	
	
	Если ЭтоРедактирование Тогда
		ЗаполнитьЗначенияСвойств(СтруктураЗаписи, Параметры.Ключ);
		ПредыдущееЗначениеЗаписи = СтруктураЗаписи;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ФлагСозданиеИзКонтрагента Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.Почта;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если  Модифицированность Тогда
		
		ОбработатьЗаписиРассылокПодчиненныхКонтрагентов();
		
	КонецЕсли;
	
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьЗаписиРассылокПодчиненныхКонтрагентов()
	
	СписокПодчиненных = РегистрыСведений.РассылкиКонтрагентов.СписокПодчиненныхКонтрагентов(Запись.Контрагент);
	
	Если ПредыдущееЗначениеЗаписи = Неопределено Тогда
		ЗначениеПочта = Запись.Почта;
		ЗначениеТипРассылки = Запись.ТипРассылки;
		ЗначениеАктивна = Запись.Активна;		
	Иначе
		ЗначениеПочта = ПредыдущееЗначениеЗаписи.Почта;
		ЗначениеТипРассылки = ПредыдущееЗначениеЗаписи.ТипРассылки;
		ЗначениеАктивна = ПредыдущееЗначениеЗаписи.Активна;
	КонецЕсли;
	
	РассылкиПодчиненныхКонтрагентов = РегистрыСведений.РассылкиКонтрагентов.СписокПодчиненныхРассылокПоРодителю(Запись.Контрагент, ЗначениеТипРассылки, ЗначениеПочта);
	
	Для Каждого ПодчиненныйКонтрагент Из СписокПодчиненных Цикл
		
		РассылкаПодчиненного = РассылкиПодчиненныхКонтрагентов.Найти(ПодчиненныйКонтрагент, "Контрагент");
		
		ЗаписьПодчиненного = регистрыСведений.РассылкиКонтрагентов.СоздатьМенеджерЗаписи();

		Если НЕ РассылкаПодчиненного = Неопределено Тогда
			ЗаписьПодчиненного.Контрагент = РассылкаПодчиненного.Контрагент;
			ЗаписьПодчиненного.ТипРассылки = РассылкаПодчиненного.ТипРассылки;
			ЗаписьПодчиненного.Почта = РассылкаПодчиненного.Почта;
			ЗаписьПодчиненного.Активна = РассылкаПодчиненного.Активна;
			ЗаписьПодчиненного.Прочитать();
		КонецЕсли;			
				
		ЗаписьПодчиненного.Контрагент = ПодчиненныйКонтрагент;
		ЗаписьПодчиненного.ТипРассылки = Запись.ТипРассылки;
		ЗаписьПодчиненного.Почта = Запись.Почта;
		ЗаписьПодчиненного.Активна = Запись.Активна;

		ЗаписьПодчиненного.Записать(Истина);
		
	КонецЦикла;	
	
КонецПроцедуры	

#КонецОбласти
