
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движение = Движения.новаКорректировкаКалендаряВозможныхРейсов.Добавить();
	ЗаполнитьЗначенияСвойств(Движение, ЭтотОбъект, "Транспорт, Водитель, НачалоПериода, Отменен");
	Если Не Отменен Тогда
		ЗаполнитьЗначенияСвойств(Движение, ЭтотОбъект);
	КонецЕсли;
	
	Если Не Отменен Тогда
		ПеренесенныйТранспорт = ?(ЗначениеЗаполнено(НовыйТранспорт), НовыйТранспорт, Транспорт);
		ПеренесенныйВодитель = ?(ЗначениеЗаполнено(НовыйВодитель), НовыйВодитель, Водитель);
		
		Если Транспорт <> ПеренесенныйТранспорт Или Водитель <> ПеренесенныйВодитель Тогда
			Движение = Движения.новаКорректировкаКалендаряВозможныхРейсов.Добавить();
			Движение.Транспорт = ПеренесенныйТранспорт;
			Движение.Водитель = ПеренесенныйВодитель;
			Движение.НачалоПериода = НачалоПериода;
			Движение.Отменен = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
