
&НаКлиенте
Процедура РежимСканированияПриИзменении(Элемент)
	//ЭтаФорма.Закрыть(РежимСканирования);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//РежимСканирования = ПредопределенноеЗначение("Перечисление.РежимыСканирования.Приход");
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПриходНажатие(Элемент)
	ЭтаФорма.Закрыть( ПредопределенноеЗначение("Перечисление.РежимыСканирования.Приход"));
КонецПроцедуры


&НаКлиенте
Процедура ДекорацияДоставкаНажатие(Элемент)
	ЭтаФорма.Закрыть( ПредопределенноеЗначение("Перечисление.РежимыСканирования.ПередачаНаДоставку"));
КонецПроцедуры


&НаКлиенте
Процедура ДекорацияНеВлезлоНажатие(Элемент)
	ЭтаФорма.Закрыть( ПредопределенноеЗначение("Перечисление.РежимыСканирования.НепогруженныеЗаказы"));
КонецПроцедуры

