
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	От = Вопрос("Будет очищены текущие данные по заказам. Продолжить?", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
	Если От = КодВозвратаДиалога.Да Тогда
		УдалитьДокументыНаСервере();
	КонецеСли;
КонецПроцедуры

Процедура УдалитьДокументыНаСервере()
	Выб = Документы.Заказ.Выбрать(НачалоДня(ТекущаяДата()), КонецДня(ТекущаяДата()));
	Пока Выб.Следующий() Цикл
		Об = Выб.ПолучитьОбъект();
		Об.Удалить();
	КонецЦикла;	
	
	Выб = Документы.ДанныеЗаказаВодителя.Выбрать(НачалоДня(ТекущаяДата()), КонецДня(ТекущаяДата()));
	Пока Выб.Следующий() Цикл
		Об = Выб.ПолучитьОбъект();
		Об.Удалить();
	КонецЦикла;	
КонецПроцедуры	
