
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Пар = 0;
	//Если Не ВвестиСтроку(Пар, "Введите пароль админа..") Тогда
	//	Отказ = Истина;
	//ИначеЕсли Пар <> ПолучитьПарольАдмина() Тогда
	//	Отказ = Истина;
	//КонецеСли;	
	
	
	//Ф = ПолучитьФорму("ОбщаяФорма.Авторизация");
	//Ф.Админ = Истина;
	//Ф.ОткрытьМодально();
	//Если Не Ф.Авторизован Тогда 
	//	Отказ = Истина;
	//КонецеСли;	
	ПараметрыФ = Новый Структура;
	параметрыФ.Вставить("Администратор", Истина);
	
	Ответ = Неопределено;

	
	ОткрытьФорму("ОбщаяФорма.Авторизация", ПараметрыФ,,,,, Новый ОписаниеОповещения("ПриОткрытииЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Ответ = Результат;
	Если Ответ <> "Ok" Тогда
		Закрыть();
	КонецеСли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЛог(Команда)
	ОткрытьФорму("РегистрСведений.ЛогОшибокОбмена.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПараметрыЧеков(Команда)
	// Вставить содержимое обработчика.
	ОткрытьФорму("РегистрСведений.ПараметрыЧеков.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокОрганизаций(Команда)
	// Вставить содержимое обработчика.
	ОткрытьФорму("Справочник.Организации.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЛогОтправкиСМС(Команда)
	ОткрытьФорму("РегистрСведений.РассылкаСМС.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПрикрепленныеФайлы(Команда)
	// Вставить содержимое обработчика.
	ОткрытьФорму("РегистрСведений..ПрикрепленныеФайлы.ФормаСписка");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	#Если МобильноеПриложениеКлиент Тогда
		Элементы.ГруппаСтраницаСБП.Видимость = Ложь;
	#Иначе
	#КонецЕсли
КонецПроцедуры
