
&НаКлиенте
Процедура Заполнить(Команда)
	Если Объект.Данные.Количество() <> 0 тогда
		От = Вопрос("Табличная часть не пуста. При заполнении она будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
		Если От = КодВозвратаДиалога.Да Тогда
			Объект.Данные.Очистить();
		Иначе
			Возврат;
		КонецеСли;	
	КонецЕсли;
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РаботникиОрганизации.Сотрудник КАК Сотрудник,
	|	МАКСИМУМ(РаботникиОрганизации.Период) КАК Период
	|ПОМЕСТИТЬ вр_РаботникиОрганизации
	|ИЗ
	|	РегистрСведений.РаботникиОрганизации КАК РаботникиОрганизации
	|
	|СГРУППИРОВАТЬ ПО
	|	РаботникиОрганизации.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_РаботникиОрганизации.Сотрудник КАК Сотрудник,
	|	вр_РаботникиОрганизации.Период КАК Период,
	|	РаботникиОрганизации.Организация КАК Организация,
	|	РаботникиОрганизации.Состояние КАК Состояние,
	|	РаботникиОрганизации.Должность КАК Должность
	|ПОМЕСТИТЬ втРаботники
	|ИЗ
	|	вр_РаботникиОрганизации КАК вр_РаботникиОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизации КАК РаботникиОрганизации
	|		ПО вр_РаботникиОрганизации.Сотрудник = РаботникиОрганизации.Сотрудник
	|			И вр_РаботникиОрганизации.Период = РаботникиОрганизации.Период
	|ГДЕ
	|	НЕ РаботникиОрганизации.Регистратор ССЫЛКА Документ.УвольнениеСРаботыИзОрганизация
	|	И НЕ РаботникиОрганизации.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиОрганизаций.ВодительЗаборщик)
	|	И НЕ ЕСТЬNULL(РаботникиОрганизации.Сотрудник.ПешийКурьер, ЛОЖЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗакрытиеЗаказовЗаказы.Ссылка КАК Ссылка,
	|	ЗакрытиеЗаказовЗаказы.НомерСтроки КАК НомерСтроки,
	|	ЗакрытиеЗаказовЗаказы.Реализация КАК Заказ,
	|	ЗакрытиеЗаказовЗаказы.ТипЗаказа КАК ТипЗаказа,
	|	ЗакрытиеЗаказовЗаказы.Водитель КАК Сотрудник,
	|	ЗакрытиеЗаказовЗаказы.РезультатДоставки КАК РезультатДоставки,
	|	ВЫБОР
	|		КОГДА ЗакрытиеЗаказовЗаказы.ПричинаНевыполнения = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ОтказКлиентаСЗаездом)
	|			ТОГДА ЗакрытиеЗаказовЗаказы.ДанныеМПВодителя.ПричинаНеВыполненияДоставки
	|		ИНАЧЕ ЗакрытиеЗаказовЗаказы.ПричинаНевыполнения
	|	КОНЕЦ КАК ПричинаНевыполнения,
	|	НАЧАЛОПЕРИОДА(ЗакрытиеЗаказовЗаказы.Реализация.Дата, ДЕНЬ) КАК ОтработанныйДень,
	|	ВЫБОР
	|		КОГДА ЗакрытиеЗаказовЗаказы.ПричинаНевыполнения = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ОтказКлиентаСЗаездом)
	|			ТОГДА ВЫБОР
	|					КОГДА ЗакрытиеЗаказовЗаказы.ДанныеМПВодителя.ПричинаНеВыполненияДоставки = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ОтказКлиентаБезЗаезда)
	|						ТОГДА 0
	|					ИНАЧЕ 1
	|				КОНЕЦ
	|		КОГДА (ЗакрытиеЗаказовЗаказы.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.Выполнена)
	|				ИЛИ ЗакрытиеЗаказовЗаказы.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.ПустаяСсылка)
	|				ИЛИ ЗакрытиеЗаказовЗаказы.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.ВыполненаЧастично))
	|				И ЗакрытиеЗаказовЗаказы.Закрыть
	|			ТОГДА 1
	|		КОГДА ЗакрытиеЗаказовЗаказы.ПричинаНевыполнения = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ПереносСЗаездом)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВыполненныйЗаказ
	|ПОМЕСТИТЬ втЗаказыВыполненные
	|ИЗ
	|	Документ.ЗакрытиеЗаказов.Заказы КАК ЗакрытиеЗаказовЗаказы
	|ГДЕ
	|	ЗакрытиеЗаказовЗаказы.Ссылка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (ЗакрытиеЗаказовЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
	|			ИЛИ ЗакрытиеЗаказовЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор)
	|			ИЛИ ЗакрытиеЗаказовЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Фрахт))
	|	И ЗакрытиеЗаказовЗаказы.Водитель <> ЗНАЧЕНИЕ(Справочник.новаВодители.ПустаяСсылка)
	|	И ЗакрытиеЗаказовЗаказы.Ссылка.ТерминалДоставки = &Терминал
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗакрытиеЗаказовЗаказы.Ссылка,
	|	ЗакрытиеЗаказовЗаказы.НомерСтроки,
	|	ЗакрытиеЗаказовЗаказы.Реализация,
	|	ЗакрытиеЗаказовЗаказы.ТипЗаказа,
	|	ЗакрытиеЗаказовЗаказы.Экспедитор,
	|	ЗакрытиеЗаказовЗаказы.РезультатДоставки,
	|	ВЫБОР
	|		КОГДА ЗакрытиеЗаказовЗаказы.ПричинаНевыполнения = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ОтказКлиентаСЗаездом)
	|			ТОГДА ЗакрытиеЗаказовЗаказы.ДанныеМПВодителя.ПричинаНеВыполненияДоставки
	|		ИНАЧЕ ЗакрытиеЗаказовЗаказы.ПричинаНевыполнения
	|	КОНЕЦ,
	|	НАЧАЛОПЕРИОДА(ЗакрытиеЗаказовЗаказы.Реализация.Дата, ДЕНЬ),
	|	ВЫБОР
	|		КОГДА ЗакрытиеЗаказовЗаказы.ПричинаНевыполнения = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ОтказКлиентаСЗаездом)
	|			ТОГДА ВЫБОР
	|					КОГДА ЗакрытиеЗаказовЗаказы.ДанныеМПВодителя.ПричинаНеВыполненияДоставки = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ОтказКлиентаБезЗаезда)
	|						ТОГДА 0
	|					ИНАЧЕ 1
	|				КОНЕЦ
	|		КОГДА (ЗакрытиеЗаказовЗаказы.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.Выполнена)
	|				ИЛИ ЗакрытиеЗаказовЗаказы.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.ПустаяСсылка)
	|				ИЛИ ЗакрытиеЗаказовЗаказы.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.ВыполненаЧастично))
	|				И ЗакрытиеЗаказовЗаказы.Закрыть
	|			ТОГДА 1
	|		КОГДА ЗакрытиеЗаказовЗаказы.ПричинаНевыполнения = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ПереносСЗаездом)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	Документ.ЗакрытиеЗаказов.Заказы КАК ЗакрытиеЗаказовЗаказы
	|ГДЕ
	|	ЗакрытиеЗаказовЗаказы.Ссылка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (ЗакрытиеЗаказовЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
	|			ИЛИ ЗакрытиеЗаказовЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор)
	|			ИЛИ ЗакрытиеЗаказовЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Фрахт))
	|	И ЗакрытиеЗаказовЗаказы.Экспедитор <> ЗНАЧЕНИЕ(Справочник.новаЭкспедиторы.ПустаяСсылка)
	|	И ЗакрытиеЗаказовЗаказы.Ссылка.ТерминалДоставки = &Терминал
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗакрытиеЗаказовЗаказы.Ссылка КАК Ссылка,
	|	ЗакрытиеЗаказовЗаказы.НомерСтроки КАК НомерСтроки,
	|	ЗакрытиеЗаказовЗаказы.Реализация КАК Заказ,
	|	ЗакрытиеЗаказовЗаказы.ТипЗаказа КАК ТипЗаказа,
	|	ЗакрытиеЗаказовЗаказы.Водитель КАК Сотрудник,
	|	ЗакрытиеЗаказовЗаказы.РезультатДоставки КАК РезультатДоставки,
	|	ЗакрытиеЗаказовЗаказы.ПричинаНевыполнения КАК ПричинаНевыполнения,
	|	1 КАК ЗаказНомер
	|ПОМЕСТИТЬ втЗаказыВсе
	|ИЗ
	|	Документ.ЗакрытиеЗаказов.Заказы КАК ЗакрытиеЗаказовЗаказы
	|ГДЕ
	|	ЗакрытиеЗаказовЗаказы.Ссылка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (ЗакрытиеЗаказовЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
	|			ИЛИ ЗакрытиеЗаказовЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор)
	|			ИЛИ ЗакрытиеЗаказовЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Фрахт))
	|	И ЗакрытиеЗаказовЗаказы.Водитель <> ЗНАЧЕНИЕ(Справочник.новаВодители.ПустаяСсылка)
	|	И ЗакрытиеЗаказовЗаказы.Ссылка.ТерминалДоставки = &Терминал
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗакрытиеЗаказовЗаказы.Ссылка,
	|	ЗакрытиеЗаказовЗаказы.НомерСтроки,
	|	ЗакрытиеЗаказовЗаказы.Реализация,
	|	ЗакрытиеЗаказовЗаказы.ТипЗаказа,
	|	ЗакрытиеЗаказовЗаказы.Экспедитор,
	|	ЗакрытиеЗаказовЗаказы.РезультатДоставки,
	|	ЗакрытиеЗаказовЗаказы.ПричинаНевыполнения,
	|	1
	|ИЗ
	|	Документ.ЗакрытиеЗаказов.Заказы КАК ЗакрытиеЗаказовЗаказы
	|ГДЕ
	|	ЗакрытиеЗаказовЗаказы.Ссылка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (ЗакрытиеЗаказовЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
	|			ИЛИ ЗакрытиеЗаказовЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор)
	|			ИЛИ ЗакрытиеЗаказовЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Фрахт))
	|	И ЗакрытиеЗаказовЗаказы.Экспедитор <> ЗНАЧЕНИЕ(Справочник.новаЭкспедиторы.ПустаяСсылка)
	|	И ЗакрытиеЗаказовЗаказы.Ссылка.ТерминалДоставки = &Терминал
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втЗаказыВыполненные.Сотрудник КАК Сотрудник,
	|	СУММА(втЗаказыВыполненные.ВыполненныйЗаказ) КАК ВыполненныеЗаказы
	|ПОМЕСТИТЬ втИтогВыполненные
	|ИЗ
	|	втЗаказыВыполненные КАК втЗаказыВыполненные
	|
	|СГРУППИРОВАТЬ ПО
	|	втЗаказыВыполненные.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втЗаказыВсе.Сотрудник КАК Сотрудник,
	|	СУММА(втЗаказыВсе.ЗаказНомер) КАК ВсегоЗаказов
	|ПОМЕСТИТЬ втИтогВсе
	|ИЗ
	|	втЗаказыВсе КАК втЗаказыВсе
	|
	|СГРУППИРОВАТЬ ПО
	|	втЗаказыВсе.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	мгЗарплатаНачисленияОстатки.Сотрудник КАК Сотрудник,
	|	СУММА(мгЗарплатаНачисленияОстатки.ТарифОстаток) КАК ВсегоНачислено
	|ПОМЕСТИТЬ втВсегоНачислено
	|ИЗ
	|	РегистрНакопления.мгЗарплатаНачисления.Остатки(
	|			&КонецПериода,
	|			ВЫБОР
	|				КОГДА &ОтборТерминала
	|					ТОГДА Терминал = &Терминал
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ) КАК мгЗарплатаНачисленияОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	мгЗарплатаНачисленияОстатки.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втИтогВсе.Сотрудник КАК Сотрудник,
	|	втИтогВыполненные.ВыполненныеЗаказы / втИтогВсе.ВсегоЗаказов КАК ПроцентВыполнения,
	|	втВсегоНачислено.ВсегоНачислено КАК ВсегоНачислено,
	|	ВЫБОР
	|		КОГДА втИтогВыполненные.ВыполненныеЗаказы / втИтогВсе.ВсегоЗаказов < 0.85
	|			ТОГДА втВсегоНачислено.ВсегоНачислено * 0.1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Депримирование
	|ПОМЕСТИТЬ втИтог
	|ИЗ
	|	втИтогВсе КАК втИтогВсе
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втВсегоНачислено КАК втВсегоНачислено
	|		ПО втИтогВсе.Сотрудник = втВсегоНачислено.Сотрудник
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втИтогВыполненные КАК втИтогВыполненные
	|		ПО втИтогВсе.Сотрудник = втИтогВыполненные.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРаботники.Сотрудник КАК Сотрудник,
	|	втИтог.Депримирование КАК Сумма,
	|	втРаботники.Организация КАК Организация
	|ИЗ
	|	втРаботники КАК втРаботники
	|		ЛЕВОЕ СОЕДИНЕНИЕ втИтог КАК втИтог
	|		ПО втРаботники.Сотрудник = втИтог.Сотрудник
	|ГДЕ
	|	втИтог.Депримирование <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	втРаботники.Сотрудник.Наименование";
	
	Запрос.УстановитьПараметр("НачалоПериода", Объект.ПериодРегистрации);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.ПериодРегистрации));
	Запрос.УстановитьПараметр("Терминал", Объект.Терминал);
	//Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Если ЗначениеЗаполнено(Объект.Терминал) Тогда
		Запрос.УстановитьПараметр("ОтборТерминала", Истина);
	Иначе 
		Запрос.УстановитьПараметр("ОтборТерминала", Ложь);
	КонецЕсли;
	Результат = Запрос.Выполнить();
	Объект.Данные.Загрузить(Результат.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцСтрокаПриИзменении(Элемент)
	
	РаботаСДиалогами.ДатаКакМесяцПодобратьДатуПоТексту(МесяцСтрока, Объект.ПериодРегистрации);
	МесяцСтрока = РаботаСДиалогами.ДатаКакМесяцПредставление(Объект.ПериодРегистрации);
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцСтрокаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	Объект.ПериодРегистрации = ДобавитьМесяц(Объект.ПериодРегистрации, Направление);
	МесяцСтрока = РаботаСДиалогами.ДатаКакМесяцПредставление(Объект.ПериодРегистрации);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ПериодРегистрации = НачалоМесяца(Объект.Дата);
	КонецЕсли;
	
	// Заполним реквизит формы МесяцСтрока.
	МесяцСтрока = РаботаСДиалогами.ДатаКакМесяцПредставление(Объект.ПериодРегистрации);
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеСотрудникПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Данные.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.Сотрудник) Тогда
		ДанныеСотрудника = мгДоработки.ПолучитьОрганизациюСотрудника(ТекущиеДанные.Сотрудник);
		Если ДанныеСотрудника.Количество() = 0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Сотрудник не принят ни в одну организацию";
			Сообщение.Сообщить();
		ИначеЕсли ДанныеСотрудника.Количество() > 1 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Сотрудник принят в несколько организаций, необходимо выбрать организацию сотрудника";
			Сообщение.Сообщить();
		Иначе
			ТекущиеДанные.Организация = ДанныеСотрудника[0].Организация;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПриИзменении(Элемент)
	Объект.Данные.Сортировать("Сотрудник");
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.Ответственный = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойОтветственный");
КонецПроцедуры
