Функция Сформировать(Период, Терминал = Неопределено) Экспорт
    СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");

    //создадим компоновщик настроек и загрузим настройки по умолчанию, вместо настроек по умолчанию можно использовать восстановленные настройки
    КомпоновщикНастроек2 = Новый КомпоновщикНастроекКомпоновкиДанных();
    КомпоновщикНастроек2.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
    КомпоновщикНастроек2.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
    Настройки = КомпоновщикНастроек2.Настройки;
    
     //установка параметров отчета, без КомпоновщикНастроекКомпоновкиДанных делать это гораздо сложнее
    Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Период", Период);
	
	// МАС - 21.12.2017 - №2140 --->> 
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ТерминалДоставки", Терминал);
	// <<--- МАС 
	
    
    
    ////Добавляем отбор если есть Контрагент в параметрах
    //Если Контрагент <> Неопределено Тогда  
    //    НовыйЭлементОтбора = Настройки.Отбор.Элементы.
    //    Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    //    
    //    ПолеОтбора = Новый ПолеКомпоновкиДанных("Контрагент");
    //    
    //    НовыйЭлементОтбора.ЛевоеЗначение  = ПолеОтбора;
    //    НовыйЭлементОтбора.Использование  = Истина;
    //    НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
    //    НовыйЭлементОтбора.ПравоеЗначение = Контрагент;
    //ИначеЕсли КонтрагеныИсключения <> Неопределено Тогда
    //    НовыйЭлементОтбора = Настройки.Отбор.Элементы.
    //    Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    //    
    //    ПолеОтбора = Новый ПолеКомпоновкиДанных("Контрагент");
    //    
    //    НовыйЭлементОтбора.ЛевоеЗначение  = ПолеОтбора;
    //    НовыйЭлементОтбора.Использование  = Истина;
    //    НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеВСписке;
    //    НовыйЭлементОтбора.ПравоеЗначение = КонтрагеныИсключения;
    //КонецЕсли;

    
    //Помещаем в переменную данные о расшифровке данных - здесь ненужный пункт, но пусть будет.
    ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;

    //Формируем макет, с помощью компоновщика макета
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

    //Передаем в макет компоновки схему, настройки и данные расшифровки
    МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);

    //Выполним компоновку с помощью процессора компоновки
    ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);

    //Очищаем поле табличного документа
    Результат = Новый ТабличныйДокумент();
    //Выводим результат в табличный документ
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(Результат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
    ////Проверка на пустоту если не указан контрагент
    //Если Контрагент <> Неопределено Тогда 
    //    Возврат Результат;
    //Иначе
        Если (Результат.ВысотаТаблицы-Результат.ФиксацияСверху)>1 Тогда
            Возврат Результат;
        Иначе
            Возврат Неопределено;
        КонецЕсли;
    //КонецЕсли;
    
КонецФункции	

//Геннадий 24.12.2021 ++
//задача по переписке: Re:Отчет по неуехавшим заказам (Москва) от 24.12.2021
Функция СформироватьВариантПоИнтернетМагазинам(Период, Терминал = Неопределено) Экспорт
    СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");

    //создадим компоновщик настроек и загрузим настройки по умолчанию, вместо настроек по умолчанию можно использовать восстановленные настройки
    КомпоновщикНастроек2 = Новый КомпоновщикНастроекКомпоновкиДанных();
    КомпоновщикНастроек2.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	
	ВариантНастройкиИП = СхемаКомпоновкиДанных.ВариантыНастроек.Получить(1);//Вариант "ПоИнтернетМагазину"
	КомпоновщикНастроек2.ЗагрузитьНастройки(ВариантНастройкиИП.Настройки);
	
	Настройки = КомпоновщикНастроек2.Настройки;
     //установка параметров отчета, без КомпоновщикНастроекКомпоновкиДанных делать это гораздо сложнее
    Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Период", Период);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ТерминалДоставки", Терминал);
	
    //Помещаем в переменную данные о расшифровке данных - здесь ненужный пункт, но пусть будет.
    ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;

    //Формируем макет, с помощью компоновщика макета
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

    //Передаем в макет компоновки схему, настройки и данные расшифровки
    МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);

    //Выполним компоновку с помощью процессора компоновки
    ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);

    //Очищаем поле табличного документа
    Результат = Новый ТабличныйДокумент();
    //Выводим результат в табличный документ
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(Результат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Если (Результат.ВысотаТаблицы-Результат.ФиксацияСверху)>1 Тогда
		Возврат Результат;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
    
КонецФункции	
//Геннадий 24.12.2021 --

