
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаДокумента" ИЛИ ВидФормы = "ФормаОбъекта" Тогда
		
		Если Параметры.Свойство("Основание") Тогда			
			Если ТипЗнч(Параметры.Основание) = Тип("ДокументСсылка.ПриходЗаказовНаСклад") Тогда	
				СтандартнаяОбработка = Ложь;	
				ВыбраннаяФорма = "ФормаДокументаОперативнаяПриемка";	
			КонецЕсли;			
		КонецЕсли;			
		
		Если Параметры.Свойство("Ключ") И ЗначениеЗаполнено(Параметры.Ключ) Тогда			
			Если Параметры.Ключ.ОперативнаяПриемкаЗаказов Тогда			
				СтандартнаяОбработка = Ложь;	
				ВыбраннаяФорма = "ФормаДокументаОперативнаяПриемка";			
			КонецЕсли;		
		КонецЕсли;						
	
	КонецЕсли;			
	
КонецПроцедуры
