
&НаКлиенте
Процедура ОткрытьРеализацию(Команда)
	СсылкаРеал = ПолучитьСсылкуНаРеализациюНаСервере();
	Если СсылкаРеал <> Неопределено Тогда
		ПоказатьЗначение(,СсылкаРеал);
	КонецЕсли;
КонецПроцедуры


&НаСервере
Функция ПолучитьСсылкуНаРеализациюНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Номер = &Номер";

	Запрос.УстановитьПараметр("Номер", Объект.Номер);
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура ВремяОтправленияСМинутыНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	Элементы.ВремяОтправленияСМинуты.СписокВыбора.Очистить();
	
	НачальнаяДата = НачалоДня(ТекущаяДата());
	
	СписокВремени = Новый СписокЗначений;
	
	Для х=0 По 47 Цикл
		
		нДата = НачальнаяДата + х*60*30;
	                     
		Элементы.ВремяОтправленияСМинуты.СписокВыбора.Добавить(нДата); 	
	
	КонецЦикла; 

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеСписковДат(СтрНазванияЭлемента,НачальнаяДатаЭл)
	Элементы[СтрНазванияЭлемента].СписокВыбора.Очистить();
	НачальнаяДата = НачалоДня(НачальнаяДатаЭл);
	Для х=0 По 47 Цикл
		нДата = НачальнаяДата + х*60*30;
		Элементы[СтрНазванияЭлемента].СписокВыбора.Добавить(нДата); 	
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнениеСписковДат("ВремяОтправленияС",Объект.ВремяОтправленияС);
	ЗаполнениеСписковДат("ВремяОтправленияПо",Объект.ВремяОтправленияПо);
	ЗаполнениеСписковДат("ВремяПрибытияС",Объект.ВремяПрибытияС);
	ЗаполнениеСписковДат("ВремяПрибытияПо",Объект.ВремяПрибытияПо);
	
	ИсторияСписок.Отбор.Элементы.Очистить();
	ЭлементОтбораСчета = ИсторияСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбораСчета.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("БизнесПроцесс"); 
	ЭлементОтбораСчета.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбораСчета.Использование = Истина; 
	ЭлементОтбораСчета.ПравоеЗначение = Объект.Ссылка;

КонецПроцедуры

&НаКлиенте
Процедура ВремяОтправленияСПриИзменении(Элемент)
	ЗаполнениеСписковДат("ВремяОтправленияС",Объект.ВремяОтправленияС);
КонецПроцедуры

&НаКлиенте
Процедура ВремяОтправленияПоПриИзменении(Элемент)
	ЗаполнениеСписковДат("ВремяОтправленияПо",Объект.ВремяОтправленияПо);
КонецПроцедуры

&НаКлиенте
Процедура ВремяПрибытияСПриИзменении(Элемент)
	ЗаполнениеСписковДат("ВремяПрибытияС",Объект.ВремяПрибытияС);
КонецПроцедуры

&НаКлиенте
Процедура ВремяПрибытияПоПриИзменении(Элемент)
	ЗаполнениеСписковДат("ВремяПрибытияПо",Объект.ВремяПрибытияПо);
КонецПроцедуры

&НаКлиенте
Процедура ТочкаПрибытияПриИзменении(Элемент)
	may.ИзминениеРасстояниеПоДорогамДляДоставки(Объект.Номер, Объект.ТочкаОтправления,Объект.ТочкаПрибытия);
КонецПроцедуры

&НаКлиенте
Процедура ТочкаОтправленияПриИзменении(Элемент)
	may.ИзминениеРасстояниеПоДорогамДляДоставки(Объект.Номер, Объект.ТочкаОтправления,Объект.ТочкаПрибытия);
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрытьУпр(Команда)
	ЭтаФорма.Записать();
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьУпр(Команда)
	ЭтаФорма.Записать();
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеДляТочкиПрибытия()
		
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	РеализацияТоваровУслуг.Ссылка КАК Заказ,
	            |	Выбор Когда РеализацияТоваровУслуг.ТерминалДоставки.Код = 1 Тогда Истина Иначе Ложь Конец КАК НадоПроизводитьПоискПолигона
	            |ИЗ
	            |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	            |ГДЕ
	            |	РеализацияТоваровУслуг.Номер = &Номер";
	Зап.УстановитьПараметр("Номер", Объект.Номер);
	
	Выб = Зап.Выполнить().Выбрать();
	
	Структура = Новый Структура;
	Структура.Вставить("Заказ",Документы.РеализацияТоваровУслуг.ПустаяСсылка());
	Структура.Вставить("НадоПроизводитьПоискПолигона",Истина);
	
	Пока Выб.Следующий() Цикл
		Структура = Новый Структура;
		Структура.Вставить("Заказ",Выб.Заказ);
		Структура.Вставить("НадоПроизводитьПоискПолигона",Истина);
	КонецЦикла;
	
	Возврат Структура;

КонецФункции

&НаКлиенте
Процедура ТочкаПрибытияОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтрукЗаказа = ПолучитьДанныеДляТочкиПрибытия();
	Парам = Новый Структура;
	Парам.Вставить("Ключ", Объект.ТочкаПрибытия);
	Форма = ПолучитьФорму("Справочник.новаТочкиДоставки.Форма.ФормаЭлементаУпр", Парам);
	Форма.Заказ = СтрукЗаказа.Заказ;
	Форма.НадоПроизводитьПоискПолигона = СтрукЗаказа.НадоПроизводитьПоискПолигона;
	Форма.Открыть();


КонецПроцедуры
