//CeHbKA 31.07.2019 #3319 
//ДополнительныеПараметры - Структура
//ДополнительныеПараметры.РасширениеФайла	- строка (обязательно) 
//ДополнительныеПараметры.Документ			- ДокументСсылка (обязательно)
//ДополнительныеПараметры.ТипДокумента		- Справочник.ТипыПрикрепленныхДокументов (обязательно)
//ДополнительныеПараметры.Каталог			- Строка (необязательно)
//ДополнительныеПараметры.КаталогПеремещения- Строка (необязательно)
//ДополнительныеПараметры.Заказы			- Массив РТиУ (необязательно)
//ДополнительныеПараметры.ИнтернетМагазин	- Контрагенты (необязательно)
//ДополнительныеПараметры.Форма				- УпрФорма (необязательно)


Процедура ПослеВыбораФайла(Результат, АдресВХ, ПомещаемыйФайл, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат Тогда
		Возврат;
	КонецЕсли; 
	
	Сч = 1;
	ИмяФайла = Прав(ПомещаемыйФайл, Сч);
	
	Пока Лев(ИмяФайла,1) <> "\" Цикл
		ИмяФайла = Прав(ПомещаемыйФайл, Сч);
		Сч = Сч + 1;
	КонецЦикла; 
	
	ИмяФайла = СтрЗаменить(ИмяФайла, "\", "");
	
	ЕстьЗаказы = ДополнительныеПараметры.Свойство("Заказы");
	ЕстьИнтернетМагазин = ДополнительныеПараметры.Свойство("ИнтернетМагазин");
	
	//Асеев 21.06.2022 (Задача № 4821)>>>
	ФайлБезЗаказов = Неопределено;
	ДополнительныеПараметры.Свойство("ФайлБезЗаказов", ФайлБезЗаказов);
	Если ФайлБезЗаказов = Неопределено Тогда
		ФайлБезЗаказов = Ложь;
	КонецЕсли;
	//Асеев 21.06.2022 (Задача № 4821)<<<
	
	Если ЕстьЗаказы И ЕстьИнтернетМагазин Тогда
		РаботаСПрикрепленнымиФайламиСервер.ЗаписатьВыбранныйФайлВБД(ИмяФайла, ДополнительныеПараметры.РасширениеФайла, АдресВХ, ДополнительныеПараметры.Документ, ДополнительныеПараметры.ТипДокумента, ДополнительныеПараметры.Заказы, ДополнительныеПараметры.ИнтернетМагазин, ФайлБезЗаказов);
	ИначеЕсли НЕ ЕстьЗаказы И ЕстьИнтернетМагазин Тогда
		РаботаСПрикрепленнымиФайламиСервер.ЗаписатьВыбранныйФайлВБД(ИмяФайла, ДополнительныеПараметры.РасширениеФайла, АдресВХ, ДополнительныеПараметры.Документ, ДополнительныеПараметры.ТипДокумента,,ДополнительныеПараметры.ИнтернетМагазин, ФайлБезЗаказов);
	Иначе	
		РаботаСПрикрепленнымиФайламиСервер.ЗаписатьВыбранныйФайлВБД(ИмяФайла, ДополнительныеПараметры.РасширениеФайла, АдресВХ, ДополнительныеПараметры.Документ, ДополнительныеПараметры.ТипДокумента,,, ФайлБезЗаказов);
	КонецЕсли; 
	
	Если ДополнительныеПараметры.Свойство("КаталогПеремещения") Тогда
		//ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПеремещенияФайла", ЭтотОбъект);
		//НачатьПеремещениеФайла(ОписаниеОповещения, ПомещаемыйФайл, ДополнительныеПараметры.КаталогПеремещения+"\"+ИмяФайла);		
		РаботаСПрикрепленнымиФайламиСервер.ПереместитьФайлНаСервере(ПомещаемыйФайл,ДополнительныеПараметры.КаталогПеремещения+"\"+ИмяФайла);//тест
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("Форма") Тогда
		УпрФорма = ДополнительныеПараметры.Форма;
		УпрФорма.Элементы.Список.Обновить();
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПослеПеремещенияФайла(ПеремещаемыйФайл, ДополнительныеПараметры) Экспорт
КонецПроцедуры
 

//CeHbKA 31.07.2019 #3319 
