
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не Объект.Ссылка.Пустая() Тогда
			
		Элементы.ГрШапка.ТолькоПросмотр = Истина;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		Сообщить("Внимание!!! Ошибка записи, введите наименование!");
		Отказ = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ТипЗаказа) Тогда
		Сообщить("Внимание!!! Ошибка записи, введите тип заказа!");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотретьКарту(Команда)
	
	Если ЗначениеЗаполнено(Объект.Карта) Тогда
		СтрокаПросмотраКарты = "https://yandex.ru/maps/?um=constructor%" + Объект.Карта.ИдентификаторКарты + "&source=constructorLink";
		ЗапуститьПриложение(СтрокаПросмотраКарты);
	КонецЕсли;
	
КонецПроцедуры
