Функция ЗначениеСтавкиНСДДляРасчетаУслуг(ДатаСтавки = Неопределено) Экспорт
	
	Если ДатаСтавки = Неопределено Тогда
		ДатаСтавки = ТекущаяДата();
	КонецЕсли;
	
	ДатаСменыНДС = Дата("01.01.2019 00:00:00");
	Если ПараметрыСеанса.ЭтоТестоваяСреда Тогда
		ДатаСменыНДС = Дата("01.11.2018 00:00:00");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата смены ставки НДС определена как " + СокрЛП(ДатаСменыНДС));
	КонецЕсли;	
	
	Если  ДатаСтавки < ДатаСменыНДС Тогда
		Возврат 18;
	Иначе		
		Возврат 20;
	КонецЕсли;
	
КонецФункции	