
&НаКлиенте
Процедура Заполнить(Команда)
	Если Объект.СоответствиеСотрудников.Количество() > 0 Тогда
		Если Вопрос("Документ будет перезаполнен! Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			ЗаполнитьНаСервере();
		КонецЕсли;
	Иначе
		ЗаполнитьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()

	Объект.СоответствиеСотрудников.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РаботникиОрганизации.Организация КАК Организация,
	|	РаботникиОрганизации.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ втУволеные
	|ИЗ
	|	РегистрСведений.РаботникиОрганизации КАК РаботникиОрганизации
	|ГДЕ
	|	РаботникиОрганизации.Состояние = ЗНАЧЕНИЕ(Перечисление.СостояниеРаботникаОрганизации.Уволен)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РаботникиОрганизации.Организация,
	|	РаботникиОрганизации.Сотрудник
	|ПОМЕСТИТЬ втРаботники
	|ИЗ
	|	РегистрСведений.РаботникиОрганизации КАК РаботникиОрганизации
	|ГДЕ
	|	НЕ (РаботникиОрганизации.Организация, РаботникиОрганизации.Сотрудник) В
	|				(ВЫБРАТЬ
	|					втУволеные.Организация,
	|					втУволеные.Сотрудник
	|				ИЗ
	|					втУволеные КАК втУволеные)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРаботники.Сотрудник КАК Сотрудник
	|ИЗ
	|	втРаботники КАК втРаботники
	|ГДЕ
	|	втРаботники.Организация = &Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник";
	
	
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	//Запрос.УстановитьПараметр("ИсточникДанныхДляРасчетаФОТ", Объект.ИсточникДанныхДляРасчетаФОТ);
	
	Результат = Запрос.Выполнить();
	ВыборкаСотрудник = Результат.Выбрать();
	Пока ВыборкаСотрудник.Следующий() Цикл
		
		НоваяСтрока = Объект.СоответствиеСотрудников.Добавить();
		НоваяСтрока.ФИОСотрудника = ВыборкаСотрудник.Сотрудник;
				
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ИсточникДанныхДляРасчетаФОТПриИзменении(Элемент)
	Если не Объект.ИсточникДанныхДляРасчетаФОТ.ФСоединениеПротестировано тогда
		Сообщить("Выбранный источник данных не проверен! Обратитесь к администратору");	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.Ответственный = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойОтветственный");
КонецПроцедуры
