Функция Сформировать(Таб, НачПериода, КонПериода, ГруппаРайонов) Экспорт
	
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	ЗакрытыеЗаказы.Доставка,
	            |	ЗакрытыеЗаказы.ИнтернетМагазин КАК ИнтернетМагазин,
	            |	ЗакрытыеЗаказы.Доставка.ТочкаПрибытия.Москва КАК ЭтоМосква,
	            |	ЗакрытыеЗаказы.Доставка.ТочкаПрибытия.Адрес.Широта КАК Широта,
	            |	ЗакрытыеЗаказы.Доставка.ТочкаПрибытия.Адрес.Долгота КАК Долгота
	            |ИЗ
	            |	РегистрНакопления.ЗакрытыеЗаказы КАК ЗакрытыеЗаказы
	            |ГДЕ
	            |	ЗакрытыеЗаказы.СтатусИнтернетМагазина.Ссылка = ЗНАЧЕНИЕ(Справочник.СтатусЗаказаИнтернетМагазина.ЗаказЗакрыт)
	            |	И ЗакрытыеЗаказы.Период МЕЖДУ &НачДата И &КонДата
	            |	И ЗакрытыеЗаказы.ТипЗаказа.Ссылка = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
	            |
	            |УПОРЯДОЧИТЬ ПО
	            |	ИнтернетМагазин";
				
	Зап.УстановитьПараметр("НачДата", НачалоДня(НачПериода));			
	Зап.УстановитьПараметр("КонДата", КонецДня(КонПериода));
	
	Рез = зап.Выполнить().Выгрузить();
	Для каждого Тек Из Рез Цикл
		Нов = Таб.Добавить();
		Нов.Контрагент = Тек.ИнтернетМагазин;
		Если Тек.ЭтоМосква Тогда
			Нов.Москва = 1;
		ИначеЕсли Справочники.новаГеоРайоны.ОпределениеПринадлежностиКГруппеРайонов(ГруппаРайонов, Тек.Широта, Тек.Долгота) Тогда
			Нов.Бетонка = 1;
		Иначе	
			Нов.Прочее = 1;
		КонецеСли;	
	КонецЦикла;	
	
	Таб.Свернуть("Контрагент", "Москва, Бетонка, Прочее");
	Таб.Сортировать("Контрагент");
	  
КонецФункции	