
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не Объект.Ссылка.Пустая() Тогда
		Элементы.РежимРаботыСвязки.Доступность = Ложь;
	КонецеСли;	
	УстановитьТекущуюСтраницу();
КонецПроцедуры

&НаКлиенте
Процедура РежимРаботыСвязкиПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	УстановитьТекущуюСтраницу();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекущуюСтраницу()
	Если Объект.РежимРаботыСвязки = 0 Тогда
		Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.ГруппаСтраницаПоРабочимМестам;
	ИначеЕсли Объект.РежимРаботыСвязки = 1 Тогда	
		Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.ГруппаСтраницаПоТерминалам;
	ИначеЕсли Объект.РежимРаботыСвязки = 2 Тогда	
		Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.ГруппаСтраницаПоПользователям;
	КонецеСли;	
КонецПроцедуры	
