// Якурнов 02.08.2018 16:42:31
Функция УстановитьРабочееМесто(ИмяКомпьютера) Экспорт
	//ИмяКомпьютера = ИмяКомпьютера();
	
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	РабочиеМеста.Ссылка КАК РабочееМесто
	            |ИЗ
	            |	Справочник.РабочиеМеста КАК РабочиеМеста
	            |ГДЕ
	            |	РабочиеМеста.ИмяКомпьютера = &ИмяКомпьютера";
	Зап.УстановитьПараметр("ИмяКомпьютера", ИмяКомпьютера);			
	
	Выб = Зап.Выполнить().Выбрать();
	
	РабочееМесто = Неопределено;
	Если Выб.Следующий() Тогда
		РабочееМесто = Выб.РабочееМесто;
	Иначе
		РабочееМестоОб = Справочники.РабочиеМеста.СоздатьЭлемент();
		РабочееМестоОб.Наименование = ИмяКомпьютера;
		РабочееМестоОб.ИмяКомпьютера = ИмяКомпьютера;
		РабочееМестоОб.Записать();
		РабочееМесто = РабочееМестоОб.Ссылка;
	КонецеСли;	
	
	Возврат РабочееМесто;
КонецФункции

//Функция ПолучитьИмяПриложенияСеанса(НомерСоединения, Представление = Ложь)
//НомерСоединения (Число) номер соединения по которому необходимо получить контекст сеанса
//Представление (Булево) - если Истина то функция вернет представления контекста сеанса (удобочитаемое) 
//Пример ИмяПриложения: "WebServerExtension" Представление:"Модуль расширения веб-сервера"
//Возвращает (Строка) - имя приложения (Контекст сеанса) или представление имени приложения
//
Функция ПолучитьИмяПриложенияСеанса(НомерСоединения, Представление = Ложь) Экспорт
    ИмяПриложения = "";  
	  
    СеансыИБ         = ПолучитьСеансыИнформационнойБазы();        
    Для Каждого Сеанс Из СеансыИБ Цикл         
        Если Сеанс.НомерСоединения = НомерСоединения Тогда
            Если Представление Тогда
				ИмяПриложения = ПредставлениеПриложения(Сеанс.ИмяПриложения); 
			Иначе
				ИмяПриложения = Сеанс.ИмяПриложения;
			КонецЕсли; 
        КонецЕсли;   
    КонецЦикла;
	
    Возврат ИмяПриложения;
    
КонецФункции

Функция ПолучитьПараметрыСеансаИнформационнойБазы(НомерСоединения, Представление = Ложь) Экспорт
    ИмяПриложения = "";
	ИмяКомпьютера = "";
	  
    СеансыИБ         = ПолучитьСеансыИнформационнойБазы();        
    Для Каждого Сеанс Из СеансыИБ Цикл         
		Если Сеанс.НомерСоединения = НомерСоединения Тогда
            Если Представление Тогда
				ИмяПриложения = ПредставлениеПриложения(Сеанс.ИмяПриложения); 
			Иначе
				ИмяПриложения = Сеанс.ИмяПриложения;
			КонецЕсли;
			ИмяКомпьютера = Сеанс.ИмяКомпьютера;
        КонецЕсли;   
    КонецЦикла;
	
    Возврат Новый Структура("ИмяПриложения,ИмяКомпьютера", ИмяПриложения, ИмяКомпьютера);
    
КонецФункции
