
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ВвестиСтроку(Объект.Комментарий, "Введите комментарий",, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.Ответственный = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойОтветственный");
КонецПроцедуры

&НаКлиенте
Процедура СписокДоставокПоМагазинамИсключенияФИОСотрудникаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокДоставокПоМагазинамИсключения.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.Сотрудник) Тогда
		ДанныеСотрудника = мгДоработки.ПолучитьОрганизациюСотрудника(ТекущиеДанные.Сотрудник);
		Если ДанныеСотрудника.Количество() = 0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Сотрудник не принят ни в одну организацию";
			Сообщение.Сообщить();
		ИначеЕсли ДанныеСотрудника.Количество() > 1 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Сотрудник принят в несколько организаций, необходимо выбрать организацию сотрудника";
			Сообщение.Сообщить();
		Иначе
			ТекущиеДанные.Организация = ДанныеСотрудника[0].Организация;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДоставокПоМагазинамИсключенияКонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("МножественныйВыбор", Ложь);
	
	Результат = ОткрытьФормуМодально("Документ.мгУчетПоМагазинамИсключения.Форма.ФормаСпискаТарифовИсключений", СтруктураПараметров, Элемент);//,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ТекущиеДанные = Элементы.СписокДоставокПоМагазинамИсключения.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.Контрагент = Результат;
		ТекущиеДанные.Тариф = ПолучитьТарифПоКонтрагентуНаСервереБезКонтекста(ТекущиеДанные.Контрагент);
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТарифПоКонтрагентуНаСервереБезКонтекста(Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	мгТарифыПоКонтрагентамСрезПоследних.Тариф КАК Тариф
	|ИЗ
	|	РегистрСведений.мгТарифыПоКонтрагентам.СрезПоследних(, Контрагент = &Контрагент) КАК мгТарифыПоКонтрагентамСрезПоследних";
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Тариф;
	
КонецФункции
 