&НаСервере
Процедура ЛогироватьОтправленноеСМСНаСервере(СтрокаСМС, Рейс, СтрокаДанных, ДатаОтправки, ДатаПолучения = "", Ошибка = Ложь, ТекстОшибки = "") Экспорт
	Наб = РегистрыСведений.РассылкаСМС.СоздатьНаборЗаписей();
	ТекВр = ТекущаяДата();
	
	Наб.Отбор.Период.Установить(ТекВр);
	Наб.Отбор.Рейс.Установить(Рейс);
	Наб.Отбор.Заказ.Установить(СтрокаДанных.Заказ);
	Наб.Отбор.Шаблон.Установить(СтрокаДанных.ШаблонСМС);
	
	Нов = Наб.Добавить();
	Нов.Период = ТекВр;
	Нов.Рейс = Рейс;
	Нов.Заказ = СтрокаДанных.Заказ;
	Нов.Шаблон = СтрокаДанных.ШаблонСМС;
	Нов.Транспорт = СтрокаДанных.Транспорт;
	Нов.ДатаОтправки = ДатаОтправки;
	Нов.ДатаПолучения = ДатаПолучения;
	Нов.ТекстСМС = СтрокаСМС;
	Нов.ПроизошлаОшибка = Ошибка;
	Нов.ТекстОшибки = ТекстОшибки;
	Нов.Телефон = СтрокаДанных.ТелефонКлиента;
	
	Наб.Записать();
КонецПроцедуры	
