
Процедура ОбработкаПроведения(Отказ, Режим)
    //{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
    // Данный фрагмент построен конструктором.
    // При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

    // регистр УчетСубагентовДополнительный Приход
    Движения.УчетСубагентовДополнительный.Записывать = Истина;
    Движения.УчетСубагентовДополнительный.Очистить();
    Для Каждого ТекСтрокаЗаказы Из Заказы Цикл
        Движение = Движения.УчетСубагентовДополнительный.Добавить();
        Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
        Движение.Период = Дата;
        Движение.ЮрЛицо = ТекСтрокаЗаказы.ЮрЛицо;
        Движение.Договор = ТекСтрокаЗаказы.Договор;
        Движение.Субагент = ТекСтрокаЗаказы.Субагент;
        Движение.ОрганизацияАгент = ТекСтрокаЗаказы.ОрганизацияАгент;
        Движение.ТипОплаты = ТекСтрокаЗаказы.ТипОплаты;
        Движение.ИнтернетМагазин = ТекСтрокаЗаказы.ИнтернетМагазин;
        Движение.Реализация = ТекСтрокаЗаказы.Реализация;
        Движение.СтатусЗаказа = ТекСтрокаЗаказы.СтатусЗаказа;
        Движение.ПричинаНевыполнения = ТекСтрокаЗаказы.ПричинаНевыполнения;
        Движение.СтатусИнтернетМагазина = ТекСтрокаЗаказы.СтатусИнтернетМагазина;
        Движение.ПричинаОтказа = ТекСтрокаЗаказы.ПричинаОтказа;
        Движение.ТарифнаяСетка = ТекСтрокаЗаказы.ТарифнаяСетка;
        Движение.КатегорияДоставки = ТекСтрокаЗаказы.КатегорияДоставки;
        Движение.ТипЗаказа = ТекСтрокаЗаказы.ТипЗаказа;
        Движение.РасчетныйБрейк = ТекСтрокаЗаказы.РасчетныйБрейк;
        Движение.ТарифнаяСеткаПартнера = ТекСтрокаЗаказы.ТарифнаяСеткаПартнера;
        Движение.ЗонаТарификации = ТекСтрокаЗаказы.ЗонаТарификации;
        Движение.ТарифныйПлан = ТекСтрокаЗаказы.ТарифныйПлан;
        Движение.РассчитаноПоТарифномуПлану = ТекСтрокаЗаказы.РассчитаноПоТарифномуПлану;
        Движение.СуммаОценочная = ТекСтрокаЗаказы.СуммаОценочная;
        Движение.СуммаПолученная = ТекСтрокаЗаказы.СуммаПолученная;
        Движение.СуммаДоставкиДоМКАД = ТекСтрокаЗаказы.СуммаДоставкиДоМКАД;
        Движение.СуммаДоставкиЗаМКАД = ТекСтрокаЗаказы.СуммаДоставкиЗаМКАД;
        Движение.УслугиСД = ТекСтрокаЗаказы.УслугиСД;
        Движение.БанковскаяКомиссия = ТекСтрокаЗаказы.БанковскаяКомиссия;
        Движение.КассовоеОбслуживание = ТекСтрокаЗаказы.КассовоеОбслуживание;
        Движение.СуммаВозврата = ТекСтрокаЗаказы.СуммаВозврата;
        Движение.Масса = ТекСтрокаЗаказы.Масса;
        Движение.СуммаЧастичногоВозврата = ТекСтрокаЗаказы.СуммаЧастичногоВозврата;
        Движение.ОплаченоКлиентовНал = ТекСтрокаЗаказы.ОплаченоКлиентовНал;
        Движение.АгентскоеВознаграждение = ТекСтрокаЗаказы.АгентскоеВознаграждение;
        Движение.ПредоплатаПоКредиту = ТекСтрокаЗаказы.ПредоплатаПоКредиту;
        Движение.СтраховойСбор = ТекСтрокаЗаказы.СтраховойСбор;
        Движение.Поступление = ТекСтрокаЗаказы.Поступление;
        Движение.Списание = ТекСтрокаЗаказы.Списание;
        Движение.Оприходование = ТекСтрокаЗаказы.Оприходование;
        Движение.Перемещение = ТекСтрокаЗаказы.Перемещение;
        Движение.Доставка = ТекСтрокаЗаказы.Доставка;
        Движение.Возврат = ТекСтрокаЗаказы.Возврат;
        Движение.ПризнакВозврата = ТекСтрокаЗаказы.ПризнакВозврата;
    КонецЦикла;

    //}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
