// См. описание в общем модуле ОбновлениеИнформационнойБазыБСП.
Процедура ПриДобавленииПодсистемы(Описание) Экспорт
    
    Описание.Имя = "СерверСканирования";
    Описание.Версия = "1.2.0.1";
    
    // Требуется библиотека стандартных подсистем.
    //Описание.ТребуемыеПодсистемы.Добавить("СтандартныеПодсистемы");
    
КонецПроцедуры


Функция ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
	
КонецФункции	

Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
КонецПроцедуры	

Процедура ПередОбновлениемИнформационнойБазы() Экспорт
	
КонецПроцедуры	

Процедура ПослеОбновленияИнформационнойБазы(ПредыдущаяВерсия, Версия, ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, ОперативноеОбновление) Экспорт

КонецПроцедуры	

Процедура ПриПодготовкеМакетаОписанияОбновлений(ДокументОписаниеОбновлений) Экспорт
	
КонецПроцедуры	
