

&НаКлиенте
Процедура СоздатьВозвратТоваровПоставщику(Команда)
    ДокументОбъект = Элементы.Список.ТекущаяСтрока.ПолучитьОбъект();
    ДокументОбъект.СоздатьНаОсновании();
КонецПроцедуры

//+++ БАО 22.08.2017 №1730
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	bao.ДобавитьОтборДинСпискаПоДоступнымПользователюТерминалам(Список);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		
	ТекДанные = Элементы.Список.ТекущиеДанные;	
	Если ТекДанные.НовыйМеханизм Тогда
		СтандартнаяОбработка = Ложь;
		Парам = Новый Структура("Ключ", ВыбраннаяСтрока);		
		ОткрытьФорму("Документ.НаборнаяВедомостьДляВозврата.Форма.ФормаДокументаНовая", Парам, ЭтаФорма);	
	КонецЕсли;
	
КонецПроцедуры
//--- БАО 22.08.2017 №1730

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Копирование;
	
КонецПроцедуры
