#Область ПрограммныйИнтерфейс

// Получить данные заказа.
// 
// Параметры:
//  СсылкаЗаказ - СправочникСсылка.Заказы  - Ссылка заказ
// 
// Возвращаемое значение:
//  Структура - Получить данные заказа
Функция ПолучитьДанныеЗаказа(СсылкаЗаказ) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СУММА(ЗаказыТовары.Количество) КАК ИтогоКоличествоТоваров,
	|	ЗаказыТовары.Ссылка КАК Заказ
	|ПОМЕСТИТЬ ВТ_ИтогПоТоварам
	|ИЗ
	|	Справочник.Заказы.Товары КАК ЗаказыТовары
	|ГДЕ
	|	ЗаказыТовары.Ссылка = &СсылкаЗаказ
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыТовары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Заказы.Ссылка КАК Заказ,
	|	Заказы.ВерсияДанных КАК ВерсияДанных,
	|	Заказы.ПометкаУдаления КАК ПометкаУдаления,
	|	Заказы.Код КАК Код,
	|	Заказы.Адрес КАК Адрес,
	|	Заказы.ДатаВремяПоследнейМаршрутизацииВМП КАК ДатаВремяПоследнейМаршрутизацииВМП,
	|	Заказы.ДатаДоставкиЗаказа КАК ДатаДоставкиЗаказа,
	|	Заказы.Долгота КАК Долгота,
	|	Заказы.ЗапрашиватьКИК КАК ЗапрашиватьКИК,
	|	Заказы.ЗапретСменыТипаОплаты КАК ЗапретСменыТипаОплаты,
	|	Заказы.ЗапретЧастичногоВыкупа КАК ЗапретЧастичногоВыкупа,
	|	Заказы.ИмяПолучателя КАК ИмяПолучателя,
	|	Заказы.ИнтервалДоставкиПо КАК ИнтервалДоставкиПо,
	|	Заказы.ИнтервалДоставкиС КАК ИнтервалДоставкиС,
	|	Заказы.ИнтернетМагазин КАК ИнтернетМагазин,
	|	Заказы.КалендарьДоставки КАК КалендарьДоставки,
	|	Заказы.КодИдентификацииКлиента КАК КодИдентификацииКлиента,
	|	Заказы.КодОрганизацияОплатаБСП КАК КодОрганизацияОплатаБСП,
	|	Заказы.КодОрганизацияОплатаНаличные КАК КодОрганизацияОплатаНаличные,
	|	Заказы.КодОрганизацияОплатаТерминал КАК КодОрганизацияОплатаТерминал,
	|	Заказы.КоличествоМест КАК КоличествоМест,
	|	Заказы.МетодОплатыПодъема КАК МетодОплатыПодъема,
	|	Заказы.НомерЗаказаИМ КАК НомерЗаказаИМ,
	|	Заказы.ОтправлятьЧекНаEMAILПолучателя КАК ОтправлятьЧекНаEMAILПолучателя,
	|	Заказы.ПечататьЧек КАК ПечататьЧек,
	|	Заказы.ПодъемОплачен КАК ПодъемОплачен,
	|	Заказы.ПолучательEMAIL КАК ПолучательEMAIL,
	|	Заказы.СтавкаНДССуммаДоставки КАК СтавкаНДССуммаДоставки,
	|	Заказы.СтатусИМ КАК СтатусИМ,
	|	Заказы.СтоимостьДоставки КАК СтоимостьДоставки,
	|	Заказы.СуммаЗаказаИтого КАК СуммаЗаказаИтого,
	|	Заказы.СуммаЗаказаИтогоУчитывается КАК СуммаЗаказаИтогоУчитывается,
	|	Заказы.СуммаСтоимостьТоваровЗаказа КАК СуммаСтоимостьТоваровЗаказа,
	|	Заказы.СуммаПредоплаты КАК СуммаПредоплаты,
	|	Заказы.ТарифицируемыйВес КАК ТарифицируемыйВес,
	|	Заказы.Телефон КАК Телефон,
	|	Заказы.ТипЗаказа КАК ТипЗаказа,
	|	Заказы.ТипОплаты КАК ТипОплаты,
	|	Заказы.ТребуетсяОплатаСтоимостиДоставкиПриОтменеЗаказа КАК ТребуетсяОплатаСтоимостиДоставкиПриОтменеЗаказа,
	|	Заказы.УслугаПримерки КАК УслугаПримерки,
	|	Заказы.Широта КАК Широта,
	|	Заказы.ПорядокСортировки КАК ПорядокСортировки,
	|	Заказы.Партнер КАК Партнер,
	|	Заказы.Рейс КАК Рейс,
	|	Заказы.ЗапрашиватьДанныеПодъема КАК ЗапрашиватьДанныеПодъема,
	|	Заказы.КодЗоныТарификации КАК КодЗоныТарификации,
	|	Заказы.ПодписаниеИВозвратСопрДокументов КАК ПодписаниеИВозвратСопрДокументов,
	|	ЕСТЬNULL(ВТ_ИтогПоТоварам.ИтогоКоличествоТоваров, 0) КАК ИтогоКоличествоТоваров
	|ИЗ
	|	Справочник.Заказы КАК Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтогПоТоварам КАК ВТ_ИтогПоТоварам
	|		ПО ВТ_ИтогПоТоварам.Заказ = Заказы.Ссылка
	|ГДЕ
	|	Заказы.Ссылка = &СсылкаЗаказ";
	Запрос.УстановитьПараметр("СсылкаЗаказ", СсылкаЗаказ);
	РезультатЗапроса = Запрос.Выполнить();
	СтруктураОтвета = Новый Структура;
	
	Для Каждого ТекКолонка Из РезультатЗапроса.Колонки Цикл
		СтруктураОтвета.Вставить(ТекКолонка.Имя);
	КонецЦикла;	
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураОтвета, Выборка);
	КонецЕсли;	
	Возврат СтруктураОтвета;
КонецФункции

// Получить данные результата доставки.
// 
// Параметры:
//  СсылкаРезультатДоставки - СправочникСсылка.РезультатыДоставки - Ссылка результат доставки
// 
// Возвращаемое значение:
//  Структура - Получить данные результата доставки
Функция ПолучитьДанныеРезультатаДоставки(СсылкаРезультатДоставки) Экспорт

	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РезультатыДоставки.Ссылка КАК РезультатДоставки,
	|	РезультатыДоставки.Наименование КАК Наименование,
	|	РезультатыДоставки.ЭтоДоставка КАК ЭтоДоставка,
	|	РезультатыДоставки.ЭтоЗаезд КАК ЭтоЗаезд,
	|	РезультатыДоставки.ЭтоОтмена КАК ЭтоОтмена,
	|	РезультатыДоставки.ЭтоПеренос КАК ЭтоПеренос,
	|	ВЫБОР
	|		КОГДА РезультатыДоставки.Ссылка = ЗНАЧЕНИЕ(Справочник.РезультатыДоставки.КДоставке)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоКДоставке
	|ИЗ
	|	Справочник.РезультатыДоставки КАК РезультатыДоставки
	|ГДЕ
	|	РезультатыДоставки.Ссылка = &ВыбРезультатДоставки";
	Запрос.УстановитьПараметр("ВыбРезультатДоставки", СсылкаРезультатДоставки);
	РезультатЗапроса = Запрос.Выполнить(); 
	СтруктураОтвета = Новый Структура;
	
	Для Каждого ТекКолонка Из РезультатЗапроса.Колонки Цикл
		СтруктураОтвета.Вставить(ТекКолонка.Имя);
	КонецЦикла;	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураОтвета, Выборка);
	КонецЕсли;	
	Возврат СтруктураОтвета;	
КонецФункции	

// Получить список результатов доставки.
// 
// Параметры:
//  ТипЗаказа  - ПеречислениеСсылка.ТипыЗаказов - Тип заказа
// 
// Возвращаемое значение:
//  СписокЗначений из Структура - Получить список и массив результатов доставки
Функция ПолучитьСписокРезультатовДоставки(ТипЗаказа) Экспорт
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РезультатыДоставки.Ссылка КАК РезультатДоставки,
	|	РезультатыДоставки.Наименование КАК Наименование,
	|	РезультатыДоставки.ЭтоДоставка КАК ЭтоДоставка,
	|	РезультатыДоставки.ЭтоЗаезд КАК ЭтоЗаезд,
	|	РезультатыДоставки.ЭтоОтмена КАК ЭтоОтмена,
	|	РезультатыДоставки.ЭтоПеренос КАК ЭтоПеренос,
	|	ВЫБОР
	|		КОГДА РезультатыДоставки.Ссылка = ЗНАЧЕНИЕ(Справочник.РезультатыДоставки.КДоставке)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоКДоставке
	|ИЗ
	|	Справочник.РезультатыДоставки КАК РезультатыДоставки
	|ГДЕ
	|	РезультатыДоставки.ЗапретВыбора = ЛОЖЬ
	|	И ВЫБОР
	|		КОГДА &ОтборПоЗаборнымЗаявкам = ИСТИНА
	|			ТОГДА РезультатыДоставки.Забор = ИСТИНА
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ";
	
	ОтборПоЗаборнымЗаявкам = Ложь;
	Если ТипЗаказа = Перечисления.ТипыЗаказов.Забор Тогда
		 ОтборПоЗаборнымЗаявкам = Истина;
	КонецеСли;
	Запрос.УстановитьПараметр("ОтборПоЗаборнымЗаявкам", ОтборПоЗаборнымЗаявкам);	 
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	СписокЗначенийРезультатыДоставки = Новый СписокЗначений();

	
	ВыборкаРезультатовДоставки = РезультатЗапроса.Выбрать();
	Пока ВыборкаРезультатовДоставки.Следующий() Цикл
		СтруктураРезультатДоставки = Новый Структура; 
		Для Каждого ТекКолонка Из РезультатЗапроса.Колонки Цикл
			СтруктураРезультатДоставки.Вставить(ТекКолонка.Имя);
		КонецЦикла;			
		ЗаполнитьЗначенияСвойств(СтруктураРезультатДоставки, ВыборкаРезультатовДоставки);
		СписокЗначенийРезультатыДоставки.Добавить(СтруктураРезультатДоставки, ВыборкаРезультатовДоставки.Наименование);
	КонецЦикла;	
	
	Возврат СписокЗначенийРезультатыДоставки;
КонецФункции	

// Получить список причин отказов переносов по результату доставки.
// 
// Параметры:
//  РезультатДоставки - СправочникСсылка.РезультатыДоставки - Результат доставки
//  ТипЗаказа - ПеречислениеСсылка.ТипыЗаказов - Тип заказа
// 
// Возвращаемое значение:
//  СписокЗначений из СправочникСсылка.ПричиныОтказаПереноса - Получить список причин отказов переносов по результату доставки
Функция ПолучитьСписокПричинОтказовПереносовПоРезультатуДоставки(РезультатДоставки, ТипЗаказа) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПричиныОтказаПереносаПоРезультатамДоставки.ПричинаОтказаПереноса.Ссылка КАК ПричинаОтказаПереноса,
	|	ПричиныОтказаПереносаПоРезультатамДоставки.ПричинаОтказаПереноса.Наименование КАК Наименование
	|ИЗ
	|	РегистрСведений.ПричиныОтказаПереносаПоРезультатамДоставки КАК ПричиныОтказаПереносаПоРезультатамДоставки
	|ГДЕ
	|	ПричиныОтказаПереносаПоРезультатамДоставки.ТипЗаказа = &ТипЗаказа
	|	И ПричиныОтказаПереносаПоРезультатамДоставки.РезультатДоставки = &РезультатДоставки
	|	И ПричиныОтказаПереносаПоРезультатамДоставки.ПричинаОтказаПереноса.ЗапретВыбора = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПричиныОтказаПереносаПоРезультатамДоставки.ПричинаОтказаПереноса.Наименование";
	Запрос.УстановитьПараметр("РезультатДоставки", РезультатДоставки);
	Запрос.УстановитьПараметр("ТипЗаказа", ТипЗаказа);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СписокПричинОтказовПереносов = Новый СписокЗначений();
	
	Пока Выборка.Следующий() Цикл
		СписокПричинОтказовПереносов.Добавить(Выборка.ПричинаОтказаПереноса, Выборка.Наименование)	
	КонецЦикла;
	Возврат СписокПричинОтказовПереносов;
КонецФункции	

// Получить список видов подъема на этаж.
// 
// Возвращаемое значение:
//  СписокЗначений из ПеречислениеСсылка.ВидыПодъемовЗаказаНаЭтаж - Получить список видов подъема на этаж
Функция ПолучитьСписокВидовПодъемаНаЭтаж() Экспорт
	Список = Новый СписокЗначений();
	Список.Добавить(Перечисления.ВидыПодъемовЗаказаНаЭтаж.БезПодъема);
	Список.Добавить(Перечисления.ВидыПодъемовЗаказаНаЭтаж.РучнойПодъем);
	Список.Добавить(Перечисления.ВидыПодъемовЗаказаНаЭтаж.Лифт);
	Возврат Список;	
КонецФункции	

// Установить статус доставки.
// 
// Параметры:
//  ПараметрыСтатуса - Структура - Параметры статуса
// Возвращаемое значение:
//  Структура - Установить статус доставки:
// * ДокументСтатуса - ДокументСсылка.УстановкаСтатусаЗаказаЭкипаж - 
Функция УстановитьСтатусДоставкиЗаказа(ПараметрыСтатуса) Экспорт
	ДокументУстановкиСтатуса = Документы.УстановкаСтатусаЗаказаЭкипаж.СоздатьДокумент();
	
	ЗаполнитьЗначенияСвойств(ДокументУстановкиСтатуса, ПараметрыСтатуса);
	ДокументУстановкиСтатуса.Дата = ТекущаяДатаСеанса();
	
	ДокументУстановкиСтатуса.Заполнить(ДокументУстановкиСтатуса.Заказ);
	
	ДокументУстановкиСтатуса.РассчитатьПодъемНаСервереСПроверкой();
	ДокументУстановкиСтатуса.Записать(РежимЗаписиДокумента.Запись);
	ДокументУстановкиСтатуса.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат Новый Структура("ДокументСтатуса", ДокументУстановкиСтатуса.Ссылка);
КонецФункции

#КонецОбласти 