
&НаСервере
Процедура ПоказатьРазличияНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.Сравнить(Таб);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьРазличия(Команда)
	ПоказатьРазличияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ДатаДоставки = НачалоДня(ТекущаяДата() + 12*60*60);
	
	Объект.Терминал = ПараметрыСеанса.ТерминалДоставки;
	Если НЕ ЗначениеЗаполнено(Объект.Терминал) Тогда
		Объект.Терминал = Справочники.РегиональныеТерминалы.МоскваСтриж;			
	КонецЕсли;
	
	Если РольДоступна("Админы") Тогда
		Элементы.Терминал.Видимость = Истина;
	КонецеСли;	
	
КонецПроцедуры
