
#Область ОбработчикиСобытий
Функция MARoutePOST(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	ИмяМетода = Запрос.ПараметрыURL.Получить("ИмяМетода");
	ТекстЗапроса = Запрос.ПолучитьТелоКакСтроку();
	
	
		//СписокПолучателей = Новый Массив;
		////СписокПолучателей.Добавить("n.stepanov@strizh-logistic.ru");
		//СписокПолучателей.Добавить("evgeniy.marochkin@strizh-logistic.ru");
		//
		//lem.ОтправитьСообщение(СписокПолучателей, "Вызов метода MARouteExchange_" + ИмяМетода, ТекстЗапроса , , "Логистическая компания ""Стриж""");
	
	
	
	
	Попытка
		Если ИмяМетода = "unloadStatusInfo" Тогда
			МассивЗначенийДат = Новый Массив;
			МассивЗначенийДат.Добавить("Date");
			МассивЗначенийДат.Добавить("DateReason");
			МассивЗначенийДат.Добавить("dateOfSendingDataOfCheck");
			МассивЗначенийДат.Добавить("dateOfPrintingCheck");
			ВходныеДанные = РаботаСМобильнымПриложениемЭкипажейСервер.ДанныеJSONВСтруктуру(ТекстЗапроса, МассивЗначенийДат);
			//ВходныеДанные = РаботаСМобильнымПриложениемЭкипажейСервер.ДанныеJSONВСтруктуру(ТекстЗапроса, "Date, DateReason, dateOfSendingDataOfCheck, dateOfPrintingCheck");
			СписокНомеров = РаботаСМобильнымПриложениемЭкипажейСервер.ЗафиксироватьСтатусыМП(ВходныеДанные);
			СтрокаJSON = РаботаСМобильнымПриложениемЭкипажейСервер.СформироватьСтрокуJSON(СписокНомеров);
		ИначеЕсли ИмяМетода = "getGoodsSellers" Тогда
			ВходныеДанные = РаботаСМобильнымПриложениемЭкипажейСервер.ДанныеJSONВСтруктуру(ТекстЗапроса);
			ОтветМетода = РаботаСМобильнымПриложениемЭкипажейСервер.ВыгрузитьСведенияПоПоставшикамТоваров(ВходныеДанные.ID);
			СтрокаJSON = РаботаСМобильнымПриложениемЭкипажейСервер.СформироватьСтрокуJSON(ОтветМетода);
		ИначеЕсли ИмяМетода = "unregisterChanges" Тогда
			ВходныеДанные = РаботаСМобильнымПриложениемЭкипажейСервер.ДанныеJSONВСтруктуру(ТекстЗапроса);
			ОтветМетода = РаботаСМобильнымПриложениемЭкипажейСервер.УдалитьРегистрациюИзменений(ВходныеДанные);
			СтрокаJSON = РаботаСМобильнымПриложениемЭкипажейСервер.СформироватьСтрокуJSON(ОтветМетода);
			
			//Асеев 01.10.2020 (Задача № 4285)>>>
		ИначеЕсли ИмяМетода = "loadTransactionsQPS" Тогда
			МассивЗначенийДат = Новый Массив;
			МассивЗначенийДат.Добавить("transactionDate");
			МассивЗначенийДат.Добавить("period");
			ВходныеДанные = РаботаСМобильнымПриложениемЭкипажейСервер.ДанныеJSONВСтруктуру(ТекстЗапроса, МассивЗначенийДат);
			ОтветМетода = РаботаСМобильнымПриложениемЭкипажейСервер.ЗаписатьТранзакцииСБП(ВходныеДанные);
			СтрокаJSON = РаботаСМобильнымПриложениемЭкипажейСервер.СформироватьСтрокуJSON(ОтветМетода);
			//Асеев 01.10.2020 (Задача № 4285)<<<
			//Асеев 02.10.2020 (Задача № 4287)>>>
		ИначеЕсли ИмяМетода = "getInformationChangesOrders" Тогда
			ВходныеДанные = РаботаСМобильнымПриложениемЭкипажейСервер.ДанныеJSONВСтруктуру(ТекстЗапроса);
			ОтветМетода = РаботаСМобильнымПриложениемЭкипажейСервер.ПолучитьИнформированиеЭкипажейОбИзмененияхВЗаказах(ВходныеДанные);
			СтрокаJSON = РаботаСМобильнымПриложениемЭкипажейСервер.СформироватьСтрокуJSON(ОтветМетода);
			//Асеев 02.10.2020 (Задача № 4287)<<<
			//Асеев 07.10.2020 (Задача № 4291)>>>
		ИначеЕсли ИмяМетода = "setInformationChangesOrders" Тогда
			МассивЗначенийДат = Новый Массив;
			МассивЗначенийДат.Добавить("period");
			ВходныеДанные = РаботаСМобильнымПриложениемЭкипажейСервер.ДанныеJSONВСтруктуру(ТекстЗапроса, МассивЗначенийДат);
			ОтветМетода = РаботаСМобильнымПриложениемЭкипажейСервер.ЗаписатьИнформированиеЭкипажейОбИзмененияхВЗаказах(ВходныеДанные);
			СтрокаJSON = РаботаСМобильнымПриложениемЭкипажейСервер.СформироватьСтрокуJSON(ОтветМетода);
			//Асеев 07.10.2020 (Задача № 4291)<<<
			//Асеев 24.09.2021 (Задача № 4679)>>>
		ИначеЕсли ИмяМетода = "loadTransactionsAssist" Тогда
			МассивЗначенийДат = Новый Массив;
			МассивЗначенийДат.Добавить("transactionDate");
			МассивЗначенийДат.Добавить("period");
			ВходныеДанные = РаботаСМобильнымПриложениемЭкипажейСервер.ДанныеJSONВСтруктуру(ТекстЗапроса, МассивЗначенийДат);
			ОтветМетода = РаботаСМобильнымПриложениемЭкипажейСервер.ЗаписатьТранзакцииAssist(ВходныеДанные);
			СтрокаJSON = РаботаСМобильнымПриложениемЭкипажейСервер.СформироватьСтрокуJSON(ОтветМетода);
			//Асеев 24.09.2021 (Задача № 4679)<<<
			//Асеев 13.07.2022 (Задача № 4847)>>>
		ИначеЕсли ИмяМетода = "getTextYandexRouting" Тогда
			ВходныеДанные = РаботаСМобильнымПриложениемЭкипажейСервер.ДанныеJSONВСтруктуру(ТекстЗапроса);
			ОтветМетода = РаботаСМобильнымПриложениемЭкипажейСервер.ПолучитьТекстЗапросаЯндексМаршрутизации(ВходныеДанные);
			СтрокаJSON = РаботаСМобильнымПриложениемЭкипажейСервер.СформироватьСтрокуJSON(ОтветМетода);
			//Асеев 13.07.2022 (Задача № 4847)<<<
		ИначеЕсли ИмяМетода = "putTaskYandexRouting" Тогда
			МассивЗначенийДат = Новый Массив;
			МассивЗначенийДат.Добавить("startTime");
			
			ВходныеДанные = РаботаСМобильнымПриложениемЭкипажейСервер.ДанныеJSONВСтруктуру(ТекстЗапроса, МассивЗначенийДат);
			ОтветМетода = РаботаСМобильнымПриложениемЭкипажейСервер.ПоставитьЗадачуЯндексМаршрутизации(ВходныеДанные);
			СтрокаJSON = РаботаСМобильнымПриложениемЭкипажейСервер.СформироватьСтрокуJSON(ОтветМетода);
			
			//логирование
			ПараметрыЛога = ВнешнееЛогированиеСервер.ПараметрыЗаписиЛогаСервиса(Справочники.API.Yandex_Route, Справочники.МетодыAPI.putTaskYandexRouting);
			ПараметрыЛога.requestXML = ТекстЗапроса;
			ПараметрыЛога.responseXML = СтрокаJSON;
			
			Попытка
				ПараметрыЛога.isError = ОтветМетода.error <> Ложь;
			Исключение
				ПараметрыЛога.isError = Истина;
			КонецПопытки;
			
			ВнешнееЛогированиеСервер.ЗаписатьСтрокуЛогаСервиса(ПараметрыЛога);
			
		ИначеЕсли ИмяМетода = "getResultTaskYandexRouting" Тогда
			ВходныеДанные = РаботаСМобильнымПриложениемЭкипажейСервер.ДанныеJSONВСтруктуру(ТекстЗапроса);
			ОтветМетода = РаботаСМобильнымПриложениемЭкипажейСервер.ПолучитьРезультатЯндексМаршрутизации(ВходныеДанные);
			СтрокаJSON = РаботаСМобильнымПриложениемЭкипажейСервер.СформироватьСтрокуJSON(ОтветМетода);
			
			//логирование
			ПараметрыЛога = ВнешнееЛогированиеСервер.ПараметрыЗаписиЛогаСервиса(Справочники.API.Yandex_Route, Справочники.МетодыAPI.getResultTaskYandexRouting);
			ПараметрыЛога.requestXML = ТекстЗапроса;
			ПараметрыЛога.responseXML = СтрокаJSON;
			
			Попытка
				ПараметрыЛога.isError = ОтветМетода.error <> Ложь;
			Исключение
				ПараметрыЛога.isError = Истина;
			КонецПопытки;
			
			ВнешнееЛогированиеСервер.ЗаписатьСтрокуЛогаСервиса(ПараметрыЛога);
			//Асеев 14.09.2022 (Задача № 4897)>>>
		ИначеЕсли ИмяМетода = "getAdressCoordinates" Тогда
			ВходныеДанные = РаботаСМобильнымПриложениемЭкипажейСервер.ДанныеJSONВСтруктуру(ТекстЗапроса);
			ОтветМетода = РаботаСМобильнымПриложениемЭкипажейСервер.ПолучитьКоординатыАдреса(ВходныеДанные);
			СтрокаJSON = РаботаСМобильнымПриложениемЭкипажейСервер.СформироватьСтрокуJSON(ОтветМетода);
			//Асеев 14.09.2022 (Задача № 4897)<<<
		ИначеЕсли ИмяМетода = "getRouteMapBody" Тогда
			ВходныеДанные = РаботаСМобильнымПриложениемЭкипажейСервер.ДанныеJSONВСтруктуру(ТекстЗапроса);
			ОтветМетода = РаботаСМобильнымПриложениемЭкипажейСервер.ПолучитьСодержимоеСтраницыМаршрутизации(ВходныеДанные.ID);
			СтрокаJSON = РаботаСМобильнымПриложениемЭкипажейСервер.СформироватьСтрокуJSON(ОтветМетода);
		ИначеЕсли ИмяМетода = "unloadRoutingData" Тогда
			ВходныеДанные = РаботаСМобильнымПриложениемЭкипажейСервер.ДанныеJSONВСтруктуру(ТекстЗапроса);
			ОтветМетода = РаботаСМобильнымПриложениемЭкипажейСервер.ВыгрузитьДанныеРучнойМаршрутизацииМП(ВходныеДанные);
			СтрокаJSON = РаботаСМобильнымПриложениемЭкипажейСервер.СформироватьСтрокуJSON(ОтветМетода);
			//Асеев 08.08.2023 (Задача № 5093)>>>
		ИначеЕсли ИмяМетода = "getDeliveryCalendars" Тогда
			ВходныеДанные = РаботаСМобильнымПриложениемЭкипажейСервер.ДанныеJSONВСтруктуру(ТекстЗапроса);
			ОтветМетода = РаботаСМобильнымПриложениемЭкипажейСервер.ПолучитьКалендариДоставки(ВходныеДанные);
			СтрокаJSON = РаботаСМобильнымПриложениемЭкипажейСервер.СформироватьСтрокуJSON(ОтветМетода);
			//Асеев 08.08.2023 (Задача № 5093)<<<
			//Асеев 28.12.2023 (Задача № 5199)>>>
		ИначеЕсли ИмяМетода = "getAccessCodeRoutingWorkplace" Тогда
			ВходныеДанные = РаботаСМобильнымПриложениемЭкипажейСервер.ДанныеJSONВСтруктуру(ТекстЗапроса);
			ОтветМетода = РаботаСМобильнымПриложениемЭкипажейСервер.ПолучитьКодДоступаРабочегоМестаМаршрутизации(ВходныеДанные);
			СтрокаJSON = РаботаСМобильнымПриложениемЭкипажейСервер.СформироватьСтрокуJSON(ОтветМетода);
			//Асеев 28.12.2023 (Задача № 5199)<<<
		ИначеЕсли ИмяМетода = "getServersIPs" Тогда
			ОтветМетода = РаботаСМобильнымПриложениемЭкипажейСервер.ПолучитьСписокIPСерверовОбмена();
			СтрокаJSON = РаботаСМобильнымПриложениемЭкипажейСервер.СформироватьСтрокуJSON(ОтветМетода);
			//Марочкин 27.10.2025<<<	
		ИначеЕсли ИмяМетода = "getRegions" Тогда
			ВходныеДанные = РаботаСМобильнымПриложениемЭкипажейСервер.ДанныеJSONВСтруктуру(ТекстЗапроса);
			ОтветМетода = РаботаСМобильнымПриложениемЭкипажейСервер.ПолучитьСписокРегионов(ВходныеДанные);
			СтрокаJSON = РаботаСМобильнымПриложениемЭкипажейСервер.СформироватьСтрокуJSON(ОтветМетода);
			//Марочкин 27.10.2025<<<
		ИначеЕсли ИмяМетода = "getTypesAttachedDocs" Тогда
			ВходныеДанные = РаботаСМобильнымПриложениемЭкипажейСервер.ДанныеJSONВСтруктуру(ТекстЗапроса);
			ОтветМетода = РаботаСМобильнымПриложениемЭкипажейСервер.ПолучитьСписокТиповПрикрепленныхДокументов(ВходныеДанные);
			СтрокаJSON = РаботаСМобильнымПриложениемЭкипажейСервер.СформироватьСтрокуJSON(ОтветМетода);
			//Марочкин 27.10.2025<<<
		ИначеЕсли ИмяМетода = "getParameters" Тогда
			ВходныеДанные = РаботаСМобильнымПриложениемЭкипажейСервер.ДанныеJSONВСтруктуру(ТекстЗапроса);
			ОтветМетода = РаботаСМобильнымПриложениемЭкипажейСервер.ПолучитьПараметры(ВходныеДанные);
			СтрокаJSON = РаботаСМобильнымПриложениемЭкипажейСервер.СформироватьСтрокуJSON(ОтветМетода);
			//Марочкин 30.10.2025<<<
		ИначеЕсли ИмяМетода = "getOrganizations" Тогда	
			ВходныеДанные = РаботаСМобильнымПриложениемЭкипажейСервер.ДанныеJSONВСтруктуру(ТекстЗапроса);
			ОтветМетода = РаботаСМобильнымПриложениемЭкипажейСервер.ПолучитьСписокОрганизаций(ВходныеДанные);
			СтрокаJSON = РаботаСМобильнымПриложениемЭкипажейСервер.СформироватьСтрокуJSON(ОтветМетода);
			//Марочкин 30.10.2025<<<	
		ИначеЕсли ИмяМетода = "getDrivers" Тогда	
			ВходныеДанные = РаботаСМобильнымПриложениемЭкипажейСервер.ДанныеJSONВСтруктуру(ТекстЗапроса);
			ОтветМетода = РаботаСМобильнымПриложениемЭкипажейСервер.ПолучитьСписокВодителей(ВходныеДанные);
			СтрокаJSON = РаботаСМобильнымПриложениемЭкипажейСервер.СформироватьСтрокуJSON(ОтветМетода);
			//Марочкин 30.10.2025<<<			
		ИначеЕсли ИмяМетода = "getForwarders" Тогда	
			ВходныеДанные = РаботаСМобильнымПриложениемЭкипажейСервер.ДанныеJSONВСтруктуру(ТекстЗапроса);
			ОтветМетода = РаботаСМобильнымПриложениемЭкипажейСервер.ПолучитьСписокЭкспедиторов(ВходныеДанные);
			СтрокаJSON = РаботаСМобильнымПриложениемЭкипажейСервер.СформироватьСтрокуJSON(ОтветМетода);
			//Марочкин 30.10.2025<<<			
		ИначеЕсли ИмяМетода = "getCars" Тогда	
			ВходныеДанные = РаботаСМобильнымПриложениемЭкипажейСервер.ДанныеJSONВСтруктуру(ТекстЗапроса);
			ОтветМетода = РаботаСМобильнымПриложениемЭкипажейСервер.ПолучитьСписокТранспорта(ВходныеДанные);
			СтрокаJSON = РаботаСМобильнымПриложениемЭкипажейСервер.СформироватьСтрокуJSON(ОтветМетода);
			//Марочкин 30.10.2025<<<	
		ИначеЕсли ИмяМетода = "getTrips" Тогда	
			ВходныеДанные = РаботаСМобильнымПриложениемЭкипажейСервер.ДанныеJSONВСтруктуру(ТекстЗапроса);
			ОтветМетода = РаботаСМобильнымПриложениемЭкипажейСервер.ПолучитьСписокРейсов(ВходныеДанные);
			СтрокаJSON = РаботаСМобильнымПриложениемЭкипажейСервер.СформироватьСтрокуJSON(ОтветМетода);
			//Марочкин 30.10.2025<<<	
		ИначеЕсли ИмяМетода = "getDeliveryResults" Тогда	
			ВходныеДанные = РаботаСМобильнымПриложениемЭкипажейСервер.ДанныеJSONВСтруктуру(ТекстЗапроса);
			ОтветМетода = РаботаСМобильнымПриложениемЭкипажейСервер.ПолучитьСписокРезультатовДоставки(ВходныеДанные);
			СтрокаJSON = РаботаСМобильнымПриложениемЭкипажейСервер.СформироватьСтрокуJSON(ОтветМетода);
			//Марочкин 31.10.2025<<<	
		ИначеЕсли ИмяМетода = "getTariffsAndBreakes" Тогда	
			ВходныеДанные = РаботаСМобильнымПриложениемЭкипажейСервер.ДанныеJSONВСтруктуру(ТекстЗапроса);
			ОтветМетода = РаботаСМобильнымПриложениемЭкипажейСервер.ПолучитьСписокТарифовИОбъемныхБрейков(ВходныеДанные);
			СтрокаJSON = РаботаСМобильнымПриложениемЭкипажейСервер.СформироватьСтрокуJSON(ОтветМетода);
			//Марочкин 01.11.2025<<<	
			
																				
		КонецеСли;	
		
		Ответ.УстановитьТелоИзСтроки(СтрокаJSON);
	исключение
		СписокПолучателей = Новый Массив;
		//СписокПолучателей.Добавить("n.stepanov@strizh-logistic.ru");
		СписокПолучателей.Добавить("evgeniy.marochkin@strizh-logistic.ru");
		
		lem.ОтправитьСообщение(СписокПолучателей, "Ошибка при вызове метода MARouteExchange_" + ИмяМетода, ОписаниеОшибки() , , "Логистическая компания ""Стриж""");
	конецПопытки;
	Возврат Ответ;
КонецФункции
#КонецОбласти
