
&НаСервере
Функция СоздатьСписок()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегиональныеТерминалы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.РегиональныеТерминалы КАК РегиональныеТерминалы";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Список = новый СписокЗначений;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Список.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	Список.Добавить(Справочники.РегиональныеТерминалы.ПустаяСсылка());
	Возврат Список;
КонецФункции


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если РольДоступна("Админы") Тогда
		Список = новый СписокЗначений;
		Список.Добавить(ПараметрыСеанса.ТерминалДоставки);
		Если ПараметрыСеанса.ТерминалДоставки = Справочники.РегиональныеТерминалы.ПустаяСсылка() Тогда
			Список = СоздатьСписок();	
		ИначеЕсли ПараметрыСеанса.ТерминалДоставки = Справочники.РегиональныеТерминалы.МоскваСтриж Тогда
			Список.Добавить(Справочники.РегиональныеТерминалы.ПустаяСсылка());
		КонецЕсли;
	Иначе
		Список = СоздатьСписок();
	КонецЕсли;
	//Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ТерминалДоставки").Использование = Истина;
	Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ТерминалДоставки").Значение = Список;
	
КонецПроцедуры
