Функция ПровестиИНапечататьЧек(СерверККМ) Экспорт
	СтрукОтвета = Новый Структура;
	СтрукОтвета.Вставить("Результат", Истина);
	СтрукОтвета.Вставить("ОписаниеОшибки", "");
	
	Если Не ЧекНапечатан Тогда
		СтрукПараметровЧека = Новый Структура;
		//товары чека
		ЗапТоваров = Новый Запрос;
		ЗапТоваров.Текст = "ВЫБРАТЬ
		                   |	ксЧекККМТовары.Номенклатура.Наименование КАК Наименование,
						   |	ксЧекККМТовары.Номенклатура.Ссылка Как Товар,
		                   |	ксЧекККМТовары.Цена КАК Цена,
		                   |	ксЧекККМТовары.Количество КАК Количество,
		                   |	1 КАК НомерСекции,
		                   |	ВЫБОР
		                   |		КОГДА ксЧекККМТовары.Ссылка.КассаККМ.ВерсияФФД = ЗНАЧЕНИЕ(Перечисление.ВерсииФФД.Версия_1_0)
		                   |				ИЛИ ксЧекККМТовары.Ссылка.КассаККМ.ВерсияФФД = ЗНАЧЕНИЕ(Перечисление.ВерсииФФД.пустаяСсылка)
		                   |			ТОГДА ВЫБОР
		                   |					КОГДА ксЧекККМТовары.СтавкаНДС = -1
		                   |						ТОГДА 4
		                   |					КОГДА ксЧекККМТовары.СтавкаНДС = -2
		                   |						ТОГДА 6
		                   |					КОГДА ксЧекККМТовары.СтавкаНДС = 10
		                   |						ТОГДА 5
		                   |					КОГДА ксЧекККМТовары.СтавкаНДС = 18
		                   |						ТОГДА 6
		                   |					КОГДА ксЧекККМТовары.СтавкаНДС = 20
		                   |						ТОГДА 6
		                   |					КОГДА ксЧекККМТовары.СтавкаНДС = 0
		                   |						ТОГДА 1
		                   |				КОНЕЦ
		                   |		КОГДА ксЧекККМТовары.Ссылка.КассаККМ.ВерсияФФД = ЗНАЧЕНИЕ(Перечисление.ВерсииФФД.Версия_1_0_5)
		                   |			ТОГДА ВЫБОР
		                   |					КОГДА ксЧекККМТовары.СтавкаНДС = -1
		                   |						ТОГДА 6
		                   |					КОГДА ксЧекККМТовары.СтавкаНДС = -2
		                   |						ТОГДА 3
		                   |					КОГДА ксЧекККМТовары.СтавкаНДС = 10
		                   |						ТОГДА 5
		                   |					КОГДА ксЧекККМТовары.СтавкаНДС = 18
		                   |						ТОГДА 3
		                   |					КОГДА ксЧекККМТовары.СтавкаНДС = 20
		                   |						ТОГДА 3
		                   |					КОГДА ксЧекККМТовары.СтавкаНДС = 0
		                   |						ТОГДА 5
		                   |				КОНЕЦ
		                   |		ИНАЧЕ 3
		                   |	КОНЕЦ КАК СтавкаНДС,
		                   |	ВЫБОР
		                   |		КОГДА ксЧекККМТовары.СтавкаНДС = -1
		                   |			ТОГДА 0
		                   |		КОГДА ксЧекККМТовары.СтавкаНДС = -2
		                   |			ТОГДА ксЧекККМТовары.Цена * ксЧекККМТовары.Количество * 18 / 118
		                   |		КОГДА ксЧекККМТовары.СтавкаНДС = 10
		                   |			ТОГДА ксЧекККМТовары.Цена * ксЧекККМТовары.Количество * 10 / 110
		                   |		КОГДА ксЧекККМТовары.СтавкаНДС = 18
		                   |			ТОГДА ксЧекККМТовары.Цена * ксЧекККМТовары.Количество * 18 / 118
		                   |		КОГДА ксЧекККМТовары.СтавкаНДС = 20
		                   |			ТОГДА ксЧекККМТовары.Цена * ксЧекККМТовары.Количество * 20 / 120
		                   |		КОГДА ксЧекККМТовары.СтавкаНДС = 0
		                   |			ТОГДА 0
		                   |	КОНЕЦ КАК СуммаНалога,
		                   |	ВЫБОР
		                   |		КОГДА ксЧекККМТовары.СтавкаНДС = -2
		                   |				ИЛИ ксЧекККМТовары.СтавкаНДС = 18
		                   |			ТОГДА 20
		                   |		ИНАЧЕ ксЧекККМТовары.СтавкаНДС
		                   |	КОНЕЦ КАК КодНалога,
		                   |	ксЧекККМТовары.КодМаркировки КАК КодМаркировки,
		                   |	ВЫБОР
		                   |		КОГДА ЕСТЬNULL(ксЧекККМТовары.Поставщик.ИНН, ИСТИНА) = ИСТИНА
		                   |			ТОГДА ксЧекККМТовары.ИННПоставщика
		                   |		ИНАЧЕ ксЧекККМТовары.Поставщик.ИНН
		                   |	КОНЕЦ КАК ПоставщикИНН,
		                   |	ксЧекККМТовары.Поставщик.Телефон КАК ПоставщикТелефон,
		                   |	ксЧекККМТовары.Поставщик.Наименование КАК ПоставщикНаименование,
		                   |	ксЧекККМТовары.ПризнакПредметаРасчета КАК ПризнакПредметаРасчета,
		                   |	ВЫБОР
		                   |		КОГДА ксЧекККМТовары.Ссылка.ТипОплаты = ЗНАЧЕНИЕ(Справочник.ксТипыОплат.ОплаченоВМагазине)
						   //|				ИЛИ ксЧекККМТовары.Ссылка.СуммаПредоплаты <> 0
		                   |			ТОГДА 1
		                   |		ИНАЧЕ 4
		                   |	КОНЕЦ КАК ПризнакСпособаРасчета
		                   |ИЗ
		                   |	Документ.ксЧекККМ.Товары КАК ксЧекККМТовары
		                   |ГДЕ
		                   |	ксЧекККМТовары.Ссылка.Ссылка = &Чек
		                   |
		                   |ОБЪЕДИНИТЬ ВСЕ
		                   |
		                   |ВЫБРАТЬ
		                   |	""Доставка"",
						   |	"""",
		                   |	ксЧекККМ.СтоимостьДоставки,
		                   |	1,
		                   |	1,
		                   |	ВЫБОР
		                   |		КОГДА ксЧекККМ.КассаККМ.ВерсияФФД = ЗНАЧЕНИЕ(Перечисление.ВерсииФФД.Версия_1_0)
		                   |				ИЛИ ксЧекККМ.КассаККМ.ВерсияФФД = ЗНАЧЕНИЕ(Перечисление.ВерсииФФД.пустаяСсылка)
		                   |			ТОГДА ВЫБОР
		                   |					КОГДА ксЧекККМ.СтавкаНДСПоДоставке = -1
		                   |						ТОГДА 4
		                   |					КОГДА ксЧекККМ.СтавкаНДСПоДоставке = -2
		                   |						ТОГДА 6
		                   |					КОГДА ксЧекККМ.СтавкаНДСПоДоставке = 10
		                   |						ТОГДА 5
		                   |					КОГДА ксЧекККМ.СтавкаНДСПоДоставке = 18
		                   |						ТОГДА 6
		                   |					КОГДА ксЧекККМ.СтавкаНДСПоДоставке = 20
		                   |						ТОГДА 6
		                   |					КОГДА ксЧекККМ.СтавкаНДСПоДоставке = 0
		                   |						ТОГДА 1
		                   |				КОНЕЦ
		                   |		КОГДА ксЧекККМ.КассаККМ.ВерсияФФД = ЗНАЧЕНИЕ(Перечисление.ВерсииФФД.Версия_1_0_5)
		                   |			ТОГДА ВЫБОР
		                   |					КОГДА ксЧекККМ.СтавкаНДСПоДоставке = -1
		                   |						ТОГДА 6
		                   |					КОГДА ксЧекККМ.СтавкаНДСПоДоставке = -2
		                   |						ТОГДА 3
		                   |					КОГДА ксЧекККМ.СтавкаНДСПоДоставке = 10
		                   |						ТОГДА 5
		                   |					КОГДА ксЧекККМ.СтавкаНДСПоДоставке = 18
		                   |						ТОГДА 3
		                   |					КОГДА ксЧекККМ.СтавкаНДСПоДоставке = 20
		                   |						ТОГДА 3
		                   |					КОГДА ксЧекККМ.СтавкаНДСПоДоставке = 0
		                   |						ТОГДА 5
		                   |				КОНЕЦ
		                   |		ИНАЧЕ 3
		                   |	КОНЕЦ,
		                   |	ВЫБОР
		                   |		КОГДА ксЧекККМ.СтавкаНДСПоДоставке = -1
		                   |			ТОГДА 0
		                   |		КОГДА ксЧекККМ.СтавкаНДСПоДоставке = -2
		                   |			ТОГДА ксЧекККМ.СтоимостьДоставки * 18 / 118
		                   |		КОГДА ксЧекККМ.СтавкаНДСПоДоставке = 10
		                   |			ТОГДА ксЧекККМ.СтоимостьДоставки * 10 / 110
		                   |		КОГДА ксЧекККМ.СтавкаНДСПоДоставке = 18
		                   |			ТОГДА ксЧекККМ.СтоимостьДоставки * 18 / 118
		                   |		КОГДА ксЧекККМ.СтавкаНДСПоДоставке = 20
		                   |			ТОГДА ксЧекККМ.СтоимостьДоставки * 20 / 120
		                   |		КОГДА ксЧекККМ.СтавкаНДСПоДоставке = 0
		                   |			ТОГДА 0
		                   |	КОНЕЦ,
		                   |	ВЫБОР
		                   |		КОГДА ксЧекККМ.СтавкаНДСПоДоставке = -2
		                   |				ИЛИ ксЧекККМ.СтавкаНДСПоДоставке = 18
		                   |			ТОГДА 20
		                   |		ИНАЧЕ ксЧекККМ.СтавкаНДСПоДоставке
		                   |	КОНЕЦ,
		                   |	"""",
		                   |	ксЧекККМ.ИННПоставщикаДоставки,
		                   |	"""",
		                   |	"""",
		                   |	4,
		                   |	ВЫБОР
		                   |		КОГДА ксЧекККМ.ТипОплаты = ЗНАЧЕНИЕ(Справочник.ксТипыОплат.ОплаченоВМагазине)
		                  // |				ИЛИ ксЧекККМ.СуммаПредоплаты <> 0
		                   |			ТОГДА 1
		                   |		ИНАЧЕ 4
		                   |	КОНЕЦ
		                   |ИЗ
		                   |	Документ.ксЧекККМ КАК ксЧекККМ
		                   |ГДЕ
		                   |	ксЧекККМ.Ссылка = &Чек
		                   |	И ксЧекККМ.СтоимостьДоставки <> 0";
		ЗапТоваров.УстановитьПараметр("Чек", Ссылка);
		
		ТабТоваров = ЗапТоваров.Выполнить().Выгрузить();
		
		Для Каждого Тек Из ТабТоваров Цикл
			Тек.Наименование = СтрЗаменить(Тек.Наименование, "«", "");
		КонецЦикла;	
		
		//доп свойства чека
		ЗапДопПараметрыЧека = Новый Запрос;
		ЗапДопПараметрыЧека.Текст = "ВЫБРАТЬ
		                            |	ксЧекККМ.Ссылка КАК ДокументЧек,
		                            |	ксЧекККМ.ПометкаУдаления КАК ПометкаУдаления,
		                            |	ксЧекККМ.Номер КАК Номер,
		                            |	ксЧекККМ.Дата КАК Дата,
		                            |	ксЧекККМ.Проведен КАК Проведен,
		                            |	ксЧекККМ.Заказ КАК Заказ,
		                            |	ксЧекККМ.Организация КАК Организация,
		                            |	ксЧекККМ.КассаККМ КАК КассаККМ,
		                            |	ксЧекККМ.СтоимостьДоставки КАК СтоимостьДоставки,
		                            |	ксЧекККМ.СтавкаНДСПоДоставке КАК СтавкаНДСПоДоставке,
		                            |	ксЧекККМ.ТипОплаты КАК ТипОплаты,
		                            |	ксЧекККМ.СуммаДокумента КАК СуммаДокумента,
		                            |	ксЧекККМ.ДатаЧека КАК ДатаЧека,
		                            |	ксЧекККМ.СуммаЧека КАК СуммаЧека,
		                            |	ксЧекККМ.ТипЧека КАК ТипЧека,
		                            |	ксЧекККМ.ФД КАК ФД,
		                            |	ксЧекККМ.ФПД КАК ФПД,
		                            |	ксЧекККМ.НомерДокумента КАК НомерДокумента,
		                            |	ксЧекККМ.ФН КАК ФН,
		                            |	ксЧекККМ.НомерЧека КАК НомерЧека,
		                            |	ксЧекККМ.НомерСмены КАК НомерСмены,
		                            |	ксЧекККМ.ЧекКПечати.АдресИнформирования КАК АдресИнформирования,
		                            |	ксЧекККМ.ТипОплаты.КодОплатыНаККМ КАК КодТипаОплатыНаККМ,
		                            |	ксЧекККМ.Кассир.Наименование КАК Кассир,
		                            |	ксЧекККМ.КассаККМ.ВерсияФФД КАК ВерсияФФД,
		                            |	ксЧекККМ.СуммаПредоплаты КАК СуммаПредоплаты,
		                            |	ксЧекККМ.ЧекКПечати.ВнешнийНомерЗаказа КАК НомерВнешнегоЗаказа
		                            |ИЗ
		                            |	Документ.ксЧекККМ КАК ксЧекККМ
		                            |ГДЕ
		                            |	ксЧекККМ.Ссылка = &Чек";
		ЗапДопПараметрыЧека.УстановитьПараметр("Чек", Ссылка);
		РезДопПараметрыЧека = ЗапДопПараметрыЧека.Выполнить().Выбрать();
		РезДопПараметрыЧека.Следующий();
		ДопПараметрыЧека = Новый Структура;
		ДопПараметрыЧека.Вставить("АдресИнформирования");
		ДопПараметрыЧека.Вставить("КодТипаОплатыНаККМ");
		ДопПараметрыЧека.Вставить("Кассир");
		ДопПараметрыЧека.Вставить("ТипОплаты");
		ДопПараметрыЧека.Вставить("НомерВнешнегоЗаказа");
		ДопПараметрыЧека.Вставить("СуммаПредоплаты");
		ДопПараметрыЧека.Вставить("ДокументЧек");
		
		ЗаполнитьЗначенияСвойств(ДопПараметрыЧека, РезДопПараметрыЧека);
		Если Не ЗначениеЗаполнено(ДопПараметрыЧека.АдресИнформирования) Тогда
			//ДопПараметрыЧека.АдресИнформирования = "checks@strizh-logistic.ru";
			//ДопПараметрыЧека.АдресИнформирования = "couriers.service@checks.ru";
			ДопПараметрыЧека.АдресИнформирования = "checks@gl.ru";
		КонецеСли;	
		
		Если Не ЗначениеЗаполнено(ДопПараметрыЧека.Кассир) Тогда
			ДопПараметрыЧека.Кассир = "Кассир 1";
		КонецеСли;	
		
		
		//собственно, сама печать чека
		ЧекНапечатан = Ложь;
		Если Не ЗначениеЗаполнено(РезДопПараметрыЧека.ВерсияФФД) Или РезДопПараметрыЧека.ВерсияФФД = Перечисления.ВерсииФФД.Версия_1_0 Тогда
			РезультатПечати = ККМ_ФЗ_54СерверПереопределяемый.ПечатьЧека(СерверККМ, КассаККМ, ТабТоваров, СтрукПараметровЧека, ДопПараметрыЧека,, ТипКассовогоЧека);
		ИначеЕсли РезДопПараметрыЧека.ВерсияФФД = Перечисления.ВерсииФФД.Версия_1_0_5 Тогда	
			РезультатПечати = ККМ_ФЗ_54СерверПереопределяемый.ПечатьЧекаФФД_1_05(СерверККМ, КассаККМ, ТабТоваров, СтрукПараметровЧека, ДопПараметрыЧека,, ТипКассовогоЧека);
		ИначеЕсли РезДопПараметрыЧека.ВерсияФФД = Перечисления.ВерсииФФД.Версия_1_2 Тогда	
			РезультатПечати = ККМ_ФЗ_54СерверПереопределяемый.ПечатьЧекаФФД_1_2(СерверККМ, КассаККМ, ТабТоваров, СтрукПараметровЧека, ДопПараметрыЧека,, ТипКассовогоЧека);			
		КонецеСли;	
		
		Если Не РезультатПечати.Результат Тогда
			Попытка
				ККМ_ФЗ_54СерверПереопределяемый.ЗаписьЛогаОшибкиККМ(РезультатПечати.КодОшибки, РезультатПечати.ТекстОшибки, КассаККМ.ПроизводительККМ, Ссылка, РезультатПечати.ОписаниеОшибкиККМ);				
			Исключение
				Мас = ксРаботаСККМСервер.ВернутьМассивАдресов(Перечисления.ксТипыСобытийУведомления.ОшибкаПечатиЧека);
				ксРаботаСККМСервер.ОтправкаСистемногоСообщенияEMAIL(Мас, ОписаниеОшибки(), "Ошибка при фиксации ошибки");		
			КонецПопытки;	
			СтрукОтвета.Вставить("Результат", Ложь);
			СтрукОтвета.Вставить("ОписаниеОшибки", "Чек не напечатан!");
			Возврат СтрукОтвета;
		Иначе
			ЧекНапечатан = Истина;
		КонецеСли;
		
		
		ТабТоваров.Свернуть("КодНалога", "СуммаНалога");
		
		Налоги.Загрузить(ТабТоваров);
		Для Каждого Тек Из Налоги Цикл
			Тек.СуммаНалога = Окр(Тек.СуммаНалога, 2);
		КонецЦикла;	
		
		ФН = ККМ_ФЗ_54.ПолучитьФН(СтрукПараметровЧека.ФН);
		ДатаЧека = СтрукПараметровЧека.ДатаЧека;
		СуммаЧека = СтрукПараметровЧека.СуммаЧека;
		Если ТипКассовогоЧека = Перечисления.ксТипыКассовыхЧеков.ЧекПрихода Тогда
			ТипЧека = 1;
		ИначеЕсли ТипКассовогоЧека = Перечисления.ксТипыКассовыхЧеков.ЧекВозвратаПрихода Тогда
			ТипЧека = 2;
		Конецесли;
		//ТипЧека = СтрукПараметровЧека.ТипЧека;
		ФПД = СтрукПараметровЧека.ФПД;
		ФД = Формат(СтрукПараметровЧека.ФД, "ЧГ=");
		НомерДокумента = СтрукПараметровЧека.НомерДокумента;
		НомерЧека = СтрукПараметровЧека.НомерЧека;
		НомерСмены = СтрукПараметровЧека.НомерСмены;
		
		Записать(РежимЗаписиДокумента.Запись);
	КонецеСли;
	Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат СтрукОтвета;
КонецФункции	